{
    "cik": "1013462",
    "company": "ANSYS INC",
    "filing_type": "10-K",
    "filing_date": "2022-02-23",
    "period_of_report": "2021-12-31",
    "sic": "7372",
    "state_of_inc": "DE",
    "state_location": "PA",
    "fiscal_year_end": "1231",
    "filing_html_index": "https://www.sec.gov/Archives/edgar/data/1013462/0001013462-22-000005-index.html",
    "htm_filing_link": "https://www.sec.gov/Archives/edgar/data/1013462/000101346222000005/anss-20211231.htm",
    "complete_text_filing_link": "https://www.sec.gov/Archives/edgar/data/1013462/0001013462-22-000005.txt",
    "filename": "1013462_10K_2021_0001013462-22-000005.htm",
    "item_1": "ITEM 1.BUSINESS\nANSYS, Inc. (Ansys, we, us, our), a Delaware corporation formed in 1994, develops and globally markets engineering simulation software and services widely used by engineers, designers, researchers and students across a broad spectrum of industries and academia, including high-tech, aerospace and defense, automotive, energy, industrial equipment, materials and chemicals, consumer products, healthcare, and construction. Headquartered south of Pittsburgh, Pennsylvania, we employed 5,100 people as of December 31, 2021. We focus on the development of open and flexible solutions that enable users to analyze designs directly on the desktop, providing a common platform for fast, efficient and cost-conscious product development, from design concept to final-stage testing and validation. We distribute our suite of simulation technologies through direct sales offices in strategic, global locations and a global network of independent resellers and distributors (collectively, channel partners). It is our intention to continue to maintain this hybrid sales and distribution model. We operate and report as one segment.\nOur strategy of Pervasive Engineering Simulation™ seeks to deepen the use of simulation in our core, to inject simulation throughout the product lifecycle and to embed simulation into our partners' ecosystems. The engineering software simulation market is strong and growing. The market growth is driven by customers' need for rapid, quality innovation in a cost efficient\nmanner, enabling faster time to market of new products and lower warranty costs. We are investing in solutions to help engineers deal with increasing product complexity in:\n•Electrification, including electric vehicles;\n•Autonomy, including self-driving vehicles;\n•5G and telecommunications; and\n•The industrial internet of things (IIoT).\nIn the longer term, we are also investing in opportunities around digital twins and simulation for additive manufacturing. Our strategy of Pervasive Engineering Simulation is aligned with the market growth.\nTo support our strategy of Pervasive Engineering Simulation, we will continue to follow a series of pillars that we believe will drive future growth. We will reinforce and extend our leadership in core and the high-growth solutions. We will build and grow our offerings and expertise in adjacencies to our current core competencies. We will also continue to pursue a smart and strategic acquisition strategy to grow our business, and we will partner with other industry leaders to broaden pervasive simulation into other ecosystems. Importantly, we will continue to win in the right way, built on a culture of and commitment to diversity, equity, inclusion and belonging.\nOur product collections consist of the following:\n3D Design\nOur Discovery™ product family allows every engineer to benefit from the insight of simulation in their product design. The Discovery products range from early design exploration tools powered by interactive real-time simulation and intuitive geometry editing, to detailed product validation solutions utilizing proven flagship solver technology with easy-to-use guided workflows. These tools allow for design engineers of all levels of expertise to utilize simulation across the entire product design process and to work seamlessly with simulation experts using our flagship products for even more advanced analysis.\nRecent enhancements allow more engineering use cases such as idealized sliding contact for live physics and porous media for high-fidelity physics, enabling fast, easy to use simulation of jointed assemblies and filtered flows. We also provide greater Ansys Workbench™ connectivity, empowering analysts to do geometry preparation for simulation in Discovery, including materials selections and upfront simulation, with seamless transfer to Ansys Mechanical and Ansys Fluent.\nAcademic\nWe bundle our commercial software by physics area and work with universities to utilize our software in teaching and research and currently have more than 3,300 university customers in 95 countries. Our digital engagement strategy has evolved to include an \"Access, Learn, Engage\" model that is supported by our free student downloads, free Ansys Innovation Courses and Learning Forum that make it easy for learners to access our products, learn how to use them and ask questions to their peers and our experts. We also work to develop partnerships in areas like student team sponsorship, strategic curriculum and research opportunities and STEM. We recently released a free Electronics Desktop Product for Students that provides free online access to our industry-leading simulation solutions, including Ansys HFSS, Ansys Maxwell, Ansys Q3D Extractor and Ansys Icepak. This adds to our existing student products including Ansys Student, consisting of structures and fluids, Ansys LS-DYNA Student, Ansys Discovery Student and Ansys SCADE Student.\nAcoustics Simulation\nOur acoustics simulation tools help optimize sound from the first steps of product development. By applying this acoustic modeling software, customers have tools at the ready to deliver user experiences that blend optimal functionality with acoustics. By predicting the acoustic effects of a given product configuration at the earliest stage of design, customers maximize the acoustic benefits while minimizing time, costs and rework.\nOur acoustic simulation couples multiple simulators such as electromagnetics, structural analysis and acoustic propagation. Applications can include any system that makes noise, but a particularly interesting application arises in modern electric vehicles. Simulating the noise, vibration, and harshness (NVH) of an electric motor is important for proper electromagnetic and vibro-acoustic design of electric vehicles. Our solutions can characterize the NVH effects of an electric motor early and accurately in the design cycle to improve vehicle performance and safety. These solutions lower development costs and help support electric mobility.\nAdditive\nOur comprehensive and scalable additive manufacturing solutions allow customers to minimize risk and ensure high quality, certifiable parts. The additive manufacturing process uses high-power laser sintering of metal powders to print 3D parts layer-by-layer. The combination of heat, molten metal and associated processing has many multiphysics attributes that can result in residual stresses and deformations. Our Additive solutions predict these effects and can work in conjunction with the 3D printer to ensure the geometry being printed is produced reliably. It can also dive deeper into the properties of 3D printer parts, ensure traceability of data, optimize build files and more. Our software helps to create additive manufacturing designs and simulate the metal additive manufacturing process to reduce product development time. As an end-to-end manufacturing solution, our additive solutions span across multiple of our product offerings.\nAutonomous Vehicle Simulation\nOur autonomous vehicle simulation solutions provide a complete solution designed specifically to support development, testing and validation of safe automated driving technologies. This autonomous vehicle simulation solution saves time and costs versus traditional development and testing methods by allowing testing of drive designs on a virtual vehicle in a real-world environment.\nDigital Mission Engineering\nOur mission-simulation, modeling, testing and analysis software for aerospace, defense and intelligence applications empowers our users to solve challenges by simulating from the chip level all the way to a customer's entire mission.\nOur technology enables our customers to consider the entire mission engineering of a product or system. Engineered products and systems can involve thousands of components, subsystems, systems and systems of systems that must work together intricately. Our software simulates these puzzle pieces and their functional relationships to each other and, increasingly, to their environments.\nDigital Twin\nOur Twin Builder allows customers to implement complete virtual prototypes of real-world systems. These can be deployed to manage the entire lifecycle of products and assets. Our digital twin simulation paradigm allows customers to increase efficiencies over time, scheduling maintenance around predictive methodologies that become more accurate with real-world testing and response. Access to this information allows engineers to unlock additional value out of existing assets, preventing unscheduled downtime and lowering operating costs, while working at optimal efficiency.\nElectronics\nOur electronics product suite provides field simulation software for designing high-performance electronic and electromechanical products. The software streamlines the design process and predicts performance of mobile communication and internet-access devices, broadband networking components and systems, integrated circuits (ICs) and printed circuit boards (PCBs), as well as electromechanical systems, including automotive components such as electric motors and power electronics equipment, all prior to building a prototype.\nEmbedded Software\nOur SCADE® product suite is a comprehensive solution for embedded software simulation, code production and automated certification. It has been developed specifically for use in critical systems with high dependability requirements, including aerospace, rail transportation, nuclear, industrial and automotive applications. SCADE software supports the entire development workflow, from requirements analysis and design, through verification, implementation and deployment. SCADE solutions easily integrate with each other and the rest of our product suite, allowing for development optimization and increased communication among team members.\nFluids\nOur fluids product suite enables modeling of fluid flow and other related physical phenomena. Fluid flow analysis capabilities provide all the tools needed to design and optimize new fluids equipment and to troubleshoot already existing installations. The\nsuite contains general-purpose computational fluid dynamics software and specialized products to address specific industry applications.\nMaterials\nWith our materials technology, our customers benefit from access to the world's premier system for managing corporate material intelligence and the market-leading solution for materials sources, selection and management. Ansys Granta MI is a leading system for materials information management in engineering enterprises. Ansys Granta Selector is the standard tool for materials selection and graphical analysis of materials properties. A comprehensive materials data library plus unique software tools enable engineers to use materials to innovate and evolve products, quickly identify solutions to material issues, confirm and validate choice of materials, and reduce material and development costs. CES EduPack is a unique set of teaching resources that supports materials education across engineering, design, science and sustainable development. Granta Materials Data for Simulation provides easy access to materials property data from within Ansys Mechanical and the Ansys Electronics Desktop environment.\nOptics and Virtual Reality (VR)\nUsing optical sensor and closed-loop, real-time simulation, our capabilities now span the simulation of all sensors, including lidar, cameras and radar; the multiphysics simulation of physical and electronic components; the analysis of systems functional safety; as well as the automated development of safety-certified embedded software. This functionality can be integrated into a closed-loop simulation environment that interacts with weather and traffic simulators for automotive applications, enabling thousands of driving scenarios to be executed virtually. Our Optics and VR solutions simulate a system’s optical performance and evaluate the final illumination effect, predicting and validating the impact of lighting and material variations on appearance and perceived quality, all in real conditions.\nPhotonics\nOur photonic design and simulation tools enable customers to predict light's behavior within complex photonic structures and systems. Silicon photonics is an expanding market and our solutions provide a comprehensive set of tools for the design and analysis of integrated photonic components and systems, similar to the traditional electronic design automation (EDA) environment.\nPlatform\nOur platform collection is the framework upon which our suite of advanced multiphysics engineering simulation technologies is built.\nThe platform collection allows engineers and designers to incorporate the compounding effects of multiple physics into a virtual prototype of their design and simulate its operation under real-world conditions. As product architectures become smaller, lighter and more complex, companies must be able to accurately predict how products will behave in real-world environments where multiple types of physics and various domain disciplines interact in a coupled way. Our software enables engineers to simulate the interactions between structures, heat transfer, fluids, electronics, optical elements and embedded software all within a single, unified engineering simulation environment. We are leaders in advanced engineering simulation with solutions in core products of structures, fluids, and electromagnetics, and we are growing into new areas to meet industry demands.\nToday’s engineered products are increasingly complex, demanding new solutions for optimal design. Products have integrated electronics and semiconductors, embedded software, wired and wireless connectivity, and advanced sensors and displays. Product success requires our customers to consider the full system operation in a broad context. Therefore, we have extended the platform collection to support scalable solutions that leverage new algorithms, additional physics, system solutions, embedded intelligence, high-performance computing (HPC), and integrated Cloud. Our platform collection provides product offerings that complement traditional multiphysics with safety, reliability, cybersecurity, digital mission engineering and digital twin.\nOur HPC product suite and Cloud solutions enable enhanced insight into product performance and improve the productivity of the design process. The HPC and Cloud offerings provide cross-physics parallel processing capabilities for the full spectrum of our simulation software and support structures, fluids, thermal and electronics simulations. This product suite decreases turnaround time for individual simulations, allowing users to consider multiple design ideas and make the right design decisions early in the design cycle.\nAnsys Minerva is a knowledge management application that secures critical simulation data, and provides simulation process and decision support to simulation teams across geographies and functional silos. Available for both on-premise and Cloud\ndeployment, Minerva delivers immediate benefits by connecting simulation and optimization to customers’ existing ecosystem of tools and processes. Minerva provides integration and automation of chained data flows and design space exploration for optimal performance parameters. With Ansys Minerva, Ansys customers can connect simulation for life cycle traceability and to enable collaboration and decision support.\nAnsys optiSLang is an evolving, leading-edge answer to the challenges posed by CAE-based Robust Design Optimization (RDO). Its state-of-the-art algorithms efficiently and automatically search for the most robust design configuration, eliminating the slow, manual process that used to define RDO.\nSafety Analysis\nOur safety and cybersecurity threat analysis software facilitates model-based safety analysis, safety concept creation, safety management and cybersecurity assessment for safety-critical electrical and electronic and software controlled systems. Using this software, engineers can deliver safer and more secure products, reduce time to market, increase profit margins and comply with industry standards.\nSemiconductors\nAdvancements in semiconductor design and manufacturing enable smaller electronic architectures. Shrinking geometries, especially in the emerging 3D IC, FinFET and stacked-die architectures, reveal design challenges related to power and reliability. Our power analysis and optimization software suite manages the power budget, power delivery integrity and power-induced noise in an electronic design, from initial prototyping to system sign-off. These solutions deliver accuracy with correlation to silicon measurement; the capacity to handle an entire electronic system, including IC, package and PCB, efficiently for ease-of-debugging and fast turnaround time; and comprehensiveness to facilitate cross-domain communications and electronic ecosystem enablement.\nStructures\nOur structural analysis product suite offers simulation tools for product design and optimization that increase productivity, minimize physical prototyping and help to deliver better and more innovative products in less time. These tools tackle real-world analysis problems by making product development less costly and more reliable. In addition, these tools have capabilities that cover a broad range of analysis types, elements, contacts, materials, equation solvers and coupled physics capabilities, all targeted toward understanding and solving complex design problems. We also provide comprehensive topology optimization tools that engineers use to design structural components to meet loading requirements with minimal material and component weight. We offer a complete simulation workflow for additive manufacturing that allows reliable 3D printing by simulating the laser sintering process and delivering compensated computer-aided design (CAD) geometries that ensure reliable printed parts.\nPRODUCT DEVELOPMENT\nWe make significant investments in research and development and emphasize frequent, integrated product releases. Our product development strategy centers on ongoing development and innovation of new technologies to increase productivity and to provide engineering simulation solutions that customers can integrate into enterprise-wide product lifecycle management (PLM) systems. Our product development efforts focus on extensions of the full product line with new functional modules, further integration with CAD, electronic CAD and PLM products, and the development of new products. Our products run on the most widely-used engineering computing platforms and operating systems, including Windows, Linux and most UNIX workstations.\nOur total research and development expenses were $404.9 million, $355.4 million and $298.2 million in 2021, 2020 and 2019, respectively, or 21.2%, 21.1% and 19.7% of total revenue, respectively. As of December 31, 2021 and 2020, our product development staff consisted of 1,900 and 1,800 employees, respectively, many of whom hold advanced degrees and have industry experience in engineering, mathematics, computer science or related disciplines. We have traditionally invested significant resources in research and development activities and intend to continue to make investments in expanding the ease of use and capabilities of our broad portfolio of simulation software products.\nWe recently completed the following major product development activities and releases:\n•In February 2022, we released Ansys 2022 R1, which delivers new customized workflows and automation to improve collaboration and increase productivity for experts and non-experts alike. The new products, technologies, and tools that make up Ansys 2022 R1 enable experts to go deep with custom workflows for industry-specific applications while also extending broad ease-of-use features that turbocharge collaboration across teams.\nAnsys 2022 R1 includes a dedicated aerospace workspace in Ansys Fluent that tailors the user interface to external aerodynamics simulations, enabling aircraft designers to evaluate aircraft efficiency and study dynamics from subsonic to very high-speed flows. Similarly, the new Ansys Forming product enables engineers to digitally design and validate every step of the sheet metal forming process commonly found in automotive, appliances, aerospace, and packaged goods industries. Ansys RF Advisor On Demand is targeted specifically to help engineers solve the challenge of radio frequency interference for the next generation of high-tech devices.\n•In July 2021, we released Ansys 2021 R2, which brings enhanced computing power to optimize complex products, assemblies and systems across industries. It enables customers to get better products to market faster with systems engineering workflows and disciplines to help stakeholders understand subsystem interactions and synergies. This release increases data visibility and reuse for materials, digital twin components, electronic components and compliance initiatives.\nAcquired Technologies\nOur 2021 acquisitions, each a leader in their respective fields, bolster our strategy of Pervasive Engineering Simulation. The acquired technologies enhance our portfolio, providing solutions valuable to our customers.\nOur acquisition of ModelCenter model-based systems engineering (MBSE) technology expands the scope of our solution offering, enabling users to connect a range of engineering tools together in multi-tool workflows for broad and robust MBSE. We have offered MBSE capabilities for years, accelerating investment recently, evolving towards an open and integrated, holistic solution for MBSE. MBSE enables our customers to make informed design decisions based upon what-if analysis, multi-physics simulations, trade-off studies and design exploration early in the product engineering process. With this acquisition, we now offer a product that bridges the gap between engineering analyses and the systems architecture model addressing MBSE initiatives in the aerospace and defense industry.\nThe acquisition of OpticStudio, a simulation tool for high-performance optical imaging systems, expands our portfolio to provide comprehensive, end-to-end solutions for simulating sophisticated optical- and photonics-enabled products. It empowers customers to model the behavior of light through complex optical lens systems, enabling photonics through illumination workflows. With the addition of this technology, we offer customers a comprehensive solution for simulating the behavior of light in complex, innovative products - ranging from the photonics products, to high precision imaging systems, to human vision perception. That comprehensive solution will enable users to create optimal designs more quickly by streamlining the workflow among photonic, optical, mechanical and manufacturing engineers.\nFor further information on our business combinations, see Note 4 to the consolidated financial statements included in Part IV, Item 15 of this Annual Report on Form 10-K.\nPRODUCT QUALITY\nOur employees generally perform product development tasks according to predefined quality plans, procedures and work instructions. Certain technical support tasks are also subject to a quality process. These plans define, for each project, the methods to be used, the responsibilities of project participants and the quality objectives to be met. The majority of our software products are developed under a quality system that is certified to the ISO 9001:2015 standard. We establish quality plans for our products and services, and subject product designs to multiple levels of testing and verification in accordance with processes established under our quality system.\nSALES AND MARKETING\nWe distribute and support our products through our own direct sales offices, as well as a global network of independent channel partners. This channel partner network provides us with a cost-effective, highly-specialized channel of distribution and technical support. It also enables us to draw on business and technical expertise from a global network, provides relative stability to our operations to help mitigate geography-specific economic trends and provides us with an opportunity to take advantage of new geographic markets or enhance our sales coverage in existing markets.\nThe channel partners market and sell our products to new customers, expand installations within the existing customer base, offer training and consulting services, and provide the first line of our technical support. Our channel partner certification process helps to ensure that each channel partner has the ongoing capability to adequately represent our expanding product lines and to provide an acceptable level of training, consultation and customer support. We derived 23.7%, 22.2% and 22.9% of our total revenue through the indirect sales channel for the years ended December 31, 2021, 2020 and 2019, respectively.\nWe also have a direct sales organization to develop an enterprise-wide, focused sales approach and to implement a worldwide go-to-market account strategy. The sales management organization also functions as a focal point for requests from the channel partners and provides additional support in strategic locations through the presence of direct sales offices.\nDuring 2021, we continued to invest in our existing domestic and international strategic sales offices. In total, our direct sales and marketing organization comprised 2,500 and 2,400 employees as of December 31, 2021 and 2020, respectively, who were responsible for the sales, technical support, consulting services, marketing initiatives, and administrative activities designed to support our overall revenue growth and expansion strategies.\nOur products are utilized by organizations ranging in size from small consulting firms to the world's largest high-tech and industrial companies. No single customer accounted for more than 5% of our revenue in 2021, 2020 or 2019.\nInformation with respect to foreign and domestic revenue may be found in Note 17 to the consolidated financial statements in Part IV, Item 15 of this Annual Report on Form 10-K and in the section entitled \"Management's Discussion and Analysis of Financial Condition and Results of Operations\" in Part II, Item 7 of this Annual Report on Form 10-K.\nSTRATEGIC ALLIANCES AND MARKETING RELATIONSHIPS\nWe have established and continue to pursue strategic alliances with advanced technology suppliers, cloud computing providers, hardware vendors, software vendors, specialized application developers, and CAD, EDA and PLM providers. We believe that these relationships facilitate accelerated incorporation of advanced technology into our products, provide access to new customers, expand our sales channels, develop specialized product applications, and provide direct integration with leading CAD, EDA, product data management and PLM systems.\nWe have technical and marketing relationships with leading CAD vendors, such as Autodesk, PTC and Siemens Digital Industries, to provide direct links between products. These links facilitate the transfer of electronic data models between the CAD systems and our products.\nWe partner with PTC to accelerate product innovation by providing customers a world-class simulation-driven design solution. Working together, we are delivering Ansys Live real-time simulation technology within PTC’s Creo® 3D CAD software. The combined solution, Creo Simulation Live, is sold by PTC as part of the Creo product suite. This solution offers customers a unified modeling and simulation environment, removing the boundaries between CAD and simulation and enabling design engineers to gain insight into each of the many design decisions they make throughout the product development process. This insight enables design engineers to create higher quality products, while reducing product and development costs. Creo Ansys Simulation includes a subset of our flagship solver technology integrated into Creo.\nIn 2021, we expanded our relationship with Autodesk by collaborating on a printed circuit board extension which marks Autodesk Fusion 360’s first third-party extension.\nWe maintain marketing and software development relationships with leading EDA software companies, including Altium, Cadence Design Systems, Synopsys, Siemens EDA, and Zuken. These relationships support the transfer of data between electronics design and layout software and our electronics simulation portfolio. We have an integration and distribution agreement with Synopsys and cooperatively integrate Ansys RedHawk technology into an in-design add-on to a Synopsys design tool for the primary purpose of providing customers with direct, in-design access to the RedHawk technology's capabilities. In addition, we continue to focus on customer solutions, such as integrating our technology into Synopsys' 3DIC compiler and are actively working together to build additional products and interoperability workflows.\nWe have a strategic relationship with Microsoft that spans several Ansys business units and markets. One focus area of the relationship is Ansys Cloud, which is a cloud-based simulation service fully managed by Ansys and hosted on Microsoft’s Azure Cloud infrastructure. Ansys Cloud provides on-demand access to HPC directly from within our flagship applications. We continue to expand the licensing options and functionality of Ansys Cloud, often working closely with Microsoft for support and technical advice. Other, more market-specific projects we have in place with Microsoft include our digital twins' connection with Microsoft Azure IoT solutions; our software for autonomous vehicles running on Azure; and co-sponsoring COVID-19 research conducted by the Eindhoven University of Technology in the Netherlands related to the dispersal of aerosols in crowded venues such as soccer stadiums.\nWe continue to strengthen the Ansys autonomy offering to provide a solution for safety driven advanced driver-assistance systems (ADAS) validation. We are partnering with NI to solve ADAS and hardware-in-the-loop validation, bridging the worlds of simulated and physical testing, and with IPG Automotive to combine our high-fidelity physics simulation with IPG’s best-in-class driving simulation.\nIn addition to marketing relationships to promote the adoption of HPC, we maintain a technical relationship with both Intel and Advanced Micro Devices (AMD) to optimize the solver performance and scalability of our structures, fluids, and electromagnetics portfolio to enable faster simulations and a shorter time to market for our customers. For example, we have further optimized the latest release of Fluent for the recent Intel architecture, incorporating AVX-512 instructions for better performance. This functionality, referred to as the Intel oneMKL sparse LDU smoother, provides an acceleration of up to twenty percent. Partnering with AMD, we have integrated AMD libraries in the latest release of Mechanical 2021 R2, resulting in speedup gains for certain workloads as high as 2.12x versus the previous release. We also work to democratize HPC to a wider audience through partnerships with cloud computing providers, cloud-hosting partners, HPC hardware manufacturers and supercomputing centers. Through a new collaboration with Fujitsu, Ansys LS-DYNA is the first commercial computer-aided engineering (CAE) structural simulation software to support Fujitsu’s latest Arm-based PRIMEHPC supercomputers. By supporting LS-DYNA on Fujitsu's hardware platform, we help customers reduce energy consumption and costs by offloading CAE workloads to a more energy-efficient supercomputer. Additionally, we have joined Intel Foundry Services' (IFS) Design Ecosystem Alliance as an inaugural member. Our EDA tools and multiphysics solutions will help IFS to deliver industry-leading bespoke silicon to their customers.\nOur Partner Program actively encourages developers of specialized software solutions to use our technology as a development platform for their applications and provides customers with enhanced functionality related to their use of our software. With 350 technology partnerships, spanning a wide range of solution areas, including materials, optimization, electronics, optical, mechanical, fluid and systems simulation, our partner ecosystem extends the depth and breadth of our technology offerings.\nCOMPETITION\nWe believe that the principal factors affecting sales of our software include ease of use, breadth and depth of functionality, flexibility, quality, ease of integration with other software systems, file compatibility across computer platforms, range of supported computer platforms, performance, price and total cost of ownership, customer service and support, company reputation and financial viability, and effectiveness of sales and marketing efforts.\nOur competitors include large, global, publicly traded companies; small, geographically-focused firms; startup firms; and solutions produced in-house by the end users. Some of our current and possible future competitors have greater financial, technical, marketing and other resources than us, and some have well-established relationships with current and potential customers of ours. Our current and possible future competitors also include firms that have elected, or may in the future elect, to compete by means of open source licensing. These competitive pressures may result in decreased sales volumes, price reductions and/or increased operating costs, and could result in lower revenues, margins and net income.\nPROPRIETARY RIGHTS AND LICENSES\nWe regard our software as proprietary and rely on a combination of trade secret, copyright, patent and trademark laws, license agreements, nondisclosure and other contractual provisions, and technical measures to protect our proprietary rights in our products. We distribute our software products under software license agreements that predominantly grant customers nonexclusive licenses, which are typically nontransferable, for the use of our products. License agreements for our products are generally directly between us and end users. Use of the licensed software product is restricted to specified sites unless the customer obtains a multi-site license for its use of the software product or the software product is by its nature a multi-site use product. Software security measures are also employed to prevent unauthorized use of our software products and the licensed software is subject to terms and conditions prohibiting unauthorized use, distribution, or reproduction. For most products, customers may purchase a perpetual license of the technology with the right to annually purchase ongoing maintenance, technical support and upgrades, or may lease the product on a fixed-term basis for a fee that includes the license, maintenance, technical support and upgrades. For some products, customers purchase an annual subscription for a certain number of named users that includes the license, maintenance, technical support and upgrades or purchase elastic units, which enable the use of any supported product at any time until their licensed volume is met.\nWe license our software products utilizing a combination of web-based and hard-copy license terms and forms. For certain software products, we primarily rely on \"click-wrapped\" licenses (i.e. online agreements where the website provider posts terms and conditions, and the user clicks on the \"accept\" button). The enforceability of these types of agreements under the laws of some jurisdictions is uncertain.\nWe also seek to protect the source code of our software as a trade secret and as registered unpublished copyrighted work. We have obtained federal trademark registration protection for Ansys and other marks in the U.S. and foreign countries. Additionally, we were awarded numerous patents by the U.S. Patent and Trademark Office or equivalent offices in other jurisdictions and have a number of patent applications pending. To the extent we do not choose to seek patent protection for our intellectual property, we primarily rely on the protection of our source code and underlying functionality as a trade secret.\nOur employees have signed agreements under which they have agreed not to disclose trade secrets or confidential information. These agreements, where legally permitted, restrict engagement in or connection with any business that is competitive with us anywhere in the world while employed by us (and, in some cases, for specified periods thereafter) and state that any products or technology created by employees during their term of employment are our property. In addition, we require all channel partners to enter into agreements not to disclose our trade secrets and other proprietary information.\nDespite these precautions, there can be no assurance that misappropriation of our technology and proprietary information (including source code) will be prevented. Further, there can be no assurance that copyright, trademark, patent and trade secret protection will be available for our products in certain jurisdictions, or that restrictions on the ability of employees and channel partners to engage in activities competitive with us will be enforceable. Costly and time-consuming litigation could be necessary in the future to enforce our rights to our trade secrets and proprietary information or to enforce our patent rights and copyrights, and it is possible that, in the future, our competitors may be able to obtain our trade secrets or to independently develop similar technology.\nThe software development industry is characterized by rapid technological change. Therefore, we believe that factors such as the technological and creative skills of our personnel, new product developments, frequent product enhancements, name recognition and reliable product maintenance are also important to establishing and maintaining technology leadership in addition to the various available legal protections of our technology.\nWe do not believe that any of our products infringe upon the proprietary rights of third parties. There can be no assurance, however, that third parties will not claim such infringement by us or our licensors or licensees with respect to current or future products. In addition, there are non-practicing entities and patent assertion entities whose business models are built on not producing any products, but rather extracting payments from revenue-generating companies through patent infringement assertions and/or litigation. We expect that software suppliers will increasingly be subject to the risk of such claims as the number of products and suppliers continues to expand and the functionality of products continues to increase. Any such claims, with or without merit, could be time consuming, result in costly litigation, cause product release delays or require us to enter into royalty or licensing agreements. Such royalty or licensing agreements, if required, may not be available on terms acceptable to us.\nSEASONAL VARIATIONS\nOur business has experienced seasonality, including quarterly volatility in software sales resulting from slowdowns of customer activities during the summer months, particularly in Europe, as well as from the seasonal purchasing and budgeting patterns of our global customers. Lease and maintenance contract renewals, as well as our revenue, are typically highest in the fourth quarter.\nDEFERRED REVENUE AND BACKLOG\nDeferred revenue consists of billings made or payments received in advance of revenue recognition from customer agreements. The deferred revenue on our consolidated balance sheets does not represent the total value of annual or multi-year, noncancellable agreements. Our backlog represents installment billings for periods beyond the current quarterly billing cycle. Our deferred revenue and backlog as of December 31, 2021 and 2020 consisted of the following:\nRevenue associated with deferred revenue and backlog that will be recognized in the subsequent twelve months is classified as current in the tables above.\nHUMAN CAPITAL RESOURCES\nAt the heart of our culture is a commitment to our people. People are our most important investment and greatest asset. The success and the growth of our business depend on our ability to attract, develop, incent and retain a diverse population of talented, qualified and highly-skilled employees at all levels of our organization, including our executive officers, and across our global workforce. We have developed key recruitment and retention strategies, objectives and measures that serve as the framework for our human capital management approach. These strategies, objectives and measures are advanced through a number of programs, policies and initiatives, including: promoting diversity, equity, inclusion and belonging; employer branding and talent acquisition; ongoing employee development; competitive compensation, including incentives linked to Ansys' and employees' performance, and competitive benefits programs providing choice and value to our employees; supporting safety and health; and surveying employee satisfaction and engagement.\nAs of December 31, 2021, we employed 5,100 people, including: 1,900 in product development, 2,500 in sales, support and marketing, and 700 in general and administrative functions. Of these employees, 46% were located in the Americas, 27% were located in Europe, Middle East and Africa (EMEA) and 27% were located in Asia-Pacific (APAC). Certain international employees are subject to collective bargaining agreements or have local work councils.\nDiversity, Equity, Inclusion and Belonging\nDiversity, equity, inclusion and belonging are key tenets of our culture. We believe diversity at all levels of our organization adds value to our business decision making and innovation by encouraging and incorporating a variety of perspectives and experiences.\nAs of December 31, 2021, our self-identified gender diversity was:\n(1)Senior leadership consists of leaders in our executive career track that report directly to the chief executive officer or within one additional reporting level of the chief executive officer and those at the highest tier of our management career track who report directly to a leader on our executive track. The senior leaders, who represent 1% of global employees, are responsible for directing strategic plans aligned with our corporate strategy through multiple levels of management.\nAs of December 31, 2021, our self-identified ethnic diversity was:\n*Other includes Native Hawaiian, American Indian, Alaskan Native, Pacific Islander, or two or more races.\nWe have a growing number of employee resource groups dedicated to ensuring a culture of inclusion and belonging that supports our goals of increasing retention of valuable employees and creating an open culture that fuels innovation. Our employee resource groups include Women in Tech at Ansys, Ansys Pride Alliance, Black Employee Network at Ansys, Veterans at Ansys, Ansys (dis)ability Network, and Ansys Latino Connection. Additionally, we train all of our people managers on the inclusive leadership concepts of overcoming unconscious bias, building inclusive teams, and making effective people decisions in areas of recruitment, selection, growth and development.\nEmployee Recruitment, Development and Retention\nOur talent strategy is focused on (i) attracting diverse high-quality talent, (ii) continually developing and engaging our employee base and (iii) retaining our people by recognizing and rewarding performance. Our commitment to recruiting diverse talent is evidenced in the United States through our dedication to increasing recruiting efforts at historically black colleges and universities, as well as our involvement with minority engineering societies, women in technology groups, veterans’ organizations and LGBTQ+A organizations. In addition to targeted outreach, we recruit talent through (i) attending career and networking events aimed towards recruiting diverse audiences, (ii) hiring internally through our Ansys internship/co-op programs for current students and (iii) value partnerships including professional societies that promote our programs to diverse audiences. Our academic product suite is also widely used in research and teaching settings, which allows students to become familiar with our simulation software and creates opportunities to strengthen our university ties and recruit top talent.\nWe support the development of our employees by providing professional development and tuition assistance, conducting annual individual assessments, and encouraging feedback on performance. We also drive a variety of focused initiatives specifically designed to support employee development. These include our annual talent reviews and succession planning, emotional intelligence trainings, and company-sponsored education programs, such as management essentials to develop front-line leaders in foundational people management skills.\nDeveloping our employees helps keep employees engaged and excited about their future at Ansys. It also helps mitigate risks associated with employee loss and keeping up with rapid technological and social change. For the year ended December 31, 2021, our annual turnover rate was 8%, and, of this, 7 of those percentage points were voluntary.\nCompensation and Benefits Program\nOur compensation programs provide an opportunity for employees to earn higher compensation by aligning their performance, which may include contributions to our environmental, social and governance objectives, with our overall financial and operational success. The program includes three key elements: (i) competitive annual salaries, (ii) annual cash incentives and sales commission programs, with a majority of our employees eligible to earn more or less than the target opportunities based on both ours and the employee's performance and (iii) long-term equity incentives with over half of employees receiving equity grants each year in the form of time-based restricted stock units and, in the case of senior leadership, time-based restricted stock units and performance stock units that vest, if at all, based on our financial performance and shareholder returns over a specified period of time. These grants align the long-term financial interests of our employees with those of our stockholders.\nHealth and welfare benefit programs include market-competitive benefits comprised of a mix of company-provided and other benefits, including those for medical, dental and vision insurance; life and disability insurance; defined contribution retirement plans; and many different employee assistance programs, such as financial, legal, emotional and social well-being employee assistance programs. Our investments in health and welfare benefits focus on providing choice and value to our employees so they can select market-competitive benefits that support their personal needs.\nLocal regulations are considered when developing our compensation and benefits packages for employees across the globe.\nSafety and Health\nThe health and safety of our employees and their families, our partners and our broad community around the world remain a high priority. At the onset of the COVID-19 pandemic, we took action to enable our employees to work from home. We closed our offices (including our corporate headquarters), transitioned to a remote work environment, and implemented certain travel restrictions, each of which has changed how we operate our business. While some of our offices have since reopened, remote or hybrid access has remained the primary means of work for much of our workforce. We announced our plans for post-pandemic work arrangements, which included options for our employees to work from home, in the office, or on a flexible basis where they can alternate between the office and home. These arrangements have continued to evolve to meet local guidelines on precautions to be taken to mitigate COVID-19 risk to our employees and customers.\nIn October 2021, we surveyed our employees and 91% of our employees responded favorably to the statement: \"I feel supported in my efforts to adapt to new changes in how we work due to the COVID-19 pandemic.\"\nEmployee Satisfaction and Engagement\nEmployee feedback and engagement are critical to our success. We conduct global employee engagement surveys with the goal of using the feedback to improve the work environment and employee satisfaction. This feedback continues to be a critical component of our listening strategy. The survey itself has become an even more important tool to stay connected with employee sentiment, as nearly all of our employees work in a remote or hybrid arrangement.\nOur survey scores confirm that employees continue to be highly engaged, and our scores exceeded the external norm across all dimensions of engagement that were measured. This year, some of the core areas of strength include that we provide opportunities for learning and development, managers create an environment of openness and trust and we value employee contributions.\nEmployee feedback is also strong in other important areas including future vision, recognition, communication, leadership, growth and development. The findings from these surveys help us to continually enable and improve performance, manager effectiveness, culture and engagement.\nAVAILABLE INFORMATION\nInformation about our products and services is available on the internet at www.ansys.com. We provide information for investors on our corporate website under \"Why Ansys - Investor Relations\".\nWe make available, free of charge, the following under \"Why Ansys - Investor Relations\" shortly before or promptly following its first use or release, or as soon as reasonably practicable after we electronically file such material with, or furnish it to, the SEC, as applicable: financially-related press releases, including earnings releases and prepared remarks, various SEC filings, including annual, quarterly and current reports and proxy statements and amendments to those reports filed or furnished pursuant to Section 13(a) or 15(d) of the Exchange Act, presentation materials associated with earnings conference calls, and access to live and recorded audio from earnings and other investor conference calls or events. For earnings conference calls, we generally include in our posted materials a cautionary statement regarding forward-looking and non-GAAP financial information, and we provide GAAP reconciliations when we include non-GAAP financial information. Such GAAP reconciliations may be in materials for the applicable presentation, in materials for prior presentations or in our annual, quarterly or current reports. Other information posted on our corporate website that may not be available in our filings with the SEC includes information relating to our corporate governance. SEC filings may also be obtained on the SEC’s website at www.sec.gov.\nWhere we have included internet addresses in this Annual Report on Form 10-K, such as our internet address and the internet address of the SEC, we have included those internet addresses as inactive textual references only. Except as specifically incorporated by reference into this Annual Report on Form 10-K, information on those websites is not part hereof.",
    "item_1A": "ITEM 1A.RISK FACTORS\nThe following are important factors we have identified that could affect our future results and an investment in our securities. Although the risks are organized by headings and each risk is described separately, many of the risks are interrelated.\nYou should not interpret the disclosure of any risk factor to imply that the risk has not already materialized. While we believe we have identified and discussed below the key risk factors affecting our business, there may be additional risks and uncertainties that are not presently known or that are not currently believed to be significant that may adversely affect our business, prospects, financial condition, results of operations or cash flows in the future. In addition, from time to time we provide information, including information contained in this Annual Report on Form 10-K, that contains forward-looking statements concerning, among other things, projected financial performance, total addressable market, market and industry sector growth, product development and commercialization or other aspects of future operations. Such statements are based on the assumptions and expectations of our management at the time such statements are made. We caution investors that our performance and any forward-looking statements are subject to risks and uncertainties, including but not limited to, the following:\nGlobal Operational Risks\nAdverse economic and geopolitical conditions may impact our operations and financial performance.\nOur operations and performance depend significantly on global macroeconomic, specific foreign country and U.S. domestic economic conditions. Recently, inflation rates in the U.S. have increased. Adverse conditions in the macroeconomic environment, including high inflation, may result in decreased demand for our products and services, constrained credit and liquidity, reduced government spending, and volatility in equity and foreign exchange markets. In addition, significant downturns and volatility in the global economy expose us to impairments of certain assets if their values deteriorate. Tighter credit due to economic conditions may diminish our future borrowing ability and increase borrowing costs under our existing credit facilities. Customers' ability to pay for our products and services may also be impaired, which could lead to an increase in our allowance for doubtful accounts and write-offs of accounts receivable.\nA significant portion of our business comes from outside the U.S. and our customers supply a wide array of goods and services to most of the world's major economic regions. International revenue represented 54.5%, 53.8% and 57.9% of our total revenue\nfor the years ended December 31, 2021, 2020, and 2019, respectively. In fiscal year 2021, our largest geographic revenue bases were the U.S., Japan and Germany.\nWhen the significant economies in which we do business deteriorate or suffer a period of uncertainty, our business and financial performance may be impacted through reduced customer and government spending, changes in purchasing cycles or timing and reduced access to credit for our customers, among other events. Furthermore, customer spending levels in any foreign jurisdiction may be adversely impacted by changes in domestic policies, including tax and trade policies. A substantial portion of our license and maintenance revenue is derived from annual lease and maintenance contracts, which typically have a high rate of customer renewal. When the rate of renewal for these contracts is adversely affected by economic or other factors, our lease license and maintenance growth is adversely affected.\nIf we are unable to attract and retain key talent, our business could be adversely affected.\nThe market for talent in the technology industry has become increasingly competitive in the wake of COVID-19. Because of the highly technical nature of our products and services, we must continue to attract and retain skilled personnel. These skilled roles are challenging to fill given the recent job market dynamics, including wage inflation, and our talent has been the subject of recruitment by our competitors. While we have non-competition and non-solicitation agreements with many of these individuals, the enforceability of these agreements may be limited by the courts.\nIn addition, our success depends upon the continued service of our senior executives and our key technical and sales employees. Most of these individuals could terminate their relationship with us at any time. The loss of any of them for which there has not been adequate knowledge-sharing and transfer might significantly delay or prevent the achievement of our business objectives and could materially harm our business and customer relationships.\nWhile we have historically recruited globally for positions in the U.S., in recent years our ability to do so has been curbed by more restrictive domestic immigration laws. If the immigration laws become even stricter or the processing of immigration requests becomes even more cumbersome or less efficient, or if we have less success in recruiting and retaining key personnel, our business, reputation and operating results could be materially and adversely affected.\nWe are subject to trade restrictions that could impact our ability to sell to customers and result in liability for violations.\nDue to the global nature of our business, we are subject to domestic and international trade protection laws, policies, sanctions, and other regulatory requirements affecting trade and investment. For example, we are subject to import and export restrictions and regulations that prohibit the shipment or provision of certain products and services to certain countries, regions and persons targeted by the U.S., including the Export Administration Regulations administered by the U.S. Bureau of Industry and Security (BIS), economic and trade sanctions administered by the U.S. Treasury Department's Office of Foreign Assets Control (OFAC), and International Traffic in Arms Regulations (ITAR) administered by the Department of State’s Directorate of Defense Trade Controls (DDTC). In 2021, BIS continued to add more companies, including existing customers, to its Entity List and OFAC continued to increase the number of companies subject to its sanctions, which continues to limit the companies with which we can do business.\nThe Entity List and OFAC restrictions limit our ability to deliver products and services to these customers and, in the absence of a license, our ability to sell products and services to these customers in the future. In addition, restrictions implemented by OFAC restrict our ability to sell to, or transact with, restricted individuals, entities, or countries. The inclusion of companies on the Entity List and subjecting companies to the heightened restrictions may encourage them to seek substitute products from competitors whose products are not subject to these restrictions or to develop their own products. We cannot predict whether or when any changes will be made that eliminate or decrease these limitations on our ability to sell products and provide services to these customers. Additionally, other existing and prospective customers may be added to the Entity List and/or be subjected to trade restrictions in the future, and such actions may result in other indirect impacts that cannot be quantified, including the imposition of additional trade restrictions on our business by the U.S., China, or other countries. Restrictions on our ability to sell and ship to customers could have a significant adverse effect on our business and consolidated financial statements.\nOur products could also be shipped to restricted parties by third parties, including our channel partners. Even though we take measures to ensure that our channel partners comply with all applicable trade restrictions, any failure by channel partners to comply with such restrictions could have negative consequences for us. Violators of trade restrictions may be subject to significant penalties, which may include considerable monetary fines, criminal proceedings against them and their officers and employees, a denial of export privileges, and suspension or debarment from selling products or services to the federal government. Any such penalties could have a significant adverse effect on our business and consolidated financial statements. In addition, the political and media scrutiny surrounding any governmental investigation could cause significant expense and reputational harm and distract senior executives from managing normal day-to-day operations.\nThe COVID-19 pandemic has had, and is expected to continue to have, an effect on our business, employees, and consolidated financial statements.\nThe health and safety of our employees and their families, our partners and our other constituents around the world is a high priority. At the onset of the COVID-19 pandemic, we took action to enable our employees to work from home. We closed our offices (including our corporate headquarters), transitioned to a remote work environment, and implemented certain travel restrictions, each of which has changed how we operate our business. We continue to monitor and manage the situation, but as of now, remote access remains the primary means of work for most of our workforce. We previously announced our plans for post-pandemic work arrangements. These plans include options for our employees to work from home, in the office or on a flexible basis where they can alternate between the office and home. The adoption of the arrangements is subject to evolving local guidelines on precautions to be taken to mitigate COVID-19 risk to our employees and customers.\nRequirements related to COVID-19 safety precautions, including COVID-19 vaccine mandates of varying scope and applicability (such as U.S. Executive Order 14042), may apply to operations in the U.S. or other jurisdictions in which our business operates. Failure to comply with the applicable requirements could create the risk of potential loss of business, including with respect to our U.S. government contracts or agreements with customers who contract with the U.S. government, which could have an adverse effect on our business and consolidated financial statements. Our implementation of various mandatory vaccination, testing or other requirements related to COVID-19 safety may result in a reduction in productivity of our workforce, attrition of management personnel or technical talent or in a reduction in employee morale, which could have an adverse effect on our business and consolidated financial statements.\nThe COVID-19 outbreak continues to cause business slowdowns and shutdowns in affected areas. While in-person meetings have started to resume, as well as live attendance at trade events, a majority of our customer events and those of our channel partners remain virtual only experiences. Virtual events may not be as successful as customer events prior to COVID-19 because, among other reasons, the limited number of such events, the varying attendance levels and virtual event fatigue.\nAn extended period of remote work arrangements may negatively impact the sales pipeline due to reduced, delayed, or altered sales and marketing interactions with customers and potential customers, expose us to increased risk of cyber incidents, delay or alter product roadmaps or research and development due to reduced or limited access to technologies, equipment, or services, and delay or disrupt recruitment efforts. Limitations on availability, ease of use or increased cost related to the use of our products in our customers' remote work environments could also result in a decline in demand for our products.\nThe situation surrounding the COVID-19 pandemic remains fluid, and given its inherent uncertainty, we expect the pandemic will continue to have an impact on our business and consolidated financial statements in the near term. The duration and extent of the impact from the COVID-19 pandemic depends on future developments that cannot be accurately predicted at this time, such as the timing and effectiveness of vaccination efforts in the markets where we do business, transmission rates of the virus and the development of virus mutations and variants, the nature and scope of government economic recovery measures, and the extent and effectiveness of containment actions. The impact of the COVID-19 pandemic may also have the effect of heightening many other risks and uncertainties described in this \"Risk Factors\" section.\nFailure to comply with global data privacy laws could give rise to regulatory enforcement action, monetary penalties, loss of the ability to do business in certain jurisdictions, or reputational harm.\nWe are subject to global data privacy laws and regulations addressing the processing of personal data. As the global focus on data privacy regulation continues to increase, standards governing the processing of personal data continue to become more strict, conflicting, and numerous. As a result, potential risks may intensify as our global business pursues data privacy compliance.\nThe General Data Protection Regulation (European Union), the Data Protection Act (United Kingdom), the Personal Information Protection and Electronic Documents Act (Canada), the Personal Information Protection Law (China), the Law Concerning the Protection of Personal Information (Japan), the Personal Information Protection Act (South Korea), many state and federal privacy laws within the U.S., and other similar global laws in locations in which we do business (collectively, \"Privacy Laws\") govern our global data privacy practices. Additionally, Privacy Laws impose abundant compliance obligations related to our processing of personal data arising from: (i) the delivery of our products and services to our customers; and (ii) our business operations involving employee data.\nCompliance with Privacy Laws has and will continue to require the deployment of substantial resources and increased costs. As the global data privacy landscape continues to change, including: (i) new and varying restrictions on the transfer of personal data across borders; (ii) the growing list of privacy rights afforded to individuals of certain jurisdictions; (iii) data minimization requirements; and (iv) the growing number of governmental agencies dedicated to the preservation of data privacy rights, we may be required to make significant changes to our software applications or business operations. Such changes may increase\nthe cost and complexity of delivering our products and services in some markets, require an investment in additional resources or tools to manage our data privacy compliance, give rise to operational interruption in the performance of services for customers, or adversely affect the internal processing of employee information.\nFailure to comply with Privacy Laws may lead to regulatory enforcement actions, loss of the ability to do business in certain jurisdictions, or inquiries and investigations into our activities; all of which could result in monetary penalties, reputational damage, lawsuits, extensive and prescriptive consent decrees or judgments. Additional software resources, increased workforce, or added expenses may be required to return the company to a compliant data privacy status.\nFailure to comply with laws and regulations could harm our business.\nWe develop and sell software and consulting services and maintain support operations in various countries whose laws and practices differ from one another and are subject to unexpected changes. Furthermore, our business is subject to regulation by various global governmental agencies, including agencies responsible for monitoring and enforcing employment and labor laws, workplace safety, environmental laws, consumer protection laws, anti-bribery laws, import/export controls, securities laws and tax laws and regulations. In certain jurisdictions, these regulatory requirements may be more stringent than those in the U.S. Managing these geographically diverse operations requires significant attention and resources to ensure compliance.\nOur global reach includes countries considered high-risk environments for public corruption. This exposes us to risks associated with violations of anti-corruption laws and regulations such as the U.S. Foreign Corrupt Practices Act and the U.K. Bribery Act. To promote compliance, we forbid our agents and employees from engaging in corrupt behavior and have implemented a compliance program to prevent and detect violations of anti-corruption laws. There remains, however, a risk that illegal conduct could occur thereby exposing us to the financial and reputational risks associated with a violation of anti-corruption laws.\nNon-compliance with applicable regulations or requirements could subject us to investigations, sanctions, enforcement actions, disgorgement of profits, fines, damages, civil and criminal penalties or injunctions and may result in our inability to provide certain products and services to existing or prospective customers. If any governmental sanctions are imposed, or if we do not prevail in any possible civil or criminal litigation, or if customers make claims against us for compensation, our business and consolidated financial statements could be harmed. In addition, responding to any action will likely result in a significant diversion of management’s attention and resources and an increase in professional fees and costs. Enforcement actions and sanctions could have a significant adverse effect on our business and consolidated financial statements.\nA catastrophic event or infrastructure failure could result in the loss of business and adverse financial consequences.\nA significant portion of our personnel, source code and computer equipment is located in the U.S., Canada, India, Japan and throughout Europe. A natural disaster (including significant disruptions in weather as a result of global climate change), cyberattack, terrorist act, pandemic, or other unforeseen catastrophe in any of these areas or a breakdown in our business infrastructure, such as an interruption in power supply, telephone system or information technology systems, could cause disruptions to our sales, operations, services and product development activities. As our sales are generally greater at the end of a quarter, the potential adverse effects resulting from any of these events would be accentuated if they occurred at quarter end.\nEffective business continuity, disaster recovery and crisis management plans are critical to minimizing the impact of such unplanned or unexpected events. We also face increasing customer certification requirements with respect to such systems. Failure to establish plans that effectively mitigate the impacts of these disruptions or meet customer certification requirements could have a significant adverse effect on our business and consolidated financial statements.\nSee \"The COVID-19 pandemic has had, and is expected to continue to have, an effect on our business, employees, and consolidated financial statements\" portion of this \"Risk Factors\" section for a description of the risk associated with the pandemic.\nIndustry Operational Risks\nOur industry is highly competitive, which could result in downward pressure on our prices.\nWe continue to experience competition across all markets for our products and services. Some of our current and potential competitors have greater financial, technical, marketing and other resources than we do, and some have well-established relationships with our current and potential customers. Our current and potential competitors also include firms that have competed, or may in the future compete, by means of open source licensing. Companies we have, or could have, strategic alliances with could reduce or discontinue technical, software development and marketing relationships with us for competitive purposes.\nIf our competitors offer deep discounts on certain products or services, or develop products that the marketplace considers more valuable, we may lower prices or offer discounts or other favorable terms to compete successfully. Our maintenance products, which include software license updates and product support fees, are generally priced as a percentage of new software license fees. Our competitors may offer lower percentage pricing on product updates and support. Some competitors may bundle software products for promotional purposes or as a long-term pricing strategy or provide guarantees of prices, product implementations or wider geographical license usage provisions. Any of these practices could, over time, significantly constrain the prices that we can charge for certain products.\nFurthermore, if we do not adapt pricing models to reflect changes in customer usage of our products or changes in customer demand, our software license revenues could decrease. Additionally, increased distribution of applications through application service providers, including software-as-a-service providers, may reduce the average price of our products or adversely affect other sales of our products, reducing new software license revenues, unless we can offset price reductions with volume increases.\nThese competitive pressures may result in decreased sales volumes, price reductions and/or increased operating costs, and could result in lower revenues, margins and net income.\nWe may not be successful in developing and marketing new products to adequately address the rapidly changing technology industry.\nWe operate in an industry generally characterized by rapidly changing technology and frequent new product introductions. A major factor in our future success will be our ability to anticipate technological changes and to develop and introduce, in a timely manner, new products and new ways to deliver them to meet those changes. Our ability to grow revenue will be dependent on our ability to respond to customer needs in the areas of, among others, 5G, autonomous vehicles, IIoT and electrification, and to leverage cloud computing and new computing platforms. In addition, our future success may depend on our ability to continue to develop a systems integrator ecosystem able to handle integrations and process and application development to address the challenge of the increasingly complex integration of our products' different functionalities to address customers' requirements. In addition, for those customers who authorize a third-party technology partner to access their data, we do not provide any warranty related to the functionality, security and integrity of the data transmission or processing. Despite contract provisions to protect us, customers may look to us to support and provide warranties for the third-party applications, integrations, data and content, even though not developed or sold by us, which may expose us to potential claims, liabilities and obligations, all of which could harm our business.\nWe devote substantial resources to research and development, which could cause our operating results to decline.\nWe devote substantial resources to research and development. New competitors, technological advances in the software development industry by us or our competitors, acquisitions, entry into new markets, or other competitive factors may require us to invest significantly greater resources than anticipated. If we are required to invest significantly greater resources than anticipated without a corresponding increase in revenue, operating results could decline. In addition, our periodic research and development expenses may be independent of our level of revenue, which could negatively impact financial results.\nThere can be no assurance that we will be successful in developing and marketing, on a timely basis, new products or product enhancements or that the new products will adequately address the changing needs of the marketplace or that we will successfully manage the transition from existing products. Software products as complex as those we offer may contain undetected errors, defects or vulnerabilities when first introduced or as new versions are released, and the likelihood of errors, defects or vulnerabilities is increased as a result of our commitment to the frequency of product releases.\nThere can be no assurance that errors, defects or vulnerabilities will not be found in any new or enhanced products after the commencement of commercial shipments. The occurrence of any defects or errors in our products could result in lost or delayed market acceptance and sales of our products, delays in payment to us by customers, loss of customers or market share, product returns, damage to our reputation, diversion of our resources, increased service and warranty expenses or financial concessions, increased insurance costs, and liability for damages.\nCompany Operational Risks\nWe are dependent upon our channel partners for a significant percentage of our revenue and usage of channel partners presents certain heightened compliance risks.\nWe distribute our products through a global network of independent channel partners, which accounted for 23.7%, 22.2%, and 22.9% of our revenue during the years ended December 31, 2021, 2020, and 2019, respectively. Channel partners sell our software products to new and existing customers, expand installations within the existing customer base, offer consulting\nservices and provide the first line of technical support. In the APAC and EMEA regions, we are highly dependent upon our channel partners. Difficulties in ongoing relationships with channel partners, such as failure to meet performance criteria and differences in handling customer relationships, could adversely affect our performance. Additionally, the loss of any major channel partner, including a channel partner's decision to sell competing products rather than ours, could result in reduced revenue. Moreover, our future success will depend substantially on the ability and willingness of our channel partners to dedicate the resources necessary to understand and promote our expanding portfolio of products and to support a larger installed base within each of our geographic regions. If the channel partners are unable or unwilling to do so, we may be unable to sustain revenue growth.\nWe have been increasing the number of our channel partners, particularly in international locations. The business relationships with many of our channel partners are recently established and could result in additional compliance burdens for us. In addition, these new channel partners have a less-established payment history and revenue from these channel partners could come with a higher rate of bad debt expense. Where channel partners operate on our behalf to collect and process personal data of customer contacts, failure to comply with relevant data privacy laws in the handling of such personal data could result in liability to us for any fines, civil suits or non-financial performance obligations imposed by regulatory authorities on these partners with respect to our customer data.\nCertain products require a higher level of sales and support expertise. Failure of our sales channel, particularly the independent channel partners, to obtain this expertise and to sell the new product offerings effectively could have an adverse impact on our sales in future periods. Any of these problems may result in the loss of or delay in customer acceptance, diversion of development resources, damage to our reputation, or increased service and warranty costs, any of which could have a significant adverse effect on our business and consolidated financial statements.\nWe may not be able to realize the potential benefit of our acquisitions and such acquisitions could pose risks to our business.\nWe acquire businesses and technology to support our long-term strategic direction.\nEach acquisition that we complete may present risks, including: difficulty in integrating the management teams, strategies, cultures and operations of the companies or businesses; failing to achieve anticipated synergies, revenue increases or cost savings; difficulty incorporating and integrating the acquired technologies or products with our existing product lines; difficulty with coordinating and integrating sales, distribution and marketing functions; failure to develop new products and services that utilize the technologies and resources of the companies; disruption of our ongoing business and diversion of management's attention to transition or integration issues; liabilities that were not identified during the acquisition process; the loss of our key employees, customers, partners and channel partners or those of the acquired companies or businesses; and cybersecurity and data privacy risks.\nFuture acquisitions may involve the expenditure of significant cash resources; the incurrence of debt, which increases our interest expense and leverage; or the issuance of equity, which is dilutive to stockholders and may decrease earnings per share.\nWe allocate a portion of the purchase price to goodwill and intangible assets. If we do not realize all the economic benefits of an acquisition, there could be an impairment of goodwill or intangible assets. Furthermore, impairment charges are generally not tax-deductible and will result in an increased effective income tax rate in the period the impairment is recorded.\nIf we do not achieve the anticipated benefits of our acquisitions as rapidly or to the extent anticipated by our management or the financial and industry analysts, there could be a significant adverse effect on our stock price, business and consolidated financial statements.\nThe ongoing digital transformation of our operational processes may not achieve the benefits identified.\nWe are in the process of implementing new tools and technology to digitally transform our business. While these systems are anticipated to automate and deliver efficiencies across multiple commercial and operational processes within the business, there is a risk that the benefits could be substantially delayed. There is also a risk that we will have to write off previously capitalized expenditures if the projects are not successful or if implementation decisions regarding the project are modified. Factors that could further delay the timing of benefits realization include:\n•changes in leadership and project objectives;\n•additional needs for technical expertise and manpower; and\n•longer than anticipated time horizon for employee adoption and mastery.\nAny of the above could divert efforts of key operational management away from other aspects of the business, including the maintenance of current commercial and business platforms, and result in increased consulting and software costs. These factors could have a significant negative impact on our business and consolidated financial statements.\nWe may be subject to proceedings that could harm our business.\nWe are subject to various investigations, claims and legal proceedings that arise in the ordinary course of business, including commercial disputes, labor and employment matters, tax audits and litigation, alleged infringement of intellectual property rights and other matters. Use or distribution of our products could generate product liability, regulatory infraction, or similar claims by our customers, end users, channel partners, government entities or other third parties. Sales and marketing activities that impact processing of personal data, as well as measures taken to ensure license compliance, may also result in claims by customers and individual employees of customers. Each of these matters is subject to various uncertainties, and it is possible that an unfavorable resolution of one or more of these matters could have a significant adverse effect on our consolidated financial statements as well as cause reputational damage.\nWe may suffer reputational or financial harm if we have product standard or quality issues.\nWe have separate quality systems and registrations under the ISO 9001:2015 standard in addition to other governmental and industrial regulations. Our continued compliance with quality standards and favorable outcomes in periodic examinations is important to retain current customers and vital to procure new sales. If it was determined that we were not in compliance with various regulatory or ISO 9001 standards, our certificates of registration could be suspended, requiring remedial action and a time-consuming re-registration process. Product quality issues or failures could result in our reputation becoming diminished, resulting in a material adverse impact on our business and consolidated financial statements.\nOur short-term and long-term sales forecast may not be accurate, which could result in an adverse impact on our business and consolidated financial statements.\nThe software business is generally characterized by long sales cycles. These long sales cycles increase the difficulty of predicting sales for any particular quarter. Many operational and strategic decisions are based upon short- and long-term sales forecasts. Our sales personnel continually monitor the status of proposals, including the estimated closing date and the value of the sale, in order to forecast quarterly sales. These forecasts are subject to significant estimation and are impacted by many external factors, including global economic conditions and the performance of our customers. The heightened uncertainty resulting from the COVID-19 pandemic results in greater ranges and variability of these forecasts.\nA variation in actual sales activity from that forecasted could cause us to plan or budget incorrectly and, therefore, could have a significant adverse effect on our business and consolidated financial statements. Management also forecasts macroeconomic trends and developments and integrates them through long-range planning into budgets, research and development strategies and a wide variety of general management duties. Global economic conditions, and the effect those conditions and any disruptions in global markets have on our customers, may have a significant impact on the accuracy of our sales forecasts. These conditions may increase the likelihood or the magnitude of variations between actual sales activity and our sales forecasts and, as a result, our performance may be hindered because of a failure to properly match corporate strategy with economic conditions. This, in turn, could have a significant adverse effect on our business and consolidated financial statements. To the extent our forecasts are incorrect and, as a result, we fail to meet analyst expectations regarding financial performance or miss or reduce the financial guidance we give to investors, our share price may be adversely impacted.\nIntellectual Property Risks\nOur success is highly dependent upon the legal protection of our proprietary technology.\nWe primarily rely upon contracts, copyright, patent, trademark, and trade secrets laws to protect our technology. We maintain intellectual property programs, including applying for patents, registering trademarks and copyrights, protecting trade secrets, entering into confidentiality agreements with our employees, customers and partners, and limiting access to and distribution of our software, documentation, and other proprietary information. However, software programs are particularly prone to piracy, which is a global phenomenon, and as a result we may lose revenue from piracy or usage and distribution of unlicensed software. Additionally, patent, copyright, trademark, and trade secret protection do not provide the same coverage in every country in which we sell our products and services and some forms of contractual protections (including limited licenses, “click-wrapped” licenses and online agreement) may not be adequately enforced. Policing the unauthorized distribution and use of our products is difficult, and software piracy (including online piracy) is a persistent problem. While we continue to develop better mechanisms to detect and report or investigate unauthorized use of our software, we are also constrained by data privacy laws that restrict our ability to collect data about unlawful usage in some countries. We cannot assure that the steps we take to protect our proprietary technology are adequate to prevent misappropriation of our software by third parties, or that third parties will not copy our technology or develop similar technology independently to compete with our products. Despite our efforts to prevent such activities, we may nonetheless lose significant revenue due to illegal use of our software or technology.\nIn the event of a misappropriation of our intellectual property, costly and time-consuming litigation may be necessary to enforce our rights. In addition, third parties may subject us to infringement claims with respect to their intellectual property rights. Any such litigation could be costly to defend, damage our reputation, and distract our employees from their daily work. Any successful infringement claims asserted against us could require us to develop technology workarounds for the impacted technologies, products, or solutions, which could be costly, disrupt product development, and delay go-to-market activities. Such disruption and delay could negatively impact our financial results.\nWe may not be able to continue to obtain licenses to third-party software and intellectual property on reasonable terms or at all, which may disrupt our business and harm our financial results.\nWe license third-party software and other intellectual property for use in product research and development and, in some instances, for inclusion in our products. We also license third-party software, including the software of our competitors, to test the interoperability of our products with other industry products and in connection with our solutions and professional services. These licenses may need to be renegotiated or renewed from time to time, or we may need to obtain new licenses in the future. Third parties may stop adequately supporting or maintaining their technology, or they or their technology may be acquired by our competitors who elect to terminate our contractual relationship. We may, additionally, acquire companies that license third-party software from our competitors or others who may elect to terminate the contractual relationship once the acquisition is announced. If we are unable to obtain licenses to such third-party software and intellectual property on reasonable terms or at all, we may not be able to sell the affected products, our customers' usage of the products may be interrupted, or our product development processes and professional services offerings may be disrupted, which could in turn harm our financial results, our customers' ability to utilize our software, and our reputation.\nCybersecurity Risks\nCyberattacks and security vulnerabilities could lead to reduced revenue, increased costs, liability claims, or harm to our reputation.\nWhile we undertake commercially reasonable efforts to maintain and improve the security and integrity of our products, source code, computer systems and data with respect to the relative sensitivity of such software, systems and data, the number of computer \"hackers\" developing and deploying destructive software programs that attack our products and computer systems continues to increase. We have incurred and will continue to incur additional costs to enhance our cybersecurity efforts. Because the tactics and tools used to obtain unauthorized access to networks or to sabotage systems are constantly evolving, we may be unable to implement adequate preventive measures. Such an attack could disrupt the proper functioning of our products, cause errors in the output of our customers' work, or allow unauthorized access to and disclosure of our sensitive, proprietary or confidential information or that of our customers and employees. In the event of a serious breach of our products or systems, or where a breach occurs due to our failure to implement reasonable and appropriate safeguards, our reputation may suffer, customers may stop buying products or may terminate current services, we could face lawsuits and potential civil liability, as well as regulatory fines and non-financial penalties for any personal data breach, and our financial performance could be negatively impacted.\nThere is also a danger of industrial espionage, cyberattacks (including state-sponsored attacks), misuse, theft of information or assets (including source code), or damage to assets by people who have gained unauthorized access to our facilities, systems or information. We have in the past, and may in the future, experience such attacks. This includes access to systems or information through email phishing attacks on our employees, which has become a very prevalent technique used against companies, often\ndelaying detection through increasingly complex practices. The objective of these attacks is often to acquire user account credentials in order to access other computer systems through linked accounts or where users have recycled passwords across systems. The attack against SolarWinds in 2020, in which hackers inserted malware into a SolarWinds software update, highlights the growing risk from the infection of software while it is under assembly, known as a supply chain attack. As a software provider, we could become a vector for a similar style attack or could ourselves become the subject of a significant network breach through our usage of compromised third-party software. Similarly, subversion of popular opensource modules, such as the recently exploited Log4J vulnerability represents a widespread and ongoing risk across the software development sector.\nInadequate security practices or inadvertent acts or omissions by our employees and partners may also result in unauthorized access to our data. Employees or third parties may also intentionally compromise our or our customers' security or systems. Such cybersecurity breaches, misuse of data or other disruptions could lead to loss of or unauthorized disclosure of our source code or other confidential information, unlicensed use and distribution of our products without compensation, illegal use of our products that could jeopardize the security of customer information stored in and transmitted through our computer systems, and theft, manipulation and destruction of proprietary data, resulting in defective products, performance downtimes and possible violation of export laws and other regulatory compliance requirements. Although we actively employ measures to combat such activities, preventing unauthorized access to our systems and data is inherently difficult. In addition, litigation to either pursue our legal rights or defend any claims against us could be costly and time-consuming and may divert management's attention and adversely affect the market's perception of us and our products.\nWe have experienced targeted and non-targeted cybersecurity attacks and incidents in the past that have resulted in unauthorized persons gaining access to our information and systems, and we could in the future experience similar attacks. To date, no cybersecurity incident or attack described herein has had a material impact on our business or consolidated financial statements.\nA number of our core processes, such as software development, sales and marketing, customer service and financial transactions, rely on IT infrastructure and applications. We also rely on third-party service providers and products, which are exposed to various security vulnerabilities outside of our control. Malicious software, sabotage and other cybersecurity breaches of the types discussed above could cause an outage of our infrastructure, which could cause short-term disruption in operations or, in the event of a longer disruption, lead to a substantial denial of service to our customers and ultimately to production downtime, recovery costs and customer claims for breach of contract, as well as reputational damage and impact to employee morale and productivity.\nWe rely on service providers for infrastructure and cloud-based products.\nWe use a number of third-party service providers, which we do not control, for key components of our infrastructure, particularly with respect to development and delivery of our cloud-based products. The utilization of these service providers gives us greater flexibility in efficiently delivering a more tailored, scalable customer experience, but also exposes us to additional risks and vulnerabilities. Third-party service providers operate their own platforms that we access, and we are, therefore, vulnerable to their service interruptions. We may experience interruptions, delays and outages in service and availability from time to time as a result of problems with our third-party service providers' infrastructure. Lack of availability of this infrastructure could be due to a number of potential causes including technical failures, natural disasters (including significant disruptions in weather as a result of global climate change), fraud or security attacks that we cannot predict or prevent. Such outages could lead to the triggering of our service level agreements and the issuance of credits to our cloud-based product customers, which may impact our business and consolidated financial statements. In addition, those of our products and services that depend upon hosted components are vulnerable to security risks inherent in web-based technologies, including greater risk of unauthorized access to or use of customers' protected data. Interception of data transmission, misappropriation or modification of data, corruption of data and attacks by bad actors against our service providers may also adversely affect our products or product and service delivery. Malicious code, viruses or vulnerabilities that are undetected by our service providers may disrupt our business operations generally and may have a disproportionate effect on those of our products that are developed and delivered in the cloud environment. If our security, or that of any of our third-party service providers, is compromised, our software is unavailable or our customers are unable to use our software within a reasonable amount of time or at all, then our business and financial statements could be adversely affected.\nThese risks, though largely outside our control, may impact customer perception of our products, service and support, and may damage our brand. While we devote resources to maintaining the security and integrity of our products and systems, as well as ensuring adequate due diligence for our third-party service providers, cloud security and reliability is inherently challenging. In the event of a material breach of data hosted by our service providers or a serious security incident on behalf of, caused by or experienced by a service provider, we may experience significant operational and technical difficulties, loss of data including customer data, diminished competitive position or reputation, and loss of customer engagement, which could result in civil\nliabilities and a negative impact to financial performance. It is also possible that our customers and potential customers would hold us accountable for any breach of security affecting a third-party service provider's infrastructure and we may incur significant liability from those customers and from third parties with respect to any breach affecting these systems. We may not be able to recover a material portion of our liabilities to our customers and third parties from a third-party cloud provider.\nFinancial Risks\nForeign exchange rate fluctuations may adversely affect our consolidated financial statements.\nAs a result of our significant international presence, we have revenue, expenses, cash, accounts receivable and payment obligations denominated in foreign currencies, most notably the Euro and Japanese Yen. Our operating results are adversely affected when the U.S. Dollar strengthens relative to foreign currencies and are positively affected when the U.S. Dollar weakens relative to foreign currencies. When the U.S. Dollar strengthens relative to other currencies, certain channel partners who pay us in U.S. Dollars may have trouble paying on time or may have trouble distributing our products due to the impact of the currency exchange fluctuation on their cash flows. This may impact our ability to distribute our products into certain regions and markets.\nWe seek to reduce our currency exchange transaction risks primarily through our normal operating and treasury activities, including derivative instruments, but there can be no assurance that these activities will be successful in reducing these risks. In addition, we incur transaction fees in the usage of such derivative instruments. Changes in currency exchange rates may adversely affect our consolidated financial statements.\nChanges to tax laws, variable tax estimates and tax authority audits could impact our financial results and operations.\nOur operations are subject to income and transaction taxes in the U.S. and in multiple foreign jurisdictions. A change in the tax law in the jurisdictions in which we do business, including an increase in tax rates, an adverse change in the treatment of an item of income or expense, or a decrease in tax rates in a jurisdiction in which we have significant deferred tax assets, could result in a material increase in tax expense. Furthermore, we have recorded significant deferred tax liabilities related to acquired intangible assets that are not deductible for tax purposes. These deferred tax liabilities are based on future statutory tax rates in the locations in which the intangible assets are recorded. Any future changes in statutory tax rates would be recorded as an adjustment to the deferred tax liabilities in the period the change is announced and could have a material impact on our effective tax rate during that period. Additionally, changes in tax laws could impact operating cash flow due to changes in timing of payments required as well as the overall rate we are required to pay.\nWe also make significant estimates in determining our worldwide income tax provision. These estimates involve complex tax regulations in many jurisdictions and are subject to many transactions and calculations in which the ultimate tax outcome is uncertain. The outcome of tax matters could be different than the estimates reflected in the historical income tax provision and related accruals. Such differences could have a material impact on income tax expense and net income in the periods in which such determinations are made.\nThe amount of income tax we pay is subject to ongoing audits by federal, state and foreign tax authorities. These audits can result in additional assessments, including interest and penalties. Our estimates for liabilities associated with uncertain tax positions are highly judgmental and actual future outcomes may result in favorable or unfavorable adjustments to our estimated tax liabilities, including estimates for uncertain tax positions, in the period the assessments are made or resolved, audits are closed or when statutes of limitation on potential assessments expire. As a result, our effective tax rate may fluctuate significantly on a quarterly or annual basis.\nOur indebtedness could adversely affect our business, financial condition and results of operations.\nIn connection with our acquisitions of AGI and LST, we have outstanding borrowings of $356.0 million and $399.0 million, respectively, under term loan facilities which mature on November 1, 2024. We also have access to a $500.0 million revolving credit facility, which includes a $50.0 million sublimit for the issuance of letters of credit. The credit agreements governing these loans contain customary representations and warranties, affirmative and negative covenants and events of default. The credit agreements also contain a financial covenant requiring us to maintain a consolidated leverage ratio of indebtedness to earnings before interest, taxes, depreciation and amortization not exceeding 3.50 to 1.00 as of the end of any fiscal quarter (for the four-quarter period ending on such date) with an opportunity for a temporary increase in such consolidated leverage ratio to 4.00 to 1.00 upon the consummation of certain qualified acquisitions for which the aggregate consideration is at least $250.0 million.\nNotwithstanding the limits contained in the credit agreements governing our term loan facilities and credit facility, we may be able to incur substantial additional debt from time to time to finance working capital, capital expenditures, share repurchases,\ninvestments or acquisitions, or for other purposes. If we do so, the risks related to our level of debt could intensify. Specifically, our level of debt could:\n•make it more difficult for us to satisfy our debt obligations and other ongoing business obligations, which may result in defaults;\n•result in an event of default if we fail to comply with the financial and other covenants contained in the agreement governing our debt, which could result in all of our debt becoming immediately due and payable or require us to negotiate an amendment to financial or other covenants that could cause us to incur additional fees and expenses;\n•limit our ability to obtain additional financing to fund future working capital, capital expenditures, acquisitions or other general corporate requirements;\n•reduce the availability of our cash flow to fund working capital, capital expenditures, acquisitions and other general corporate purposes;\n•increase our vulnerability to the impact of adverse economic and industry conditions;\n•expose us to the risk of increased interest rates as certain of our borrowings, including borrowings under the credit facility, are at variable rates of interest;\n•limit our flexibility in planning for, or reacting to, and increasing our vulnerability to, changes in our business, the industries in which we operate, and the overall economy;\n•place us at a competitive disadvantage compared to other, less leveraged competitors;\n•increase our cost of borrowing; and\n•increase our effective tax rate as interest expense could become non-deductible.\nAny of the above-listed factors could have an adverse effect on our business, financial condition and results of operations and our ability to meet our payment obligations under our debt agreements.\nFurthermore, borrowings under the credit agreement use the London Interbank Offering Rate (LIBOR) as a benchmark for establishing the interest rate. LIBOR has been the subject of national, international and other regulatory guidance and proposals for reform, and the financial industry is currently transitioning away from LIBOR as a benchmark for the interbank lending market. On March 5, 2021, the Intercontinental Exchange Benchmark Administration, the U.K. Financial Conduct Authority (FCA) regulated and authorized administrator of LIBOR, announced, and the FCA confirmed, that the U.S. Dollar LIBOR panel for all tenors will cease on June 30, 2023. When LIBOR is eliminated, our borrowings will default to the base rate that is historically higher, and we may not be able to renegotiate to a more favorable rate that more closely approximates LIBOR and could experience an increase in the cost of our variable rate indebtedness.",
    "item_1B": "ITEM 1B.UNRESOLVED STAFF COMMENTS\nNone.",
    "item_1C": "",
    "item_2": "ITEM 2.PROPERTIES\nOur executive offices and those related to certain domestic product development, marketing, production and administration are located in a LEED certified, 186,000 square foot office facility in Canonsburg, Pennsylvania. The lease for this facility began on October 1, 2014 and expires on December 31, 2029, excluding any renewal or termination options.\nWe own: a 70,000 square foot office facility in Lebanon, New Hampshire; a 62,000 square foot office building near our current Canonsburg headquarters; a 59,000 square foot facility in Pune, India; a 40,000 square foot campus in Livermore, California; and a 5,000 square foot facility in Apex, North Carolina. These properties are used as general office space and/or data centers.\nWe also lease office space in various locations throughout the world. We own substantially all equipment used in our facilities. Management believes that our facilities generally allow for sufficient space to support present and future foreseeable needs, including such expansion and growth as the business may require.\nOur properties and equipment are in good operating condition and are adequate for our current needs. We do not anticipate difficulty in renewing existing leases as they expire or in finding alternative facilities.",
    "item_3": "ITEM 3.LEGAL PROCEEDINGS\nWe are subject to various claims, investigations and legal and regulatory proceedings that arise in the ordinary course of business, including, but not limited to, commercial disputes, labor and employment matters, tax audits, alleged infringement of third parties' intellectual property rights and other matters. Use or distribution of our products could generate product liability, regulatory infraction, or claims by our customers, end users, channel partners, government entities or third parties. Sales and marketing activities that impact processing of personal data, as well as measures taken to ensure license compliance against pirated or unauthorized usage of our commercial product, may also result in claims by customers and individual employees of customers or by non-customers using pirated versions of our products. Each of these matters is subject to various uncertainties and it is possible that an unfavorable resolution of one or more of these matters could have a significant adverse effect on our consolidated financial statements as well as cause reputational damage.",
    "item_4": "ITEM 4.MINE SAFETY DISCLOSURES\nNot applicable.\nPART II",
    "item_5": "ITEM 5.MARKET FOR REGISTRANT'S COMMON EQUITY, RELATED STOCKHOLDER MATTERS AND ISSUER PURCHASES OF EQUITY SECURITIES\nOur common stock trades on the Nasdaq Global Select Market tier of the Nasdaq Stock Market under the symbol: \"ANSS\".\nOn February 9, 2022, there were 258 stockholders of record of our common stock.\nWe have not historically paid cash dividends on our common stock as we have retained earnings primarily for acquisitions, for future business opportunities, to make payments on outstanding debt balances and to repurchase stock when authorized by the Board of Directors and when such repurchase meets our objectives. We review our policy with respect to the payment of dividends from time to time; however, there can be no assurance that any dividends will be paid in the future.\nPerformance Graph\nSet forth below is a line graph comparing the yearly percentage change in the cumulative total stockholder return of our common stock, based on the market price per share of our common stock, with the total return of companies included within the Nasdaq Composite Stock Market Index, the Nasdaq 100 Stock Market Index, the S&P 500 Stock Index and an industry peer group of seven companies (Autodesk, Inc., PTC Inc., Cadence Design Systems, Inc., Synopsys, Inc., Altair Engineering Inc., Aspen Technology, Inc. and Dassault Systemes SE) for the period commencing December 31, 2016 and ending December 31, 2021. The calculation of total cumulative returns assumes a $100 investment in our common stock, the Nasdaq Composite Stock Market Index, the Nasdaq 100 Stock Market Index, the S&P 500 Stock Index and the peer group on December 31, 2016, and the reinvestment of all dividends, and accounts for all stock splits. The historical information set forth below is not necessarily indicative of future performance.\nASSUMES $100 INVESTED ON DECEMBER 31, 2016\nASSUMES DIVIDENDS REINVESTED\nFIVE FISCAL YEARS ENDED DECEMBER 31, 2021\nUnregistered Sale of Equity Securities and Use of Proceeds\nNone.\nIssuer Purchases of Equity Securities\n(1) We initially announced our stock repurchase program in February 2000, and subsequently announced various amendments to the program. The most recent amendment to the program, authorizing the repurchase of up to 5.0 million shares, was approved by our Board of Directors in February 2018. There is no expiration date for the stock repurchase program.",
    "item_6": "ITEM 6.[RESERVED]",
    "item_7": "ITEM 7.MANAGEMENT'S DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION AND RESULTS OF OPERATIONS\nThe following discussion and analysis should be read in conjunction with our consolidated financial statements and notes thereto. This section generally discusses our results of operations for the year ended December 31, 2021 compared to the year ended December 31, 2020. For discussion and analysis of our results for the year ended December 31, 2020 compared to the year ended December 31, 2019, refer to the \"Management's Discussion and Analysis of Financial Condition and Results of Operations\" in Part II, Item 7 of our 2020 Form 10-K, filed with the SEC on February 24, 2021.\nBusiness\nAnsys, a Delaware corporation formed in 1994, develops and globally markets engineering simulation software and services widely used by engineers, designers, researchers and students across a broad spectrum of industries and academia, including high-tech, aerospace and defense, automotive, energy, industrial equipment, materials and chemicals, consumer products, healthcare, and construction. Headquartered south of Pittsburgh, Pennsylvania, we employed 5,100 people as of December 31, 2021. We focus on the development of open and flexible solutions that enable users to analyze designs directly on the desktop, providing a common platform for fast, efficient and cost-conscious product development, from design concept to final-stage testing and validation. We distribute our suite of simulation technologies through direct sales offices in strategic, global locations and a global network of independent resellers and distributors (collectively, channel partners). It is our intention to continue to maintain this hybrid sales and distribution model.\nOur strategy of Pervasive Engineering Simulation™ seeks to deepen the use of simulation in our core, to inject simulation throughout the product lifecycle and to embed simulation into our partners' ecosystems. The engineering software simulation market is strong and growing. The market growth is driven by customers' need for rapid, quality innovation in a cost efficient manner, enabling faster time to market of new products and lower warranty costs. We are investing in solutions to help engineers deal with increasing product complexity in:\n•Electrification, including electric vehicles;\n•Autonomy, including self-driving vehicles;\n•5G and telecommunications; and\n•IIoT.\nIn the longer term, we are also investing in opportunities around digital twins and simulation for additive manufacturing. Our strategy of Pervasive Engineering Simulation is aligned with the market growth.\nTo support our strategy of Pervasive Engineering Simulation, we will continue to follow a series of pillars that we believe will drive future growth. We will reinforce and extend our leadership in core and the high-growth solutions. We will build and grow our offerings and expertise in adjacencies to our current core competencies. We will also continue to pursue a smart and strategic acquisition strategy to grow our business, and we will partner with other industry leaders to broaden pervasive simulation into other ecosystems. Importantly, we will continue to win in the right way, built on a culture of and commitment to diversity, equity, inclusion and belonging.\nWe license our technology to businesses, educational institutions and governmental agencies. Growth in our revenue is affected by the strength of global economies, general business conditions, currency exchange rate fluctuations, customer budgetary constraints and the competitive position of our products. We believe that the features, functionality and integrated multiphysics capabilities of our software products are as strong as they have ever been. However, the software business is generally characterized by long sales cycles. These long sales cycles increase the difficulty of predicting sales for any particular quarter. We make many operational and strategic decisions based upon short- and long-term sales forecasts that are impacted not only by these long sales cycles, but also by current global economic conditions, including the impact of the current COVID-19 pandemic. As a result, we believe that our overall performance is best measured by fiscal year results rather than by quarterly results. Please see the sub-section entitled \"Company Operational Risks\" under Part I. Item 1A. of this Annual Report on Form 10-K for additional discussion of the potential impact of our sales forecasts on our financial condition, cash flows and operating results.\nManagement addresses the competition and price pressure that it faces in the short- and long-term by focusing on expanding the breadth, depth, ease of use and quality of the technologies, features, functionality and integrated multiphysics capabilities of our software products as compared to our competitors; investing in research and development to develop new and innovative products and increase the capabilities of our existing products; supplying new products and services; focusing on customer\nneeds, training, consulting and support; and enhancing our distribution channels. We also evaluate and execute strategic acquisitions to supplement our global engineering talent, product offerings and distribution channels.\nOverview\nUpdate on the Impact of the COVID-19 Pandemic\nWe have continued to employ measures intended to mitigate the effects of the COVID-19 pandemic on our business. The health and safety of our employees and their families, our partners and our broad Ansys community around the world remain a high priority. Remote access continued to remain the primary means of work for much of our workforce. We previously announced our plans for post-pandemic work arrangements. These plans include options for our employees to work from home, in the office or on a flexible basis where they can alternate between the office and home. The adoption of the arrangements is subject to evolving local guidelines on precautions to be taken to mitigate COVID-19 risk to our employees and customers. Remote work arrangements have not adversely affected our ability to maintain effective financial operations, including our financial reporting systems, internal controls over financial reporting and disclosure controls and procedures. We expect to maintain these effective controls as we continue to work remotely during and after the COVID-19 pandemic. The spread of the virus and its variants and economic deterioration caused by them could have an impact on our business, as well as on our ability to achieve our financial guidance.\nOur direct and indirect sales and support teams continue to use collaborative technology to access both Ansys’ data centers and the public cloud, and to meet virtually with customers to mitigate disruptions to our sales pipeline. Our sales team continues to engage with customers around the world in a mix of virtual and in-person meetings, depending on the location specific guidelines and customer preferences. They continue to deliver customer value and business momentum. Our research and development teams have also continued to be productive and meet our product release targets, as evidenced by the recent release of Ansys 2022 R1.\nOur spending reflects our expectations for the pace at which economic recovery will occur, and we continue to invest in long-term opportunities. We have also maintained and intend to maintain our commitment to invest in our acquisitions, research and development, and certain digital transformation projects, as those projects are critical to our ability to operate efficiently and scale the business for future growth.\nPlease see \"Risk Factors\" under Part I. Item 1A. of this Annual Report on Form 10-K for discussion on additional business risks, including those associated with the COVID-19 pandemic.\nOverall GAAP and Non-GAAP Results\nThis section includes a discussion of GAAP and Non-GAAP results. For reconciliations of Non-GAAP results to GAAP results, see the section titled \"Non-GAAP Results\" herein.\nThe non-GAAP results exclude the income statement effects of the acquisition accounting adjustments to deferred revenue, stock-based compensation, excess payroll taxes related to stock-based compensation, amortization of acquired intangible assets, transaction expenses related to business combinations and adjustments for the income tax effect of the excluded items.\nThis section also includes a discussion of constant currency results, which we use for financial and operational decision-making and as a means to evaluate period-to-period comparisons by excluding the effects of foreign currency fluctuations on the reported results. Constant currency is a non-GAAP measure. All constant currency results presented in this Item 7 exclude the effects of foreign currency fluctuations on the reported results. To present this information, the 2021 results for entities whose functional currency is a currency other than the U.S. Dollar were converted to U.S. Dollars at rates that were in effect for the 2020 comparable period, rather than the actual exchange rates in effect for 2021. Constant currency growth rates are calculated by adjusting the 2021 reported revenue and operating income amounts by the 2021 currency fluctuation impacts and comparing to the 2020 comparable period reported revenue and operating income amounts.\nOur GAAP and non-GAAP results for the year ended December 31, 2021 as compared to the year ended December 31, 2020 reflected the following variances:\nOur results reflect an increase in revenue during the year ended December 31, 2021 due to growth across all revenue streams, driven by strong execution, acquisitions and by the improving global economic environment in 2021 as compared to 2020. We\nalso experienced increased operating expenses during the year ended December 31, 2021, primarily due to increased personnel costs, additional operating expenses related to acquisitions and higher stock-based compensation. The COVID-19 pandemic did not have a material impact on our operating expenses during the year ended December 31, 2021.\nImpact of Foreign Currency\nOur comparative financial results were impacted by fluctuations in the U.S. Dollar during the year ended December 31, 2021 as compared to the year ended December 31, 2020. The impacts on our GAAP and non-GAAP revenue and operating income as a result of the fluctuations of the U.S. Dollar when measured against our primary foreign currencies are reflected in the table below. Amounts in brackets indicate an adverse impact from currency fluctuations.\nAlthough exchange rates had a favorable impact on revenue for the year, the impact on operating income was negative driven primarily by the significant strengthening in the fourth quarter of the U.S. Dollar against the Euro as compared to the same quarter in the prior year. The currency impacts were further amplified in operating income as the fourth quarter also represents the EMEA region's most significant sales period and correspondingly, its largest margin.\nIn constant currency, our variances were as follows:\nOther Key Business Metric\nAnnual Contract Value (ACV) is one of our key performance metrics and is useful to investors in assessing the strength and trajectory of our business. Given that revenue is more volatile due to the upfront revenue recognition of perpetual licenses and multi-year lease license sales, we provide ACV as a supplemental metric to help evaluate the annual performance of the business. Summed over the long term, ACV and revenue are equal. However, there will be years in which ACV growth lags revenue growth and other years in which ACV growth leads revenue growth. It is used by management in financial and operational decision-making and in setting sales targets used for compensation. ACV should be viewed independently of revenue and deferred revenue as ACV is a performance metric and is not intended to be combined with any of these items. There is no GAAP measure comparable to ACV. ACV is composed of the following:\n•the annualized value of maintenance and lease contracts with start dates or anniversary dates during the period, plus\n•the value of perpetual license contracts with start dates during the period, plus\n•the annualized value of fixed-term services contracts with start dates or anniversary dates during the period, plus\n•the value of work performed during the period on fixed-deliverable services contracts.\nOur ACV was as follows:\nRecurring ACV includes both lease licenses and maintenance contracts. The reduction as a percentage of total ACV in 2021 as compared to 2020 was driven by an increase in perpetual licensing due to lower perpetual sales during the pandemic in 2020.\nIndustry Commentary\nFor 2021, ACV growth was broad based across core industries. High-tech, aerospace and defense (A&D) and automotive, our three largest industries, experienced strong growth in 2021 as companies continued investing in simulation to reduce costs and development time. The high-tech industry growth was driven by 5G, increasingly complex electronics systems and chip designs, and high-performance computing demands spurred by remote work requirements. Despite the A&D industry continuing to feel impacts from the pandemic, demand for our core and new and emerging technology segments, including simulation data management, safety-critcal embedded controls and mission planning, contributed to growth in the industry. Our continued growth in the automotive industry illustrates the industry’s need for a complete multiphysics simulation portfolio to overcome complex engineering challenges, while electrification, autonomous technology and connectivity serve as strong tailwinds. Sustainability, engineering digitalization and electrification initiatives are driving growth in the industrial equipment and energy industries. We also saw robust growth in the healthcare space as in-silico medicine becomes more prevalent.\nGeographic Trends\nThe following table presents our GAAP and non-GAAP geographic revenue variances using actual and constant currency rates during the year ended December 31, 2021 as compared to the year ended December 31, 2020:\nTo drive growth, we continue to focus on a number of sales improvement activities across the geographic regions, including sales hiring, pipeline building, productivity initiatives and customer engagement activities.\nDespite the overall strong performance in the broader Asia-Pacific region, continued trade restrictions between the U.S. and China have had an impact on, and in the future may further restrict, our ability to sell and distribute our products to certain customers. As a result, this as well as other potential trade restrictions with other countries could continue to have an adverse effect on our business, results of operations or financial condition. Refer to additional details in \"Risk Factors\" under Part I. Item 1A. of this Annual Report on Form 10-K.\nAcquisitions\nWe make targeted acquisitions in order to support our long-term strategic direction, accelerate innovation, provide increased capabilities to our existing products, supply new products and services, expand our customer base and enhance our distribution channels. Our recent acquisitions included the following:\nFor further information on our business combinations during the years ended December 31, 2021 and 2020, see Note 4 to the consolidated financial statements included in Part IV, Item 15 of this Annual Report on Form 10-K.\nResults of Operations\nThe results of operations discussed below are on a GAAP basis unless otherwise stated.\nFor purposes of the following discussion and analysis, the table below sets forth certain consolidated financial data for the years 2021 and 2020. The operating results of our acquisitions have been included in the results of operations since their respective acquisition dates.\nYear Ended December 31, 2021 Compared to Year Ended December 31, 2020\nRevenue:\nRevenue for the year ended December 31, 2021 increased 13.4% compared to the year ended December 31, 2020, or 13.2% in constant currency. The growth rate was favorably impacted by our continued investments in our global sales, support and marketing organizations, the timing and duration of our multi-year lease contracts, strong perpetual license sales off a relatively lower 2020 compare, sales to our small- and medium-sized businesses, and our recent acquisitions. Lease license revenue increased 23.5%, or 24.9% in constant currency, as compared to the year ended December 31, 2020. Perpetual license revenue, which is derived from new sales during the year ended December 31, 2021, increased 16.9%, or 16.3% in constant currency, as compared to the year ended December 31, 2020. Service revenue increased 8.4%, or 7.4% in constant currency, as compared to the year ended December 31, 2020. Annual maintenance contracts that were sold with new perpetual licenses, maintenance contracts for new perpetual licenses sold in previous years, maintenance renewals and the maintenance portion of lease license contracts collectively contributed to maintenance revenue growth of 6.6%, or 5.6% in constant currency.\nWith respect to revenue, on average for the year ended December 31, 2021, the U.S. Dollar was 0.4% weaker, when measured against our primary foreign currencies, than for the year ended December 31, 2020. The table below presents the net impacts of currency fluctuations on revenue for the year ended December 31, 2021. Amounts in brackets indicate a net adverse impact from currency fluctuations.\nThe impacts from currency fluctuations resulted in decreased operating income of $10.7 million for the year ended December 31, 2021 as compared to the year ended December 31, 2020.\nAs a percentage of revenue, our international and domestic revenues, and our direct and indirect revenues, were as follows:\nIn valuing deferred revenue on the balance sheets of our recent acquisitions as of their respective acquisition dates, we applied the fair value provisions applicable to the accounting for business combinations, resulting in a reduction of deferred revenue as compared to the historical carrying amount. As a result, our post-acquisition revenue will be less than the sum of what would have otherwise been reported by us and each acquiree absent the acquisitions. The impacts on reported revenue were $24.8 million and $14.2 million for the years ended December 31, 2021 and 2020, respectively. The expected impacts on reported revenue are $3.4 million and $7.4 million for the quarter ending March 31, 2022 and the year ending December 31, 2022, respectively.\nCost of Sales and Operating Expenses:\nThe tables below reflect our operating results on both a GAAP and constant currency basis. Amounts included in the discussions that follow each table are provided in constant currency and are inclusive of costs related to our acquisitions. The impact of foreign exchange translation is discussed separately, where material.\nSoftware Licenses: The increase in the cost of software licenses was primarily due to increased third-party royalties of $7.2 million.\nAmortization: The increase in amortization expense was primarily due to the amortization of newly acquired intangible assets.\nMaintenance and Service: The net increase in maintenance and service costs was primarily due to the following:\n•Increased salaries and incentive compensation of $3.1 million.\n•Increased costs related to foreign exchange translation of $2.3 million due to a weaker U.S. Dollar.\n•Increased IT maintenance and software hosting costs of $1.6 million.\n•Decreased third-party technical support of $1.8 million.\nThe improvement in gross profit was a result of the increase in revenue, partially offset by the increase in the cost of\nsales.\nSelling, General and Administrative: The net increase in selling, general and administrative costs was primarily due to the following:\n•Increased salaries, incentive compensation and other headcount-related costs of $89.2 million.\n•Increased stock-based compensation of $18.3 million.\n•Increased consulting costs of $9.0 million.\n•Increased IT maintenance and software hosting costs of $7.2 million.\n•Increased costs related to foreign exchange translation of $6.1 million due to a weaker U.S. Dollar.\n•Decreased bad debt expense of $5.4 million.\nWe anticipate that we will continue to make targeted investments in our global sales and marketing organizations and our global business infrastructure to enhance and support our revenue-generating activities.\nResearch and Development: The increase in research and development costs was primarily due to the following:\n•Increased salaries, incentive compensation and other headcount-related costs of $31.6 million.\n•Increased IT maintenance and software hosting costs of $5.5 million.\n•Increased costs related to foreign exchange translation of $5.0 million due to a weaker U.S. Dollar.\n•Increased stock-based compensation of $3.7 million.\nAmortization: The net decrease in amortization expense was primarily due to a decrease in the amortization of customer lists due to assets that became fully amortized, which was partially offset by the amortization of newly acquired intangible assets.\nWe have traditionally invested significant resources in research and development activities and intend to continue to make investments in expanding the ease of use and capabilities of our broad portfolio of simulation software products.\nInterest Income: Interest income for the year ended December 31, 2021 was $2.1 million as compared to $5.1 million for the year ended December 31, 2020. Interest income decreased as a result of a lower interest rate environment and the related decrease in the average rate of return on invested cash balances.\nInterest Expense: Interest expense for the year ended December 31, 2021 was $12.4 million as compared to $11.0 million for the year ended December 31, 2020. Interest expense increased as a result of interest incurred on debt financing obtained in connection with the acquisition of AGI in the fourth quarter of 2020, partially offset by a lower interest rate environment.\nOther Income, net: Our other income consisted of the following:\nIncome Tax Provision: Our income before income tax provision, income tax provision and effective tax rate were as follows:\nThe decrease in the effective tax rate from the prior year was primarily due to increased tax benefits of $7.9 million related to stock-based compensation deductions and $7.0 million related to foreign-derived intangible income (FDII) deductions. These benefits were partially offset by an increase in non-deductible compensation of $11.0 million.\nWhen compared to the federal and state combined statutory rate for each respective period, the effective tax rates for the years ended December 31, 2021 and 2020 were favorably impacted by tax benefits from stock-based compensation, the FDII deduction, and research and development credits, partially offset by the impact of non-deductible compensation.\nNet Income: Our net income, diluted earnings per share and weighted average shares used in computing diluted earnings per share were as follows:\nNon-GAAP Results\nWe provide non-GAAP revenue, non-GAAP gross profit, non-GAAP gross profit margin, non-GAAP operating income, non-GAAP operating profit margin, non-GAAP net income and non-GAAP diluted earnings per share as supplemental measures to GAAP regarding our operational performance. These financial measures exclude the impact of certain items and, therefore, have not been calculated in accordance with GAAP. A detailed explanation and a reconciliation of each non-GAAP financial measure to its most comparable GAAP financial measure are included below.\n1 Diluted weighted average shares were 88,102.\n1 Diluted weighted average shares were 87,288.\nWe use non-GAAP financial measures (a) to evaluate our historical and prospective financial performance as well as our performance relative to our competitors, (b) to set internal sales targets and spending budgets, (c) to allocate resources, (d) to measure operational profitability and the accuracy of forecasting, (e) to assess financial discipline over operational expenditures and (f) as an important factor in determining variable compensation for management and employees. In addition, many financial analysts that follow us focus on and publish both historical results and future projections based on non-GAAP financial measures. We believe that it is in the best interest of our investors to provide this information to analysts so that they accurately report the non-GAAP financial information. Moreover, investors have historically requested, and we have historically reported, these non-GAAP financial measures as a means of providing consistent and comparable information with past reports of financial results.\nWhile we believe that these non-GAAP financial measures provide useful supplemental information to investors, there are limitations associated with the use of these non-GAAP financial measures. These non-GAAP financial measures are not prepared in accordance with GAAP, are not reported by all our competitors and may not be directly comparable to similarly titled measures of our competitors due to potential differences in the exact method of calculation. We compensate for these limitations by using these non-GAAP financial measures as supplements to GAAP financial measures and by reviewing the reconciliations of the non-GAAP financial measures to their most comparable GAAP financial measures.\nThe adjustments to these non-GAAP financial measures, and the basis for such adjustments, are outlined below:\nAcquisition accounting for deferred revenue. Historically, we have consummated acquisitions in order to support our strategic and other business objectives. In accordance with the fair value provisions applicable to the accounting for business combinations, acquired deferred revenue is often recorded on the opening balance sheet at an amount that is lower than the historical carrying value. Although this acquisition accounting requirement has no impact on our business or cash flow, it adversely impacts our reported GAAP revenue in the reporting periods following an acquisition. In order to provide investors with financial information that facilitates comparison of both historical and future results, we provide non-GAAP financial measures which exclude the impact of the acquisition accounting adjustment. We believe that this non-GAAP financial adjustment is useful to investors because it allows investors to (a) evaluate the effectiveness of the methodology and information used by us in our financial and operational decision-making, and (b) compare our past and future reports of financial results as the revenue reduction related to acquired deferred revenue will not recur when related lease licenses and software maintenance contracts are renewed in future periods.\nAmortization of intangible assets from acquisitions. We incur amortization of intangible assets, included in our GAAP presentation of amortization expense, related to various acquisitions we have made. We exclude these expenses for the purpose of calculating non-GAAP gross profit, non-GAAP gross profit margin, non-GAAP operating income, non-GAAP operating profit margin, non-GAAP net income and non-GAAP diluted earnings per share when we evaluate our continuing operational performance because these costs are fixed at the time of an acquisition, are then amortized over a period of several years after the acquisition and generally cannot be changed or influenced by us after the acquisition. Accordingly, we do not consider these expenses for purposes of evaluating our performance during the applicable time period after the acquisition, and we exclude such expenses when making decisions to allocate resources. We believe that these non-GAAP financial measures are useful to investors because they allow investors to (a) evaluate the effectiveness of the methodology and information used by us in our financial and operational decision-making, and (b) compare our past reports of financial results as we have historically reported these non-GAAP financial measures.\nStock-based compensation expense. We incur expense related to stock-based compensation included in our GAAP presentation of cost of maintenance and service; research and development expense; and selling, general and administrative expense. This non-GAAP adjustment also includes excess payroll tax expense related to stock-based compensation. Stock-based compensation expense (benefit) incurred in connection with our deferred compensation plan held in a rabbi trust includes an offsetting benefit (charge) recorded in other income (expense). Although stock-based compensation is an expense and viewed as a form of compensation, we exclude these expenses for the purpose of calculating non-GAAP gross profit, non-GAAP gross profit margin, non-GAAP operating income, non-GAAP operating profit margin, non-GAAP net income and non-GAAP diluted earnings per share when we evaluate our continuing operational performance. We similarly exclude income (expense) related to assets held in a rabbi trust in connection with our deferred compensation plan. Specifically, we exclude stock-based compensation and income (expense) related to assets held in the deferred compensation plan rabbi trust during our annual budgeting process and our quarterly and annual assessments of our performance. The annual budgeting process is the primary mechanism whereby we allocate resources to various initiatives and operational requirements. Additionally, the annual review by our board of directors during which it compares our historical business model and profitability to the planned business model and profitability for the forthcoming year excludes the impact of stock-based compensation. In evaluating the performance of our senior management and department managers, charges related to stock-based compensation are excluded from expenditure and profitability results. In fact, we record stock-based compensation expense into a stand-alone cost center for which no single operational manager is responsible or accountable. In this way, we can review, on a period-to-period basis,\neach manager's performance and assess financial discipline over operational expenditures without the effect of stock-based compensation. We believe that these non-GAAP financial measures are useful to investors because they allow investors to (a) evaluate our operating results and the effectiveness of the methodology used by us to review our operating results, and (b) review historical comparability in our financial reporting as well as comparability with competitors' operating results.\nTransaction expenses related to business combinations. We incur expenses for professional services rendered in connection with business combinations, which are included in our GAAP presentation of selling, general and administrative expense. These expenses are generally not tax-deductible. We exclude these acquisition-related transaction expenses, derived from announced acquisitions, for the purpose of calculating non-GAAP operating income, non-GAAP operating profit margin, non-GAAP net income and non-GAAP diluted earnings per share when we evaluate our continuing operational performance, as we generally would not have otherwise incurred these expenses in the periods presented as a part of our operations. We believe that these non-GAAP financial measures are useful to investors because they allow investors to (a) evaluate our operating results and the effectiveness of the methodology used by us to review our operating results, and (b) review historical comparability in our financial reporting as well as comparability with competitors' operating results.\nNon-GAAP tax provision. We utilize a normalized non-GAAP annual effective tax rate (AETR) to calculate non-GAAP measures. This methodology provides better consistency across interim reporting periods by eliminating the effects of non-recurring items and aligning the non-GAAP tax rate with our expected geographic earnings mix. To project this rate, we analyzed our historic and projected non-GAAP earnings mix by geography along with other factors such as our current tax structure, recurring tax credits and incentives, and expected tax positions. On an annual basis we will re-evaluate this rate for significant items that may materially affect our projections.\nNon-GAAP financial measures are not in accordance with, or an alternative for, GAAP. Our non-GAAP financial measures are not meant to be considered in isolation or as a substitute for comparable GAAP financial measures and should be read only in conjunction with our consolidated financial statements prepared in accordance with GAAP.\nWe have provided a reconciliation of the non-GAAP financial measures to the most directly comparable GAAP financial measures as listed below:\nGAAP Reporting Measure Non-GAAP Reporting Measure\nRevenue Non-GAAP Revenue\nGross Profit Non-GAAP Gross Profit\nGross Profit Margin Non-GAAP Gross Profit Margin\nOperating Income Non-GAAP Operating Income\nOperating Profit Margin Non-GAAP Operating Profit Margin\nNet Income Non-GAAP Net Income\nDiluted Earnings Per Share Non-GAAP Diluted Earnings Per Share\nConstant currency. In addition to the non-GAAP financial measures detailed above, we use constant currency results for financial and operational decision-making and as a means to evaluate period-to-period comparisons by excluding the effects of foreign currency fluctuations on the reported results. To present this information, the 2021 results for entities whose functional currency is a currency other than the U.S. Dollar were converted to U.S. Dollars at rates that were in effect for the 2020 comparable period, rather than the actual exchange rates in effect for 2021. Constant currency growth rates are calculated by adjusting the 2021 reported amounts by the 2021 currency fluctuation impacts and comparing the adjusted amounts to the 2020 comparable period reported amounts. We believe that these non-GAAP financial measures are useful to investors because they allow investors to (a) evaluate the effectiveness of the methodology and information used by us in our financial and operational decision-making, and (b) compare our reported results to our past reports of financial results without the effects of foreign currency fluctuations.\nLiquidity and Capital Resources\nCash, Cash Equivalents and Short-Term Investments\nCash and cash equivalents consist primarily of highly liquid investments such as money market funds and deposits held at major banks. Short-term investments consist primarily of deposits held by certain of our foreign subsidiaries with original maturities of three months to one year. The following table presents our foreign and domestic holdings of cash, cash equivalents and short-term investments:\nIn general, it is our intention to permanently reinvest all earnings in excess of previously taxed amounts. Substantially all of the pre-2018 earnings of our non-U.S. subsidiaries were taxed through the transition tax and post-2018 current earnings are taxed as part of global intangible low-taxed income tax expense. These taxes increase our previously taxed earnings and allow for the repatriation of the majority of our foreign earnings without any residual U.S. federal tax. While we believe that the financial reporting bases may be greater than the tax bases of investments in foreign subsidiaries for any earnings in excess of previously taxed amounts, such amounts are considered permanently reinvested. The cumulative temporary difference related to such permanently reinvested earnings is $70.0 million and we would anticipate the tax effect on those earnings to be immaterial.\nThe amount of cash, cash equivalents and short-term investments held by foreign subsidiaries is subject to translation adjustments caused by changes in foreign currency exchange rates as of the end of each respective reporting period, the offset to which is recorded in accumulated other comprehensive loss on our consolidated balance sheet.\nCash Flows from Operating Activities\nNet cash provided by operating activities increased during the current fiscal year due to increased net income (net of non-cash operating adjustments) of $40.7 million partially offset by decreased net cash flows from operating assets and liabilities of $38.5 million.\nCash Flows from Investing Activities\nNet cash used in investing activities decreased during the current fiscal year due primarily to decreased acquisition-related net cash outlays of $61.5 million and decreased capital expenditures of $12.4 million. We currently plan capital spending of $25.0 million to $35.0 million during fiscal year 2022 as compared to the $23.0 million that was spent in fiscal year 2021. The level of spending will depend on various factors, including the growth of the business and general economic conditions.\nCash Flows from Financing Activities\nNet cash used in financing activities increased during the current fiscal year due primarily to $375.0 million in proceeds from long-term debt obtained in fiscal year 2020 related to the AGI acquisition and increased restricted stock withholding taxes paid in lieu of issuing shares of $26.0 million, partially offset by decreased principal payments on long-term debt of $30.0 million and decreased stock repurchases of $26.4 million.\nOther Cash Flow Information\nAs of December 31, 2021, the carrying value of our term loans was $753.6 million, with no principal payments due in the next twelve months. Borrowings under the term loans accrue interest at the Eurodollar rate plus an applicable margin or at the base rate, at our election. The base rate is the applicable margin plus the highest of (i) the federal funds rate plus 0.500%, (ii) the Bank of America prime rate and (iii) the Eurodollar rate plus 1.000%. The applicable margin for these borrowings is a percentage per annum based on the lower of (1) a pricing level determined by our then-current consolidated leverage ratio and (2) a pricing level determined by our debt ratings (if such debt ratings exist).\nWe previously entered into operating lease commitments, primarily for our domestic and international offices. The commitments related to these operating leases is $141.8 million, of which $25.9 million is due in the next twelve months.\nWe believe that existing cash and cash equivalent balances, together with cash generated from operations and access to the $500.0 million Revolving Credit Facility, will be sufficient to meet our working capital and capital expenditure requirements through the next twelve months. Our cash requirements in the future may also be financed through additional equity or debt financings. However, future disruptions in the capital markets could make financing more challenging, and there can be no assurance that such financing can be obtained on commercially reasonable terms, or at all.\nUnder our stock repurchase program, we repurchased shares as follows:\nAs of December 31, 2021, 2.5 million shares remained available for repurchase under the program.\nThe authorized repurchase program does not have an expiration date, and the pace of the repurchase activity will depend on factors such as working capital needs, cash requirements for acquisitions, our stock price, and economic and market conditions. Our stock repurchases may be effected from time to time through open market purchases or pursuant to a Rule 10b5-1 plan.\nWe continue to generate positive cash flows from operating activities and believe that the best uses of our excess cash are to invest in the business; acquire or make investments in complementary companies, products, services and technologies; and make payments on our outstanding debt balances. Any future acquisitions may be funded by available cash and investments, cash generated from operations, debt financing, or the issuance of additional securities. Additionally, we have in the past, and expect in the future, to repurchase stock in order to both offset dilution and return capital, in excess of our requirements, to stockholders with the goal of increasing stockholder value.\nContractual and Other Obligations\nOur significant contractual and other obligations as of December 31, 2021 are summarized below:\n(1)Borrowings under the long-term debt accrue interest at the Eurodollar rate plus an applicable margin or at the base rate, at our election. The base rate is the applicable margin plus the highest of (i) the federal funds rate plus 0.500%, (ii) the Bank of America prime rate and (iii) the Eurodollar rate plus 1.000%. The applicable margin for these borrowings is a percentage per annum based on the lower of (1) a pricing level determined by our then-current consolidated leverage ratio and (2) a pricing level determined by our debt ratings (if such debt ratings exist). As the interest rate is variable, interest on the long-term debt is estimated using the interest rate as of December 31, 2021. For additional information, see Note 10 to the consolidated financial statements included in Part IV, Item 15 of this Annual Report on Form 10-K.\n(2)We previously entered into a lease agreement for 186,000 square feet of rentable space located in an office facility in Canonsburg, Pennsylvania, which serves as our headquarters. The term of the lease is 183 months, beginning on October 1, 2014 and expiring on December 31, 2029. We have a one-time right to terminate the lease on December 31, 2025 by providing the landlord with at least 18 months' prior written notice of such termination.\n(3)Other operating leases primarily include lease commitments for our other domestic and international offices as well as certain operating equipment.\n(4)Unconditional purchase obligations primarily include minimum royalty contracts, software licenses and support, and network services, which are unrecorded as of December 31, 2021. The unconditional purchase obligations are in addition to the current and long-term liabilities recorded on our December 31, 2021 consolidated balance sheet.\n(5)We have $49.8 million of unrecognized tax benefits, including estimated interest and penalties, that have been recorded as liabilities in accordance with income tax accounting guidance for which we are uncertain as to if or when such amounts may be settled. As a result, such amounts are excluded from the table above.\nCritical Accounting Estimates\nWe have prepared our consolidated financial statements in accordance with GAAP. In preparing our consolidated financial statements, we make assumptions, judgments and estimates that can have a significant impact on our financial position and results of operations. These estimates, assumptions and judgments are made based on our historical experience and on other assumptions that we believe to be reasonable under the circumstances. Actual results could materially differ from any of our estimates under different assumptions or conditions.\nThe accounting policies, methods and estimates used to prepare our consolidated financial statements are described in Note 2 to the consolidated financial statements included in Part IV, Item 15 of this Annual Report on Form 10-K. The most critical accounting judgments and estimates that we made in preparing our consolidated financial statements involved:\n•Revenue recognition;\n•Valuation of assets acquired and liabilities assumed in business combinations; and\n•Income taxes.\nRevenue Recognition\nDescription\nOur revenue is derived principally from the licensing of computer software products and from related maintenance contracts. We enter into contracts that include combinations of products, maintenance and services, which are accounted for as separate performance obligations with differing revenue recognition patterns.\nJudgments and Estimates\nOur contracts with customers typically include promises to transfer licenses and services to a customer. Judgment is required to determine if the promises are separate performance obligations, and if so, to allocate the transaction price to each performance obligation. We use the estimated standalone selling price method to allocate the transaction price for each performance obligation. The estimated standalone selling price is determined using all information reasonably available to us, including market conditions and other observable inputs. The corresponding revenues are recognized as the related performance obligations are satisfied.\nOur time-based lease (TBL) license contracts with customers are sold as a bundled arrangement that includes the rights to a term software license as well as post-contract support (PCS). Revenue is recognized up front at the commencement of the lease for the term software license and recognized ratably over the term of the contract for the PCS in the arrangement. Utilizing observable inputs, we determined that 50% of the estimated standalone selling price of the TBL is attributable to the term software license, while 50% is attributable to PCS. This determination involved judgment, particularly as it relates to the value relationship between our PCS and TBLs, the value relationship between PCS and our perpetual licenses and its linkage to the shortened term of a TBL, the average economic life of our software, renewal rates of our customers, and the price of the bundled arrangement in relation to the perpetual licensing approach.\nChanges in these estimates could significantly impact the recognition of revenue in a given period.\nValuation of Assets Acquired and Liabilities Assumed in Business Combinations\nDescription\nIn accordance with business combination accounting, we allocate the purchase price of an acquired business to its identifiable assets acquired and liabilities assumed at the acquisition date based upon their estimated fair values. The excess of the fair value of consideration transferred over the fair value of net identifiable assets acquired, if any, is recorded as goodwill. Intangible assets are recognized apart from goodwill whenever an acquired intangible asset arises from contractual or other legal rights, or whenever it is capable of being separated or divided from the acquired entity and sold, transferred, licensed, rented, or exchanged, either individually or in combination with a related contract, asset or liability.\nJudgments and Estimates\nDetermining these fair values requires us to make significant estimates and assumptions, particularly with respect to acquired intangible assets. We determined the fair value of our intangible assets using various valuation techniques, including the relief-from-royalty method and the multi-period excess earnings method. These models utilize certain unobservable inputs classified as Level 3 measurements as defined by ASC 820, Fair Value Measurements and Disclosures. The determination of fair value requires considerable judgment and is sensitive to changes in underlying assumptions, estimates and market factors. Estimating fair value requires us to make assumptions and estimates regarding our future plans, as well as industry and economic conditions. These assumptions and estimates include, but are not limited to: royalty rate, discount rate and customer attrition rate. The fair values of the intangible assets will be amortized over their useful lives.\nIf actual results are materially different than the assumptions we used to determine fair value of the assets acquired and liabilities assumed through a business combination, it is possible that adjustments to the carrying values of such assets and liabilities will have a material impact on our financial position and results of operations. See Note 4 to to the consolidated financial statements included in Part IV, Item 15 of this Annual Report on Form 10-K for information regarding our business acquisitions.\nIncome Taxes\nDescription\nOur income tax expense reflects management's best estimate of current and future taxes to be paid. We account for income taxes under the asset and liability method, which requires the recognition of deferred tax assets and liabilities for the expected future tax consequences of events that have been included in the financial statements. Under this method, deferred tax assets and liabilities are determined based on the differences between the financial statement and tax bases of assets and liabilities using enacted tax rates in effect for the year in which the differences are expected to reverse. The effect of a change in tax rates on deferred tax assets and liabilities is recognized in income in the period of the enactment date.\nAdditionally, as part of our accounting for income taxes, tax benefits related to uncertain tax positions taken or expected to be taken on a tax return are recorded when such benefits meet a more-likely-than-not threshold. Otherwise, these tax benefits are recorded when a tax position has been effectively settled, which means that the statute of limitations has expired or the appropriate taxing authority has completed its examination even though the statute of limitations remains open.\nJudgments and Estimates\nWe are subject to tax in the U.S. and numerous foreign jurisdictions. Significant judgements and estimates are required in the determination of consolidated income tax expense. We record net deferred tax assets to the extent we believe these assets will more likely than not be realized. In making such determination, we consider all available positive and negative evidence, including scheduled reversals of deferred tax liabilities, projected future taxable income, tax planning strategies and recent financial operations. The assumptions about future taxable income require the use of significant judgement and are consistent with the plans and estimates we are using to manage the underlying business. In the event we determine that we will be able to realize deferred tax assets for which a valuation allowance was used to reduce their carrying value, the adjustment to the valuation allowance will be recorded as a reduction to the provision for income taxes in the period such determination is made.\nThe calculation of our tax liabilities involves dealing with uncertainties in the application of complex tax laws and regulations in a multitude of jurisdictions across our global operations. Significant judgment is required in the identification and measurement of uncertain tax positions. Our liability for unrecognized tax benefits contains uncertainties because we are required to make assumptions and to apply judgment to estimate the exposures associated with our various filing positions. We adjust the liabilities when our judgement changes as a result of new information not previously available.\nAlthough we believe that the judgments and estimates discussed herein are reasonable, actual results could differ, and we may be exposed to losses or gains that could be material. To the extent actual results differ from estimated amounts recorded, such differences will impact the income tax provision in the period in which the determination is made.\nRecent Accounting Guidance\nFor information regarding recent accounting guidance and its impact on our consolidated financial statements, see Note 2 to the consolidated financial statements in Part IV, Item 15 of this Annual Report on Form 10-K.",
    "item_7A": "ITEM 7A.QUANTITATIVE AND QUALITATIVE DISCLOSURES ABOUT MARKET RISK\nInterest Rate Risk. Changes in the overall level of interest rates affect the interest income that is generated from our cash, cash equivalents and short-term investments and the interest expense that is generated from our outstanding borrowings. For the year ended December 31, 2021, interest income was $2.1 million and interest expense was $12.4 million.\nCash and cash equivalents consist primarily of highly liquid investments such as money market funds and deposits held at major banks. Short-term investments consist primarily of deposits held by certain foreign subsidiaries with original maturities of three months to one year. A hypothetical 100 basis point increase or decrease in interest rates on these holdings would have an immaterial impact on our interest income.\nOur outstanding borrowings of $755.0 million as of December 31, 2021 accrue interest at the Eurodollar rate plus an applicable margin or at the base rate, at our election. The base rate is the applicable margin plus the highest of (i) the federal funds rate plus 0.500%, (ii) the Bank of America prime rate and (iii) the Eurodollar rate plus 1.000%. The applicable margin for these borrowings is a percentage per annum based on the lower of (1) a pricing level determined by our then-current consolidated leverage ratio and (2) a pricing level determined by our debt ratings (if such debt ratings exist). This results in a margin ranging from 1.125% to 1.750% and 0.125% to 0.750% for the Eurodollar rate and base rate, respectively. Because interest rates applicable to the outstanding borrowings are variable, we are exposed to interest rate risk from changes in the underlying index rates, which affects our interest expense. A hypothetical increase of 100 basis points in interest rates would result in an increase in interest expense and a corresponding decrease in cash flows of $7.6 million over the next twelve months, based on outstanding borrowings at December 31, 2021.\nForeign Currency Transaction Risk. As we operate in international regions, a portion of our revenue, expenses, cash, accounts receivable and payment obligations are denominated in foreign currencies. As a result, changes in currency exchange rates will affect our financial position, results of operations and cash flows.\nWith respect to revenue, on average for the year ended December 31, 2021, the U.S. Dollar was 0.4% weaker, when measured against our primary foreign currencies, than for the year ended December 31, 2020. The table below presents the net impacts of currency fluctuations on revenue for the year ended December 31, 2021. Amounts in brackets indicate a net adverse impact from currency fluctuations.\nThe impacts from currency fluctuations resulted in decreased operating income of $10.7 million for the year ended December 31, 2021 as compared to the year ended December 31, 2020.\nA hypothetical 10% strengthening in the U.S. Dollar against other currencies would have decreased our revenue by $80.3 million and decreased our operating income by $36.3 million for the year ended December 31, 2021. We seek to reduce our currency exchange transaction risks primarily through our normal operating and treasury activities, including the use of derivative instruments.\nThe most significant currency impacts on revenue and operating income are typically attributable to U.S. Dollar exchange rate changes against the Euro and Japanese Yen. Historical exchange rates for these currency pairs are reflected in the charts below:",
    "item_8": "ITEM 8.FINANCIAL STATEMENTS AND SUPPLEMENTARY DATA\nThe information required by this Item is included in Part IV, Item 15 of this Annual Report on Form 10-K.",
    "item_9": "ITEM 9.CHANGES IN AND DISAGREEMENTS WITH ACCOUNTANTS ON ACCOUNTING AND FINANCIAL DISCLOSURE\nNone.",
    "item_9A": "ITEM 9A.CONTROLS AND PROCEDURES\nEvaluation of Disclosure Controls and Procedures. As required by Rules 13a-15 and 15d-15 of the Exchange Act, we have evaluated, with the participation of management, including the Chief Executive Officer and the Chief Financial Officer, the effectiveness of the design and operation of our disclosure controls and procedures as of the end of the period covered by this report. Based on such evaluation, the Chief Executive Officer and Chief Financial Officer have concluded that such disclosure controls and procedures are effective, as defined in Rule 13a-15(e) or Rule 15d-15(e) of the Exchange Act.\nWe completed our acquisition of Zemax on October 1, 2021 and have not yet included Zemax in our assessment of the effectiveness of our internal control over financial reporting. Accordingly, pursuant to the SEC's general guidance that an assessment of a recently acquired business may be omitted from the scope of an assessment in the year of acquisition, the scope of our assessment of the effectiveness of our disclosure controls and procedures does not include Zemax. As of and for the year ended December 31, 2021, Zemax represented 7.1% of our consolidated assets and accounted for less than 1% of our consolidated revenues.\nWe believe, based on our knowledge, that the financial statements and other financial information included in this report fairly present, in all material respects, our financial condition, results of operations and cash flows as of and for the periods presented in this report. We are committed to both a sound internal control environment and to good corporate governance.\nFrom time to time, we review the disclosure controls and procedures, and may periodically make changes to enhance their effectiveness and to ensure that our systems evolve with our business.\nManagement's Annual Report on Internal Control over Financial Reporting. Management is responsible for establishing and maintaining adequate internal control over financial reporting, as such term is defined in Exchange Act Rule 13a-15(f) or Rule 15d-15(f). Under the supervision and with the participation of management, including our Chief Executive Officer and Chief Financial Officer, we have conducted an evaluation of the effectiveness of our internal control over financial reporting based upon the Internal Control - Integrated Framework (2013) issued by the Committee of Sponsoring Organizations of the Treadway Commission.\nWe completed our acquisition of Zemax on October 1, 2021. In conducting our evaluation of the effectiveness of our internal control over financial reporting as of December 31, 2021, we excluded Zemax from our evaluation for the year ended December 31, 2021 as permitted under current Securities and Exchange Commission rules and regulations. As of and for the year ended December 31, 2021, Zemax represented 7.1% of our consolidated assets and accounted for less than 1% of our consolidated revenues. We are currently in the process of integrating and assessing the internal control over financial reporting of Zemax with the rest of our company. The integration may lead to changes in future periods, but we do not expect these changes to materially affect our internal control over financial reporting. Management was unable, without incurring unreasonable effort or expense, to conduct an assessment of internal control over financial reporting for the acquired business. We expect to complete this integration during 2022.\nBecause of its inherent limitations, internal control over financial reporting may not prevent or detect misstatements. Projections of any evaluation of effectiveness to future periods are subject to the risk that controls may become inadequate because of changes in conditions, or that the degree of compliance with policies or procedures may deteriorate. Our system of internal control over financial reporting is designed to provide reasonable assurance to management and the Board of Directors regarding the reliability of financial records used in preparation of our published financial statements. As all internal control systems have inherent limitations, even systems determined to be effective can provide only reasonable assurance with respect to financial statement preparation and presentation. Based on this evaluation, our Chief Executive Officer and Chief Financial Officer have concluded that our internal control over financial reporting was effective at December 31, 2021.\nAdditionally, Deloitte & Touche LLP, an independent registered public accounting firm, has audited the financial statements included in this Annual Report on Form 10-K and has issued an attestation report on our internal control over financial reporting. This report is included in Item 15 of this Annual Report on Form 10-K.\nChanges in Internal Controls. There were no changes in our internal control over financial reporting that occurred during the three months ended December 31, 2021 that materially affected, or that are reasonably likely to materially affect, our internal control over financial reporting.",
    "item_9B": "ITEM 9B.OTHER INFORMATION\nNone.",
    "item_9C": "ITEM 9C. DISCLOSURE REGARDING FOREIGN JURISDICTIONS THAT PREVENT INSPECTIONS\nNot applicable.\nPART III",
    "item_10": "ITEM 10.DIRECTORS, EXECUTIVE OFFICERS AND CORPORATE GOVERNANCE\nThe information required by this Item is incorporated by reference to our 2022 Proxy Statement and is set forth under \"Corporate Governance at Ansys,\" \"Director Nominees,\" \"Continuing Directors Following the 2022 Annual Meeting,\" \"Our Executive Officers,\" and \"Delinquent Section 16(a) Reports\" therein.\nWe adopted a Code of Business Conduct and Ethics that applies to our principal executive officer, principal financial officer and principal accounting officer, and all of our directors and employees. Our Code of Business Conduct and Ethics is posted under the Governance tab of the Investor Relations section of our website at https://investors.ansys.com. We will post any amendments to, or waiver of, our Code of Business Conduct and Ethics that apply to our principal executive officer, principal financial officer and principal accounting officer on our website.",
    "item_11": "ITEM 11.EXECUTIVE COMPENSATION\nThe information required by this Item is incorporated by reference to our 2022 Proxy Statement and is set forth under \"Compensation Discussion and Analysis,\" \"Compensation Policies and Practices Related to Risk Management,\" \"Fiscal 2021 Compensation Tables,\" \"2021 CEO Pay Ratio,\" \"Compensation Committee Report,\" \"Corporate Governance at Ansys--Compensation Committee Interlocks and Insider Participation,\" \"Non-Employee Director Compensation\" and \"Director Compensation Table Fiscal Year 2021\" therein.",
    "item_12": "ITEM 12.SECURITY OWNERSHIP OF CERTAIN BENEFICIAL OWNERS AND MANAGEMENT AND RELATED STOCKHOLDER MATTERS\nThe information required by this Item is incorporated by reference to our 2022 Proxy Statement and is set forth under \"Equity Compensation Plans\" and \"Ownership of Our Common Stock\" therein.",
    "item_13": "ITEM 13.CERTAIN RELATIONSHIPS AND RELATED TRANSACTIONS, AND DIRECTOR INDEPENDENCE\nThe information required by this Item is incorporated by reference to our 2022 Proxy Statement and is set forth under \"Corporate Governance at Ansys--Director Independence\" and \"Corporate Governance at Ansys--Related-Party Transactions\" therein.",
    "item_14": "ITEM 14.PRINCIPAL ACCOUNTANT FEES AND SERVICES\nThe information required by this Item is incorporated by reference to our 2022 Proxy Statement and is set forth under \"Independent Registered Accounting Firm Services and Fees\" therein.\nPART IV",
    "item_15": "ITEM 15.EXHIBIT AND FINANCIAL STATEMENT SCHEDULES\n(a)Documents Filed as Part of this Annual Report on Form 10-K:\ni.Financial Statements: The following consolidated financial statements and reports are filed as part of this report:\n- Reports of Independent Registered Public Accounting Firm (PCAOB ID: 34)\n- Consolidated Balance Sheets as of December 31, 2021 and 2020\n- Consolidated Statements of Income for the years ended December 31, 2021, 2020 and 2019\n- Consolidated Statements of Comprehensive Income for the years ended December 31, 2021, 2020 and 2019\n- Consolidated Statements of Cash Flows for the years ended December 31, 2021, 2020 and 2019\n- Consolidated Statements of Stockholders' Equity for the years ended December 31, 2021, 2020 and 2019\n- Notes to Consolidated Financial Statements\nii.Financial Statement Schedule: The following financial statement schedule is filed as part of this report and should be read in conjunction with the consolidated financial statements.\n- Schedule II - Valuation and Qualifying Accounts\nSchedules not listed above have been omitted because they are not applicable, are not required or the information required to be set forth therein is included in the consolidated financial statements or notes thereto.\niii.Exhibits: The exhibits listed in the accompanying Exhibit Index immediately following the financial statement schedule are filed as part of, or incorporated by reference into, this Annual Report on Form 10-K.\n(b)Exhibits:\nWe hereby file as part of this Annual Report on Form 10-K the exhibits listed in the Exhibit Index immediately following the financial statement schedule of this Annual Report on Form 10-K.\n(c)Financial Statement Schedule:\nWe hereby file as part of this Annual Report on Form 10-K the financial statement schedule listed in Item 15(a)(ii) as set forth above.\nREPORT OF INDEPENDENT REGISTERED PUBLIC ACCOUNTING FIRM\nTo the Stockholders and the Board of Directors of ANSYS, Inc.\nOpinion on the Financial Statements\nWe have audited the accompanying consolidated balance sheets of ANSYS, Inc. and subsidiaries (the “Company”) as of December 31, 2021 and 2020, the related consolidated statements of income, comprehensive income, stockholders’ equity, and cash flows for each of the three years in the period ended December 31, 2021, and the related notes and the schedule listed in the Index at Item 15 (collectively referred to as the “financial statements”). In our opinion, the financial statements present fairly, in all material respects, the financial position of the Company as of December 31, 2021 and 2020, and the results of its operations and its cash flows for each of the three years in the period ended December 31, 2021, in conformity with accounting principles generally accepted in the United States of America.\nWe have also audited, in accordance with the standards of the Public Company Accounting Oversight Board (United States) (PCAOB), the Company’s internal control over financial reporting as of December 31, 2021, based on criteria established in Internal Control-Integrated Framework (2013) issued by the Committee of Sponsoring Organizations of the Treadway Commission and our report dated February 23, 2022, expressed an unqualified opinion on the Company’s internal control over financial reporting.\nBasis for Opinion\nThese financial statements are the responsibility of the Company’s management. Our responsibility is to express an opinion on the Company’s financial statements based on our audits. We are a public accounting firm registered with the PCAOB and are required to be independent with respect to the Company in accordance with the U.S. federal securities laws and the applicable rules and regulations of the Securities and Exchange Commission and the PCAOB.\nWe conducted our audit in accordance with the standards of the PCAOB. Those standards require that we plan and perform the audit to obtain reasonable assurance about whether the financial statements are free of material misstatement, whether due to error or fraud. Our audits included performing procedures to assess the risks of material misstatement of the financial statements, whether due to error or fraud, and performing procedures that respond to those risks. Such procedures included examining, on a test basis, evidence regarding the amounts and disclosures in the financial statements. Our audits also included evaluating the accounting principles used and significant estimates made by management, as well as evaluating the overall presentation of the financial statements. We believe that our audits provide a reasonable basis for our opinion.\nCritical Audit Matter\nThe critical audit matter communicated below is a matter arising from the current-period audit of the financial statements that was communicated or required to be communicated to the audit committee and that (1) relates to accounts or disclosures that are material to the financial statements and (2) involved our especially challenging, subjective, or complex judgments. The communication of the critical audit matter does not alter in any way our opinion on the financial statements, taken as a whole, and we are not, by communicating the critical audit matter below, providing separate opinions on the critical audit matter or on the accounts or disclosures to which it relates.\nRevenue-Time-Based Lease Licenses-Refer to Notes 2 and 3 to the financial statement\nCritical Audit Matter Description\nThe Company sells time-based lease (TBL) licenses that are a bundled arrangement that include the rights to a term software license as well as post-contract support (PCS). Revenue is recognized up front at the commencement of the lease for the term software license and recognized ratably over the term of the contract for the PCS in the arrangement. Utilizing observable inputs, the Company determined that 50% of the estimated standalone selling price of the TBL is attributable to the term software license, while 50% is attributable to PCS. This determination involved judgment, particularly as it relates to the value relationship between the Company’s PCS to TBLs, the value relationship between PCS and the Company’s perpetual licenses and its linkage to the shortened term of a TBL, the average economic life of the Company’s software, renewal rates of its customers, and the price of the bundled arrangement in relation to the perpetual licensing approach.\nGiven the judgments necessary to determine the allocation between the term software license and PCS, auditing this estimate involved a high degree of auditor judgment.\nHow the Critical Audit Matter Was Addressed in the Audit\nOur audit procedures related to management’s estimate of the allocation between the term software license and PCS in a TBL included the following, among others:\n•We tested the effectiveness of controls over TBL revenue, including those over the determination of the estimated standalone selling price of the Company’s licenses and services, as well as the allocation of this standalone selling price within the arrangement.\n•We evaluated the pricing relationship between PCS and perpetual licenses on the net licensing fee of the arrangement, as well as the Company’s renewal rate of PCS sales on perpetual licenses through those arrangements selected for testing that contained both elements as a consideration point of the value relationship between the term software license and PCS when a customer purchases a bundled TBL.\n•We evaluated the estimated economic life of the Company’s software through observable data points.\n•Through our current and historical audit procedures, we confirmed that the term software license portion and PCS portion of an arrangement are not sold separately from one another.\n•We selected a sample of arrangements and performed the following:\n-Compared the list price of the TBL to the consideration received from the customer and recalculated the discount from list price for each arrangement.\n-Evaluated whether management appropriately calculated the estimated standalone selling price for the TBL.\n-Tested management’s identification of distinct performance obligations.\n-Tested the mathematical accuracy of revenue recognized at a point in time or over time based upon the identification of TBLs within the arrangement.\n/s/ Deloitte & Touche LLP\nPittsburgh, Pennsylvania\nFebruary 23, 2022\nWe have served as the Company's auditor since 2002.\nREPORT OF INDEPENDENT REGISTERED PUBLIC ACCOUNTING FIRM\nTo the Stockholders and the Board of Directors of ANSYS, Inc.\nOpinion on Internal Control over Financial Reporting\nWe have audited the internal control over financial reporting of ANSYS, Inc. and subsidiaries (the “Company”) as of December 31, 2021, based on criteria established in Internal Control - Integrated Framework (2013) issued by the Committee of Sponsoring Organizations of the Treadway Commission (COSO). In our opinion, the Company maintained, in all material respects, effective internal control over financial reporting as of December 31, 2021, based on criteria established in Internal Control - Integrated Framework (2013) issued by COSO.\nWe have also audited, in accordance with the standards of the Public Company Accounting Oversight Board (United States) (PCAOB), the consolidated financial statements as of and for the year ended December 31, 2021, of the Company and our report dated February 23, 2022, expressed an unqualified opinion on those financial statements.\nAs described in Management’s Report on Internal Control over Financial Reporting, management excluded from its assessment the internal control over financial reporting at Zemax, LLC, which was acquired on October 1, 2021, and whose financial statements constitute 7% of total assets and less than 1% of revenues of the consolidated financial statement amounts as of and for the year ended December 31, 2021. Accordingly, our audit did not include the internal control over financial reporting at Zemax, LLC.\nBasis for Opinion\nThe Company’s management is responsible for maintaining effective internal control over financial reporting and for its assessment of the effectiveness of internal control over financial reporting, included in the accompanying Management’s Report on Internal Control over Financial Reporting. Our responsibility is to express an opinion on the Company’s internal control over financial reporting based on our audit. We are a public accounting firm registered with the PCAOB and are required to be independent with respect to the Company in accordance with the U.S. federal securities laws and the applicable rules and regulations of the Securities and Exchange Commission and the PCAOB.\nWe conducted our audit in accordance with the standards of the PCAOB. Those standards require that we plan and perform the audit to obtain reasonable assurance about whether effective internal control over financial reporting was maintained in all material respects. Our audit included obtaining an understanding of internal control over financial reporting, assessing the risk that a material weakness exists, testing and evaluating the design and operating effectiveness of internal control based on the assessed risk, and performing such other procedures as we considered necessary in the circumstances. We believe that our audit provides a reasonable basis for our opinion.\nDefinition and Limitations of Internal Control over Financial Reporting\nA company’s internal control over financial reporting is a process designed to provide reasonable assurance regarding the reliability of financial reporting and the preparation of financial statements for external purposes in accordance with generally accepted accounting principles. A company’s internal control over financial reporting includes those policies and procedures that (1) pertain to the maintenance of records that, in reasonable detail, accurately and fairly reflect the transactions and dispositions of the assets of the company; (2) provide reasonable assurance that transactions are recorded as necessary to permit preparation of financial statements in accordance with generally accepted accounting principles, and that receipts and expenditures of the company are being made only in accordance with authorizations of management and directors of the company; and (3) provide reasonable assurance regarding prevention or timely detection of unauthorized acquisition, use, or disposition of the company’s assets that could have a material effect on the financial statements.\nBecause of its inherent limitations, internal control over financial reporting may not prevent or detect misstatements. Also, projections of any evaluation of effectiveness to future periods are subject to the risk that controls may become inadequate because of changes in conditions, or that the degree of compliance with the policies or procedures may deteriorate.\n/s/ Deloitte & Touche LLP\nPittsburgh, Pennsylvania\nFebruary 23, 2022\nANSYS, INC. AND SUBSIDIARIES\nCONSOLIDATED BALANCE SHEETS\nThe accompanying notes are an integral part of the consolidated financial statements.\nANSYS, INC. AND SUBSIDIARIES\nCONSOLIDATED STATEMENTS OF INCOME\nThe accompanying notes are an integral part of the consolidated financial statements.\nANSYS, INC. AND SUBSIDIARIES\nCONSOLIDATED STATEMENTS OF COMPREHENSIVE INCOME\nThe accompanying notes are an integral part of the consolidated financial statements.\nANSYS, INC. AND SUBSIDIARIES\nCONSOLIDATED STATEMENTS OF CASH FLOWS\nThe accompanying notes are an integral part of the consolidated financial statements.\nANSYS, INC. AND SUBSIDIARIES\nCONSOLIDATED STATEMENTS OF STOCKHOLDERS' EQUITY\nThe accompanying notes are an integral part of the consolidated financial statements.\nANSYS, INC. AND SUBSIDIARIES\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nDecember 31, 2021\n1.Organization\nWe develop and globally market engineering simulation software and services widely used by engineers, designers, researchers and students across a broad spectrum of industries and academia, including high-tech, aerospace and defense, automotive, energy, industrial equipment, materials and chemicals, consumer products, healthcare, and construction.\nAs defined by the accounting guidance for segment reporting, we operate as one segment.\nGiven the integrated approach to the multi-discipline problem-solving needs of our customers, a single sale of software may contain components from multiple product areas and include combined technologies. We also have a multi-year product and integration strategy that will result in new, combined products or changes to the historical product offerings. As a result, it is impracticable for us to provide accurate historical or current reporting among our various product lines.\n2.Accounting Policies\nAccounting Principles\nThe consolidated financial statements and accompanying notes are prepared in accordance with accounting principles generally accepted in the United States. Certain items in the notes to the consolidated financial statements of prior years have been reclassified to conform to the current year's presentation. These reclassifications had no effect on reported net income, comprehensive income, cash flows, total assets or total liabilities and stockholders' equity.\nPrinciples of Consolidation\nThe accompanying consolidated financial statements include our accounts and those of our wholly owned subsidiaries. All intercompany accounts and transactions have been eliminated.\nRecently Adopted Accounting Guidance\nIncome taxes: In December 2019, the Financial Accounting Standards Board (FASB) issued Accounting Standards Update (ASU) No. 2019-12, Income Taxes (Topic 740): Simplifying the Accounting for Income Taxes (ASU 2019-12), as part of its initiative to reduce complexity in the accounting standards. The amendments in ASU 2019-12 eliminated certain exceptions related to the approach for intraperiod tax allocation, the methodology for calculating income taxes in an interim period and the recognition of deferred tax liabilities for outside basis differences. ASU 2019-12 also clarified and simplified other aspects of the accounting for income taxes. We adopted ASU 2019-12 on January 1, 2021 with no material impact to our consolidated financial statements.\nAccounting Guidance Issued and Not Yet Adopted\nBusiness combinations: In October 2021, the FASB issued ASU No. 2021-08, Business Combinations (Topic 805): Accounting for Contract Assets and Contract Liabilities from Contracts with Customers (ASU 2021-08). ASU 2021-08 requires contract assets and contract liabilities acquired in a business combination to be recognized and measured by the acquirer on the acquisition date in accordance with Accounting Standards Codification (ASC) 606, Revenue from Contracts with Customers, as if the acquirer had originated the contracts. Under the current guidance, such assets and liabilities are recognized by the acquirer at fair value on the acquisition date. ASU 2021-08 is effective for fiscal years, including interim periods within those fiscal years, beginning after December 15, 2022. Early adoption is permitted, including in an interim period, for any period for which financial statements have not yet been issued. We adopted the standard effective January 1, 2022. The standard will not impact acquired contract assets or liabilities from business combinations occurring prior to the effective date of adoption, and the impact in future periods will depend on the contract assets and contract liabilities acquired in future business combinations.\nUse of Estimates\nThe preparation of financial statements in conformity with accounting principles generally accepted in the United States requires management to make estimates and assumptions that affect the reported amounts of assets and liabilities and disclosure of contingent assets and liabilities at the date of the financial statements. Estimates also affect the amounts of revenue and expenses during the reported periods. Significant estimates included in these consolidated financial statements include:\n•Contract revenue\n•Standalone selling prices of our products and services\n•Allowance for doubtful accounts receivable\n•Valuation of goodwill and other intangible assets\n•Useful lives for depreciation and amortization\n•Acquired deferred revenue\n•Operating lease assets and liabilities\n•Fair values of stock awards\n•Deferred compensation\n•Income taxes\n•Uncertain tax positions\n•Tax valuation reserves\n•Contingencies and litigation\nActual results could differ from these estimates. Changes in estimates are recorded in the results of operations in the period that the changes occur.\nRevenue Recognition\nOur revenue is derived principally from the licensing of computer software products and from related maintenance contracts. We enter into contracts that include combinations of products, maintenance and services, which are accounted for as separate performance obligations with differing revenue recognition patterns.\nRevenue from perpetual licenses is classified as software license revenue. Software license revenue is recognized up front upon delivery of the licensed product and/or the utility that enables the customer to access authorization keys, provided that an enforceable contract has been received. Typically, our perpetual licenses are sold with post-contract support (PCS), which includes unspecified technical enhancements and customer support. We allocate value in bundled perpetual and PCS arrangements based on the standalone selling prices of the perpetual license and PCS. Revenue from PCS is classified as maintenance revenue and is recognized ratably over the term of the contract, as we satisfy the PCS performance obligation.\nIn addition to perpetual licenses, we sell time-based lease licenses. Lease licenses are sold only as a bundled arrangement that includes the rights to a term software license and PCS. Utilizing observable inputs, we determined that 50% of the estimated standalone selling price of the lease license is attributable to the term license and 50% is attributable to the PCS. This determination considered the value relationship for our products between PCS and time-based lease licenses, the value relationship between PCS and perpetual licenses, the average economic life of our products, software renewal rates and the price of the bundled arrangement in relation to the perpetual licensing approach. Consistent with the perpetual sales, the license component is classified as software license revenue and recognized as revenue up front at the commencement of the lease upon delivery of the licensed product and/or utility that enables the customer to access authorization keys. The PCS is classified as maintenance revenue and is recognized ratably over the term of the contract, as we satisfy the PCS performance obligation.\nRevenue from training, support and other services is recognized as the services are performed. For contracts in which the service consists of a single performance obligation, such as providing a training class to a customer, we recognize revenue upon completion of the performance obligation. For service contracts that are longer in duration and often include multiple performance obligations (for example, both training and consulting), we measure the progress toward completion of the obligations and recognize revenue accordingly. In measuring progress towards the completion of performance obligations, we typically utilize output-based estimates for services with contractual billing arrangements that are not based on time and materials, and estimate output based on the total tasks completed as compared to the total tasks required for each work contract. Input-based estimates are utilized for services that involve general consultations with contractual billing arrangements based on time and materials, utilizing direct labor as the input measure.\nWe also execute arrangements through independent channel partners in which the channel partners are authorized to market and distribute our software products to end users of our products and services in specified territories. In sales facilitated by channel partners, the channel partner is the principal to the transaction with the end-user. We recognize revenue from transactions with channel partners in a manner consistent with the direct sales described above for both perpetual and time-based licenses. Revenue from channel partner transactions is the amount remitted to us by the channel partners. This amount includes a fee for PCS that is compensation for providing technical enhancements and the second level of technical support to the end user, which is recognized over the period that PCS is to be provided.\nNon-income related taxes collected from customers and remitted to governmental authorities are recorded on the consolidated balance sheet as accounts receivable and accrued expenses. The collection and payment of these amounts are reported on a net basis in the consolidated statements of income and do not impact reported revenues or expenses.\nWe do not offer right of return. We warrant to our customers that our software will perform substantially as specified in our current user manuals. We have not experienced significant claims related to software warranties beyond the scope of maintenance support, which we are already obligated to provide. The warranty is not sold, and cannot be purchased, separately.\nThe warranty does not provide any type of additional service to the customer or performance obligation for us.\nOur agreements with our customers generally require us to indemnify the customer against claims that our software infringes third-party patent, copyright, trademark or other proprietary rights. Such indemnification obligations are generally limited in a variety of industry-standard respects, including our right to replace an infringing product.\nSignificant Judgments\nOur contracts with customers typically include promises to transfer licenses and services to a customer. Judgment is required to determine if the promises are separate performance obligations, and if so, to allocate the transaction price to each performance obligation. We use the estimated standalone selling price method to allocate the transaction price for each performance obligation. The estimated standalone selling price is determined using all information reasonably available to us, including market conditions and other observable inputs. The corresponding revenues are recognized as the related performance obligations are satisfied.\nWe apply a practical expedient to expense sales commissions as incurred when the amortization period would have been one year or less. Sales commissions associated with the initial year of multi-year contracts are expensed as incurred due to their immateriality. Sales commissions associated with multi-year contracts beyond the initial year are subject to an employee service requirement and are expensed as incurred as they are not considered incremental costs to obtain a contract.\nWe are required to adjust promised amounts of consideration for the effects of the time value of money if the timing of the payments provides the customer or us with a significant financing benefit. We consider various factors in assessing whether a financing component exists, including the duration of the contract, market interest rates and the timing of payments. Our contracts do not include a significant financing component requiring adjustment to the transaction price.\nCash and Cash Equivalents\nCash and cash equivalents consist primarily of highly liquid investments such as deposits held at major banks and money market funds. Cash equivalents are carried at cost, which approximates fair value. Our cash and cash equivalents balances comprise the following:\nOur money market fund balances are held in various funds of two issuers.\nProperty and Equipment\nProperty and equipment is stated at cost. Depreciation is computed using the straight-line method over the estimated useful lives of the various classes of assets, which range from one year to forty years. Repairs and maintenance are charged to expense as incurred. Gains or losses from the sale or retirement of property and equipment are included in operating income.\nResearch and Development\nResearch and development costs are expensed as incurred. Internally developed software costs required to be capitalized as defined by the accounting guidance are not material to our consolidated financial statements.\nBusiness Combinations\nWhen we consummate an acquisition, the assets acquired and the liabilities assumed are recognized separately from goodwill at their acquisition date fair values. Goodwill as of the acquisition date is measured as the excess of the fair value of consideration transferred over the acquisition date fair value of the net identifiable assets acquired. While best estimates and assumptions are used to accurately value assets acquired and liabilities assumed at the acquisition date as well as contingent consideration,\nwhere applicable, our estimates are inherently uncertain and subject to refinement. As a result, during the measurement period, which may be up to one year from the acquisition date, we record adjustments to the assets acquired and liabilities assumed with the corresponding offset to goodwill as we obtain new information about facts and circumstances that existed as of the acquisition date that, if known, would have affected the measurement of the amounts recognized as of that date. Upon the earlier of the conclusion of the measurement period or final determination of the values of assets acquired or liabilities assumed, any subsequent adjustments are recorded in the consolidated statements of income.\nGoodwill and Other Intangible Assets\nGoodwill represents the excess of the fair value of consideration transferred over the fair value of net identifiable assets acquired. Other intangible assets consist of trade names, customer lists and acquired software and technology. Intangible assets that are not considered to have an indefinite useful life are amortized over their useful lives, which range from two years to seventeen years. Amortization expense for intangible assets was $76.0 million, $57.2 million and $36.9 million for the years ended December 31, 2021, 2020 and 2019, respectively.\nWe test goodwill and indefinite-lived intangible assets for impairment at least annually by performing a quantitative assessment of whether the fair value of each reporting unit or asset exceeds its carrying amount. We have one reporting unit. Goodwill is tested at this reporting unit level and indefinite-lived intangible assets are tested at the individual asset level. This requires us to assess and make judgments regarding a variety of factors which impact the fair value of the reporting unit or asset being tested, including business plans, anticipated future cash flows, economic projections and other market data.\nDuring the first quarter of 2021, we completed the annual impairment test for goodwill and the indefinite-lived intangible asset and determined that these assets had not been impaired as of the test date, January 1, 2021. No other events or circumstances changed during the year ended December 31, 2021 that would indicate that the fair values of our reporting unit and indefinite-lived intangible asset are below their carrying amounts.\nConcentrations of Credit Risk\nWe have a concentration of credit risk with respect to revenue and trade receivables due to the use of certain significant channel partners to market and sell our products. We perform periodic credit evaluations of our customers' financial condition and generally do not require collateral. The following table outlines concentrations of risk with respect to our revenue:\nNo single customer or channel partner accounted for more than 5% of our revenue in 2021, 2020 or 2019.\nIn addition to the concentration of credit risk with respect to trade receivables, our cash and cash equivalents are also exposed to concentration risk. Our cash and cash equivalent accounts are insured through various public and private bank deposit insurance programs, foreign and domestic; however, a significant portion of our funds are not insured. The following table outlines concentrations of risk with respect to our cash and cash equivalents:\nAllowance for Doubtful Accounts\nAllowance for Doubtful Accounts Policy 2021 and 2020\nOn January 1, 2020, we adopted ASU No. 2016-13, Financial Instruments - Credit Losses (Topic 326): Measurement of Credit Losses on Financial Instruments (ASU 2016-13). ASU 2016-13 requires us to use the current expected credit loss methodology to make judgments as to our ability to collect outstanding receivables and provide allowances for a portion of receivables over the lifetime of the receivables. Provisions are made based upon a specific review of all significant outstanding invoices from both value and delinquency perspectives. For those invoices not specifically reviewed, provisions are estimated at differing rates based upon the age of the receivable. In determining these percentages, we consider our historical loss experience, current economic trends and future conditions.\nThe changes in the allowance for doubtful accounts during the years ended December 31, 2021 and 2020 were as follows:\nAllowance for Doubtful Accounts Policy 2019\nUnder previous guidance, we made judgments as to our ability to collect outstanding receivables and provided allowances for a portion of receivables when collection became doubtful. Provisions were made based upon a specific review of all significant outstanding invoices from both value and delinquency perspectives. For those invoices not specifically reviewed, provisions were estimated at differing rates based upon the age of the receivable and the geographic area of origin. In determining these percentages, we considered our historical collection experience and current economic trends in the customer's industry and geographic region.\nWe recorded provisions for bad debts of $1.0 million, $6.4 million and $2.9 million for the years ended December 31, 2021, 2020 and 2019, respectively.\nIncome Taxes\nWe account for income taxes under the asset and liability method, which requires the recognition of deferred tax assets and liabilities for the expected future tax consequences of events that have been included in the financial statements. Under this method, deferred tax assets and liabilities are determined based on the differences between the financial statement and tax bases of assets and liabilities using enacted tax rates in effect for the year in which the differences are expected to reverse. The effect of a change in tax rates on deferred tax assets and liabilities is recognized in income in the period of the enactment date.\nWe record net deferred tax assets to the extent we believe these assets will more likely than not be realized. In making such determination, we consider all available positive and negative evidence, including scheduled reversals of deferred tax liabilities, projected future taxable income, tax planning strategies and recent financial operations. In the event we determine that we will be able to realize deferred tax assets for which a valuation allowance was used to reduce their carrying value, the adjustment to the valuation allowance will be recorded as a reduction to the provision for income taxes.\nTax benefits related to uncertain tax positions taken or expected to be taken on a tax return are recorded when such benefits meet a more-likely-than-not threshold. Otherwise, these tax benefits are recorded when a tax position has been effectively settled, which means that the statute of limitations has expired or the appropriate taxing authority has completed its examination even though the statute of limitations remains open.\nWe recognize interest and penalties related to income taxes within the income tax expense line in the consolidated statements of income. Accrued interest and penalties are included within the related tax liability line in the consolidated balance sheets.\nForeign Currencies\nCertain of our sales and intercompany transactions are denominated in foreign currencies. These transactions are translated to the functional currency at the exchange rate on the transaction date. Assets and liabilities denominated in a currency other than our functional currency or our subsidiaries' functional currencies are translated at the effective exchange rate on the balance sheet date. Gains and losses resulting from foreign exchange transactions are included in other income (expense), net. We\nrecorded net foreign exchange losses of $1.8 million, $0.2 million and $2.5 million for the years ended December 31, 2021, 2020 and 2019, respectively.\nThe financial statements of our foreign subsidiaries are translated from the functional (local) currency to U.S. Dollars. Assets and liabilities are translated at the exchange rates on the balance sheet date. Results of operations are translated at average exchange rates, which approximate rates in effect when the underlying transactions occurred.\nAccumulated Other Comprehensive Loss\nAccumulated other comprehensive loss is composed entirely of foreign currency translation adjustments.\nEarnings Per Share\nBasic earnings per share (EPS) amounts are computed by dividing earnings by the weighted average number of common shares outstanding during the period. Diluted EPS amounts assume the issuance of common stock for all potentially dilutive equivalents outstanding. To the extent stock awards are anti-dilutive, they are excluded from the calculation of diluted EPS.\nThe details of basic and diluted EPS are as follows:\nStock-Based Compensation\nWe account for stock-based compensation in accordance with share-based payment accounting guidance. The guidance requires an entity to measure the cost of employee services received in exchange for an award of equity instruments based on the grant-date fair value of the award. The cost is recognized over the period during which an employee is required to provide services in exchange for the award, typically the vesting period.\nFair Value of Financial Instruments\nWe account for certain assets and liabilities at fair value in accordance with the accounting guidance applicable to fair value measurements and disclosures. The carrying values of cash, cash equivalents, short-term investments, accounts receivable, accounts payable, accrued expenses, other accrued liabilities and short-term obligations are deemed to be reasonable estimates of their fair values because of their short-term nature. Our term loans are variable rate debt obligations and, therefore, the carrying amounts approximate the fair values.\n3.Revenue from Contracts with Customers\nDisaggregation of Revenue\nThe following table summarizes revenue:\nOur software licenses revenue is recognized up front, while maintenance and service revenue is generally recognized over the term of the contract.\nDeferred Revenue\nDeferred revenue consists of billings made or payments received in advance of revenue recognition from customer agreements. The timing of revenue recognition may differ from the timing of billings to customers. Payment terms vary by the type and location of customer and the products or services offered. The time between invoicing and when payment is due is not significant.\nThe changes in deferred revenue, inclusive of both current and long-term deferred revenue, during the years ended December 31, 2021 and 2020 were as follows:\nTotal revenue allocated to remaining performance obligations as of December 31, 2021 will be recognized as revenue as follows:\nRevenue allocated to remaining performance obligations represents contracted revenue that has not yet been recognized, which includes both deferred revenue and backlog. Our backlog represents installment billings for periods beyond the current quarterly billing cycle. Revenue recognized during the years ended December 31, 2021 and 2020 included amounts in deferred\nrevenue and backlog at the beginning of the period of $606.8 million, of which $372.1 million was in deferred revenue, and $569.8 million, of which $351.4 million was in deferred revenue, respectively.\n4.Acquisitions\n2021 Acquisitions\nOn October 1, 2021, we acquired 100% of the shares of Zemax, a leader in high-performance optical imaging system simulation, for a purchase price of $411.5 million, paid in cash, or $399.1 million net of cash acquired from Zemax. The acquisition expands the scope of our optical and photonics simulation portfolio by giving users comprehensive solutions that could drive innovation in healthcare, autonomy, consumer electronics and the IIoT.\nAdditionally, during the year ended December 31, 2021 we completed several other acquisitions to expand our solution offerings and enhance our customers' experience. These acquisitions were not individually significant. The combined purchase price of these acquisitions during the year ended December 31, 2021 was $110.7 million, which was paid in cash.\nDuring the year ended December 31, 2021, we incurred $6.0 million in acquisition-related expenses, recognized as selling, general and administrative expense on the consolidated statements of income.\nThe assets and liabilities of the acquisitions have been recorded based upon management's estimates of their fair market values as of each respective date of acquisition. The following tables summarize the fair values of consideration transferred and the fair values of identified assets acquired and liabilities assumed at each respective date of acquisition:\nFair Value of Consideration Transferred:\nRecognized Amounts of Identifiable Assets Acquired and Liabilities Assumed:\nThe goodwill, which is generally not tax-deductible, is attributed to intangible assets that do not qualify for separate recognition, including the assembled workforce of the acquired business and the synergies expected to arise as a result of the acquisitions.\nThe fair values of the assets acquired and liabilities assumed are based on preliminary calculations. The estimates and assumptions for these items are subject to change as additional information about what was known and knowable at the acquisition date is obtained during the measurement period (up to one year from the acquisition date).\nWe determined the fair value of our intangible assets using various valuation techniques, including the relief-from-royalty method and the multi-period excess earnings method. These models utilize certain unobservable inputs classified as Level 3 measurements as defined by ASC 820, Fair Value Measurements and Disclosures. The determination of fair value requires considerable judgment and is sensitive to changes in underlying assumptions, estimates and market factors. Estimating fair value requires us to make assumptions and estimates regarding our future plans, as well as industry and economic conditions. These assumptions and estimates include, but are not limited to: selection of a valuation methodology, royalty rate, discount rate and customer attrition rate.\nThe weighted-average useful life, valuation method and assumptions used to determine the fair value of the intangible assets acquired with the Zemax acquisition are as follows:\nThe operating results of each acquisition have been included in our consolidated financial statements since each respective date of acquisition. The effects of the business combinations were not material to our consolidated results of operations individually or in the aggregate during 2021.\n2020 Acquisitions\nOn December 1, 2020, we acquired 100% of the shares of AGI, a premier provider of mission-simulation, modeling, testing and analysis software for aerospace, defense and intelligence applications. The acquisition expands the scope of our offerings, empowering users to solve challenges by simulating from the chip level all the way to a customer's entire mission. The purchase price was $720.1 million, inclusive of net working capital adjustments.\nOn April 1, 2020, we acquired 100% of the shares of Lumerical, a leading developer of photonic design and simulation tools, for a purchase price of $107.5 million, which was paid in cash. The acquisition adds best-in-class photonic products to our multiphysics portfolio, providing customers with a full set of solutions to solve their next-generation product challenges.\nDuring the year ended December 31, 2020, we incurred $5.1 million in acquisition-related expenses, recognized as selling, general and administrative expense on the consolidated statements of income.\nThe assets and liabilities of the acquisitions have been recorded based upon management's estimates of their fair market values as of each respective date of acquisition. The following tables summarize the fair value of consideration transferred and the fair values of identified assets acquired and liabilities assumed at each respective date of acquisition:\nFair Value of Consideration Transferred:\n(1)We issued 0.6 million shares of our common stock in an unregistered offering to the prior owners of AGI with a fair value of $217.7 million, and we issued $4.5 million from shares held in treasury.\nRecognized Amounts of Identifiable Assets Acquired and Liabilities Assumed:\nThe goodwill, which is generally not tax-deductible, is attributed to intangible assets that do not qualify for separate recognition, including the assembled workforce of the acquired business and the synergies expected to arise as a result of the acquisitions.\nThe weighted-average useful life, valuation method and assumptions used to determine the fair value of the intangible assets acquired with the AGI acquisition are as follows:\nThe weighted-average useful life, valuation method and assumptions used to determine the fair value of the intangible assets acquired with the Lumerical acquisition are as follows:\nThe operating results of each acquisition have been included in our consolidated financial statements since each respective date of acquisition. The effects of the business combinations were not material to our consolidated results of operations individually or in the aggregate for the year ended December 31, 2020.\n5.Other Receivables and Current Assets and Other Accrued Expenses and Liabilities\nOur other receivables and current assets, and other accrued expenses and liabilities, comprise the following balances:\nReceivables related to unrecognized revenue represent the current portion of billings made for customer contracts that have not yet been recognized as revenue.\n6.Property and Equipment\nProperty and equipment consists of the following:\nDepreciation expense related to property and equipment was $30.9 million, $28.0 million and $23.6 million for the years ended December 31, 2021, 2020 and 2019, respectively.\n7.Goodwill and Intangible Assets\nGoodwill represents the excess of the fair value of consideration transferred over the fair value of net identifiable assets acquired. Identifiable intangible assets acquired in business combinations are recorded based on their fair values on the date of acquisition.\nIntangible assets are classified as follows:\nFinite-lived intangible assets are amortized over their estimated useful lives of two years to seventeen years. Amortization expense for the intangible assets reflected above was $76.0 million, $57.2 million and $36.9 million for the years ended December 31, 2021, 2020 and 2019, respectively.\nAs of December 31, 2021, estimated future amortization expense for the intangible assets reflected above is as follows:\nThe changes in goodwill during the years ended December 31, 2021 and 2020 were as follows:\n(1) In accordance with the accounting for business combinations, we recorded adjustments to goodwill for the effect of changes in the provisional fair values of the assets acquired and liabilities assumed during the measurement period (up to one year from the acquisition date) as we obtained new information about facts and circumstances that existed as of the acquisition date that, if known, would have affected the measurement of the amounts recognized as of that date. Such adjustments are not material to our consolidated financial statements.\nDuring the first quarter of 2021, we completed the annual impairment test for goodwill and the indefinite-lived intangible asset and determined that these assets had not been impaired as of the test date, January 1, 2021. No other events or circumstances changed during the year ended December 31, 2021 that would indicate that the fair values of our reporting unit and indefinite-lived intangible asset are below their carrying amounts.\n8.Fair Value Measurement\nThe valuation hierarchy for disclosure of assets and liabilities reported at fair value prioritizes the inputs for such valuations into three broad levels:\n•Level 1: quoted prices (unadjusted) in active markets for identical assets or liabilities;\n•Level 2: quoted prices for similar assets and liabilities in active markets or inputs that are observable for the asset or liability, either directly or indirectly through market corroboration, for substantially the full term of the financial instrument; or\n•Level 3: unobservable inputs based on our own assumptions used to measure assets and liabilities at fair value.\nA financial asset's or liability's classification within the hierarchy is determined based on the lowest level input that is significant to the fair value measurement.\nOur long-term debt is classified within Level 2 of the fair value hierarchy because these borrowings are not actively traded and have a variable interest rate structure based upon market rates. The carrying amount of our long-term debt approximates the estimated fair value. See Note 10, “Debt”, for additional information on these borrowings.\nThe following tables provide the assets carried at fair value and measured on a recurring basis:\nThe cash equivalents in the preceding tables represent money market funds, valued at net asset value, with carrying values which approximate their fair values because of their short-term nature.\nThe short-term investments in the preceding tables represent deposits held by certain foreign subsidiaries. The deposits have fixed interest rates with original maturities ranging from three months to one year.\nThe deferred compensation plan investments in the preceding tables represent trading securities held in a rabbi trust for the benefit of non-employee directors. These securities consist of mutual funds traded in an active market with quoted prices. As a result, the plan assets are classified as Level 1 in the fair value hierarchy. The plan assets are recorded within other long-term assets on our consolidated balance sheets.\nThe equity securities represent our investment in a publicly traded company. These securities are traded in an active market with quoted prices. As a result, the securities are classified as Level 1 in the fair value hierarchy. The securities are recorded within other long-term assets on our consolidated balance sheets.\n9.Leases\nOur right-of-use (ROU) assets and lease liabilities primarily include operating leases for office space. Our executive offices and those related to certain domestic product development, marketing, production and administration are located in a 186,000 square foot office facility in Canonsburg, Pennsylvania. The term of the lease is 183 months, which began on October 1, 2014 and expires on December 31, 2029. The lease agreement includes options to renew the contract through August 2044, an option to lease additional space in January 2025 and an option to terminate the lease in December 2025. No options are included in the lease liability as renewal is not reasonably certain. In addition, we are reasonably certain we will not terminate the lease agreement. Absent the exercise of options in the lease, our remaining base rent (inclusive of property taxes and certain operating costs) is $4.5 million per annum through 2024 and $4.7 million per annum for 2025 - 2029.\nThe components of our global lease cost reflected in the consolidated statements of income for the years ended December 31, 2021, 2020, and 2019 are as follows:\n(1) Variable lease cost includes common area maintenance, property taxes, utilities and fluctuations in rent due to a change in an index or rate.\nOther information related to operating leases for the years ended December 31, 2021, 2020, and 2019 is as follows:\nThe maturity schedule of the operating lease liabilities as of December 31, 2021 is as follows:\n(1)Includes the current portion of operating lease liabilities of $22.8 million, which is reflected in other accrued expenses and liabilities in the consolidated balance sheets.\nThere were no material leases that have been signed but not yet commenced as of December 31, 2021.\n10.Debt\nIn February 2019, we entered into a credit agreement for a $500.0 million unsecured revolving credit facility, which includes a $50.0 million sublimit for the issuance of letters of credit (Revolving Credit Facility), with Bank of America, N.A. as the Administrative Agent. The Revolving Credit Facility becomes payable in full on February 22, 2024 and is available for general corporate purposes, including, among others, to finance acquisitions and capital expenditures. The Revolving Credit Facility has never been utilized.\nIn connection with an acquisition, we amended our credit agreement (Amended Credit Agreement) on October 16, 2019. The amendment provided for a new $500.0 million unsecured term loan facility to partially finance the acquisition. The term loan was funded on November 1, 2019 and matures on November 1, 2024. Principal on the term loan will be payable on the last business day of each fiscal quarter commencing on March 31, 2022 at a rate of 1.25% per quarter, increasing to 2.50% per quarter after the next four fiscal quarters. We repaid $75.0 million of the unsecured term loan balance in January 2020 prior to the scheduled maturity dates in 2022 ($25.0 million) and 2023 ($50.0 million). In June 2021, we repaid $26.0 million of the unsecured term loan balance prior to the scheduled maturity dates in 2024.\nIn connection with the acquisition of AGI, we entered into a credit agreement (AGI Credit Agreement) on November 9, 2020, with Bank of America, N.A. as the Administrative Agent. The AGI Credit Agreement provided for a new $375.0 million unsecured term loan facility to finance a portion of the cash consideration for the acquisition. The term loan was funded on December 1, 2020 and matures on November 1, 2024. Principal on the term loan will be payable on the last business day of each fiscal quarter commencing on March 31, 2022 at a rate of 1.25% per quarter, increasing to 2.50% per quarter after the next four fiscal quarters. We repaid $19.0 million of the unsecured term loan balance in June 2021 prior to the scheduled maturity dates in 2022 ($18.8 million) and 2023 ($0.2 million).\nBorrowings under the Amended Credit Agreement and the AGI Credit Agreement (collectively, the Credit Agreements) accrue interest at the Eurodollar rate plus an applicable margin or at the base rate, at our election. For the quarter ended December 31, 2021, we elected to apply the Eurodollar rate. The base rate is the applicable margin plus the highest of (i) the federal funds rate plus 0.500%, (ii) the Bank of America prime rate and (iii) the Eurodollar rate plus 1.000%. The applicable margin for these borrowings is a percentage per annum based on the lower of (1) a pricing level determined by our then-current consolidated leverage ratio and (2) a pricing level determined by our debt ratings (if such debt ratings exist). This results in a margin ranging from 1.125% to 1.750% and 0.125% to 0.750% for the Eurodollar rate and base rate, respectively.\nThe weighted-average interest rates in effect for the years ended December 31, 2021 and 2020 were 1.37% and 2.09%, respectively. As of December 31, 2021, the rate in effect for the Credit Agreements was 1.35%.\nThe Credit Agreements contain language in the event the Eurodollar rate is not available due to LIBOR changes. If this occurs, the base rate will be used for borrowings. However, we may work with the Administrative Agent to amend the Credit Agreements to replace the Eurodollar rate with (i) one or more rates based on the Secured Overnight Financing Rate (SOFR); or (ii) another alternative benchmark rate, subject to the lenders' approval.\nThe Credit Agreements contain customary representations and warranties, affirmative and negative covenants and events of default. The Credit Agreements also each contain a financial covenant requiring us to maintain a consolidated leverage ratio of indebtedness to earnings before interest, taxes, depreciation and amortization not exceeding 3.50 to 1.00 as of the end of any fiscal quarter (for the four-quarter period ending on such date) with an opportunity for a temporary increase in such consolidated leverage ratio to 4.00 to 1.00 upon the consummation of certain qualified acquisitions for which the aggregate consideration is at least $250.0 million.\nAs of December 31, 2021 and December 31, 2020, the carrying values of the term loans were $753.6 million, which is net of $1.4 million of unamortized debt issuance costs, and $798.1 million, which is net of $1.9 million of unamortized debt issuance costs, respectively. We were in compliance with all covenants as of December 31, 2021 and December 31, 2020.\nAs of December 31, 2021, scheduled maturities of total debt for each of the three succeeding fiscal years are as follows:\n11.Income Taxes\nIncome before income tax provision included the following components:\nThe provision for income taxes was composed of the following:\nThe reconciliation of the U.S. federal statutory tax rate to the consolidated effective tax rate was as follows:\nThe components of deferred tax assets and liabilities are as follows:\nThe net decrease in the valuation allowance was primarily due to currency fluctuations on balances relating to foreign jurisdictions, partially offset by other increases in unrealizable tax assets. As of each reporting date, management considers new evidence, both positive and negative, that could affect the future realization of deferred tax assets. If management determines it is more likely than not that an asset, or a portion of an asset, will not be realized, a valuation allowance is recorded.\nAs of December 31, 2021, we had federal net operating loss carryforwards of $14.8 million, which are subject to limitations of their utilization. Losses totaling $13.4 million are not currently subject to expiration dates, while the remaining $1.4 million of losses expire between 2025 - 2037. Deferred tax assets of $2.2 million have been recorded for state operating loss carryforwards. These losses expire between 2031 - 2042, and are subject to limitations on their utilization. We had total foreign net operating loss carryforwards of $173.2 million, of which $141.3 million are not currently subject to expiration dates. The remainder, $31.9 million, expires between 2025 - 2037. We had tax credit carryforwards of $6.6 million, of which $1.1 million are subject to limitations on their utilization. Of these tax credit carryforwards, $1.0 million are not currently subject to expiration dates. The remainder, $5.6 million, expires in various years between 2023 - 2041.\nIn general, it is our intention to permanently reinvest all earnings in excess of previously taxed amounts. Substantially all of the pre-2018 earnings of our non-U.S. subsidiaries were taxed through the transition tax imposed as part of the Tax Cuts and Jobs Act of 2017 and post-2018 current earnings are taxed as part of global intangible low-taxed income tax expense. These taxes increase our previously taxed earnings and allow for the repatriation of the majority of our foreign earnings without any residual U.S. federal tax. While we believe that the financial reporting bases may be greater than the tax bases of investments in foreign subsidiaries for any earnings in excess of previously taxed amounts, such amounts are considered permanently reinvested. The cumulative temporary difference related to such permanently reinvested earnings is $70.0 million, and we would anticipate the tax effect on those earnings to be immaterial.\nThe following is a reconciliation of the total amounts of unrecognized tax benefits:\nWe believe that it is reasonably possible that $3.5 million of uncertain tax positions included in the table above may be resolved within the next twelve months as a result of settlement with a taxing authority or a lapse of the statute of limitations. If the unrecognized tax benefit as of December 31, 2021 were to be recognized, a benefit of $16.4 million would impact the effective tax rate.\nWe recognize interest and penalties related to income taxes as income tax expense. We recorded penalty expense of $1.8 million, $0.2 million and $0.5 million for the years ended December 31, 2021, 2020 and 2019, respectively. We recorded interest income of $0.2 million for the year ended December 31, 2021 and interest expense of $0.3 million and less than $0.1 million for the years ended December 31, 2020, and 2019, respectively. As of December 31, 2021, we accrued a liability for penalties of $7.2 million and interest of $5.2 million. As of December 31, 2020, we accrued a liability for penalties of $5.5 million and interest of $5.4 million.\nWe are subject to taxation in the U.S. and various states and foreign jurisdictions. In the U.S., our only major tax jurisdiction, the 2018 - 2021 tax years are open to examination by the Internal Revenue Service.\n12.Pension and Profit-Sharing Plans\nWe have a 401(k) plan for all qualifying domestic employees that permits participants to defer a portion of their pay pursuant to Section 401(k) of the Internal Revenue Code. We make matching contributions on behalf of each eligible participant in an amount equal to 100% of the first 3% and an additional 25% of the next 5%, for a maximum total of 4.25% of the employee's eligible compensation. We may make discretionary matching contributions. We may also make discretionary nonelective contributions in an amount to be determined by the Board of Directors for each Plan Year, provided the employee is employed at the end of the year and has worked at least 1,000 hours. Domestic employees of acquired businesses may participate in the 401(k) plan when their benefits are transitioned. We also maintain and contribute to various defined contribution and defined benefit pension arrangements for our international employees. We meet the minimum statutory funding requirements for our foreign plans. As of December 31, 2021 and 2020, the total unfunded portions of the defined benefit obligations were $9.2 million and $13.5 million, respectively.\nExpenses related to our retirement programs were $20.0 million in 2021, $18.7 million in 2020 and $16.3 million in 2019.\n13.Non-Compete and Employment Agreements\nOur employees have signed agreements under which they have agreed not to disclose trade secrets or confidential information that, where legally permitted, restrict engagement in or connection with any business that is competitive with us anywhere in the world while employed by us (and, in some cases, for specified periods thereafter in relevant geographic areas), and that any products or technology created by them during their term of employment are our property. In addition, we require all channel partners to enter into agreements not to disclose our trade secrets and other proprietary information.\nWe have an employment agreement with our Chief Executive Officer. Under the terms of the employment agreement, in the event that the Chief Executive Officer’s employment with us is terminated by us without “Cause” or as a result of his resignation with “Good Reason,” (each as defined in the agreement) the Chief Executive Officer will be entitled to (i) receive an amount equal to two times the sum of his then effective base salary plus his target bonus, payable over 24 months in equal\ninstallments, (ii) in certain circumstances, a monthly payment would be made by us of an amount equal to the employer health insurance contribution amount that would have been paid to the Chief Executive Officer for at most 24 months following such termination and (iii) the period of time during which the Chief Executive Officer may exercise his vested stock options shall be extended to the longer of (x) three months after his date of termination or (y) seven days after the commencement of our first open trading window that occurs after the date of termination, but in no event later than the 10-year expiration date of such options. During his employment with us and for two years thereafter, following termination of employment under certain circumstances described in the contract, he will be subject to non-competition and non-solicitation obligations.\nIf a termination under the circumstances described above occurs during the period beginning 60 days prior to the effective date of a definitive agreement that will result in a change in control and ending 18 months after the consummation (closing) of a change in control, then, in lieu of the benefits described in the foregoing paragraph, the Chief Executive Officer will be entitled to (a) the amounts described in clause (i) above, which will be paid in a lump sum in certain circumstances rather than over 24 months, (b) the acceleration and vesting of all outstanding stock-based awards held by the Chief Executive Officer, subject to any performance or metric-based requirements set forth therein which shall be separately determined as set forth in the applicable award agreement and (c) in certain circumstances, a monthly payment by us of an amount equal to the employer health insurance contribution amount that would have been paid to the Chief Executive Officer for at most 24 months following such termination.\nWe also have employment agreements with several other employees, primarily in foreign jurisdictions. The terms of these employment agreements generally include annual compensation and non-compete clauses.\n14.Stock-Based Compensation\nOn May 14, 2021, our stockholders approved the ANSYS, Inc. 2021 Equity and Incentive Compensation Plan (the 2021 Plan). The 2021 Plan is a long-term incentive plan pursuant to which awards may be granted to directors, officers, other employees and certain consultants of Ansys and its subsidiaries. These awards include stock option rights, stock appreciation rights, restricted stock, restricted stock units, cash incentives, performance shares, performance units and other awards. The 2021 Plan authorizes 4.4 million shares of common stock for issuance, plus 1.6 million shares that remained available for issuance under the Fifth Amended and Restated ANSYS, Inc. 1996 Stock Option and Grant Plan (the Predecessor Plan) as of the effective date of the 2021 Plan plus any shares relating to the outstanding awards under the Predecessor Plan or the 2021 Plan that are subsequently forfeited. As of the effective date of the 2021 Plan, grants were no longer made under the Predecessor Plan.\nThe 2021 Plan requires a minimum vesting period or performance period of one year for most award types and a maximum period for options to be exercisable as ten years from the grant date. Upon the death or disability of a participant, performance awards are vested pro-rata, subject to any performance target requirements, and all other awards become fully vested. The Compensation Committee of the Board of Directors may, at its sole discretion, accelerate the date or dates on which an award granted under the 2021 Plan may vest in the event of a change in control or an employee's termination of employment. A change in control will result in awards either being assumed by the acquirer or the pre-existing awards becoming immediately vested and earned at target award levels. In the event an employee is terminated without cause within 18 months after the change in control, any assumed awards will become immediately vested.\nWe currently issue shares related to exercised stock options or vested awards from our existing pool of treasury shares and have no specific policy to repurchase treasury shares as stock options are exercised or as awards vest. If the treasury pool is depleted, we will issue new shares.\nTotal stock-based compensation expense recognized for the years ended December 31, 2021, 2020 and 2019 is as follows:\nAs of December 31, 2021, total unrecognized estimated compensation expense related to awards granted prior to that date was $180.0 million, which is expected to be recognized over a weighted average period of 1.4 years. Forfeitures of awards are accounted for as they occur.\nStock Options\nPrior to 2017, we granted stock option awards. The value of each stock option award was estimated on the date of grant, or date of acquisition for options issued in a business combination, using the Black-Scholes option pricing model (Black-Scholes model). The determination of the fair value of stock-based payment awards using an option pricing model was affected by our stock price as well as assumptions regarding a number of complex and subjective variables. These variables included our stock volatility during the preceding six years, actual and projected employee stock option exercise behaviors, interest rate assumptions using the five-year U.S. Treasury Note yield on the date of grant or acquisition date, and expected dividends. The stock-based compensation expense for options was recorded ratably over the requisite service period.\nAs of December 31, 2021, there is no unrecognized estimated compensation cost related to unvested stock options.\nInformation regarding stock option transactions is summarized below:\nInformation regarding stock options outstanding as of December 31, 2021 is summarized below:\nThere were no unvested stock options as of December 31, 2021.\nRestricted Stock Units\nUnder the terms of the 2021 Plan, we issue various restricted stock unit awards (RSUs). The following table summarizes the types of awards and vesting conditions:\nThe fair value of RSUs with only a service condition is based on the fair market value of our stock on the date of the grant and is recognized straight-line over the vesting period.\nThe fair value of RSUs with operating performance metrics is based on the fair market value of our stock on the date of the grant and is recognized from the grant date through the vesting period based on management's estimates concerning the probability of operating performance metric achievement.\nThe fair values of RSUs with a market condition were estimated using a Monte Carlo simulation model and are recognized over the vesting period. The determination of the fair values of the awards was affected by the grant date and several variables, each of which has been identified in the chart below:\nTotal compensation expense for employee RSU awards recorded for the years ended December 31, 2021, 2020 and 2019 was $160.2 million, $138.3 million and $109.9 million, respectively.\nInformation regarding all employee RSU transactions is summarized below:\n(1) Includes all RSUs granted during the year. RSUs with operating performance conditions are issued annually and have one performance cycle or three sub-performance cycles. Performance conditions are assigned near the beginning of each performance cycle or sub-performance cycle, as applicable, and awards are reflected as grants at the target number of units at that time.\n(2) RSUs with a market or performance condition are granted at target and vest based on achievement of the market or operating performance and service conditions. The actual number of RSUs issued may be more or less than the target RSUs depending on the achievement of the market or operating performance conditions.\nBoard of Directors\nPrior to 2016, we granted deferred stock awards to non-employee Directors, which are rights to receive shares of common stock upon termination of service as a Director. Associated with these awards, we established a non-qualified 409(a) deferred compensation plan with assets held under a rabbi trust to provide Directors an opportunity to diversify their vested awards. During open trading windows and at their elective option, the Directors may convert their Ansys shares into a variety of non-Ansys-stock investment options in order to diversify a portion of their holdings, subject to meeting ownership guidelines.\nInformation regarding deferred stock awards to non-employee Directors is summarized below:\nInformation regarding RSU awards to non-employee Directors is summarized below:\nThe RSUs to non-employee Directors vest in full upon the earlier of one year from the date of grant or the date of the next regular meeting of stockholders. If a non-employee Director retires prior to the vest date, the non-employee Director receives a pro-rata portion of the RSUs. Total compensation expense associated with the awards recorded for the years ended December 31, 2021, 2020 and 2019 was $2.1 million, $2.2 million and $2.5 million, respectively.\nEmployee Stock Purchase Plan\nOur 1996 Employee Stock Purchase Plan (the “Purchase Plan”) was adopted by the Board of Directors on April 19, 1996 and was subsequently approved by our stockholders. The stockholders approved an amendment to the Purchase Plan in May 2016 to increase the number of shares available for offerings to 1.8 million shares of which 0.1 million shares are available for future purchases as of December 31, 2021. The Purchase Plan is administered by the Compensation Committee. Offerings under the Purchase Plan commence on each February 1 and August 1, and have a duration of six months. An employee who owns or is deemed to own shares of stock representing in excess of 5% of the combined voting power of all classes of our stock may not participate in the Purchase Plan.\nDuring each offering, an eligible employee may purchase shares under the Purchase Plan by authorizing payroll deductions of up to 10% of his or her cash compensation during the offering period. The maximum number of shares that may be purchased by any participating employee during any offering period is limited to 3,840 shares (as adjusted by the Compensation Committee from time to time). Unless the employee has previously withdrawn from the offering, his or her accumulated payroll\ndeductions will be used to purchase common stock on the last business day of the period at a price equal to 90% of the fair market value of the common stock on the first or last day of the offering period, whichever is lower. Under applicable tax rules, an employee may not accrue the right to purchase more than $25,000 of common stock, based on the grant-date fair value, in any calendar year in which the option is outstanding at any time. As of December 31, 2021, 1.7 million shares of common stock had been issued under the Purchase Plan. The total compensation expense recorded under the Purchase Plan during the years ended December 31, 2021, 2020 and 2019 was $4.0 million, $4.1 million and $2.0 million, respectively.\n15.Stock Repurchase Program\nUnder our stock repurchase program, we repurchased shares as follows:\nAs of December 31, 2021, 2.5 million shares remained available for repurchase under the program.\n16.Royalty Agreements\nWe have entered into various renewable license agreements under which we have been granted access to the licensor's technology and the right to sell the technology in our product line. Royalties are payable to developers of the software at various rates and amounts, which generally are based upon unit sales, revenue or flat fees. Royalty fees are reported in cost of software licenses and were $36.9 million, $29.6 million and $22.4 million for the years ended December 31, 2021, 2020 and 2019, respectively.\n17.Geographic Information\nRevenue to external customers is attributed to individual countries based upon the location of the customer. Revenue by geographic area was as follows:\nProperty and equipment by geographic area was as follows:\n18.Unconditional Purchase Obligations\nWe have entered into various unconditional purchase obligations which primarily include minimum royalty contracts, software licenses and support, and network services. We expended $44.9 million, $37.2 million and $24.2 million related to unconditional purchase obligations that existed as of the beginning of each year for the years ended December 31, 2021, 2020 and 2019, respectively. Future expenditures under unconditional purchase obligations in effect as of December 31, 2021 are as follows:\n19.Contingencies and Commitments\nWe are subject to various claims, investigations, and legal and regulatory proceedings that arise in the ordinary course of business, including, but not limited to, commercial disputes, labor and employment matters, tax audits, alleged infringement of third party's intellectual property rights and other matters. In our opinion, the resolution of pending matters is not expected to have a material adverse effect on our consolidated results of operations, cash flows or financial position. However, each of these matters is subject to various uncertainties and it is possible that an unfavorable resolution of one or more of these proceedings could materially affect our results of operations, cash flows or financial position.\nOur Indian subsidiary has several service tax audits pending that have resulted in formal inquiries being received on transactions through mid-2012. We could incur tax charges and related liabilities of $7.5 million. As such charges are not probable at this time, a reserve has not been recorded on the consolidated balance sheet as of December 31, 2021. The service tax issues raised in our notices and inquiries are very similar to the case, M/s Microsoft Corporation (I) (P) Ltd. Vs. Commissioner of Service Tax, New Delhi, wherein the Delhi Customs, Excise and Service Tax Appellate Tribunal (CESTAT) issued a favorable ruling to Microsoft. The Microsoft ruling was subsequently challenged in the Supreme Court by the Indian tax authority and a decision is still pending. We can provide no assurances on the impact that the present Microsoft case's decision will have on our cases, however, an unfavorable ruling in the Microsoft case may impact our assessment of probability and result in the recording of a $7.5 million reserve. We are uncertain as to when these service tax matters will be concluded.\nWe sell software licenses and services to our customers under contractual agreements. Such agreements generally include certain provisions indemnifying the customer against claims, by third parties, of infringement or misappropriation of their intellectual property rights arising from such customer’s usage of our products or services. To date, payments related to these indemnification provisions have been immaterial. For several reasons, including the lack of prior material indemnification claims, we cannot determine the maximum amount of potential future payments, if any, related to such indemnification provisions.\nSCHEDULE II\nANSYS, INC. AND SUBSIDIARIES\nValuation and Qualifying Accounts\nEXHIBIT INDEX\nExhibit No. Exhibit\n3.1 Restated Certificate of Incorporation of the Company (filed as Exhibit 3.1 to the Company’s Annual Report on Form 10-K, filed February 27, 2020, and incorporated herein by reference).\n3.2 Third Amended and Restated By-laws of the Company (filed as Exhibit 3.1 to the Company's Current Report on Form 8-K, filed January 19, 2018, and incorporated herein by reference).\n4.1 Description of Securities (filed as Exhibit 4.1 to the Company’s Annual Report on Form 10-K, filed February 27, 2020, and incorporated herein by reference).\n10.1 Form of Indemnification Agreement between ANSYS, Inc. and Non-Employee Directors (filed as Exhibit 10.1 to the Company's Current Report on Form 8-K, filed March 20, 2013, and incorporated herein by reference).*\n10.2 Non-Employee Director Deferred Compensation Plan (filed as Exhibit 10.2 to the Company's Quarterly Report on Form 10-Q, filed November 7, 2019, and incorporated herein by reference).*\n10.3 Executive Severance Plan, as amended and restated, dated July 29, 2014 (filed as Exhibit 10.3 to the Company’s Annual Report on Form 10-K, filed February 27, 2020, and incorporated herein by reference).*\n10.4 Fourth Amended and Restated ANSYS, Inc. 1996 Stock Option and Grant Plan (filed as Exhibit 10.1 to the Company's Current Report on Form 8-K, filed May 17, 2011, and incorporated herein by reference).*\n10.5 Form of Deferred Stock Unit Agreement under the Fourth Amended and Restated ANSYS, Inc. 1996 Stock Option and Grant Plan (filed as Exhibit 10.5 to the Company's Annual Report on Form 10-K, filed February 27, 2020, and incorporated herein by reference).*\n10.6 Form of Employee Non-Qualified Stock Option Agreement under the Fourth Amended and Restated ANSYS, Inc. 1996 Stock Option and Grant Plan (filed as Exhibit 10.1 to the Company's Quarterly Report on Form 10-Q, filed May 2, 2013, and incorporated herein by reference).*\n10.7 Fifth Amended and Restated ANSYS, Inc. 1996 Stock Option and Grant Plan (filed as Appendix 1 to the registrant’s Definitive Proxy Statement on Schedule 14A filed with the SEC on March 31, 2016 and incorporated herein by reference).*\n10.8 Form of Non-Qualified Stock Option Agreement under the Fifth Amended and Restated ANSYS, Inc. 1996 Stock Option and Grant Plan (filed as Exhibit 10.36 to the Company's Annual Report on Form 10-K, filed February 23, 2017, and incorporated herein by reference).*\n10.9 2018 Form of Restricted Stock Unit Agreement under the Fifth Amended and Restated ANSYS, Inc. 1996 Stock Option and Grant Plan (filed as Exhibit 10.11 to the Company’s Annual Report on Form 10-K, filed February 27, 2020, and incorporated herein by reference).*\n10.10 2019 Form of Restricted Stock Unit Agreement under the Fifth Amended and Restated ANSYS, Inc. 1996 Stock Option and Grant Plan (filed as Exhibit 10.12 to the Company’s Annual Report on Form 10-K, filed February 27, 2020, and incorporated herein by reference).*\n10.11 Form of Restricted Stock Unit Award Agreement (Non-Employee Directors) under the Fifth Amended and Restated ANSYS, Inc. 1996 Stock Option and Grant Plan (filed as Exhibit 10.13 to the Company’s Annual Report on Form 10-K, filed February 27, 2020, and incorporated herein by reference).*\n10.12 2019 Form of Award Notice (Annual Contract Value) under the Fifth Amended and Restated ANSYS, Inc. 1996 Stock Option and Grant Plan (filed as Exhibit 10.16 to the Company’s Annual Report on Form 10-K, filed February 27, 2020, and incorporated herein by reference).*\n10.13 2019 Form of Award Notice (Total Shareholder Return) under the Fifth Amended and Restated ANSYS, Inc. 1996 Stock Option and Grant Plan (filed as Exhibit 10.14 to the Company’s Annual Report on Form 10-K, filed February 24, 2021 and incorporated herein by reference).*\n10.14 2019 Form of Special Performance Stock Unit Agreement under the Fifth Amended and Restated ANSYS, Inc. 1996 Stock Option and Grant Plan (filed as Exhibit 10.18 to the Company’s Annual Report on Form 10-K, filed February 27, 2020, and incorporated herein by reference).*\n10.15 2020 Form of Award Notice (Total Shareholder Return) under the Fifth Amended and Restated ANSYS, Inc. 1996 Stock Option and Grant Plan (filed as Exhibit 10.24 to the Company’s Quarterly Report on Form 10-Q, filed May 6, 2020, and incorporated herein by reference).*\n10.16 2020 Form of Award Notice (Annual Contract Value) under the Fifth Amended and Restated ANSYS, Inc. 1996 Stock Option and Grant Plan (filed as Exhibit 10.17 to the Company’s Annual Report on Form 10-K, filed February 24, 2021, and incorporated herein by reference).*\n10.17 2021 Form of Award Notice (Annual Contract Value) under the Fifth Amended and Restated ANSYS, Inc. 1996 Stock Option and Grant Plan (filed as Exhibit 10.24 to the Company’s Quarterly Report on Form 10-Q, filed May 5, 2021, and incorporated herein by reference).*\n10.18 2021 Form of Award Notice (Total Shareholder Return) under the Fifth Amended and Restated ANSYS, Inc. 1996 Stock Option and Grant Plan (filed as Exhibit 10.25 to the Company’s Quarterly Report on Form 10-Q, filed May 5, 2021, and incorporated herein by reference).*\n10.19 2021 Form of Restricted Stock Unit Agreement under the Fifth Amended and Restated ANSYS, Inc. 1996 Stock Option and Grant Plan (filed as Exhibit 10.26 to the Company’s Quarterly Report on Form 10-Q, filed May 5, 2021, and incorporated herein by reference).*\n10.20 Employment Agreement between ANSYS, Inc. and Ajei S. Gopal, dated August 29, 2016 (filed as Exhibit 10.1 to the Company's Current Report on Form 8-K, filed August 29, 2016, and incorporated herein by reference).*\n10.21 Form of Non-Qualified Stock Option Agreement with Ajei S. Gopal (filed as Exhibit 10.3 to the Company's Current Report on Form 8-K, filed August 29, 2016, and incorporated herein by reference).*\n10.22 Lease by and between ANSYS, Inc. and Quattro Investment Group, L.P., dated as of September 14, 2012 (filed as Exhibit 10.1 to the Company's Current Report on Form 8-K, filed September 18, 2012, and incorporated herein by reference).\n10.23 Credit Agreement, dated as of February 22, 2019, among ANSYS, Inc. as borrower, Bank of America, N.A. as Administrative Agent, Swing Line Lender and an L/C issuer, the lenders party thereto, and the other L/C Issuers party thereto (filed as Exhibit 10.1 to the Company’s Quarterly Report on Form 10-Q, filed May 2, 2019, and incorporated herein by reference).\n10.24 First Amendment to Credit Agreement dated October 16, 2019, among ANSYS, Inc., as borrower, Bank of America, N.A., as Administrative Agent, and the lenders party thereto (filed as Exhibit 10.1 to the Company's Current Report on Form 8-K, filed October 21, 2019, and incorporated herein by reference).\n10.25 Credit Agreement, dated as of November 9, 2020, among ANSYS, Inc., as borrower, Bank of America, N.A., as Administrative Agent, and the lenders party thereto (filed as Exhibit 10.1 to the Company’s Current Report on Form 8-K, filed November 12, 2020, and incorporated herein by reference).\n10.26 ANSYS, Inc. 2021 Equity and Incentive Compensation Plan (filed as Exhibit 99.1 to the Company’s Current Report on Form 8-K, filed May 18, 2021, and incorporated herein by reference).*\n10.27 Form of Notice of Grant of Performance-Based Restricted Stock Units and Agreement (Total Shareholder Return) under the ANSYS, Inc. 2021 Equity and Incentive Compensation Plan (filed as Exhibit 10.28 to the Company’s Quarterly Report on Form 10-Q, filed August 4, 2021, and incorporated herein by reference).*\n10.28 Form of Notice of Grant of Performance-Based Restricted Stock Units and Agreement (Operating Metrics) under the ANSYS, Inc. 2021 Equity and Incentive Compensation Plan (filed as Exhibit 10.29 to the Company’s Quarterly Report on Form 10-Q, filed August 4, 2021, and incorporated herein by reference).*\n10.29 Form of Notice of Grant of Restricted Stock Units and Agreement (Non-Employee Director) under the ANSYS, Inc. 2021 Equity and Incentive Compensation Plan (filed as Exhibit 10.30 to the Company’s Quarterly Report on Form 10-Q, filed August 4, 2021, and incorporated herein by reference).*\n10.30 Form of Notice of Grant of Restricted Stock Units and Award Notice and Agreement (Employee) under the ANSYS, Inc. 2021 Equity and Incentive Compensation Plan (filed as Exhibit 10.31 to the Company’s Quarterly Report on Form 10-Q, filed August 4, 2021, and incorporated herein by reference).*\n10.31 Separation Agreement between ANSYS, Inc. and Maria Shields, dated December 30, 2021.\n10.32 Consulting Services Agreement between ANSYS, Inc. and Maria Shields, dated December 30, 2021.\n21.1 Subsidiaries of the Registrant.\n23.1 Consent of Deloitte & Touche LLP, independent registered public accounting firm.\n24.1 Powers of Attorney. Contained on the Signatures page of the Company's Annual Report on Form 10-K for the fiscal year ended December 31, 2021 and incorporated herein by reference.\n31.1 Certification of Chief Executive Officer pursuant to Section 302 of the Sarbanes-Oxley Act of 2002.\n31.2 Certification of Chief Financial Officer pursuant to Section 302 of the Sarbanes-Oxley Act of 2002.\n32.1 Certification of Chief Executive Officer pursuant to 18 U.S.C. Section 1350, as adopted pursuant to Section 906 of the Sarbanes-Oxley Act of 2002.\n32.2 Certification of Chief Financial Officer pursuant to 18 U.S.C. Section 1350, as adopted pursuant to Section 906 of the Sarbanes-Oxley Act of 2002.\n101.INS Inline XBRL Instance Document (the instance document does not appear in the Interactive Data File because its XBRL tags are embedded within the Inline XBRL document)\n101.SCH Inline XBRL Taxonomy Extension Schema\n101.CAL Inline XBRL Taxonomy Extension Calculation Linkbase\n101.DEF Inline XBRL Taxonomy Extension Definition Linkbase\n101.LAB Inline XBRL Taxonomy Extension Label Linkbase\n101.PRE Inline XBRL Taxonomy Extension Presentation Linkbase\n104 Cover Page Interactive Data File (formatted as Inline XBRL and contained in Exhibit 101)\n* Indicates management contract or compensatory plan, contract or arrangement.",
    "item_16": "ITEM 16.FORM 10-K SUMMARY\nNone.",
    "stock_ticker": "ANSS"
}