{
    "cik": "1013462",
    "company": "ANSYS INC",
    "filing_type": "10-K",
    "filing_date": "2020-02-27",
    "period_of_report": "2019-12-31",
    "sic": "7372",
    "state_of_inc": "DE",
    "state_location": "PA",
    "fiscal_year_end": "1231",
    "filing_html_index": "https://www.sec.gov/Archives/edgar/data/1013462/0001013462-20-000004-index.html",
    "htm_filing_link": "https://www.sec.gov/Archives/edgar/data/1013462/000101346220000004/anss2019123110k.htm",
    "complete_text_filing_link": "https://www.sec.gov/Archives/edgar/data/1013462/0001013462-20-000004.txt",
    "filename": "1013462_10K_2019_0001013462-20-000004.htm",
    "item_1": "ITEM 1.\nBUSINESS\nANSYS, Inc. (Ansys, we, us, our), a Delaware corporation formed in 1994, develops and globally markets engineering simulation software and services widely used by engineers, designers, researchers and students across a broad spectrum of industries and academia, including aerospace and defense, automotive, electronics, semiconductors, energy, materials and chemical processing, turbomachinery, consumer products, healthcare, and sports. Headquartered south of Pittsburgh, Pennsylvania, we employed approximately 4,100 people as of December 31, 2019. We focus on the development of open and flexible solutions that enable users to analyze designs directly on the desktop, providing a common platform for fast, efficient and cost-conscious product development, from design concept to final-stage testing and validation. We distribute our suite of simulation technologies through a global network of independent resellers and distributors (collectively, channel partners) and direct sales offices in strategic, global locations. It is our intention to continue to maintain this hybrid sales and distribution model. We operate and report as one segment.\nOur product portfolio consists of the following:\nPlatform\nAnsys Workbench™ is the framework upon which our suite of advanced engineering simulation technologies is built. The innovative project schematic view ties together the entire simulation process, guiding the user through complex multiphysics analyses with drag-and-drop simplicity. With bi-directional computer-aided design (CAD) connectivity, powerful highly-automated meshing, a project-level update mechanism, pervasive parameter management and integrated optimization tools, the Ansys Workbench platform enables Pervasive Engineering Simulation™.\nOur Workbench framework allows engineers and designers to incorporate the compounding effects of multiple physics into a virtual prototype of their design and simulate its operation under real-world conditions. As product architectures become smaller, lighter and more complex, companies must be able to accurately predict how products will behave in real-world environments where multiple types of physics interact in a coupled way. Our multiphysics software enables engineers to simulate the interactions between structures, heat transfer, fluids and electronics all within a single, unified engineering simulation environment.\nAnsys Workbench enables companies to create a customized simulation environment to deploy specialized simulation best practices and automations unique to their product development process or industry. With Ansys ACT™, our partners and end users can modify the user interface, process simulation data or embed third-party applications to create specialized tools based on Ansys Workbench.\nOur high-performance computing (HPC) product suite enables enhanced insight into product performance and improves the productivity of the design process. The HPC product suite delivers cross-physics parallel processing capabilities for the full spectrum of our simulation software by supporting structures, fluids, thermal and electronics simulations. This product suite decreases turnaround time for individual simulations, allowing users to consider multiple design ideas and make the right design decisions early in the design cycle.\nRefer to the section titled \"New Product Offerings\" for solutions added to our platform offerings in 2019.\nStructures\nOur structural analysis product suite offers simulation tools for product design and optimization that increase productivity, minimize physical prototyping and help to deliver better and more innovative products in less time. These tools tackle real-world analysis problems by making product development less costly and more reliable. In addition, these tools have capabilities that cover a broad range of analysis types, elements, contacts, materials, equation solvers and coupled physics capabilities, all targeted toward understanding and solving complex design problems. We also provide comprehensive topology optimization tools that engineers use to design structural components to meet loading requirements with minimal material and component weight. We offer a complete simulation workflow for additive manufacturing that allows reliable 3D printing by simulating the laser sintering process and delivering compensated CAD geometries that ensure reliable printed parts.\nFluids\nOur fluids product suite enables modeling of fluid flow and other related physical phenomena. Fluid flow analysis capabilities provide all the tools needed to design and optimize new fluids equipment and to troubleshoot already existing installations. The suite contains general-purpose computational fluid dynamics software and specialized products to address specific industry applications.\nElectromagnetics\nOur electromagnetics product suite provides field simulation software for designing high-performance electronic and electromechanical products. The software streamlines the design process and predicts performance of mobile communication and internet-access devices, broadband networking components and systems, integrated circuits (ICs) and printed circuit boards (PCBs), as well as electromechanical systems such as automotive components and power electronics equipment, all prior to building a prototype.\nSemiconductors\nAdvancements in semiconductor design and manufacturing enable smaller electronic architectures. Shrinking geometries, especially in the emerging 3D IC, FinFET and stacked-die architectures, reveal design challenges related to power and reliability. Our power analysis and optimization software suite manages the power budget, power delivery integrity and power-induced noise in an electronic design, from initial prototyping to system sign-off. These solutions deliver accuracy with correlation to silicon measurement; the capacity to handle an entire electronic system, including IC, package and PCB, efficiently for ease-of-debugging and fast turnaround time; and comprehensiveness to facilitate cross-domain communications and electronic ecosystem enablement.\nEmbedded Software\nOur SCADE® product suite is a comprehensive solution for embedded software simulation, code production and automated certification. It has been developed specifically for use in critical systems with high dependability requirements, including aerospace, rail transportation, nuclear, industrial and automotive applications. SCADE software supports the entire development workflow, from requirements analysis and design, through verification, implementation and deployment. SCADE solutions easily integrate with each other and the rest of our product suite, allowing for development optimization and increased communication among team members.\nSystems\nWe deliver a unique and comprehensive system simulation capability that is ideal for the design of today's increasingly automated products. This collaborative environment leverages our multiphysics, multibody dynamics, circuit and embedded software simulation capabilities, enabling users to simulate the complex interactions between components, circuits and control software within a single environment. These technologies provide a complete view into predicted product performance, which creates greater design confidence for engineers.\n3D Design\nOur Discovery™ product family allows every engineer to benefit from the insight of simulation in their product design. The Discovery products range from early design exploration tools powered by interactive real-time simulation and intuitive geometry editing, to detailed product validation solutions utilizing proven flagship solver technology with easy-to-use guided workflows. These tools allow for design engineers of all levels of expertise to utilize simulation across the entire product design process and to work seamlessly with simulation experts using our flagship products for even more advanced analysis.\nOptical\nUsing optical sensor and closed-loop, real-time simulation, our capabilities now span the simulation of all sensors, including lidar, cameras and radar; the multiphysics simulation of physical and electronic components; the analysis of systems functional safety; as well as the automated development of safety-certified embedded software. This functionality can be integrated into a closed-loop simulation environment that interacts with weather and traffic simulators, enabling thousands of driving scenarios to be executed virtually.\nMaterials\nAnsys Granta products give our customers access to material intelligence, including data that is critical to simulations. Refer to the section titled \"New Product Offerings\" for additional discussion around our materials offerings.\nAcademic\nOur academic product suite provides a highly scalable portfolio of academic products based on several usage tiers, including associate, research and teaching. Each tier includes various non-commercial products that bundle a broad range of physics and advanced coupled field solver capabilities. The academic product suite provides entry-level tools intended for class demonstrations and hands-on instruction. It includes flexible terms of use and more complex analysis suitable for doctoral and post-doctoral research projects. We also provide a special product at no cost to students that is suitable for use away from the classroom and in non-commercial applications.\nPRODUCT DEVELOPMENT\nWe make significant investments in research and development and emphasize frequent, integrated product releases. Our product development strategy centers on ongoing development and innovation of new technologies to increase productivity and to provide engineering simulation solutions that customers can integrate into enterprise-wide product lifecycle management (PLM) systems. Our product development efforts focus on extensions of the full product line with new functional modules, further integration with CAD, electronic CAD (ECAD) and PLM products, and the development of new products. Our products run on the most widely-used engineering computing platforms and operating systems, including Windows, Linux and most UNIX workstations.\nOur total research and development expenses were $298.2 million, $233.8 million and $202.7 million in 2019, 2018 and 2017, respectively, or 19.7%, 18.1% and 18.5% of total revenue, respectively. As of December 31, 2019 and 2018, our product development staff consisted of approximately 1,500 and 1,200 employees, respectively, most of whom hold advanced degrees and have industry experience in engineering, mathematics, computer science or related disciplines. We have traditionally\ninvested significant resources in research and development activities and intend to continue to make investments in expanding the ease of use and capabilities of our broad portfolio of simulation software products.\nWe recently completed the following major product development activities and releases:\n•\nIn January 2020, we released Ansys 2020 R1, which streamlines product development lifecycles and helps boost product performance with enhancements to the interfaces, functionality and power of our simulation solvers. Among these advances is Ansys Minerva, a knowledge management application platform that delivers an integrated suite of Ansys tools, fusing simulation and optimization to product lifecycle processes across any enterprise. Minerva spurs collaboration within global engineering teams and increases data sharing to innovate product designs and reduce development costs. From improving product development with Ansys Minerva to running complex simulations with substantially streamlined workflows with Ansys Fluent to optimizing electromagnetic design processes with Ansys HFSS, Ansys 2020 R1 helps enable companies to pioneer innovations and create cost-effective designs.\nTo leverage the combined benefits of cloud computing and best-in-class engineering simulation, we are partnering with Microsoft® Azure™ to create a secure cloud solution. In Ansys 2020 R1, Ansys Cloud™ introduced new licensing options to enable greater business flexibility. Companies can cost optimize cloud software usage by mixing elastic (usage-based) and traditional (leased or paid-up) licensing while accessing on-demand compute resources. In addition, within Ansys Mechanical, Ansys Fluent and Ansys Electronics Desktop, you can directly access HPC in the Cloud.\n•\nIn September 2019, we released Ansys 2019 R3, which strengthens our autonomous vehicles (AV) solutions with the addition of Ansys Autonomy. Ansys Autonomy enables engineers to develop safer AV through advanced closed-loop scenario simulation, automated driving and control software development, functional safety analysis, and sensor, camera, lidar, and radar simulation. Among a number of other enhancements to our product portfolio, Ansys 2019 R3 also includes the SPEOS Road Library for Sensors Simulation, a comprehensive, retro-reflecting materials database, as well as updates to Ansys HFSS SBR+ that provide greater accuracy in predicting radar cross sections of large targets with curvatures.\nAs fully autonomous vehicles edge closer to real-world deployment, operating safely becomes more critical than ever. AVs require rigorous testing in complex environments and under variable conditions. Physical testing would require billions of miles of driving or flying - a time-consuming, cost-prohibitive approach. Using simulation to virtually test AVs is the only viable option for validating systems safety and accelerating AV development. From sensors to virtual environments to artificial intelligence, Ansys 2019 R3 includes robust offerings that speed the safe development and deployment of AVs on the road and in the air.\n•\nIn June 2019, we released Ansys 2019 R2, which accelerates, streamlines and simplifies the product life cycle through new functionalities. With the new functionalities, including new materials capabilities for structural analysis following the acquisition of Granta Design Limited (Granta Design), our simulation solutions accelerate collaboration, validation and verification, creating a reliable digital thread throughout operations. The release also includes a revolutionary Ansys Mechanical™ user experience, simplified simulation of complex electronics and a new Ansys FluentTM workflow that significantly speeds meshing of dirty geometries.\nNew Product Offerings\nOur 2019 acquisitions, each a leader in their respective fields, are intended to bolster our strategy of Pervasive Engineering Simulation. The acquired technologies offer solutions that significantly enhance our portfolio, providing solutions valuable to our customers.\nThe acquisition of material intelligence leader Granta Design gives our customers access to material intelligence, including data that is critical to successful simulations. With Granta Design technology, our customers benefit from access to the world's premier system for managing corporate material intelligence and the market-leading solution for materials sources, selection and management. Ansys Granta MI is a leading system for materials information management in engineering enterprises. Ansys Granta Selector is the standard tool for materials selection and graphical analysis of materials properties. A comprehensive materials data library plus unique software tools enable engineers to use materials to innovate and evolve products, quickly identify solutions to material issues, confirm and validate choice of materials, and reduce material and development costs. CES EduPack is a unique set of teaching resources that supports materials education across engineering, design, science and sustainable development. Granta Materials Data for Simulation provides easy access to materials property data from within Ansys Mechanical and the Ansys Electronics Desktop environment.\nThe acquisition of Helic, Inc. (Helic), an industry-leading provider of electromagnetic (EM) crosstalk solutions for systems on chips, combined with our flagship electromagnetic and semiconductor solvers, provides a comprehensive solution for on-chip, 3DIC and chip-package-system electromagnetics and noise analysis. Helic’s software products (VeloceRF, RaptorX, Exalto and Pharos) help engineers analyze and mitigate the risk of on-chip EM crosstalk, which can lead to silicon failure and time to market delays. VeloceRF is an inductive device synthesizer and modeler for geometries as small as 5 nm and frequencies up to 110Ghz. RaptorX is an electromagnetic modeling, extraction and analysis tool for chip designs pre-layout-vs-schematic (LVS). Exalto is a post-LVS resistance, capacitance, self and mutual inductance (RLCk) extraction tool for electromagnetic coupling. Pharos is a tool that identifies wires that are susceptible to EM and substrate crosstalk.\nThe acquisition of DfR Solutions' electronics reliability technology, combined with our existing multiphysics portfolio, gives customers a complete designer-level solution to analyze for electronics failure earlier in the design cycle. DfR Solutions' Sherlock is the industry's only automated design reliability analysis software. Sherlock revolutionizes electronic design by empowering designers to simulate real-world conditions and accurately model PCBs and assemblies to predict solder fatigue due to thermal, mechanical, and shock and vibration conditions. During pre-processing, Sherlock automatically translates ECAD and MCAE data into 3D finite element models in minutes. In post-processing, Sherlock automates thermal derating and democratizes the thermal and mechanical analysis of electronics - meaning analysis is done in minutes rather than weeks. Sherlock seamlessly integrates with already existing simulation workflows in the hardware design process making Ansys SIwave, Ansys Icepak and Ansys Mechanical users more efficient. It directly connects simulation to material and manufacturing costs.\nOur acquisition of Livermore Software Technology (LST) and its technologies empower customers to solve a new class of engineering challenges, including developing safer automobiles, aircraft and trains while reducing or even eliminating the need for costly physical testing. LST's LS-DYNA is an advanced general-purpose multiphysics simulation software package that can simulate many complex, real-world problems. LS-DYNA is the most advanced multiphysics simulation technology for high-speed, short-duration events (for example, a cell phone drop or automotive crash). Additionally, the acquisition results in an even tighter integration between LS-DYNA and Ansys Workbench (already a leading pre- and post-processor for LS-DYNA) computations. Most automotive companies use LS-DYNA to design and optimize automobile components or entire vehicles to produce safe cars for consumers. Companies all over the world have developed a trust in LST for their vehicle development process due to deep technical relationships. While we have partnered with LST for years, their industry-leading vehicle crash capabilities were not traditionally part of our offerings. Now, we have much greater access and available know-how in those industries to sell the rest of our platform.\nOur acquisition of Dynardo, a leading provider of multidisciplinary analysis and optimization technology, gives customers access to a full suite of process integration and robust design tools - empowering users to identify optimal product designs faster and more economically. Dynardo’s flagship offering, optiSLang, is a comprehensive multi-disciplinary design optimization solution with a full suite of multi-objective optimization, sensitivity, reliability, and robust design capabilities. Customers of all sizes and across industries leverage optiSlang to integrate chained simulation flows and automate execution for design space exploration and optimization, greatly reducing development time and accelerating the evaluation of optimal product design alternatives for cost and performance. Ansys optiSLang has an intuitive graphical user interface that enables engineers to connect computer-aided design tools together in a way that captures both the simulation process automation and workflows, such as sensitivity analysis or robust design optimization. Ansys optiSLang supports interfacing with most software tools used in virtual product development.\nAnsys Minerva is a centralized knowledge management application engineered with an open and vendor-neutral architecture that improves multiphysics collaboration by making data, project plans and analytics easily accessible in one place so team members across the world and in different functional silos can work with the same, most up-to-date information. Minerva improves productivity and maximizes the value of existing engineering technology investments by providing simulation process and data management, life cycle traceability, process integration, design optimization and simulation-driven data science capabilities. Available for both on-premise and cloud deployment, Minerva connects to most leading product life cycle management systems.\nPRODUCT QUALITY\nOur employees generally perform product development tasks according to predefined quality plans, procedures and work instructions. Certain technical support tasks are also subject to a quality process. These plans define, for each project, the methods to be used, the responsibilities of project participants and the quality objectives to be met. The majority of software products are developed under a quality system that is certified to the ISO 9001:2015 standard. We establish quality plans for our products and services, and subject product designs to multiple levels of testing and verification in accordance with processes established under our quality system.\nSALES AND MARKETING\nWe distribute and support our products through our own direct sales offices, as well as a global network of independent channel partners. This channel partner network provides us with a cost-effective, highly-specialized channel of distribution and technical support. It also enables us to draw on business and technical expertise from a global network, provides relative stability to our operations to help mitigate geography-specific economic trends and provides us with an opportunity to take advantage of new geographic markets or enhance our sales coverage in existing markets.\nThe channel partners sell our products to new customers, expand installations within the existing customer base, offer training and consulting services, and provide the first line of our technical support. Our channel partner certification process helps to ensure that each channel partner has the ongoing capability to adequately represent our expanding product lines and to provide an acceptable level of training, consultation and customer support. We derived 22.9%, 22.4% and 24.8% of our total revenue through the indirect sales channel for the years ended December 31, 2019, 2018 and 2017, respectively.\nWe also have a direct sales organization to develop an enterprise-wide, focused sales approach and to implement a worldwide go-to-market account strategy. The sales management organization also functions as a focal point for requests from the channel partners and provides additional support in strategic locations through the presence of direct sales offices.\nDuring 2019, we continued to invest in our existing domestic and international strategic sales offices. In total, our direct sales organization comprised 2,100 and 1,700 employees as of December 31, 2019 and 2018, respectively, who were responsible for the sales, technical support, consulting services, marketing initiatives and administrative activities designed to support our overall revenue growth and expansion strategies.\nOur products are utilized by organizations ranging in size from small consulting firms to the world's largest industrial companies. No single customer accounted for more than 5% of our revenue in 2019, 2018 or 2017.\nInformation with respect to foreign and domestic revenue may be found in Note 17 to the consolidated financial statements in Part IV, Item 15 of this Annual Report on Form 10-K and in the section entitled “Management's Discussion and Analysis of Financial Condition and Results of Operations” in Part II, Item 7 of this Annual Report on Form 10-K.\nSTRATEGIC ALLIANCES AND MARKETING RELATIONSHIPS\nWe have established and continued to pursue strategic alliances with advanced technology suppliers, cloud computing providers, hardware vendors, specialized application developers, and CAD, ECAD and PLM providers. We believe that these relationships facilitate accelerated incorporation of advanced technology into our products, provide access to new customers, expand our sales channels, develop specialized product applications and provide direct integration with leading CAD, electronic design automation (EDA), product data management and PLM systems.\nWe have technical and marketing relationships with leading CAD vendors, such as Autodesk, PTC and Siemens Digital Industries, to provide direct links between products. These links facilitate the transfer of electronic data models between the CAD systems and our products.\nWe partnered with PTC to accelerate product innovation by providing customers a world-class simulation-driven design solution. Working together, we are delivering Ansys Discovery Live real-time simulation within PTC’s Creo® 3D CAD software. The combined solution, Creo Simulation Live, is sold by PTC as part of the Creo product suite. This solution offers customers a unified modeling and simulation environment, removing the boundaries between CAD and simulation and enabling design engineers to gain insight into each of the many design decisions they make throughout the product development process. This insight enables design engineers to create higher quality products, while reducing product and development costs.\nSimilarly, we maintain marketing and software development relationships with leading EDA software companies, including Cadence Design Systems, Synopsys, Mentor Graphics, Zuken and National Instruments. These relationships support the transfer of data between electronics design and layout software and our electronics simulation portfolio. In 2017, we entered into an integration and distribution agreement with Synopsys to cooperatively integrate Ansys RedHawk technology into an in-design add-on to a Synopsys design tool for the primary purpose of providing customers with direct, in-design access to the RedHawk technology's capabilities.\nWe also have relationships with Siemens and Spatial Corporation to provide the 3D modeling kernel and format translation technologies upon which our in-house geometry modeling software solutions are built.\nThe main method we employ to democratize HPC to a wider audience is through partnerships with a number of companies, such as cloud computing providers, HPC hardware manufacturers and supercomputing centers such as HLRS in Stuttgart,\nGermany. In 2019, we launched a new cloud service fully managed by us and developed in collaboration with Microsoft Azure that provides on-demand access to HPC directly from within our flagship applications. We also collaborated with Flexera to improve our elastic licensing solution by now supporting on-premise use and internet-based usage monitoring. We added Hewlett Packard Enterprises and Dell Technologies as new members to the HPC appliance program that is designed to simplify and accelerate HPC cluster deployment.\nOur open cloud strategy allows us to work with various public cloud providers and cloud-hosting partners. This approach makes it easy for customers to use the same workflows on-premise and in the Cloud. Cloud-hosting partners such as Nimbix, Rescale and Gompute provide cloud access to us and/or third-party applications for customers having very complex workflows or other restrictive security certification requirements. Furthermore, we continued to enjoy mutually-committed alliances with large cloud platform providers such as Microsoft, AWS, Google and Alibaba. In 2018, we entered into an agreement with SAP SE (SAP) to embed our pervasive simulation solutions for digital twins into SAP's market-leading digital supply chain, manufacturing and asset management portfolio. The partnership's first solution launched in 2019 and runs on the SAP Cloud Platform and empowers industrial asset operators to optimize operations and maintenance through real-time engineering insights, which reduces product cycle times and increases profitability.\nOur Partner Program actively encourages developers of specialized software solutions to use our technology as a development platform for their applications and provides customers with enhanced functionality related to their use of our software. With more than 200 active solution partnerships, spanning a wide range of technologies, including materials, optimization, electronics, optical, mechanical, fluid and systems simulation, our partner ecosystem extends the depth and breadth of our technology offerings.\nWe have a software license agreement with HBM that provides the advanced fatigue capabilities of nCode DesignLife™, a leading durability software from HBM. nCode DesignLife™ technology leverages the open architecture of our platform and enables mechanical engineers to more easily address complex product life and durability issues before a prototype is built. A similar agreement was executed with VirtualMotion to offer Ansys Motion™ as a tightly-integrated, next-generation capability for simulating complex multi-body mechanisms and assemblies.\nCOMPETITION\nWe believe that the principal factors affecting sales of our software include ease of use, breadth and depth of functionality, flexibility, quality, ease of integration with other software systems, file compatibility across computer platforms, range of supported computer platforms, performance, price and total cost of ownership, customer service and support, company reputation and financial viability, and effectiveness of sales and marketing efforts.\nWe continue to experience competition across all markets for our products and services. Our competitors include large, global, publicly traded companies; small, geographically-focused firms; startup firms; and solutions produced in-house by the end users. Some of our current and possible future competitors have greater financial, technical, marketing and other resources than us, and some have well-established relationships with current and potential customers of ours. Our current and possible future competitors also include firms that have elected, or may in the future elect, to compete by means of open source licensing. These competitive pressures may result in decreased sales volumes, price reductions and/or increased operating costs, and could result in lower revenues, margins and net income.\nPROPRIETARY RIGHTS AND LICENSES\nWe regard our software as proprietary and rely on a combination of trade secret, copyright, patent and trademark laws, license agreements, nondisclosure and other contractual provisions, and technical measures to protect our proprietary rights in our products. We distribute our software products under software license agreements that predominantly grant customers nonexclusive licenses, which are typically nontransferable, for the use of our products. License agreements for our products are generally directly between us and end users. Use of the licensed software product is restricted to specified sites unless the customer obtains a multi-site license for its use of the software product or the software product is by its nature a multi-site use product. Software security measures are also employed to prevent unauthorized use of our software products and the licensed software is subject to terms and conditions prohibiting unauthorized use or reproduction. For most products, customers may purchase a perpetual license of the technology with the right to annually purchase ongoing maintenance, technical support and upgrades, or may lease the product on a fixed-term basis for a fee that includes the license, maintenance, technical support and upgrades. For some products, customers purchase an annual subscription for a certain number of named users that includes the license, maintenance, technical support and upgrades or purchase elastic units hosted by our Cloud and use any supported product at any time until their licensed volume is met.\nWe license our software products utilizing a combination of web-based and hard-copy license terms and forms. For certain software products, we primarily rely on \"click-wrapped\" licenses (i.e. online agreements where the website provider posts terms and conditions, and the user clicks on the \"accept\" button). The enforceability of these types of agreements under the laws of some jurisdictions is uncertain.\nWe also seek to protect the source code of our software as a trade secret and as registered unpublished copyrighted work. We have obtained federal trademark registration protection for Ansys and other marks in the U.S. and foreign countries. Additionally, we were awarded numerous patents by the U.S. Patent and Trademark Office and have a number of patent applications pending. To the extent we do not choose to seek patent protection for our intellectual property, we primarily rely on the protection of our source code as a trade secret. We seek additional protection of our proprietary rights in our source code via copyright registrations.\nOur employees have signed agreements under which they have agreed not to disclose trade secrets or confidential information. These agreements, where legally permitted, restrict engagement in or connection with any business that is competitive with us anywhere in the world while employed by us (and, in some cases, for specified periods thereafter) and state that any products or technology created by employees during their term of employment are our property. In addition, we require all channel partners to enter into agreements not to disclose our trade secrets and other proprietary information.\nDespite these precautions, there can be no assurance that misappropriation of our technology and proprietary information (including source code) will be prevented. Further, there can be no assurance that copyright, trademark, patent and trade secret protection will be available for our products in certain jurisdictions, or that restrictions on the ability of employees and channel partners to engage in activities competitive with us will be enforceable. Costly and time-consuming litigation could be necessary in the future to enforce our rights to our trade secrets and proprietary information or to enforce our patent rights and copyrights, and it is possible that, in the future, our competitors may be able to obtain our trade secrets or to independently develop similar, unpatented technology.\nThe software development industry is characterized by rapid technological change. Therefore, we believe that factors such as the technological and creative skills of our personnel, new product developments, frequent product enhancements, name recognition and reliable product maintenance are also important to establishing and maintaining technology leadership in addition to the various legal protections of our technology that may be available.\nWe do not believe that any of our products infringe upon the proprietary rights of third parties. There can be no assurance, however, that third parties will not claim such infringement by us or our licensors or licensees with respect to current or future products. In addition, there are non-practicing entities (NPEs) and patent assertion entities (PAEs) whose business models are built on not producing any products but rather extracting payments from revenue generating companies through patent infringement assertions and/or litigation. We expect that software suppliers will increasingly be subject to the risk of such claims as the number of products and suppliers continues to expand and the functionality of products continues to increase. Any such claims, with or without merit, could be time consuming, result in costly litigation, cause product release delays or require us to enter into royalty or licensing agreements. Such royalty or licensing agreements, if required, may not be available on terms acceptable to us.\nSEASONAL VARIATIONS\nOur business has experienced seasonality, including quarterly reductions in software sales resulting from slowdowns of customer activities during the summer months, particularly in Europe, as well as from the seasonal purchasing and budgeting patterns of our global customers. Lease and maintenance contract renewals are typically highest in the first and fourth quarters. Our revenue is typically highest in the fourth quarter.\nDEFERRED REVENUE AND BACKLOG\nDeferred revenue consists of billings made or payments received in advance of revenue recognition from customer agreements. The deferred revenue on our consolidated balance sheets does not represent the total value of annual or multi-year, noncancellable agreements. Our backlog represents installment billings for periods beyond the current quarterly billing cycle. Our deferred revenue and backlog as of December 31, 2019 and 2018 consisted of the following:\nRevenue associated with deferred revenue and backlog that will be recognized in the subsequent twelve months is classified as current in the tables above.\nEMPLOYEES\nAs of December 31, 2019, we employed approximately 4,100 people. At that date, there were also contract personnel and co-op students providing ongoing development services and technical support. Certain employees are subject to collective bargaining agreements and have local work councils.\nACQUISITIONS\nWe make targeted acquisitions in order to support our long-term strategic direction, accelerate innovation, provide increased capabilities to our existing products, supply new products and services, expand our customer base and enhance our distribution channels.\n2019 Acquisitions\nOn November 1, 2019, we completed the acquisition of 100% of the shares of LST for a purchase price of $777.8 million.\nOn February 1, 2019, we completed the acquisition of 100% of the shares of Granta Design for a purchase price of $208.7 million.\nAdditionally, during the year ended December 31, 2019, we acquired Dynardo, Helic and DfR Solutions to combine the acquired technologies with our existing comprehensive multiphysics portfolio. These acquisitions were not individually significant. The combined purchase price of these acquisitions was $136.2 million.\nThe 2019 acquisitions are further described in the table below:\n2018 Acquisition\nOn May 2, 2018, we completed the acquisition of 100% of the shares of OPTIS, a premier provider of software for scientific simulation of light, human vision and physics-based visualization, for a purchase price of $291.0 million. The acquisition extended our portfolio into the area of optical simulation to provide comprehensive sensor solutions, covering visible and infrared light, electromagnetics and acoustics for camera, radar and lidar.\n2017 Acquisitions\nDuring the year ended December 31, 2017, we completed various acquisitions which were not individually significant. The combined purchase price of the acquisitions was approximately $67.0 million.\nThe 2017 technology acquisitions are further described in the table below:\nFor further information on our business combinations, see Note 4 to the consolidated financial statements included in Part IV, Item 15 of this Annual Report on Form 10-K.\nAVAILABLE INFORMATION\nOur website is www.ansys.com and our investor relations website is https://investors.ansys.com. We make available on our investor relations website, free of charge, Annual Reports on Form 10-K, Quarterly Reports on Form 10-Q, interactive data files, Current Reports on Form 8-K, reports filed pursuant to Section 16 and amendments to those reports filed or furnished pursuant to Section 13(a) or 15(d) of the Securities Exchange Act of 1934, as amended, as soon as reasonably practicable after such materials are electronically filed or furnished to the Securities and Exchange Commission (SEC). Our reports may also be obtained by accessing the EDGAR database of the SEC's website at www.sec.gov.",
    "item_1A": "ITEM 1A.\nRISK FACTORS\nThe following are important factors we have identified that could affect our future results and an investment in our common stock. In addition, from time to time we provide information, including information contained in this Annual Report on Form 10-K, that contains forward-looking statements concerning, among other things, projected financial performance, total addressable market, market and industry sector growth, product development and commercialization or other aspects of future operations. Such statements are based on the assumptions and expectations of our management at the time such statements are made. We caution investors that our performance and any forward-looking statements are subject to risks and uncertainties, including but not limited to, the following:\nGlobal Operational Risks\nAdverse economic and geopolitical conditions may impact our operations and financial performance.\nOur operations and performance depend significantly on global macroeconomic, specific foreign country and U.S. domestic economic conditions. Adverse conditions in the macroeconomic environment may result in a decreased demand for our products and services, constrained credit and liquidity, reduced government spending and volatility in equity and foreign exchange markets. In addition, to the extent the global economy experiences a significant downturn or volatility, we may be exposed to impairments of certain assets if their values deteriorate. Tighter credit due to economic conditions may diminish our future borrowing ability and increase borrowing costs under our existing credit facilities. Customers' ability to pay for our products and services may also be impaired, which could lead to an increase in our allowance for doubtful accounts and write-offs of accounts receivable.\nA majority of our business comes from outside the U.S. and our customers supply a wide array of goods and services to most of the world’s major economic regions. International revenue represented 57.9%, 60.9% and 61.9% of our total revenue for the years ended December 31, 2019, 2018 and 2017, respectively. In fiscal year 2019, our largest geographic revenue bases included the U.S., Japan, Germany and South Korea.\nIf any of the foreign economies in which we do business deteriorates or suffers a period of uncertainty, our business and performance may be negatively impacted through reduced customer and government spending, changes in purchasing cycles or timing, reduced access to credit for our customers, or other factors impacting our international sales and collections. Furthermore, customer spending levels in any foreign jurisdiction may be adversely impacted by changes in domestic policies, including tax and trade policies. For example, the United Kingdom withdrew from the European Union effective as of January 31, 2020 and is now in a period of transition until the end of 2020. We have significant operations in the United Kingdom and the European Union. It remains unclear as to what the terms of the new relationship between the United Kingdom and the European Union will be. Terms that are disadvantageous to us, including those related to trade, tax and the movement of people across borders could negatively impact our results.\nA substantial portion of our license and maintenance revenue is derived from annual lease and maintenance contracts which typically have a high rate of customer renewal. If the rate of renewal for these contracts is adversely affected by economic or other factors, our lease license and maintenance growth will be adversely affected. As a result, our business, financial position, results of operations and cash flows may also be adversely impacted during those periods.\nWe face compliance risk as a result of our international operations and our sales model, including pertaining to anti-corruption and data privacy laws.\nThe laws with which we need to comply due to our international operations vary from country to country and are subject to frequent change and interpretation. In May 2018, the General Data Protection Regulation (GDPR), which governs data privacy practices within the European Economic Area (EEA), went into effect. The law, which applies to our data processing activities within the EEA, as well as the processing of EEA citizen data globally, imposes various compliance obligations related to the handling of personal data in the delivery of our products and services and to business operations involving employee data. Compliance with the GDPR has and will continue to require deployment of substantial resources and increased costs. If we fail to comply with the GDPR, it may lead to regulatory enforcement actions, which can result in monetary penalties of up to 4% of annual worldwide revenue, private lawsuits, extensive and prescriptive consent decrees or judgments that may require additional resources or expenses for compliance and may cause reputational damage.\nIn the U.S., California implemented the California Consumer Protection Act (CCPA) as of January 2020, which requires compliance measures similar to those of the GDPR and establishes the first state standard for a comprehensive set of data privacy rights. Several other states have proposed data privacy laws that would impose obligations on us with respect to how we collect and use personal data, including customer data. In order to comply with U.S. state laws, as well as any data breach notification laws that vary across states, we may be required to invest in additional resources or tools to manage our data\nprocessing activities. If we fail to comply with the requirements of U.S. data privacy and data breach notification laws, we will be subject to state monetary fines, consent decrees issued by the Federal Trade Commission, and possible reputational damage.\nOur global reach, including within countries considered high-risk environments for public corruption, exposes us to risks associated with violations of anti-bribery laws such as the U.S. Foreign Corrupt Practices Act and the U.K. Bribery Act. We develop and sell software and consulting services and maintain support operations in more than 40 countries whose laws and practices differ from one another and are subject to unexpected changes. Managing these geographically diverse operations requires significant attention and resources to ensure compliance. To promote compliance, we forbid our agents and employees from engaging in corrupt behavior and have implemented a compliance plan to prevent and detect violations of anti-corruption laws. There remains, however, a risk that illegal conduct could occur thereby exposing us to the financial and reputational risks associated with a violation of anti-corruption laws.\nNoncompliance with these regulations could adversely impact our financial results or stock price as well as divert management time and effort.\nWe are subject to trade restrictions that could impact our ability to sell to customers and result in liability for violations.\nDue to the global nature of our business, we are subject to import and export restrictions and regulations that prohibit the shipment or provision of certain products and services to certain countries, governments and persons targeted by the U.S., including the Export Administration Regulations administered by the U.S. Bureau of Industry and Security (BIS) and economic and trade sanctions administered by the U.S. Treasury Department’s Office of Foreign Assets Control (OFAC). During the second quarter of 2019, the BIS placed certain entities on the Entity List. Certain of our existing and prospective customers, including Huawei, were included in this list. In addition, restrictions implemented by OFAC restrict our ability to sell to some companies in certain countries, such as Russia. The Entity List and OFAC restrictions limit our ability to deliver products and services to these customers and, in the absence of a license, our ability to sell products and services to these customers in the future. The inclusion of companies on the Entity List may encourage them to seek substitute products from competitors who are not subject to these restrictions or to develop their own products. We cannot predict whether or when any changes will be made that eliminate or decrease these limitations on our ability to sell products and provide services to these customers. Additionally, other customers may continue to be added to the Entity List and/or be subjected to trade restrictions. There may be indirect impacts that cannot be quantified, including that our business may also be impacted by other trade restrictions that may be imposed by the U.S., China, or other countries. Restrictions on our ability to sell and ship to customers could have an adverse effect on our business, results of operations or financial condition.\nViolators of these export controls may be subject to significant penalties, which may include considerable monetary fines, criminal proceedings against them and their officers and employees, a denial of export privileges, and suspension or debarment from selling products or services to the federal government. Any such penalties could have an adverse effect on our business, financial condition, operating results and cash flows. In addition, the political and media scrutiny surrounding any governmental investigation could cause significant expense and reputational harm and distract senior executives from managing normal day-to-day operations.\nOur products could also be shipped to denied parties by third parties, including our channel partners. Even though we take precautions to ensure that our channel partners comply with all relevant import and export regulations, any failure by channel partners to comply with such regulations could have negative consequences for us, including reputational harm, government investigations and penalties.\nThe effect of foreign exchange rate fluctuation may adversely impact our revenue, expenses, cash flows and financial conditions.\nAs a result of our significant international presence, we have revenue, expenses, cash, accounts receivable and payment obligations denominated in foreign currencies, most notably the British Pound, Euro, Japanese Yen, South Korean Won and Indian Rupee. Our revenue and operating results are adversely affected when the U.S. Dollar strengthens relative to foreign currencies and are positively affected when the U.S. Dollar weakens relative to foreign currencies. If the U.S. Dollar strengthens relative to other currencies, certain channel partners who pay us in U.S. Dollars may have trouble paying on time or may have trouble distributing our products due to the impact of the currency exchange fluctuation on such channel partner's cash flows. This may impact our ability to distribute our products into certain regions and markets.\nWe seek to reduce our currency exchange transaction risks primarily through our normal operating and treasury activities, including derivative instruments, but there can be no assurance that these activities will be successful in reducing these risks. In addition, we incur transaction fees in the usage of such derivative instruments. Changes in currency exchange rates will affect our financial position, results of operations and cash flows.\nA natural disaster or catastrophic event may disrupt our business.\nA significant portion of our software development personnel, source code and computer equipment is located at operating facilities in the U.S., Canada, India, Japan and throughout Europe. The occurrence of a natural disaster or other unforeseen catastrophe at any of these facilities could cause disruptions to our operations, services and product development activities. Additionally, if we experience problems that impair our business infrastructure, such as a computer virus, telephone system failure or an intentional disruption of our information technology systems by a third party, these disruptions could have a material adverse effect on our business, financial position, results of operations, cash flows and the ability to meet financial reporting deadlines. Further, because our sales are not generally consistent across quarterly periods, the potential adverse effects resulting from any of the events described above or any other disruption of our business could be accentuated if they occur close to the end of a fiscal quarter.\nIn addition, our business could be adversely affected by the effects of a widespread outbreak of contagious disease, including the recent outbreak of respiratory illness caused by a novel coronavirus first identified in Wuhan, Hubei Province, China. Any outbreak of contagious diseases, and other adverse public health developments, may cause us or our customers to temporarily suspend operations in the affected city or country. In addition, a significant outbreak of contagious diseases in the human population could result in a widespread health crisis that could adversely affect the economies and financial markets of many countries, resulting in an economic downturn that could affect demand for our products, our ability to collect against existing trade receivables and our operating results.\nIndustry Operational Risks\nOur industry is highly competitive, which could result in downward pressure on our prices.\nWe continue to experience competition across all markets for our products and services. Some of our current and potential competitors have greater financial, technical, marketing and other resources than we do, and some have well-established relationships with our current and potential customers. Our current and potential competitors also include firms that have competed, or may in the future compete, by means of open source licensing. Companies we have, or could have, strategic alliances with could reduce or discontinue technical, software development and marketing relationships with us for competitive purposes. If our competitors offer deep discounts on certain products or services, or develop products that the marketplace considers more valuable, we may need to lower prices or offer discounts or other favorable terms in order to compete successfully. Our maintenance products, which include software license updates and product support fees, are generally priced as a percentage of new software license fees. Our competitors may offer lower percentage pricing on product updates and support. Some competitors may bundle software products for promotional purposes or as a long-term pricing strategy or provide guarantees of prices, product implementations or wider geographical license usage provisions. Any of these practices could, over time, significantly constrain the prices that we can charge for certain products.\nFurthermore, if we do not adapt pricing models to reflect changes in customer usage of our products or changes in customer demand, our new software license revenues could decrease. Additionally, increased distribution of applications through application service providers, including software-as-a-service providers, may reduce the average price of our products or adversely affect other sales of our products, reducing new software license revenues unless we can offset price reductions with volume increases.\nThese competitive pressures may result in decreased sales volumes, price reductions and/or increased operating costs, and could result in lower revenues, margins and net income.\nWe may not be successful in developing and marketing new products to adequately address the rapidly changing technology industry.\nWe operate in an industry generally characterized by rapidly changing technology and frequent new product introductions, which can render existing products obsolete or unmarketable. A major factor in our future success will be our ability to anticipate technological changes and to develop and introduce, in a timely manner, new products to meet those changes. Our ability to grow revenue will be dependent on our ability to respond to customer needs in the areas of, among others, 5G, autonomous vehicles, Industrial Internet of Things (IIoT) and electrification, and to leverage cloud computing and new computing platforms. In addition, our future success may depend on our ability to continue to develop a systems integrator ecosystem able to handle integrations and process and application development to address the challenge of the increasingly complex integration of our products’ different functionalities to address customers’ requirements. In addition, for those customers who authorize a third-party technology partner to access their data, we do not provide any warranty related to the functionality, security and integrity of the data transmission or processing. Despite contract provisions to protect us, customers may look to us to support and provide warranties for the third-party applications, integrations, data and content, even though not developed or sold by us, which may expose us to potential claims, liabilities and obligations, all of which could harm our business.\nWe devote substantial resources to research and development, which could cause our operating results to decline.\nWe devote substantial resources to research and development. New competitors, technological advances in the software development industry by us or our competitors, acquisitions, entry into new markets, or other competitive factors may require us to invest significantly greater resources than anticipated. If we are required to invest significantly greater resources than anticipated without a corresponding increase in revenue, operating results could decline. In addition, our periodic research and development expenses may be independent of our level of revenue, which could negatively impact financial results.\nThere can be no assurance that we will be successful in developing and marketing, on a timely basis, new products or product enhancements or that the new products will adequately address the changing needs of the marketplace or that we will successfully manage the transition from existing products. Software products as complex as those we offer may contain undetected errors when first introduced, or as new versions are released, and the likelihood of errors is increased as a result of our commitment to the frequency of product releases. There can be no assurance that errors will not be found in any new or enhanced products after the commencement of commercial shipments. Certain products require a higher level of sales and support expertise. Failure of our sales channel, particularly the independent channel partners, to obtain this expertise and to sell the new product offerings effectively could have an adverse impact on our sales in future periods. Any of these problems may result in the loss of or delay in customer acceptance, diversion of development resources, damage to our reputation, or increased service and warranty costs, any of which could have a material adverse effect on our business, financial position, results of operations and cash flows.\nConsolidation among our customers as well as our industry competitors may negatively impact our operating results.\nThere have been consolidations among our customers in the semiconductor, electronics and automotive industries, among others. This may result in the newly combined entity wanting the most favorable pricing from the former contracts and expecting larger volume discounts on future purchases. If a customer is acquired by an entity that does not utilize our products in favor of a competing product, we may not have future orders from the enterprise. Further, consolidation of our competitors may result in synergies that allow those competitors to benefit from broader sales channels and increased access to capital. Any of these impacts could adversely affect our business, financial position, results of operations and cash flows.\nThe price of our common stock is subject to volatility.\nThe market price of securities of software companies is subject to significant fluctuations. The valuation and trading price of our common stock may not be predictable. Factors that may adversely impact our share price include our failure to meet analyst expectations, reduced expectations regarding financial outlook, increases in our debt levels, changes in management or our material announcements or those of our competitors. In addition, volatility could result from causes that are unrelated to our operating performance such as conditions in the financial markets or the software industry generally.\nCompany Operational Risks\nWe are dependent upon our channel partners for a significant percentage of our revenue.\nWe distribute our products through a global network of independent channel partners, which accounted for 22.9%, 22.4% and 24.8% of our revenue during the years ended December 31, 2019, 2018 and 2017, respectively. Channel partners sell our software products to new and existing customers, expand installations within the existing customer base, offer consulting\nservices and provide the first line of technical support. In Asia-Pacific and EMEA, we are highly dependent upon our channel partners. Difficulties in ongoing relationships with channel partners, such as failure to meet performance criteria and differences in handling customer relationships, could adversely affect our performance. Additionally, the loss of any major channel partner, including a channel partner's decision to sell competing products rather than ours, could result in reduced revenue. Moreover, our future success will depend substantially on the ability and willingness of our channel partners to dedicate the resources necessary to promote our portfolio of products and to support a larger installed base within each of our geographic regions. If the channel partners are unable or unwilling to do so, we may be unable to sustain revenue growth.\nWe have been increasing the number of channel partners, particularly in international locations. The business relationships with these channel partners are recently established and could result in additional compliance burdens for us. In addition, these partners have a less-established payment history and revenue from these partners could come with a higher rate of bad debt expense. Where channel partners operate on our behalf to collect and process personal data of customer contacts, failure to comply with relevant data privacy laws in the handling of such personal data could result in our liability for any fines, civil suits or non-financial performance obligations imposed by regulatory authorities on these partners with respect to our customer data.\nWe may not be able to realize the potential benefit of our acquisitions and such acquisitions could pose risks to our business.\nWe consummate acquisitions to support our long-term strategic direction. We have completed a number of acquisitions in recent years, and in 2019 we acquired Granta Design, Helic, DfR Solutions, LST and Dynardo.\nAny acquisitions that we complete may present risks, including: difficulty in integrating the management teams, strategies, cultures and operations of the companies or businesses; failing to achieve anticipated synergies, revenue increases or cost savings; difficulty incorporating and integrating the acquired technologies or products with our existing product lines; difficulty with sales, distribution and marketing functions; failure to develop new products and services that utilize the technologies and resources of the companies; disruption of our ongoing business and diversion of management's attention to transition or integration issues; liabilities that were not identified during the buying process; the loss of our key employees, customers, partners and channel partners or those of the acquired company; and cybersecurity and data privacy risks, including any liabilities for failure to comply with data privacy laws and obligations for collection, use and retention of personal data.\nFuture acquisitions may involve the expenditure of significant cash resources; the incurrence of debt, which increases our interest expense and leverage; or the issuance of equity, which is dilutive to stockholders and may decrease earnings per share.\nWe allocate a portion of the purchase price to goodwill and intangible assets. If we do not recognize all the economic benefits of an acquisition, there could be an impairment of goodwill or intangible assets. Furthermore, impairment charges are generally not tax-deductible and will result in an increased effective income tax rate in the period the impairment is recorded.\nIf we do not achieve the anticipated benefits of our acquisitions as rapidly or to the extent anticipated by our management or the financial and industry analysts, there could be a material adverse effect on our stock price, business, financial position, results of operations and cash flows. Where customer contacts and leads are a significant consideration in the purchase price or expected financial outcome of an acquisition, failure to identify or mitigate data privacy concerns with the collection, use and retention of personal data may adversely impact our ability to use this information as anticipated and regulatory obligations may require that we delete all or a portion of the database, or take additional remediation measures before use. This may impact the value of the acquisition or reduce forecasted sales.\nThe implementation of a new CRM system may not achieve the corporate benefits initially identified in the anticipated time frame or at all.\nWe are in the process of implementing new functionality in our existing Customer Relationship Management (CRM) system. While this system is anticipated to simplify the demand generation, sales cycle, order processing and customer service activities, there is a risk that the project will not achieve the anticipated benefits or that the benefits will not be achieved as quickly as anticipated. There is also a risk that we will have to write off previously capitalized expenditures if the project is not successful or if implementation decisions regarding the project are modified. The project implementation timeline and scope may change and become longer and broader as new facets of the design and implementation efforts are undertaken. This may take the attention of key operational management away from other aspects of the business, including the integration of acquisitions, and may also result in increased consulting and software costs. These factors may have a significant negative impact on our business, financial position, profit, cash flows and reputation.\nIf we are unable to attract and retain key talent, our business could be adversely affected.\nOur success depends upon the continued service of our senior executives and our key technical and sales employees. Each of our executive officers and key technical personnel could terminate his or her relationship with us at any time. The loss of any of our senior executives or key personnel for which there has not been adequate knowledge-sharing and transfer might significantly delay or prevent the achievement of our business objectives and could materially harm our business and customer relationships.\nIn addition, because of the highly technical nature of our products and services, we must attract and retain highly skilled engineering and development personnel. The market for this talent is highly competitive and we have difficulty filling these roles for this reason. While we have historically recruited from outside of the U.S., in recent years our ability to do so has been curbed by more restrictive domestic immigration laws. If the immigration laws become even stricter or the processing of immigration requests becomes even more cumbersome or less efficient, or if we have less success in recruiting and retaining key personnel, our business, reputation and operating results could be materially and adversely affected.\nWe may be subject to proceedings that could harm our business.\nWe are subject to various investigations, claims and legal proceedings that arise in the ordinary course of business, including commercial disputes, labor and employment matters, tax audits and litigations, alleged infringement of intellectual property rights and other matters. Use or distribution of our products could generate product liability, regulatory infraction, or similar claims by our customers, end users, channel partners, government entities or other third parties. Sales and marketing activities that impact processing of personal data, as well as measures taken to ensure license compliance, may also result in claims by customers and individual employees of customers. Each of these matters is subject to various uncertainties, and it is possible that an unfavorable resolution of one or more of these matters could materially and adversely affect our results of operations, cash flows and financial position, as well as cause damage to our reputation.\nWe may not be able to continue to obtain licenses to third-party software and intellectual property on reasonable terms or at all, which may disrupt our business and harm our financial results.\nWe license third-party software and other intellectual property for use in product research and development and, in several instances, for inclusion in our products. We also license third-party software, including the software of our competitors, to test the interoperability of our products with other industry products and in connection with our professional services. These licenses may need to be renegotiated or renewed from time to time, or we may need to obtain new licenses in the future. Third parties may stop adequately supporting or maintaining their technology, or they or their technology may be acquired by our competitors. If we are unable to obtain licenses to such third-party software and intellectual property on reasonable terms or at all, we may not be able to sell the affected products, our customers’ use of the products may be interrupted, or our product development processes and professional services offerings may be disrupted, which could in turn harm our financial results, our customers' ability to utilize our software, and our reputation.\nWe may suffer reputational or financial harm if we have product standard or quality issues.\nWe have separate quality systems and registrations under the ISO 9001:2015 standard in addition to other governmental and industrial regulations. Our continued compliance with quality standards and favorable outcomes in periodic examinations is important to retain current customers and vital to procure new sales. If it was determined that we were not in compliance with various regulatory or ISO 9001 standards, our certificates of registration could be suspended, requiring remedial action and a time-consuming re-registration process. Product quality issues or failures could result in our reputation becoming diminished, resulting in a material adverse impact on revenue, operating margins, net income, financial position and cash flows.\nOur short-term and long-term sales forecast may not be accurate which could result in an adverse impact on our business.\nThe software business is generally characterized by long sales cycles. These long sales cycles increase the difficulty of predicting sales for any particular quarter. Many operational and strategic decisions are based upon short- and long-term sales forecasts. Our sales personnel continually monitor the status of proposals, including the estimated closing date and the value of the sale, in order to forecast quarterly sales. These forecasts are subject to significant estimation and are impacted by many external factors, including global economic conditions and the performance of our customers. A variation in actual sales activity from that forecasted could cause us to plan or budget incorrectly and, therefore, could adversely affect our business, financial position, results of operations and cash flows. Management also forecasts macroeconomic trends and developments and integrates them through long-range planning into budgets, research and development strategies and a wide variety of general management duties. Global economic conditions, and the effect those conditions and any disruptions in global markets have on our customers, may have a significant impact on the accuracy of our sales forecasts. These conditions may increase the likelihood or the magnitude of variations between actual sales activity and our sales forecasts and, as a result, our performance may be hindered because of a failure to properly match corporate strategy with economic conditions. This, in turn, may adversely affect our business, financial position, results of operations and cash flows. To the extent our forecasts are incorrect and, as a result, we fail to meet analyst expectations regarding financial performance or miss or reduce the financial guidance we give to investors, our share price may be adversely impacted.\nIntellectual Property and Cybersecurity Risks\nOur success is highly dependent upon the legal protection of our proprietary technology.\nWe primarily rely upon contracts and copyright, patent, trademark and trade secrets laws to protect our technology. We maintain intellectual property programs, including applying for patents, registering trademarks and copyrights, protecting trade secrets, entering into confidentiality agreements with our employees and channel partners, and limiting access to and distribution of our software, documentation and other proprietary information. However, software programs are particularly prone to piracy, which is a global phenomenon, and as a result we may lose revenue from the distribution of unlicensed software. Additionally, patent, copyright, trademark and trade secret protection do not provide the same coverage in every country in which we sell our products and services. Policing the unauthorized distribution and use of our products is difficult, and software piracy (including online piracy) is a persistent problem. While we continue to develop better mechanisms to detect and report or investigate unauthorized use of our software, we are also constrained by data privacy laws that restrict our ability to collect data about unlawful usage in some countries. We cannot assure that the steps we take to protect our proprietary technology are adequate to prevent misappropriation of our software by third parties, or that third parties will not be able to develop similar technology independently. Despite our efforts to prevent such activities, we may nonetheless lose significant revenue due to illegal use of our software.\nCostly and time-consuming litigation would be necessary to enforce and determine the scope of trade secret rights and related confidentiality and nondisclosure provisions across our contractual agreements and partnerships. While we are not aware that any of our technology infringes upon the rights of third parties, there can be no assurance that other parties will not assert technology infringement claims against us, or that, if asserted, such claims will not prevail. Any such litigation could be costly to defend, damage our reputation, and distract our employees from their daily work. Any successful infringement claims asserted against us could require us to develop technology workarounds for the impacted products or product development, which could be costly, disrupt product development, and delay go-to-market activities. Such disruption and delay could negatively impact our financial results.\nCyberattacks and security vulnerabilities could lead to reduced revenue, increased costs, liability claims, or harm to our reputation.\nWhile we undertake commercially reasonable efforts to maintain and improve the security and integrity of our products, source code, computer systems and data with respect to the relative sensitivity of such software, systems and data, the number of computer “hackers” developing and deploying destructive software programs that attack our products and computer systems continues to increase. We have incurred and will continue to incur additional costs to enhance our cybersecurity efforts. Because the tactics and tools used to obtain unauthorized access to networks or to sabotage systems are constantly evolving, we may be unable to implement adequate preventive measures. Such an attack could disrupt the proper functioning of our products, cause errors in the output of our customers' work, or allow unauthorized access to and disclosure of our sensitive, proprietary or confidential information or that of our customers and employees. In the event of a serious breach of our products or systems, or where a breach occurs due to our failure to implement reasonable and appropriate safeguards, our reputation may suffer, customers may stop buying products or may terminate current services, we could face lawsuits and potential civil liability, as well as regulatory fines and non-financial penalties for any personal data breach, and our financial performance could be negatively impacted.\nThere is also a danger of industrial espionage, cyberattacks, misuse, theft of information or assets (including source code), or damage to assets by people who have gained unauthorized access to our facilities, systems or information. This includes access to systems or information through email phishing attacks on our employees which has become a very prevalent technique used against companies, often delaying detection through increasingly complex practices. The objective of these attacks is often to acquire user account credentials in order to access other computer systems through linked accounts or where users have recycled passwords across systems.\nInadequate security practices or inadvertent acts or omissions by our employees and partners may also result in unauthorized access to our data. Employees or third parties may also intentionally compromise our or our customers’ security or systems. Such cybersecurity breaches, misuse of data or other disruptions could lead to loss of or unauthorized disclosure of our source code or other confidential information, unlicensed use and distribution of our products without compensation, illegal use of our products that could jeopardize the security of customer information stored in and transmitted through our computer systems, and theft, manipulation and destruction of proprietary data, resulting in defective products, performance downtimes and possible violation of export laws and other regulatory compliance requirements. Although we actively employ measures to combat such activities, preventing unauthorized access to our systems and data is inherently difficult. In addition, litigation to either pursue our legal rights or defend any claims against us could be costly and time-consuming and may divert management's attention and adversely affect the market's perception of us and our products.\nWe have experienced targeted and non-targeted cybersecurity attacks and incidents in the past that have resulted in unauthorized persons gaining access to our information and systems, and we could in the future experience similar attacks. To date, no cybersecurity incident or attack has had a material impact on our business, results of operations or financial condition.\nA number of our core processes, such as software development, sales and marketing, customer service and financial transactions, rely on IT infrastructure and applications. We also rely on third-party service providers and products, which are exposed to various security vulnerabilities outside of our control. Malicious software, sabotage and other cybersecurity breaches of the types discussed above could cause an outage of our infrastructure, which could cause short-term disruption in operations or, in the event of a longer disruption, lead to a substantial denial of service to our customers and ultimately to production downtime, recovery costs and customer claims for breach of contract, as well as reputational damage and impact to employee morale and productivity.\nWe rely on service providers for infrastructure and cloud-based products.\nWe use a number of third-party service providers for key components of our infrastructure, particularly with respect to development and delivery of our cloud-based products. The utilization of these service providers gives us greater flexibility in efficiently delivering a more tailored, scalable customer experience but also exposes us to additional risks and vulnerabilities. Those of our products and services that depend upon hosted components delivered by third parties are vulnerable to security risks inherent in web-based technologies, including greater risk of unauthorized access to or use of customers’ protected data. Interception of data transmission, misappropriation or modification of data, corruption of data and attacks by bad actors against our service providers may also adversely affect our products or product and service delivery. Malicious code, viruses or vulnerabilities that are undetected by our service providers may disrupt our business operations generally and may have a disproportionate effect on those of our products that are developed and delivered in the cloud environment. These risks, though largely outside our control, may impact customer perception of our products, service and support, and may damage our brand. While we devote resources to maintaining the security and integrity of our products and systems, as well as ensuring adequate due diligence for our third-party service providers, cloud security and reliability is inherently challenging. In the event of a material breach of data hosted by our service providers or a serious security incident on behalf of, caused by or experienced by a service provider, we may experience significant operational and technical difficulties, loss of data including customer data, diminished competitive position or reputation, and loss of customer engagement, which could result in civil liabilities and a negative impact to financial performance.\nFinancial Risks\nOur revenue is subject to increased volatility due to the adoption of a new revenue recognition accounting standard on January 1, 2018.\nIn May 2014, the Financial Accounting Standards Board (FASB) issued Accounting Standards Update No. 2014-09, Revenue from Contracts with Customers (Topic 606) (ASU 2014-09). We adopted ASU 2014-09 and its related amendments (collectively known as Accounting Standards Codification (ASC) 606) on January 1, 2018 which significantly impacted the timing, allocation and presentation of our lease license, perpetual license and maintenance revenue. Under previous revenue guidance, revenue was recognized ratably from the sale of software lease licenses and software maintenance subscriptions. However, under ASC 606, the license component of lease revenue is recognized up front. The post-contract support portion of lease license contracts continues to be recognized over the contract term, but it is now allocated to maintenance and service revenue.\nWe continue to sell perpetual licenses that involve the payment of a single, upfront fee. Historically, these licenses have been more typical in the computer software industry and remain as the preferred licensing approach in certain markets. The revenue associated with perpetual licenses continues to be recognized up front, consistent with prior revenue guidance.\nThe adoption of this revenue recognition guidance, coupled with our continued sales of perpetual licenses, creates the likelihood for software license revenue volatility to increase across periods, particularly as compared to our results under the previous revenue recognition standard. Our revenue in any period will depend significantly on sales contracts completed during that period.\nChanges in existing financial accounting standards could adversely impact our financial results and operations.\nChanges in existing accounting rules or practices, new accounting pronouncements, or varying interpretations of current accounting pronouncements could have a significant adverse effect on our results of operations or the manner in which we conduct our business.\nIn addition, we could incur significant costs for changes to our business systems, processes and internal controls as a result of the transition. These costs could have a significant adverse impact on our results of operations and cash flows. The transition could also cause management to divert time from day-to-day operations, which could impact our business. If we are unable to successfully transition our business systems, processes and internal controls before the guidance effective date, it could impact our ability to meet financial reporting deadlines. For further information on the impact of recently issued accounting guidance, see Note 2 to the consolidated financial statements included in Part IV, Item 15 of this Annual Report on Form 10-K.\nChanges to tax laws, variable tax estimates and tax authority audits could impact our financial results and operations.\nOur operations are subject to income and transaction taxes in the U.S. and in multiple foreign jurisdictions. A change in the tax law in the jurisdictions in which we do business, including an increase in tax rates, an adverse change in the treatment of an item of income or expense, or a decrease in tax rates in a jurisdiction in which we have significant deferred tax assets, could result in a material increase in tax expense. Furthermore, we have recorded significant deferred tax liabilities related to acquired intangible assets that are not deductible for tax purposes. These deferred tax liabilities are based on future statutory tax rates in the locations in which the intangible assets are recorded. Any future changes in statutory tax rates would be recorded as an adjustment to the deferred tax liabilities in the period the change is announced and could have a material impact on our effective tax rate during that period.\nWe also make significant estimates in determining our worldwide income tax provision. These estimates involve complex tax regulations in many jurisdictions and are subject to many transactions and calculations in which the ultimate tax outcome is uncertain. The outcome of tax matters could be different than the estimates reflected in the historical income tax provision and related accruals. Such differences could have a material impact on income tax expense and net income in the periods in which such determinations are made.\nThe amount of income tax we pay is subject to ongoing audits by federal, state and foreign tax authorities. These audits can result in additional assessments, including interest and penalties. Our estimates for liabilities associated with uncertain tax positions is highly judgmental and actual future outcomes may result in favorable or unfavorable adjustments to our estimated tax liabilities, including estimates for uncertain tax positions, in the period the assessments are made or resolved, audits are closed or when statutes of limitation on potential assessments expire. As a result, our effective tax rate may fluctuate significantly on a quarterly or annual basis.\nOur indebtedness could adversely affect our business, financial condition and results of operations.\nIn connection with our acquisition of LST, we borrowed $500.0 million under a term loan facility which matures on November 1, 2024. We also have access to a $500.0 million revolving credit facility, which includes a $50.0 million sublimit for the issuance of letters of credit. The credit agreement governing these loans contains customary representations and warranties, affirmative and negative covenants and events of default. The credit agreement also contains a financial covenant requiring us\nto maintain a consolidated leverage ratio of indebtedness to earnings before interest, taxes, depreciation and amortization not exceeding 3.50 to 1.00 as of the end of any fiscal quarter (for the four-quarter period ending on such date) with an opportunity for a temporary increase in such consolidated leverage ratio to 4.00 to 1.00 upon the consummation of certain qualified acquisitions for which the aggregate consideration is at least $250.0 million.\nNotwithstanding the limits contained in the credit agreement governing our credit facility, we may be able to incur substantial additional debt from time to time to finance working capital, capital expenditures, share repurchases, investments or acquisitions, or for other purposes. If we do so, the risks related to our level of debt could intensify. Specifically, our level of debt could:\n•\nmake it more difficult for us to satisfy our debt obligations and other ongoing business obligations, which may result in defaults;\n•\nresult in an event of default if we fail to comply with the financial and other covenants contained in the agreement governing our debt, which could result in all of our debt becoming immediately due and payable or require us to negotiate an amendment to financial or other covenants that could cause us to incur additional fees and expenses;\n•\nlimit our ability to obtain additional financing to fund future working capital, capital expenditures, acquisitions or other general corporate requirements;\n•\nreduce the availability of our cash flow to fund working capital, capital expenditures, acquisitions and other general corporate purposes;\n•\nincrease our vulnerability to the impact of adverse economic and industry conditions;\n•\nexpose us to the risk of increased interest rates as certain of our borrowings, including borrowings under the credit facility, are at variable rates of interest;\n•\nlimit our flexibility in planning for, or reacting to, and increasing our vulnerability to, changes in our business, the industries in which we operate, and the overall economy;\n•\nplace us at a competitive disadvantage compared to other, less leveraged competitors; and\n•\nincrease our cost of borrowing.\nAny of the above-listed factors could have an adverse effect on our business, financial condition and results of operations and our ability to meet our payment obligations under our debt agreements.\nFurthermore, borrowings under the credit agreement use the London Interbank Offering Rate (LIBOR) as a benchmark for establishing the interest rate. LIBOR has been the subject of recent national, international and other regulatory guidance and proposals for reform, and the financial industry is currently transitioning away from LIBOR as a benchmark for the interbank lending market. The consequences of these developments cannot be entirely predicted but could include an increase in the cost of our variable rate indebtedness.",
    "item_1B": "ITEM 1B.\nUNRESOLVED STAFF COMMENTS\nNone.",
    "item_1C": "",
    "item_2": "ITEM 2.\nPROPERTIES\nOur executive offices and those related to certain domestic product development, marketing, production and administration are located in a LEED certified, 186,000 square foot office facility in Canonsburg, Pennsylvania. The lease for this facility was effective as of September 14, 2012 and expires on December 31, 2029, excluding any renewal or termination options.\nWe own: a 70,000 square foot office facility in Lebanon, New Hampshire; a 62,000 square foot office building near our current Canonsburg headquarters; a 59,000 square foot facility in Pune, India; a 40,000 square foot campus in Livermore, California; and a 5,000 square foot facility in Apex, North Carolina.\nWe also lease office space in various locations throughout the world. We own substantially all equipment used in our facilities. Management believes that, in most geographic locations, our facilities allow for sufficient space to support present and future\nforeseeable needs, including such expansion and growth as the business may require. In other geographic locations, we expect that we will be required to expand capacity beyond that which we currently own or lease.\nOur properties and equipment are in good operating condition and are adequate for our current needs. We do not anticipate difficulty in renewing existing leases as they expire or in finding alternative facilities.",
    "item_3": "ITEM 3.\nLEGAL PROCEEDINGS\nWe are subject to various investigations, claims and legal proceedings that arise in the ordinary course of business, including commercial disputes, labor and employment matters, tax audits, alleged infringement of intellectual property rights and other matters. In our opinion, the resolution of pending matters is not expected to have a material adverse effect on our consolidated results of operations, cash flows or financial position. However, each of these matters is subject to various uncertainties and it is possible that an unfavorable resolution of one or more of these proceedings could materially affect our results of operations, cash flows or financial position.",
    "item_4": "ITEM 4.\nMINE SAFETY DISCLOSURES\nNot applicable.\nPART II",
    "item_5": "ITEM 5.\nMARKET FOR REGISTRANT'S COMMON EQUITY, RELATED STOCKHOLDER MATTERS AND ISSUER PURCHASES OF EQUITY SECURITIES\nOur common stock trades on the Nasdaq Global Select Market tier of the Nasdaq Stock Market under the symbol: \"ANSS\".\nOn February 14, 2020, there were 126 stockholders of record.\nWe have not historically paid cash dividends on our common stock as we have retained earnings primarily for acquisitions, for future business opportunities, to make payments on outstanding debt balances and to repurchase stock when authorized by the Board of Directors and when such repurchase meets our objectives. We review our policy with respect to the payment of dividends from time to time; however, there can be no assurance that any dividends will be paid in the future.\nPerformance Graph\nSet forth below is a line graph comparing the yearly percentage change in the cumulative total stockholder return of our common stock, based on the market price per share of our common stock, with the total return of companies included within the Nasdaq Composite Stock Market Index, the S&P 500 Stock Index, a new industry peer group of seven companies (Autodesk, Inc., PTC Inc., Cadence Design Systems, Inc., Synopsys, Inc., Altair Engineering Inc., Aspen Technology, Inc. and Dassault Systemes SE) and an old industry peer group of four companies (Autodesk, Inc., PTC Inc., Cadence Design Systems, Inc. and Synopsys, Inc.), for the period commencing December 31, 2014 and ending December 31, 2019. The calculation of total cumulative returns assumes a $100 investment in our common stock, the Nasdaq Composite Stock Market Index, the S&P 500 Stock Index, the new peer group and the old peer group on December 31, 2014, and the reinvestment of all dividends, and accounts for all stock splits. The historical information set forth below is not necessarily indicative of future performance.\nASSUMES $100 INVESTED ON DECEMBER 31, 2014\nASSUMES DIVIDENDS REINVESTED\nFIVE FISCAL YEARS ENDED DECEMBER 31, 2019\n(1) The new peer group is inclusive of the old peer group plus three companies added in 2019 (Altair Engineering Inc., Aspen Technology, Inc. and Dassault Systemes SE). The companies were added to enhance the comparability of the peer group to our size and business.\nUnregistered Sale of Equity Securities and Use of Proceeds\nNone.\nIssuer Purchases of Equity Securities\nNone.",
    "item_6": "ITEM 6.\nSELECTED FINANCIAL DATA\nThe following table sets forth selected financial data as of and for the year ended December 31 for each of the last five years. This selected financial data should be read in conjunction with the consolidated financial statements and related notes included in Part IV, Item 15 of this Annual Report on Form 10-K.\n(1)Effective January 1, 2019, we adopted new guidance on leases. We elected to adopt the change in accounting principle using the modified retrospective approach. Results for reporting periods beginning after January 1, 2019 are presented under the new guidance, while prior period amounts are not adjusted and continue to be reported in accordance with previous guidance (ASC 840). For further information, see Note 2 to the consolidated financial statements included in Part IV, Item 15 of this Annual Report on Form 10-K.\n(2)Effective January 1, 2018, we adopted new guidance on revenue recognition. We elected to adopt the change in accounting principle using the modified retrospective approach. Results for reporting periods beginning after January 1, 2018 are presented under the new guidance, while prior period amounts are not adjusted and continue to be reported in accordance with previous guidance. For further information, see Note 3 to the consolidated financial statements included in Part IV, Item 15 of this Annual Report on Form 10-K.\n(3)During fiscal year 2019, we retrospectively adopted new guidance on the accounting for costs incurred to implement a cloud computing arrangement (CCA) that is a service arrangement. As a result of the adoption, operating cash flows decreased with a corresponding increase to investing cash flows by $2.5 million, $1.4 million and $2.8 million for the years ending December 31, 2019, 2018 and 2017, respectively. The adoption had no impact on our consolidated balance sheets or consolidated statements of income. Fiscal years 2016 and 2015 have not been restated in the table above. For further information, see Note 2 to the consolidated financial statements included in Part IV, Item 15 of this Annual Report on Form 10-K.\nIn the table above, the comparability of information among the years presented is impacted by our acquisitions. The operating results of our acquisitions have been included in the results of operations since their respective acquisition dates. For further information, see the “Acquisitions” section of Management's Discussion and Analysis of Financial Condition and Results of Operations in Item 7 and Note 4 to the consolidated financial statements included in Part IV, Item 15 of this Annual Report on Form 10-K.",
    "item_7": "ITEM 7.\nMANAGEMENT'S DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION AND RESULTS OF OPERATIONS\nOverview\nOverall GAAP and Non-GAAP Results\nOur growth rates of GAAP and non-GAAP results for the year ended December 31, 2019 as compared to the year ended December 31, 2018 were as follows:\nWe experienced higher revenue during the year ended December 31, 2019 from double-digit growth in lease licenses, maintenance and service, partially driven by contributions from our recent acquisitions. We also experienced increased operating expenses primarily due to increased personnel costs, higher stock-based compensation and additional operating expenses related to acquisitions, partially offset by a reduction in expenses due to a stronger U.S. Dollar.\nThe non-GAAP results exclude the income statement effects of the acquisition accounting adjustments to deferred revenue, stock-based compensation, amortization of acquired intangible assets, transaction costs related to business combinations, and adjustments related to the transition tax associated with the Tax Cuts and Jobs Act. For further disclosure regarding non-GAAP results, see the section titled \"Non-GAAP Results\" immediately preceding the section titled \"Liquidity and Capital Resources.\"\nImpact of Foreign Currency\nOur comparative financial results were impacted by fluctuations in the U.S. Dollar during the year ended December 31, 2019 as compared to the year ended December 31, 2018. The impacts on our revenue and operating income due to currency fluctuations are reflected in the table below. Amounts in brackets indicate an adverse impact from currency fluctuations.\nIn constant currency, our growth rates were as follows:\nConstant currency amounts exclude the effects of foreign currency fluctuations on the reported results. To present this information, the 2019 results for entities whose functional currency is a currency other than the U.S. Dollar were converted to U.S. Dollars at rates that were in effect for the 2018 comparable period, rather than the actual exchange rates in effect for 2019. Constant currency growth rates are calculated by adjusting the 2019 reported revenue and operating income amounts by the 2019 currency fluctuation impacts and comparing to the 2018 comparable period reported revenue and operating income amounts.\nOther Financial Information\nOur financial position includes $872.4 million in cash and short-term investments, and working capital of $860.3 million as of December 31, 2019.\nDuring the year ended December 31, 2019, we repurchased 0.3 million shares for $59.1 million at an average price of $179.41 per share under our stock repurchase program.\nBusiness\nAnsys, a Delaware corporation formed in 1994, develops and globally markets engineering simulation software and services widely used by engineers, designers, researchers and students across a broad spectrum of industries and academia, including aerospace and defense, automotive, electronics, semiconductors, energy, materials and chemical processing, turbomachinery, consumer products, healthcare, and sports. Headquartered south of Pittsburgh, Pennsylvania, we employed approximately 4,100 people as of December 31, 2019. We focus on the development of open and flexible solutions that enable users to analyze designs directly on the desktop, providing a common platform for fast, efficient and cost-conscious product development, from design concept to final-stage testing and validation. We distribute our suite of simulation technologies through a global network of independent resellers and distributors (collectively, channel partners) and direct sales offices in strategic, global locations. It is our intention to continue to maintain this hybrid sales and distribution model.\nWe license our technology to businesses, educational institutions and governmental agencies. Growth in our revenue is affected by the strength of global economies, general business conditions, currency exchange rate fluctuations, customer budgetary constraints and the competitive position of our products. Please see Part I. Item 1A. of this Annual Report on Form 10-K for a complete discussion of factors that might impact our financial condition and operating results. We believe that the features, functionality and integrated multiphysics capabilities of our software products are as strong as they have ever been. However, the software business is generally characterized by long sales cycles. These long sales cycles increase the difficulty of predicting sales for any particular quarter. We make many operational and strategic decisions based upon short- and long-term sales forecasts that are impacted not only by these long sales cycles, but also by current global economic conditions. As a result, we believe that our overall performance is best measured by fiscal year results rather than by quarterly results. Please see the sub-section entitled \"Financial Risks\" under Part I. Item 1A. of this Annual Report on Form 10-K for additional discussion of the potential impact of our sales forecasts on our financial condition, cash flows and operating results.\nManagement considers the competition and price pressure that it faces in the short- and long-term by focusing on expanding the breadth, depth, ease of use and quality of the technologies, features, functionality and integrated multiphysics capabilities of our software products as compared to our competitors; investing in research and development to develop new and innovative products and increase the capabilities of our existing products; supplying new products and services; focusing on customer needs, training, consulting and support; and enhancing our distribution channels. We also consider acquisitions to supplement our global engineering talent, product offerings and distribution channels.\nGeographic Trends\nThe following table presents our geographic constant currency revenue growth during the year ended December 31, 2019 as compared to the year ended December 31, 2018:\nWe continue to focus on a number of sales improvement activities across the geographic regions, including sales hiring, pipeline building, productivity initiatives and customer engagement activities.\nAs trade tensions between the U.S. and China continue, as well as the uncertainty around China's ability to control the coronavirus outbreak, our ability to sell and ship our products to certain customers and our ability to collect against existing trade receivables may be further restricted and could have an adverse effect on our business, results of operations or financial condition. For additional details, refer to Part I. Item 1A. of this Annual Report on Form 10-K.\nIndustry Commentary:\nOur three largest industries - high-tech, automotive, and aerospace and defense (A&D) - remained strong throughout 2019. The high-tech industry was positively impacted by companies' investments in 5G and smart connected products. The automotive industry continued its momentum due to continued investments by our customers to capture the disruptive mobility trends of autonomy and electrification. Defense spending continued to support growth in the aerospace and defense industry.\nAcquisitions\nOn November 1, 2019, we completed the acquisition of 100% of the shares of LST, the premier provider of explicit dynamics and other advanced finite element analysis technology, for a purchase price of $777.8 million. The acquisition empowers our customers to solve a new class of engineering challenges, including developing safer automobiles, aircraft and trains while reducing or even eliminating the need for costly physical testing.\nOn February 1, 2019, we completed the acquisition of 100% of the shares of Granta Design, the premier provider of materials information technology, for a purchase price of $208.7 million. The acquisition expands our portfolio into this important area, giving customers access to materials intelligence, including data that is critical to successful simulations.\nAdditionally, during the year ended December 31, 2019, we acquired Dynardo, Helic and DfR Solutions to combine the acquired technologies with our existing comprehensive multiphysics portfolio. These acquisitions were not individually significant. The combined purchase price of these acquisitions was $136.2 million.\nDuring the year ended December 31, 2018, we completed the acquisition of 100% of the shares of OPTIS, a premier provider of software for scientific simulation of light, human vision and physics-based visualization, for a purchase price of $291.0 million. The acquisition extended our portfolio into the area of optical simulation to provide comprehensive sensor solutions, covering visible and infrared light, electromagnetics and acoustics for camera, radar and lidar.\nDuring the year ended December 31, 2017, we completed various acquisitions to expand our customer base and accelerate the development of new and innovative products to the marketplace while lowering design and engineering costs for customers. The acquisitions were not individually significant. The combined purchase price of the acquisitions was approximately $67.0 million.\nFor further information on our business combinations during the years ended December 31, 2019, 2018 and 2017, see Note 4 to the consolidated financial statements included in Part IV, Item 15 of this Annual Report on Form 10-K.\nResults of Operations\nFor purposes of the following discussion and analysis, the table below sets forth certain consolidated financial data for the years 2019, 2018 and 2017. The operating results of our acquisitions have been included in the results of operations since their respective acquisition dates.\nEffective January 1, 2018, we adopted new guidance on revenue recognition. We elected to adopt the change in accounting principle using the modified retrospective approach. Results for reporting periods beginning after January 1, 2018 are presented under the new guidance, while prior period amounts are not adjusted and continue to be reported in accordance with previous guidance. For further information, see Note 3 to the consolidated financial statements included in Part IV, Item 15 of this Annual Report on Form 10-K.\nYear Ended December 31, 2019 Compared to Year Ended December 31, 2018\nRevenue:\nOur revenue in the year ended December 31, 2019 increased 17.2% as compared to the year ended December 31, 2018, or 19.0% in constant currency. The growth rate was favorably impacted by our continued investments in our global sales, support and marketing organizations, as well as our 2019 and 2018 acquisitions which contributed incremental revenue of $72.9 million. Lease license revenue increased 47.3%, or 49.4% in constant currency, as compared to the year ended December 31, 2018, driven primarily by an increase in multi-year lease contracts. Annual maintenance contracts that were sold with new perpetual licenses, maintenance contracts for new perpetual licenses sold in previous years and the maintenance portion of lease license contracts each contributed to maintenance revenue growth of 12.4%, or 14.3% in constant currency. Service revenue, driven primarily by a focus on service offerings that provide on-site mentorship on simulation best practices, training and expanding simulation adoption, increased 39.1%, or 41.5% in constant currency, as compared to the year ended December 31, 2018. Perpetual license revenue, which is derived primarily from new sales during the year ended December 31, 2019, decreased 2.5%, or 1.1% in constant currency, as compared to the year ended December 31, 2018.\nWe continue to experience increased interest by some of our larger customers in enterprise agreements that often include longer-term, time-based licenses involving a larger number of our software products. While these arrangements typically involve a higher overall transaction price, the upfront recognition of license revenue related to these larger, multi-year transactions can result in significantly higher lease license revenue and corresponding revenue growth volatility. As software products, across a large variety of applications and industries, become increasingly distributed in software-as-a-service, cloud and other subscription environments in which the licensing approach is time-based rather than perpetual, we are also experiencing a shifting preference from perpetual licenses to time-based licenses across a broader spectrum of our customers.\nWith respect to revenue, on average for the year ended December 31, 2019, the U.S. Dollar was approximately 3.3% stronger, when measured against our primary foreign currencies, than for the year ended December 31, 2018. The table below presents the impacts of currency fluctuations on revenue for the year ended December 31, 2019. Amounts in brackets indicate an adverse impact from currency fluctuations.\nThe net overall stronger U.S. Dollar also resulted in decreased operating income of $10.2 million for the year ended December 31, 2019 as compared to the year ended December 31, 2018.\nAs a percentage of revenue, our international and domestic revenues, and our direct and indirect revenues, were as follows:\nIn valuing deferred revenue on the balance sheets of our recent acquisitions as of their respective acquisition dates, we applied the fair value provisions applicable to the accounting for business combinations, resulting in a reduction of deferred revenue as compared to the historical carrying amount. As a result, our post-acquisition revenue will be less than the sum of what would have otherwise been reported by us and each acquiree absent the acquisitions. The impacts on reported revenue were $12.5 million and $9.4 million for the years ended December 31, 2019 and 2018, respectively. The expected impacts on reported revenue are $3.9 million and $8.0 million for the quarter ending March 31, 2020 and the year ending December 31, 2020, respectively.\nCost of Sales and Operating Expenses:\nThe tables below reflect our operating results as presented on the consolidated statements of income, which are inclusive of foreign currency translation impacts. Amounts included in the discussions that follow each table are provided in constant currency and are inclusive of costs related to our acquisitions. The impact of foreign exchange translation is discussed separately, where material. The 2019 and 2018 acquisitions contributed $54.7 million to the overall increase in cost of sales and operating expenses with the most significant contributions from the OPTIS (May 2, 2018) and Granta Design (February 1, 2019) acquisitions of $17.3 million and $18.9 million, respectively.\nSoftware Licenses: The increase in the cost of software licenses was primarily due to increased third-party royalties of $5.6 million.\nAmortization: The net decrease in amortization expense was primarily due to a decrease in the amortization of trade names and acquired technology due to assets that became fully amortized, which was partially offset by the amortization of newly acquired intangible assets.\nMaintenance and Service: The net increase in maintenance and service costs was primarily due to the following:\n•\nIncreased salaries of $4.0 million.\n•\nIncreased stock-based compensation of $3.3 million.\n•\nIncreased consulting costs of $1.7 million.\n•\nIncreased IT maintenance and software hosting costs of $1.3 million.\n•\nDecreased costs related to foreign exchange translation of $2.0 million due to a stronger U.S. Dollar.\nThe improvement in gross profit was a result of the increase in revenue, partially offset by the increase in the related cost of sales.\nSelling, General and Administrative: The net increase in selling, general and administrative costs was primarily due to the following:\n•\nIncreased salaries, incentive compensation and other headcount-related costs of $63.7 million.\n•\nIncreased stock-based compensation of $13.5 million.\n•\nIncreased business travel of $6.5 million.\n•\nIncreased marketing expenses of $5.4 million.\n•\nIncreased professional fees of $4.5 million.\n•\nIncreased consulting costs of $4.2 million.\n•\nDecreased costs related to foreign exchange translation of $7.1 million due to a stronger U.S. Dollar.\nWe anticipate that we will continue to make targeted investments in our global sales and marketing organizations and our global business infrastructure to enhance and support our revenue-generating activities.\nResearch and Development: The increase in research and development costs was primarily due to the following:\n•\nIncreased salaries, incentive compensation and other headcount-related costs of $41.1 million.\n•\nIncreased stock-based compensation of $16.0 million.\nWe have traditionally invested significant resources in research and development activities and intend to continue to make investments in expanding the ease of use and capabilities of our broad portfolio of simulation software products.\nInterest Income: Interest income for the year ended December 31, 2019 was $12.8 million as compared to $11.4 million for the year ended December 31, 2018. Interest income increased as a result of an increase in the average rate of return on invested cash balances.\nInterest Expense: Interest expense for the year ended December 31, 2019 was $3.5 million as compared to $0.1 million for the year ended December 31, 2018. Interest expense increased as a result of the interest incurred on debt financing obtained in fiscal year 2019.\nOther Expense, net: Our other expense consisted of the following:\nIncome Tax Provision: Our income before income tax provision, income tax provision and effective tax rate were as follows:\nThe decrease in the effective tax rate from the prior year was primarily due to $6.7 million of benefit related to the release of valuation allowance in a foreign jurisdiction and $1.8 million of benefit related to transition tax recorded in 2019. These benefits are offset by $6.7 million of benefit recorded in 2018 related to global legal entity restructuring activities that did not recur in 2019.\nWhen compared to the federal and state combined statutory rate for each respective period, the effective tax rates for the years ended December 31, 2019 and 2018 were favorably impacted by tax benefits from stock-based compensation, the foreign-derived intangible income deduction, and research and development credits.\nNet Income: Our net income, diluted earnings per share and weighted average shares used in computing diluted earnings per share were as follows:\nYear Ended December 31, 2018 Compared to Year Ended December 31, 2017\nRevenue:\nThe adoption of ASC 606 significantly impacted the timing, allocation and presentation of lease license, perpetual license and maintenance revenue. For further information about this adoption, see Note 3 to the consolidated financial statements included in Part IV, Item 15 of this Annual Report on Form 10-K.\nFor purposes of comparability, the changes in the following table and the related discussion that follows are presented in accordance with ASC 605.\nOur ASC 605 revenue in the year ended December 31, 2018 increased 11.1% as compared to the year ended December 31, 2017, while revenue grew 9.7% in constant currency. The growth rate was favorably impacted by our continued investments in our global sales, support and marketing organizations; continued progress with market segmentation and go-to-market adjustments; and the May 2018 acquisition of OPTIS. Lease license revenue increased 11.8%, or 10.7% in constant currency, as compared to the year ended December 31, 2017. Perpetual license revenue, which is derived primarily from new sales during the year, increased 3.0%, or 2.0% in constant currency, as compared to the year ended December 31, 2017. Annual maintenance contracts that were sold with new perpetual licenses, along with maintenance contracts for perpetual licenses sold in previous years, contributed to maintenance revenue growth of 13.4%, or 11.6% in constant currency. Service revenue, driven primarily by a focus on service offerings that provide on-site mentorship on simulation best practices, training and expanding simulation adoption, increased 34.3%, or 33.4% in constant currency, as compared to the year ended December 31, 2017.\nWith respect to revenue, on average for the year ended December 31, 2018, the U.S. Dollar was approximately 2.3% weaker and 2.6% weaker, when measured against our primary foreign currencies, than for the year ended December 31, 2017 under ASC 606 and ASC 605, respectively. The table below presents the impacts of currency fluctuations on revenue for the year ended December 31, 2018. Amounts in brackets indicate a net adverse impact from currency fluctuations.\nThe net overall weaker U.S. Dollar also resulted in increased operating income of $9.6 million and $10.3 million for the year ended December 31, 2018 as compared to the year ended December 31, 2017 under ASC 606 and ASC 605, respectively.\nAs a percentage of revenue, our international and domestic revenues, and our direct and indirect revenues, were as follows:\nIn valuing deferred revenue on the balance sheets of our recent acquisitions as of their respective acquisition dates, we applied the fair value provisions applicable to the accounting for business combinations, resulting in a reduction of deferred revenue as compared to the historical carrying amount. As a result, our post-acquisition revenue will be less than the sum of what would have otherwise been reported by us and each acquiree absent the acquisitions. Under ASC 606, the impact on reported revenue was $9.4 million for the year ended December 31, 2018. Under ASC 605, the impacts on reported revenue were $15.6 million and $2.9 million for the years ended December 31, 2018 and 2017, respectively.\nCost of Sales and Operating Expenses:\nThe tables below reflect our operating results as presented on the consolidated statements of income, which are inclusive of foreign currency translation impacts. The adoption of ASC 606 resulted in a reclassification of expenses within cost of sales from software licenses to maintenance and service. Amounts included in the discussion that follows are provided in constant currency and do not include the impact of the OPTIS acquisition. The impact of the OPTIS acquisition on each expense line is provided separately, where material. The impact, where material, of foreign exchange translation on each expense line is also provided separately and is inclusive of the OPTIS acquisition.\nSoftware Licenses: The net decrease in the cost of software licenses was primarily due to the following:\n•\nReclassification of $18.2 million of cost of sales, previously reflected within software licenses, to maintenance and service due to the adoption of ASC 606 in 2018.\n•\nOPTIS-related software license expenses of $1.6 million for the period from the acquisition date (May 2, 2018) through December 31, 2018.\nAmortization: The decrease in amortization expense was primarily due to a net decrease in the amortization of trade names and acquired technology due to assets that became fully amortized.\nMaintenance and Service: The increase in maintenance and service costs was primarily due to the following:\n•\nReclassification of $18.2 million of cost of sales, previously reflected within software licenses, to maintenance and service due to the adoption of ASC 606 in 2018.\n•\nIncreased third-party technical support of $5.5 million.\n•\nOPTIS-related maintenance and service expenses of $2.8 million for the period from the acquisition date (May 2, 2018) through December 31, 2018.\n•\nIncreased salaries of $2.1 million.\nThe improvement in gross profit was a result of the increase in revenue, partially offset by the increase in the related cost of sales.\nSelling, General and Administrative: The net increase in selling, general and administrative costs was primarily due to the following:\n•\nIncreased salaries, incentive compensation and other headcount-related costs of $35.2 million.\n•\nIncreased stock-based compensation of $15.3 million.\n•\nOPTIS-related selling, general and administrative expenses of $13.8 million for the period from the acquisition date (May 2, 2018) through December 31, 2018.\n•\nIncreased business travel of $3.9 million.\n•\nIncreased severance expenses of $3.7 million.\n•\nDecreased consulting costs of $7.1 million.\nResearch and Development: The net increase in research and development costs was primarily due to the following:\n•\nIncreased salaries, incentive compensation and other headcount-related costs of $15.2 million.\n•\nIncreased stock-based compensation of $11.6 million.\n•\nOPTIS-related research and development expenses of $5.9 million for the period from the acquisition date (May 2, 2018) through December 31, 2018.\n•\nIncreased IT maintenance and software hosting costs of $1.5 million.\n•\nRestructuring costs of $6.8 million related to 2017 workforce realignment activities that did not reoccur in 2018.\nInterest Income: Interest income for the year ended December 31, 2018 was $11.4 million as compared to $7.0 million for the year ended December 31, 2017. Interest income increased as a result of an increase in the average rate of return on invested cash balances.\nOther Expense, net: Our other expense, net consists of the following:\nIncome Tax Provision: Our income before income tax provision, income tax provision and effective tax rate were as follows:\nOn December 22, 2017, the U.S. government enacted comprehensive tax legislation commonly referred to as the Tax Cuts and Jobs Act (Tax Reform). Tax Reform made broad and complex changes to the U.S. tax code, including, but not limited to, (1) reducing the U.S. federal corporate tax rate from 35 percent to 21 percent; (2) requiring companies to pay a one-time federal income tax on certain unrepatriated earnings of foreign subsidiaries (transition tax); (3) generally eliminating U.S. federal income taxes on dividends from foreign subsidiaries; (4) creating a new provision designed to tax global intangible low-taxed income (GILTI) which allows for the possibility of using foreign tax credits (FTCs) and a deduction of up to 50 percent to offset the income tax liability (subject to some limitations); (5) repealing the domestic production activity deduction; (6) creating the foreign-derived intangible income deduction; (7) creating the base erosion anti-abuse tax, a new minimum tax; (8) allowing for full expensing of qualified property through bonus depreciation; and (9) creating limitations on the deductibility of certain executive compensation.\nThe SEC staff issued Staff Accounting Bulletin (SAB) 118, which provides guidance on accounting for the tax effects of Tax Reform. SAB 118 provided a measurement period that was limited to one year from enactment for companies to complete the accounting under ASC 740, Income Taxes. In accordance with SAB 118, throughout the measurement period, a company must reflect the income tax effects of those aspects of Tax Reform for which the accounting under ASC 740 was complete in the financial statements. To the extent that a company’s accounting for certain income tax effects of Tax Reform was incomplete, but a reasonable estimate was able to be made, the company must record a provisional estimate in the financial statements. If a company could not determine a provisional estimate to be included in the financial statements, it should continue to apply ASC 740 on the basis of the tax laws that were in effect immediately before the enactment of Tax Reform.\nAs further discussed below, we finalized our provisional Tax Reform calculations as of the end of the measurement period, based on guidance and information available as of the reporting date. The U.S. government has not yet issued final guidance related to a portion of the new rules enacted as part of Tax Reform. Subsequent adjustments, if any, will be recorded in the period in which guidance is finalized.\nOur accounting for the impact of the reduction in the U.S. federal corporate tax rate on our deferred tax assets and liabilities is complete. Tax Reform reduced the corporate tax rate to 21 percent, effective January 1, 2018. Consequently, we recorded a net adjustment to deferred income tax expense of $1.9 million for the year ended December 31, 2017 to revalue our deferred tax assets and liabilities. No further adjustments were recorded for the year ended December 31, 2018.\nOur accounting for the transition tax is complete. Reasonable estimates of certain effects were calculated and a provisional adjustment of $16.0 million was recorded in the December 31, 2017 financial statements. To determine the amount of the transition tax, we determined, in addition to other factors, the amount of post-1986 earnings and profits (E&P) of the relevant subsidiaries, as well as the amount of non-U.S. income taxes paid on such earnings. Based on revised E&P calculations updated during the measurement period, we recognized an additional measurement-period adjustment for the year ended December 31, 2018 of $0.9 million to the transition tax obligation and a corresponding adjustment to tax expense.\nOur accounting for the indefinite reinvestment assertion is complete. In general, it is our intention to permanently reinvest all earnings in excess of previously taxed amounts. As part of Tax Reform, substantially all of the previous earnings of our non-U.S. subsidiaries were taxed through the transition tax and current earnings are taxed as part of GILTI tax expense. These taxes increased our previously taxed earnings and allow for the repatriation of the majority of our foreign earnings without any residual U.S. federal tax. During the year ended December 31, 2018, we repatriated $144.3 million of foreign cash. We did not make any adjustments related to our indefinite reinvestment assertion during the year ended December 31, 2018.\nOur accounting policy choice for GILTI is complete. Under U.S. GAAP, we are allowed to make an accounting policy choice of either (1) treating taxes due on future U.S. inclusions in taxable income related to GILTI as a current-period expense when incurred (the period cost method) or (2) factoring such amounts into the measurement of our deferred taxes (the deferred method). We selected the period cost method and recorded GILTI tax expense of $0.4 million in the financial statements for the year ended December 31, 2018.\nThe decrease in the effective tax rate from the prior year was primarily due to the reduction in the U.S. federal corporate tax rate from 35 percent to 21 percent enacted as part of Tax Reform, the additional $15.1 million of transition tax in 2017 when compared to 2018, and a net $6.7 million benefit related to global legal entity restructuring activities. The effective tax rate was also reduced by the foreign-derived intangible income deduction, increased research and development credits and increased stock-based compensation benefits, partially offset by the loss of the domestic manufacturing deduction, which was repealed as part of Tax Reform.\nWhen compared to the federal and state combined statutory rate, the effective tax rates for the years ended December 31, 2018 and 2017 were favorably impacted by tax benefits from stock-based compensation and research and development credits.\nNet Income: Our net income, diluted earnings per share and weighted average shares used in computing diluted earnings per share were as follows:\nNon-GAAP Results\nWe provide non-GAAP revenue, non-GAAP operating income, non-GAAP operating profit margin, non-GAAP net income and non-GAAP diluted earnings per share as supplemental measures to GAAP regarding our operational performance. These financial measures exclude the impact of certain items and, therefore, have not been calculated in accordance with GAAP. A detailed explanation and a reconciliation of each non-GAAP financial measure to our most comparable GAAP financial measure are described below.\n(1)\nAmount represents the revenue not reported during the period as a result of the acquisition accounting adjustment associated with the accounting for deferred revenue in business combinations.\n(2)\nAmount represents $116.2 million of stock-based compensation expense, $4.9 million of excess payroll taxes related to stock-based awards, $36.9 million of amortization expense associated with intangible assets acquired in business combinations, $6.6 million of transaction expenses related to business combinations and the $12.5 million adjustment to revenue as reflected in (1) above.\n(3)\nAmount represents the impact of the adjustments to operating income referred to in (2) above, decreased for the related income tax impact of $61.2 million, adjustments related to the transition tax associated with the Tax Cuts and Jobs Act of $1.8 million, and rabbi trust income of $0.4 million.\n(4)\nAmount represents the revenue not reported during the period as a result of the acquisition accounting adjustment associated with the accounting for deferred revenue in business combinations.\n(5)\nAmount represents $83.3 million of stock-based compensation expense, $4.3 million of excess payroll taxes related to stock-based awards, $40.8 million of amortization expense associated with intangible assets acquired in business combinations, $3.5 million of transaction expenses related to business combinations and the $9.4 million adjustment to revenue as reflected in (4) above.\n(6)\nAmount represents the impact of the adjustments to operating income referred to in (5) above, decreased for the related income tax impact of $47.9 million and increased for a measurement-period adjustment related to the Tax Cuts and Jobs Act of $0.9 million and rabbi trust expense of $0.1 million.\n(1)\nAmount represents the revenue not reported during the period as a result of the acquisition accounting adjustment associated with the accounting for deferred revenue in business combinations.\n(2)\nAmount represents $83.3 million of stock-based compensation expense, $4.3 million of excess payroll taxes related to stock-based awards, $40.8 million of amortization expense associated with intangible assets acquired in business combinations, $3.5 million of transaction expenses related to business combinations and the $15.6 million adjustment to revenue as reflected in (1) above.\n(3)\nAmount represents the impact of the adjustments to operating income referred to in (2) above, decreased for the related income tax impact of $49.7 million and increased for a measurement-period adjustment related to the Tax Cuts and Jobs Act of $0.9 million and rabbi trust expense of $0.1 million.\n(4)\nAmount represents the revenue not reported during the period as a result of the acquisition accounting adjustment associated with the accounting for deferred revenue in business combinations.\n(5)\nAmount represents $53.2 million of stock-based compensation expense, $49.8 million of amortization expense associated with intangible assets acquired in business combinations, $11.7 million of restructuring charges, $1.1 million of transaction expenses related to business combinations and the $2.9 million adjustment to revenue as reflected in (4) above.\n(6)\nAmount represents the impact of the adjustments to operating income referred to in (5) above, decreased for the related income tax impact of $52.5 million, excluding the impact of the Tax Cuts and Jobs Act, and rabbi trust income of $0.1 million, and increased for total net impacts of the Tax Cuts and Jobs Act of $22.7 million.\nNon-GAAP Measures\nWe use non-GAAP financial measures (a) to evaluate our historical and prospective financial performance as well as our performance relative to our competitors, (b) to set internal sales targets and spending budgets, (c) to allocate resources, (d) to measure operational profitability and the accuracy of forecasting, (e) to assess financial discipline over operational expenditures and (f) as an important factor in determining variable compensation for management and employees. In addition, many financial analysts that follow us focus on and publish both historical results and future projections based on non-GAAP financial measures. We believe that it is in the best interest of our investors to provide this information to analysts so that they accurately report the non-GAAP financial information. Moreover, investors have historically requested, and we have historically reported, these non-GAAP financial measures as a means of providing consistent and comparable information with past reports of financial results.\nWhile we believe that these non-GAAP financial measures provide useful supplemental information to investors, there are limitations associated with the use of these non-GAAP financial measures. These non-GAAP financial measures are not prepared in accordance with GAAP, are not reported by all our competitors and may not be directly comparable to similarly titled measures of our competitors due to potential differences in the exact method of calculation. We compensate for these limitations by using these non-GAAP financial measures as supplements to GAAP financial measures and by reviewing the reconciliations of the non-GAAP financial measures to their most comparable GAAP financial measures.\nThe adjustments to these non-GAAP financial measures, and the basis for such adjustments, are outlined below:\nAcquisition accounting for deferred revenue and its related tax impact. Historically, we have consummated acquisitions in order to support our strategic and other business objectives. In accordance with the fair value provisions applicable to the accounting for business combinations, acquired deferred revenue is often recorded on the opening balance sheet at an amount that is lower than the historical carrying value. Although this acquisition accounting requirement has no impact on our business or cash flow, it adversely impacts our reported GAAP revenue in the reporting periods following an acquisition. In order to provide investors with financial information that facilitates comparison of both historical and future results, we provide non-GAAP financial measures which exclude the impact of the acquisition accounting adjustment. We believe that this non-GAAP financial adjustment is useful to investors because it allows investors to (a) evaluate the effectiveness of the methodology and information used by us in our financial and operational decision-making, and (b) compare our past and future reports of financial results as the revenue reduction related to acquired deferred revenue will not recur when related annual lease licenses and software maintenance contracts are renewed in future periods.\nAmortization of intangible assets from acquisitions and its related tax impact. We incur amortization of intangible assets, included in our GAAP presentation of amortization expense, related to various acquisitions we have made. We exclude these expenses and their related tax impact for the purpose of calculating non-GAAP operating income, non-GAAP operating profit margin, non-GAAP net income and non-GAAP diluted earnings per share when we evaluate our continuing operational performance because these costs are fixed at the time of an acquisition, are then amortized over a period of several years after the acquisition and generally cannot be changed or influenced by us after the acquisition. Accordingly, we do not consider these expenses for purposes of evaluating our performance during the applicable time period after the acquisition, and we exclude such expenses when making decisions to allocate resources. We believe that these non-GAAP financial measures are useful to investors because they allow investors to (a) evaluate the effectiveness of the methodology and information used by us in our financial and operational decision-making, and (b) compare our past reports of financial results as we have historically reported these non-GAAP financial measures.\nStock-based compensation expense and its related tax impact. We incur expense related to stock-based compensation included in our GAAP presentation of cost of software licenses; cost of maintenance and service; research and development expense; and selling, general and administrative expense. This non-GAAP adjustment also includes excess payroll tax expense related to stock-based compensation. Stock-based compensation expense (benefit) incurred in connection with our deferred compensation plan held in a rabbi trust includes an offsetting benefit (charge) recorded in other income (expense). Although stock-based compensation is an expense and viewed as a form of compensation, we exclude these expenses for the purpose of calculating non-GAAP operating income, non-GAAP operating profit margin, non-GAAP net income and non-GAAP diluted earnings per share when we evaluate our continuing operational performance. We similarly exclude income (expense) related to assets held in a rabbi trust in connection with our deferred compensation plan. Specifically, we exclude stock-based compensation and income (expense) related to assets held in the deferred compensation plan rabbi trust during our annual budgeting process and our quarterly and annual assessments of our performance. The annual budgeting process is the primary mechanism whereby we allocate resources to various initiatives and operational requirements. Additionally, the annual review by our board of directors during which it compares our historical business model and profitability to the planned business model and profitability for the forthcoming year excludes the impact of stock-based compensation. In evaluating the performance of our senior management and department managers, charges related to stock-based compensation are excluded from expenditure and profitability results. In fact, we record stock-based compensation expense into a stand-alone cost center for which no single operational manager is responsible or accountable. In this way, we can review, on a period-to-period basis, each manager's performance and assess financial discipline over operational expenditures without the effect of stock-based compensation. We believe that these non-GAAP financial measures are useful to investors because they allow investors to (a) evaluate our operating results and the effectiveness of the methodology used by us to review our operating results, and (b) review historical comparability in our financial reporting as well as comparability with competitors' operating results.\nRestructuring charges and the related tax impact. We occasionally incur expenses for restructuring our workforce included in our GAAP presentation of cost of software licenses; cost of maintenance and service; research and development expense; and selling, general and administrative expense. We exclude these expenses for the purpose of calculating non-GAAP operating income, non-GAAP operating profit margin, non-GAAP net income and non-GAAP diluted earnings per share when we evaluate our continuing operational performance, as we generally do not incur these expenses as a part of our operations. We believe that these non-GAAP financial measures are useful to investors because they allow investors to (a) evaluate our operating results and the effectiveness of the methodology used by us to review our operating results, and (b) review historical comparability in our financial reporting as well as comparability with competitors' operating results.\nTransaction costs related to business combinations. We incur expenses for professional services rendered in connection with business combinations, which are included in our GAAP presentation of selling, general and administrative expense. These expenses are generally not tax-deductible. We exclude these acquisition-related transaction expenses, derived from announced\nacquisitions, for the purpose of calculating non-GAAP operating income, non-GAAP operating profit margin, non-GAAP net income and non-GAAP diluted earnings per share when we evaluate our continuing operational performance, as we generally would not have otherwise incurred these expenses in the periods presented as a part of our operations. We believe that these non-GAAP financial measures are useful to investors because they allow investors to (a) evaluate our operating results and the effectiveness of the methodology used by us to review our operating results, and (b) review historical comparability in our financial reporting as well as comparability with competitors' operating results.\nTax Cuts and Jobs Act. We recorded impacts to our income tax provision related to the enactment of the Tax Cuts and Jobs Act, specifically for the transition tax related to unrepatriated cash and the impacts of the tax rate change on net deferred tax assets. We exclude these impacts for the purpose of calculating non-GAAP net income and non-GAAP diluted earnings per share when we evaluate our continuing operational performance, as (i) the charges are not expected to recur as part of our normal operations and (ii) the charges resulted from the extremely infrequent event of major U.S. tax reform, the last such reform having occurred in 1986. We believe that these non-GAAP financial measures are useful to investors because they allow investors to (a) evaluate our operating results and the effectiveness of the methodology used by us to review our operating results, and (b) review historical comparability in our financial reporting.\nNon-GAAP financial measures are not in accordance with, or an alternative for, GAAP. Our non-GAAP financial measures are not meant to be considered in isolation or as a substitute for comparable GAAP financial measures and should be read only in conjunction with our consolidated financial statements prepared in accordance with GAAP.\nWe have provided a reconciliation of the non-GAAP financial measures to the most directly comparable GAAP financial measures as listed below:\nGAAP Reporting Measure\nNon-GAAP Reporting Measure\nRevenue\nNon-GAAP Revenue\nOperating Income\nNon-GAAP Operating Income\nOperating Profit Margin\nNon-GAAP Operating Profit Margin\nNet Income\nNon-GAAP Net Income\nDiluted Earnings Per Share\nNon-GAAP Diluted Earnings Per Share\nLiquidity and Capital Resources\nCash, Cash Equivalents and Short-Term Investments\nCash and cash equivalents consist primarily of highly liquid investments such as money market funds and deposits held at major banks. Short-term investments consist primarily of deposits held by certain of our foreign subsidiaries with original maturities of three months to one year. The following table presents our foreign and domestic holdings of cash, cash equivalents and short-term investments:\nIn general, it is our intention to permanently reinvest all earnings in excess of previously taxed amounts. As part of Tax Reform, substantially all of the previous earnings of our non-U.S. subsidiaries were taxed through the transition tax and current earnings are taxed as part of GILTI tax expense. These taxes increased our previously taxed earnings and allow for the repatriation of the majority of our foreign earnings without any residual U.S. federal tax. While we believe that the financial reporting bases may be greater than the tax bases of investments in foreign subsidiaries for any earnings in excess of previously taxed amounts, such amounts are considered permanently reinvested. The cumulative temporary difference related to such permanently reinvested earnings is approximately $32.8 million and we would anticipate the tax effect on those earnings to be immaterial as a result of Tax Reform.\nThe amount of cash, cash equivalents and short-term investments held by foreign subsidiaries is subject to translation adjustments caused by changes in foreign currency exchange rates as of the end of each respective reporting period, the offset to which is recorded in accumulated other comprehensive loss on our consolidated balance sheet.\nCash Flows from Operating Activities\nFiscal year 2019 as compared to fiscal year 2018\nNet cash provided by operating activities increased during the current fiscal year due to increased net income (net of non-cash operating adjustments) of $107.4 million, partially offset by decreased net cash flows from operating assets and liabilities of $92.4 million.\nFiscal year 2018 as compared to fiscal year 2017\nNet cash provided by operating activities increased during the prior fiscal year due to increased net income (net of non-cash operating adjustments) of $151.4 million, partially offset by decreased net cash flows from operating assets and liabilities of $94.1 million.\nCash Flows from Investing Activities\nFiscal year 2019 as compared to fiscal year 2018\nNet cash used in investing activities increased during the current fiscal year due primarily to increased acquisition-related net cash outlays of $504.2 million and increased capital expenditures of $23.2 million. We currently plan capital spending of $45.0 million to $55.0 million during fiscal year 2020 as compared to the $44.9 million that was spent in fiscal year 2019. The level of spending will depend on various factors, including the growth of the business and general economic conditions.\nFiscal year 2018 as compared to fiscal year 2017\nNet cash used in investing activities increased during the prior fiscal year due primarily to increased acquisition-related net cash outlays of $219.1 million.\nCash Flows from Financing Activities\nFiscal year 2019 as compared to fiscal year 2018\nNet cash provided by financing activities increased during the current fiscal year due primarily to $500.0 million in proceeds from long-term debt obtained in fiscal year 2019 related to the LST acquisition and decreased stock repurchases of $210.7 million, partially offset by increased restricted stock unit withholding taxes paid in lieu of issuing shares of $13.6 million.\nFiscal year 2018 as compared to fiscal year 2017\nNet cash used in financing activities decreased during the prior fiscal year due primarily to decreased stock repurchases of $66.2 million, partially offset by increased restricted stock unit withholding taxes paid in lieu of issuing shares of $17.8 million and decreased proceeds from shares issued for stock-based compensation of $11.5 million.\nOther Cash Flow Information\nWe believe that existing cash and cash equivalent balances of $872.1 million, together with cash generated from operations and access to the $500.0 million revolving credit facility, will be sufficient to meet our working capital and capital expenditure requirements through the next twelve months. Our cash requirements in the future may also be financed through additional equity or debt financings. There can be no assurance that such financings can be obtained on favorable terms, if at all. We repaid $75.0 million of our unsecured term loan in January 2020 prior to its scheduled maturity date.\nUnder our stock repurchase program, we repurchased shares as follows:\nIn February 2018, our Board of Directors increased the number of shares authorized for repurchase to a total of 5.0 million shares under the stock repurchase program. As of December 31, 2019, 3.5 million shares remained available for repurchase under the program.\nThe authorized repurchase program does not have an expiration date, and the pace of the repurchase activity will depend on factors such as working capital needs, cash requirements for acquisitions, our stock price, and economic and market conditions. Our stock repurchases may be effected from time to time through open market purchases or pursuant to a Rule 10b5-1 plan.\nWe continue to generate positive cash flows from operating activities and believe that the best uses of our excess cash are to invest in the business; acquire or make investments in complementary companies, products, services and technologies; and make payments on our outstanding debt balances. Any future acquisitions may be funded by available cash and investments, cash generated from operations, debt financing, or the issuance of additional securities. Additionally, we have in the past, and expect in the future, to repurchase stock in order to both offset dilution and return capital, in excess of our requirements, to stockholders with the goal of increasing stockholder value.\nOff-Balance-Sheet Arrangements\nWe do not have any special-purpose entities or off-balance-sheet arrangements.\nContractual Obligations\nOur significant contractual obligations as of December 31, 2019 are summarized below:\n(1)\nWe repaid $75.0 million of the unsecured term loan in January 2020 prior to its scheduled maturity date. As such, the payment is reflected as current on our consolidated balance sheet but not in the table above.\n(2)\nInterest on the long-term debt is estimated using the interest rate as of December 31, 2019, as the interest rate is variable. For additional information, see Note 10 to the consolidated financial statements included in Part IV, Item 15 of this Annual Report on Form 10-K. The interest payments reflected in the table above have not been reduced for the effect of the $75.0 million principal payment discussed in (1) above.\n(3)\nWe previously entered into a lease agreement for 186,000 square feet of rentable space located in an office facility in Canonsburg, Pennsylvania, which serves as our headquarters. The term of the lease is 183 months, beginning on October 1, 2014 and expiring on December 31, 2029. We have a one-time right to terminate the lease on December 31, 2025 by providing the landlord with at least 18 months' prior written notice of such termination.\n(4)\nOther operating leases primarily include noncancellable lease commitments for our other domestic and international offices as well as certain operating equipment.\n(5)\nUnconditional purchase obligations primarily include royalties and software licenses and services, which are unrecorded as of December 31, 2019.\n(6)\nWe have $64.4 million of unrecognized tax benefits, including estimated interest and penalties, that have been recorded as liabilities in accordance with income tax accounting guidance for which we are uncertain as to if or when such amounts may be settled. As a result, such amounts are excluded from the table above.\n(7)\nOther long-term obligations primarily include third-party commissions of $28.3 million; post-employment benefits, including pension obligations, of $12.7 million for certain foreign locations; and office space restoration of $3.1 million. These amounts include the related current portions when applicable.\nCritical Accounting Policies and Estimates\nWe believe that the following critical accounting policies affect the more significant judgments and estimates used in the preparation of our consolidated financial statements.\nRevenue Recognition: Our revenue is derived principally from the licensing of computer software products and from related maintenance contracts. We adopted ASC 606 on January 1, 2018 using the modified retrospective approach for all contracts not completed as of the date of adoption. Results for reporting periods beginning after January 1, 2018 are presented under ASC 606, while prior period amounts are not adjusted and continue to be reported in accordance with ASC 605. The adoption of ASC 606 represents a change in accounting principle that will more closely align revenue recognition with the delivery of our software licenses, maintenance and services.\nRevenue Recognition Policy 2019 and 2018 (ASC 606)\nWe enter into contracts that include combinations of products, maintenance and services, which are accounted for as separate performance obligations with differing revenue recognition patterns.\nRevenue from perpetual licenses is classified as software license revenue. Software license revenue is recognized up front upon delivery of the licensed product and/or the utility that enables the customer to access authorization keys, provided that an enforceable contract has been received. Typically, our perpetual licenses are sold with post-contract support (PCS), which includes unspecified technical enhancements and customer support. We allocate value in bundled perpetual and PCS arrangements based on the standalone selling prices of the perpetual license and PCS. Revenue from PCS is classified as maintenance revenue and is recognized ratably over the term of the contract, as we satisfy the PCS performance obligation over time.\nIn addition to perpetual licenses, we sell time-based lease licenses. Lease licenses are sold only as a bundled arrangement that includes the rights to a term software license and PCS. Utilizing observable inputs, we determined that 50% of the estimated standalone selling price of the lease license is attributable to the term license and 50% is attributable to the PCS. This determination considered the value relationship for our products between PCS to time-based lease licenses, the value relationship between PCS and perpetual licenses, the average economic life of our products, software renewal rates and the price of the bundled arrangement in relation to the perpetual licensing approach. Consistent with the perpetual sales, the license component is classified as software license revenue and recognized as revenue up front at the commencement of the lease upon delivery of the licensed product and/or utility that enables the customer to access authorization keys. The PCS is classified as maintenance revenue and is recognized ratably over the term of the contract, as we provide the PCS benefit over time.\nRevenue from training, support and other services is recognized as the services are performed. For contracts in which the service consists of a single performance obligation, such as providing a training class to a customer, we recognize revenue upon completion of the performance obligation. For service contracts that are longer in duration and often include multiple performance obligations (for example, both training and consulting), we measure the progress toward completion of the obligations and recognize revenue accordingly. In measuring progress towards the completion of performance obligations, we typically utilize output-based estimates for services with contractual billing arrangements that are not based on time and materials, and estimate output based on the total tasks completed as compared to the total tasks required for each work contract. Input-based estimates are utilized for services that involve general consultations with contractual billing arrangements based on time and materials, utilizing direct labor as the input measure. Proceeds from customers for the purpose of expediting road-map items, developing new products or creating specific features and functionality for existing products is classified as revenue.\nWe also execute arrangements through independent channel partners in which the channel partners are authorized to market and distribute our software products to end users of our products and services in specified territories. In sales facilitated by channel partners, the channel partner bears the risk of collection from the end-user customer. We recognize revenue from transactions with channel partners in a manner consistent with the direct sales described above for both perpetual and time-based licenses. Revenue from channel partner transactions is the amount remitted to us by the channel partners. This amount includes a fee for PCS that is compensation for providing technical enhancements and the second level of technical support to the end user, which is recognized over the period that PCS is to be provided.\nNon-income related taxes collected from customers and remitted to governmental authorities are recorded on the consolidated balance sheet as accounts receivable and accrued expenses. The collection and payment of these amounts are reported on a net basis in the consolidated statements of income and do not impact reported revenues or expenses.\nWe do not offer right of return. We warrant to our customers that our software will perform substantially as specified in our current user manuals. We have not experienced significant claims related to software warranties beyond the scope of\nmaintenance support, which we are already obligated to provide. The warranty is not sold, and cannot be purchased, separately. The warranty does not provide any type of additional service to the customer or performance obligation for us.\nOur agreements with our customers generally require us to indemnify the customer against claims that our software infringes third-party patent, copyright, trademark or other proprietary rights. Such indemnification obligations are generally limited in a variety of industry-standard respects, including our right to replace an infringing product.\nSignificant Judgments (ASC 606)\nOur contracts with customers typically include promises to transfer licenses and services to a customer. Judgment is required to determine if the promises are separate performance obligations, and if so, to allocate the transaction price to each performance obligation. We use the estimated standalone selling price method to allocate the transaction price for each performance obligation. The estimated standalone selling price is determined using all information reasonably available to us, including market conditions and other observable inputs. The corresponding revenues are recognized as the related performance obligations are satisfied.\nWe apply a practical expedient to expense sales commissions as incurred when the amortization period would have been one year or less. Sales commissions associated with the initial year of multi-year contracts are expensed as incurred due to their immateriality. Sales commissions associated with multi-year contracts beyond the initial year are subject to an employee service requirement and are expensed as incurred as they are not considered incremental costs to obtain a contract.\nWe are required to adjust promised amounts of consideration for the effects of the time value of money if the timing of the payments provides the customer or us with a significant financing benefit. We consider various factors in assessing whether a financing component exists, including the duration of the contract, market interest rates and the timing of payments. Our contracts do not include a significant financing component requiring adjustment to the transaction price.\nRevenue Recognition Policy 2017 (ASC 605)\nRevenue from perpetual licenses was classified as license revenue and was recognized upon delivery of the licensed product and/or the utility that enabled the customer to access authorization keys, provided that acceptance had occurred and a signed contractual obligation was received, the price was fixed and determinable, and collectibility of the receivable was probable. We determined the fair value of PCS sold together with perpetual licenses based on the rate charged for PCS when sold separately. Revenue from PCS contracts was classified as maintenance and service revenue and was recognized ratably over the term of the contract.\nRevenue for software lease licenses was classified as license revenue and was recognized over the period of the lease contract. Typically, our software leases include PCS which, due to the short term (principally one year or less) of our software lease licenses, were not permitted to be separated from lease revenue for accounting purposes. As a result, both the lease licenses and PCS were recognized ratably over the lease period. We included the revenue for the entire lease arrangement within software license revenue in the consolidated statements of income.\nMany of our semiconductor products are typically licensed via longer term leases of 24-36 months. We recognized revenue for these licenses over the term of the lease contract. Because we did not have vendor-specific objective evidence of the fair value of these leases, we also recognized revenue from perpetual licenses over the term of the lease contract during the infrequent occurrence of these licenses being sold with semiconductor leases in multiple-element arrangements.\nRevenue from training, support and other services was recognized as the services were performed. We applied the specific performance method to contracts in which the service consisted of a single act, such as providing a training class to a customer, and the proportional performance method to other service contracts that were longer in duration and often included multiple acts (for example, both training and consulting). In applying the proportional performance method, we typically utilized output-based estimates for services with contractual billing arrangements that were not based on time and materials, and estimated output based on the total tasks completed as compared to the total tasks required for each work contract. Input-based estimates were utilized for services that involved general consultations with contractual billing arrangements based on time and materials, utilizing direct labor as the input measure.\nThe accounting treatment under ASC 605 associated with arrangements through independent channel partners, non-income related taxes, warranties and indemnification obligations is consistent with the accounting treatment under ASC 606 described above.\nGoodwill and Other Intangible Assets: We test goodwill and indefinite-lived intangible assets for impairment at least annually by performing a quantitative assessment of whether the fair value of each reporting unit or asset exceeds its carrying amount. We have one reporting unit. Goodwill is tested at this reporting unit level and indefinite-lived intangible assets are tested at the individual asset level. This requires us to assess and make judgments regarding a variety of factors which impact the fair value\nof the reporting unit or asset being tested, including business plans, anticipated future cash flows, economic projections and other market data. Because there are inherent uncertainties involved in these factors, significant differences between these estimates and actual results could result in future impairment charges and could materially impact our future financial results. During the first quarter of 2019, we completed the annual impairment test for goodwill and the indefinite-lived intangible asset and determined that these assets had not been impaired as of the test date, January 1, 2019. No other events or circumstances changed during the year ended December 31, 2019 that would indicate that the fair values of our reporting unit and indefinite-lived intangible asset are below their carrying values.\nIntangible assets are recognized apart from goodwill whenever an acquired intangible asset arises from contractual or other legal rights, or whenever it is capable of being separated or divided from the acquired entity and sold, transferred, licensed, rented, or exchanged, either individually or in combination with a related contract, asset or liability. We determined the fair value of our intangible assets using various valuation techniques, including the relief-from-royalty method and the multi-period excess earnings method. These models utilize certain unobservable inputs classified as Level 3 measurements as defined by ASC 820, Fair Value Measurements and Disclosures. The determination of fair value requires considerable judgment and is sensitive to changes in underlying assumptions, estimates and market factors. Estimating fair value requires us to make assumptions and estimates regarding our future plans, as well as industry and economic conditions. These assumptions and estimates include, but are not limited to: royalty rate, discount rate and attrition rate. The fair values of the intangible assets will be amortized over their useful lives. Impairment losses are recognized if the carrying amounts of finite-lived intangible assets are both not recoverable and exceed the fair values.\nIncome Taxes: We account for income taxes under the asset and liability method, which requires the recognition of deferred tax assets and liabilities for the expected future tax consequences of events that have been included in the financial statements. Under this method, deferred tax assets and liabilities are determined based on the differences between the financial statement and tax bases of assets and liabilities using enacted tax rates in effect for the year in which the differences are expected to reverse. The effect of a change in tax rates on deferred tax assets and liabilities is recognized in income in the period of the enactment date.\nWe record net deferred tax assets to the extent we believe these assets will more likely than not be realized. In making such determination, we consider all available positive and negative evidence, including scheduled reversals of deferred tax liabilities, projected future taxable income, tax planning strategies and recent financial operations. In the event we determine that we will be able to realize deferred tax assets for which a valuation allowance was used to reduce their carrying value, the adjustment to the valuation allowance will be recorded as a reduction to the provision for income taxes.\nTax benefits related to uncertain tax positions taken or expected to be taken on a tax return are recorded when such benefits meet a more-likely-than-not threshold. Otherwise, these tax benefits are recorded when a tax position has been effectively settled, which means that the statute of limitations has expired or the appropriate taxing authority has completed its examination even though the statute of limitations remains open.\nWe recognize interest and penalties related to income taxes within the income tax expense line in the consolidated statements of income. Accrued interest and penalties are included within the related tax liability line in the consolidated balance sheets.\nStock-Based Compensation: We grant restricted stock units and other stock awards to employees and directors under our equity incentive plan. Eligible employees can also purchase shares of our common stock at a discount under our employee stock purchase plan. The benefits provided under these plans are stock-based payments subject to the provisions of stock-based payment accounting guidance. We use the fair value method to apply the provisions of stock-based payment accounting guidance. Stock-based compensation expense for 2019, 2018 and 2017 was $116.2 million, $83.3 million and $53.2 million, respectively. As of December 31, 2019, total unrecognized estimated compensation expense related to awards granted prior to that date was $186.4 million, which is expected to be recognized over a weighted average period of 1.5 years.\nPrior to 2017, we granted stock option awards. The value of each stock option award was estimated on the date of grant, or date of acquisition for options issued in a business combination, using the Black-Scholes option pricing model (Black-Scholes model). The determination of the fair value of stock-based payment awards using an option pricing model was affected by our stock price as well as assumptions regarding a number of complex and subjective variables. These variables included our stock volatility during the preceding six years, actual and projected employee stock option exercise behaviors, interest rate assumptions using the five-year U.S. Treasury Note yield on the date of grant or acquisition date, and expected dividends. The stock-based compensation expense for options is recorded ratably over the requisite service period.\nWe issue various restricted stock unit awards which contain either a market condition, a performance condition, a service condition, or certain combinations of the three. Restricted stock unit awards are valued based on the grant-date fair value of the award. Stock-based compensation expense is recognized over the employee's requisite service period for awards with only a service condition. For awards with a performance condition, stock-based compensation expense is recorded from the service\ninception date through the conclusion of the measurement period based on management's estimates concerning the probability of vesting.\nVesting of restricted stock unit awards with a market condition is based on our performance as measured by total stockholder return relative to the appreciation of a specified stock index over the measurement period, subject to each participant's continued employment through the conclusion of the measurement period. The fair value of the restricted stock unit awards with a market condition is estimated using a Monte Carlo simulation model. The determination of the fair value of the awards is affected by the grant date and several variables, each of which has been identified in the chart below. Stock-based compensation expense based on the fair value of the award is recorded from the grant date through the conclusion of the measurement period.\nWe also grant restricted stock units to non-employee Directors, which vest upon the earlier of one year from the date of grant or the date of the next regular annual meeting of stockholders. If a non-employee Director retires prior to the vest date, the non-employee Director receives a pro-rata portion of the restricted stock units.\nTo the extent we change the terms of our stock-based compensation programs, experience market volatility in the pricing of our common stock that increases the implied volatility assumption used in the pricing models, refine different assumptions, or assume stock awards from acquired companies that are different in nature than our stock award arrangements, among other potential impacts, the stock-based compensation expense recorded in future periods and the related tax benefits may differ significantly from what was recorded in previous reporting periods. Forfeitures of awards are accounted for as they occur.\nEstimates of stock-based compensation expense are significant to our financial statements, but this expense is partially based on the aforementioned option valuation and Monte Carlo simulation models and will never result in the payment of cash by us other than through the payment of withholding taxes in lieu of additional share issuance. For this reason, and because we do not view stock-based compensation as related to our operational performance, the Board of Directors and management exclude stock-based compensation expense when evaluating our underlying business performance.\nContingencies: We are involved in various investigations, claims and legal proceedings that arise in the ordinary course of business, including commercial disputes, labor and employment matters, tax audits, alleged infringement of intellectual property rights and other matters. We review the status of these matters, assess our financial exposure and record a related accrual if the potential loss from an investigation, claim or legal proceeding is probable and the amount is reasonably estimable. Significant judgment is involved in the determination of probability and in the determination of whether an exposure is reasonably estimable. As a result of the uncertainties involved in making these estimates, we may have to revise our estimates as facts and circumstances change. The revision of these estimates could have a material impact on our financial position and results of operations.\nRecent Accounting Guidance\nFor information regarding recent accounting guidance and its impact on our consolidated financial statements, see Note 2 to the consolidated financial statements in Part IV, Item 15 of this Annual Report on Form 10-K.",
    "item_7A": "ITEM 7A.\nQUANTITATIVE AND QUALITATIVE DISCLOSURES ABOUT MARKET RISK\nInterest Rate Risk. Changes in the overall level of interest rates affect the interest income that is generated from our cash, cash equivalents and short-term investments and the interest expense that is generated from our outstanding borrowings. For the year ended December 31, 2019, interest income was $12.8 million and interest expense was $3.5 million. Cash and cash equivalents consist primarily of highly liquid investments such as money market funds and deposits held at major banks. Short-term investments consist primarily of deposits held by certain foreign subsidiaries with original maturities of three months to one year.\nForeign Currency Transaction Risk. As we operate in international regions, a portion of our revenue, expenses, cash, accounts receivable and payment obligations are denominated in foreign currencies. As a result, changes in currency exchange rates will affect our financial position, results of operations and cash flows. We are most impacted by movements in and among the British Pound, Euro, Japanese Yen, South Korean Won and U.S. Dollar.\nWith respect to revenue, on average for the year ended December 31, 2019, the U.S. Dollar was approximately 3.3% stronger, when measured against our primary foreign currencies, than for the year ended December 31, 2018. The table below presents the impacts of currency fluctuations on revenue for the year ended December 31, 2019. Amounts in brackets indicate a net adverse impact from currency fluctuations.\nThe net overall stronger U.S. Dollar also resulted in decreased operating income of $10.2 million for the year ended December 31, 2019 as compared to the year ended December 31, 2018.\nThe most significant currency impacts on revenue and operating income are typically attributable to U.S. Dollar exchange rate changes against the British Pound, Euro, Japanese Yen and South Korean Won. Historical exchange rates for these currency pairs are reflected in the charts below:",
    "item_8": "ITEM 8.\nFINANCIAL STATEMENTS AND SUPPLEMENTARY DATA\nThe following tables set forth selected unaudited quarterly information. We believe that the amounts stated below present fairly the results of such periods when read in conjunction with the consolidated financial statements and related notes included in Part IV, Item 15 of this Annual Report on Form 10-K.\nOther information required by this Item is included in Part IV, Item 15 of this Annual Report on Form 10-K.",
    "item_9": "ITEM 9.\nCHANGES IN AND DISAGREEMENTS WITH ACCOUNTANTS ON ACCOUNTING AND FINANCIAL DISCLOSURE\nNone.",
    "item_9A": "ITEM 9A.\nCONTROLS AND PROCEDURES\nEvaluation of Disclosure Controls and Procedures. As required by Rules 13a-15 and 15d-15 of the Securities Exchange Act of 1934, as amended, or the Exchange Act, we have evaluated, with the participation of management, including the Chief Executive Officer and the Chief Financial Officer, the effectiveness of the design and operation of our disclosure controls and procedures as of the end of the period covered by this report. Based on such evaluation, the Chief Executive Officer and Chief Financial Officer have concluded that such disclosure controls and procedures are effective, as defined in Rule 13a-15(e) of the Exchange Act.\nWe believe, based on our knowledge, that the financial statements and other financial information included in this report fairly present, in all material respects, our financial condition, results of operations and cash flows as of and for the periods presented in this report. We are committed to both a sound internal control environment and to good corporate governance.\nFrom time to time, we review the disclosure controls and procedures, and may periodically make changes to enhance their effectiveness and to ensure that our systems evolve with our business.\nManagement's Report on Internal Control over Financial Reporting. Management is responsible for establishing and maintaining adequate internal control over financial reporting, as such term is defined in Exchange Act Rules 13a-15(f). Under the supervision and with the participation of management, including our Chief Executive Officer and Chief Financial Officer, we have conducted an evaluation of the effectiveness of our internal control over financial reporting based upon the Internal Control - Integrated Framework (2013) issued by the Committee of Sponsoring Organizations of the Treadway Commission. Based on this evaluation, our Chief Executive Officer and Chief Financial Officer have concluded that our internal control over financial reporting was effective at December 31, 2019.\nBecause of its inherent limitations, internal control over financial reporting may not prevent or detect misstatements. Projections of any evaluation of effectiveness to future periods are subject to the risk that controls may become inadequate because of changes in conditions, or that the degree of compliance with policies or procedures may deteriorate.\nAdditionally, Deloitte & Touche LLP, an independent registered public accounting firm, has audited the financial statements included in this Annual Report on Form 10-K and has issued an attestation report on our internal control over financial reporting. This report is included in Item 15 of this Annual Report on Form 10-K.\nChanges in Internal Controls. There were no changes in our internal control over financial reporting that occurred during the three months ended December 31, 2019 that materially affected, or were reasonably likely to materially affect, our internal control over financial reporting.",
    "item_9B": "ITEM 9B.\nOTHER INFORMATION\nNone.\nPART III",
    "item_9C": "",
    "item_10": "ITEM 10.\nDIRECTORS, EXECUTIVE OFFICERS AND CORPORATE GOVERNANCE\nThe information required by this Item is incorporated by reference to our 2020 Proxy Statement and is set forth under “Corporate Governance at Ansys,” “Director Nominations,” “Continuing Directors Following the 2020 Annual Meeting,” “Our Executive Officers,” “Delinquent Section 16(a) Reports” and “Audit Committee” therein.\nWe adopted a Code of Business Conduct and Ethics that applies to our principal executive officer, principal financial and accounting officer, and all of our directors and employees. Our Code of Business Conduct and Ethics is posted under the Corporate Responsibility tab of the Investor Relations section of our website at https://investors.ansys.com. We will post any amendments to, or waiver of, our Code of Business Conduct and Ethics that apply to our principal executive officer and principal financial and accounting officer on our website.",
    "item_11": "ITEM 11.\nEXECUTIVE COMPENSATION\nThe information required by this Item is incorporated by reference to our 2020 Proxy Statement and is set forth under “Compensation Discussion and Analysis,” “Compensation Policies and Practices Related to Risk Management,” “Fiscal 2019 Compensation Tables,” “2019 CEO Pay Ratio,” “Compensation Committee Report,” “Compensation Committee Interlocks and Insider Participation,” “Director Nominations” and “Non-Employee Director Compensation” therein.",
    "item_12": "ITEM 12.\nSECURITY OWNERSHIP OF CERTAIN BENEFICIAL OWNERS AND MANAGEMENT, AND RELATED STOCKHOLDER MATTERS\nEquity Compensation Plan Information as of December 31, 2019\n(1)\nThe weighted average exercise price does not take into account the shares for outstanding restricted stock units or deferred stock awards, which have no exercise price.\n(2)\nIncludes 1,617,974 shares for outstanding restricted stock units for employees, 929,559 shares for outstanding stock options, 9,688 shares for outstanding restricted stock units for non-employee directors and 60,081 shares for deferred stock awards for non-employee directors. Restricted stock units with a performance or market condition are included based on target performance, unless performance is otherwise known.\n(3)\nThe number of securities remaining available for future issuance assumes maximum attainment for awards with a performance condition or a market condition.\n(4)\nThe number of shares issuable with respect to the current offering period is not determinable until the end of the period.\n(5)\nThe per share purchase price of shares issuable with respect to the current offering period is not determinable until the end of the period.\n(6)\nWe no longer issue awards under equity compensation plans not approved by security holders.\nAll other information required by this Item is incorporated by reference to our 2020 Proxy Statement and is set forth under “Ownership of Our Common Stock” therein.",
    "item_13": "ITEM 13.\nCERTAIN RELATIONSHIPS AND RELATED TRANSACTIONS, AND DIRECTOR INDEPENDENCE\nThe information required by this Item is incorporated by reference to our 2020 Proxy Statement and is set forth under “Director Independence” and “Related-Party Transactions” therein.",
    "item_14": "ITEM 14.\nPRINCIPAL ACCOUNTANT FEES AND SERVICES\nThe information required by this Item is incorporated by reference to our 2020 Proxy Statement and is set forth under “Independent Registered Accounting Firm Services and Fees” therein.\nPART IV",
    "item_15": "ITEM 15.\nEXHIBITS AND FINANCIAL STATEMENT SCHEDULES\n(a)\nDocuments Filed as Part of this Annual Report on Form 10-K:\n1.\nFinancial Statements: The following consolidated financial statements and reports are filed as part of this report:\n-\nManagement's Report on Internal Control over Financial Reporting\n-\nReports of Independent Registered Public Accounting Firm\n-\nConsolidated Balance Sheets as of December 31, 2019 and 2018\n-\nConsolidated Statements of Income for the years ended December 31, 2019, 2018 and 2017\n-\nConsolidated Statements of Comprehensive Income for the years ended December 31, 2019, 2018 and 2017\n-\nConsolidated Statements of Cash Flows for the years ended December 31, 2019, 2018 and 2017\n-\nConsolidated Statements of Stockholders' Equity for the years ended December 31, 2019, 2018 and 2017\n-\nNotes to Consolidated Financial Statements\n2.\nFinancial Statement Schedule: The following financial statement schedule is filed as part of this report and should be read in conjunction with the consolidated financial statements.\n-\nSchedule II - Valuation and Qualifying Accounts\nSchedules not listed above have been omitted because they are not applicable, are not required or the information required to be set forth therein is included in the consolidated financial statements or notes thereto.\n3.\nExhibits: The exhibits listed in the accompanying Exhibit Index immediately following the financial statement schedule are filed as part of, or incorporated by reference into, this Annual Report on Form 10-K.\n(b)\nExhibits:\nWe hereby file as part of this Annual Report on Form 10-K the exhibits listed in the Exhibit Index immediately following the financial statement schedule of this Annual Report on Form 10-K.\n(c)\nFinancial Statement Schedule:\nWe hereby file as part of this Annual Report on Form 10-K the financial statement schedule listed in Item 15(a)(2) as set forth above.\nMANAGEMENT'S REPORT ON INTERNAL CONTROL OVER FINANCIAL REPORTING\nManagement is responsible for establishing and maintaining an adequate system of internal control over our financial reporting. In order to evaluate the effectiveness of internal control over financial reporting, management has conducted an assessment, including testing, using the financial reporting criteria in the Internal Control - Integrated Framework (2013), issued by the Committee of Sponsoring Organizations of the Treadway Commission.\nOur system of internal control over financial reporting is designed to provide reasonable assurance to management and the Board of Directors regarding the reliability of financial records used in preparation of our published financial statements. As all internal control systems have inherent limitations, even systems determined to be effective can provide only reasonable assurance with respect to financial statement preparation and presentation. Based on their assessment, management has concluded that we maintained an effective system of internal control over financial reporting as of December 31, 2019. Deloitte & Touche LLP, an independent registered public accounting firm, has audited our internal control over financial reporting as of December 31, 2019, as stated in their report which appears in Part IV, Item 15 of this Annual Report on Form 10-K.\n/s/ AJEI S. GOPAL\n/s/ MARIA T. SHIELDS\nAjei S. Gopal\nMaria T. Shields\nPresident and Chief Executive Officer\nChief Financial Officer\nFebruary 27, 2020\nFebruary 27, 2020\nREPORT OF INDEPENDENT REGISTERED PUBLIC ACCOUNTING FIRM\nTo the Stockholders and the Board of Directors of ANSYS, Inc.\nOpinion on the Financial Statements\nWe have audited the accompanying consolidated balance sheets of ANSYS, Inc. and subsidiaries (the “Company”) as of December 31, 2019 and 2018, the related consolidated statements of income, comprehensive income, stockholders’ equity, and cash flows for each of the three years in the period ended December 31, 2019, and the related notes and the schedule listed in the Index at Item 15 (collectively referred to as the “financial statements”). In our opinion, the financial statements present fairly, in all material respects, the financial position of the Company as of December 31, 2019 and 2018, and the results of its operations and its cash flows for each of the three years in the period ended December 31, 2019, in conformity with accounting principles generally accepted in the United States of America.\nWe have also audited, in accordance with the standards of the Public Company Accounting Oversight Board (United States) (PCAOB), the Company’s internal control over financial reporting as of December 31, 2019, based on criteria established in Internal Control-Integrated Framework (2013) issued by the Committee of Sponsoring Organizations of the Treadway Commission and our report dated February 27, 2020, expressed an unqualified opinion on the Company’s internal control over financial reporting.\nChange in Accounting Principle\nAs discussed in Note 2 to the financial statements, the Company has changed its method of accounting for leases in 2019 due to the adoption of the new leasing standard. The Company adopted the new leasing standard using a modified retrospective approach.\nAs discussed in Note 3 to the financial statements, the Company has changed its method of accounting for revenue from contracts with customers in 2018 due to the adoption of the new revenue standard. The Company adopted the new revenue standard using a modified retrospective approach.\nBasis for Opinion\nThese financial statements are the responsibility of the Company’s management. Our responsibility is to express an opinion on the Company’s financial statements based on our audits. We are a public accounting firm registered with the PCAOB and are required to be independent with respect to the Company in accordance with the U.S. federal securities laws and the applicable rules and regulations of the Securities and Exchange Commission and the PCAOB.\nWe conducted our audits in accordance with the standards of the PCAOB. Those standards require that we plan and perform the audit to obtain reasonable assurance about whether the financial statements are free of material misstatement, whether due to error or fraud. Our audits included performing procedures to assess the risks of material misstatement of the financial statements, whether due to error or fraud, and performing procedures that respond to those risks. Such procedures included examining, on a test basis, evidence regarding the amounts and disclosures in the financial statements. Our audits also included evaluating the accounting principles used and significant estimates made by management, as well as evaluating the overall presentation of the financial statements. We believe that our audits provide a reasonable basis for our opinion.\nCritical Audit Matters\nThe critical audit matters communicated below are matters arising from the current-period audit of the financial statements that were communicated or required to be communicated to the audit committee and that (1) relate to accounts or disclosures that are material to the financial statements and (2) involved our especially challenging, subjective, or complex judgments. The communication of critical audit matters does not alter in any way our opinion on the financial statements, taken as a whole, and we are not, by communicating the critical audit matters below, providing separate opinions on the critical audit matters or on the accounts or disclosures to which they relate.\nRevenue-Time-Based Lease Licenses-Refer to Notes 2 and 3 to the financial statements\nCritical Audit Matter Description\nThe Company sells time-based lease (TBL) licenses that are a bundled arrangement that include the rights to a term software license as well as post-contract support (PCS). Revenue is recognized up front at the commencement of the lease for the term software license and recognized ratably over the term of the contract for the PCS in the arrangement. Utilizing observable\ninputs, the Company determined that 50% of the estimated standalone selling price of the TBL is attributable to the term software license, while 50% is attributable to PCS. This determination involved judgment, particularly as it relates to the value relationship between the Company’s PCS to TBLs, the value relationship between PCS and the Company’s perpetual licenses and its linkage to the shortened term of a TBL, the average economic life of the Company’s software, renewal rates of its customers, and the price of the bundled arrangement in relation to the perpetual licensing approach.\nGiven the judgments necessary to determine the allocation between the term software license and PCS, auditing this estimate involved a high degree of auditor judgment.\nHow the Critical Audit Matter Was Addressed in the Audit\nOur audit procedures related to management’s estimate of the allocation between the term software license and PCS in a TBL included the following, among others:\n•\nWe tested the effectiveness of controls over TBL revenue, including those over the determination of the estimated standalone selling price of the Company’s licenses and services, as well as the allocation of this standalone selling price within the arrangement.\n•\nWe evaluated the pricing relationship between PCS and perpetual licenses on the net licensing fee of the arrangement, as well as the Company’s renewal rate of PCS sales on perpetual licenses through those arrangements selected for testing that contained both elements as a consideration point of the value relationship between the term software license and PCS when a customer purchases a bundled TBL.\n•\nWe evaluated the estimated economic life of the Company’s software through observable data points.\n•\nThrough our current and historical audit procedures, we confirmed that the term software license portion and PCS portion of an arrangement are not sold separately from one another.\n•\nWe selected a sample of arrangements and performed the following:\n-\nCompared the list price of the TBL to the consideration received from the customer and recalculated the discount from list price for each arrangement\n-\nEvaluated whether management appropriately calculated the estimated standalone selling price for the TBL\n-\nTested management’s identification of distinct performance obligations\n-\nTested the mathematical accuracy of revenue recognized at a point in time or over time based upon the identification of TBLs within the arrangement\nAcquisitions-Livermore Software Technology, LLC- Developed Software and Core Technologies Intangible Asset-Refer to Notes 2 and 4 to the financial statements\nCritical Audit Matter Description\nThe Company completed the acquisition of Livermore Software Technology, LLC for $777.8 million on November 1, 2019. The Company accounted for the acquisition under the acquisition method of accounting for business combinations. Accordingly, the purchase price was allocated to the assets acquired and liabilities assumed based on their respective fair values, including the developed software and core technologies intangible asset of $167.7 million. Management estimated the fair value of the developed software and core technologies intangible asset using the relief from royalty method. The fair value determination of the developed software and core technologies intangible asset required management to make significant estimates and assumptions related to the royalty rate, revenue growth rate, and the selection of the discount rate.\nGiven the fair value determination of the developed software and core technologies intangible asset requires management to make significant estimates and assumptions related to the selected royalty rate, forecasts of future revenue growth, and the selection of the discount rate, performing audit procedures to evaluate the reasonableness of these estimates and assumptions required a high degree of auditor judgment and an increased extent of effort, including the need to involve our fair value specialists.\nHow the Critical Audit Matter Was Addressed in the Audit\nOur audit procedures related to the selection of the royalty rate, forecasts of future revenue growth, and the selection of the discount rate for the developed software and core technologies intangible asset included the following, among others:\n•\nWe tested the effectiveness of controls over the valuation of the developed software and core technologies intangible asset, including management’s controls over the selection of the royalty rate, forecasts of future revenue growth, and selection of the discount rate.\n•\nWe assessed the reasonableness of management’s forecasts of future revenue growth by comparing the projections to historical results and certain industry data.\n•\nWe selected a sample of historical revenue transactions included within the valuation model and evaluated the appropriate recognition of revenue within the relevant period.\n•\nWith the assistance of our fair value specialists, we evaluated the reasonableness of the (1) valuation methodology, (2) royalty rate, and (3) discount rate by:\n-\nTesting the source information underlying the determination of the discount rate and testing the mathematical accuracy of the calculation\n-\nEvaluating the selected royalty rate against market data of comparable licensing agreements, as well as historical licensing agreements\n-\nDeveloping a range of independent estimates and comparing those to the discount rate selected by management\n/s/ Deloitte & Touche LLP\nPittsburgh, Pennsylvania\nFebruary 27, 2020\nWe have served as the Company's auditor since 2002.\nREPORT OF INDEPENDENT REGISTERED PUBLIC ACCOUNTING FIRM\nTo the Stockholders and the Board of Directors of ANSYS, Inc.\nOpinion on Internal Control over Financial Reporting\nWe have audited the internal control over financial reporting of ANSYS, Inc. and subsidiaries (the “Company”) as of December 31, 2019, based on criteria established in Internal Control - Integrated Framework (2013) issued by the Committee of Sponsoring Organizations of the Treadway Commission (COSO). In our opinion, the Company maintained, in all material respects, effective internal control over financial reporting as of December 31, 2019, based on criteria established in Internal Control - Integrated Framework (2013) issued by COSO.\nWe have also audited, in accordance with the standards of the Public Company Accounting Oversight Board (United States) (PCAOB), the consolidated financial statements as of and for the year ended December 31, 2019, of the Company and our report dated February 27, 2020, expressed an unqualified opinion on those financial statements.\nBasis for Opinion\nThe Company’s management is responsible for maintaining effective internal control over financial reporting and for its assessment of the effectiveness of internal control over financial reporting, included in the accompanying Management’s Report on Internal Control over Financial Reporting. Our responsibility is to express an opinion on the Company’s internal control over financial reporting based on our audit. We are a public accounting firm registered with the PCAOB and are required to be independent with respect to the Company in accordance with the U.S. federal securities laws and the applicable rules and regulations of the Securities and Exchange Commission and the PCAOB.\nWe conducted our audit in accordance with the standards of the PCAOB. Those standards require that we plan and perform the audit to obtain reasonable assurance about whether effective internal control over financial reporting was maintained in all material respects. Our audit included obtaining an understanding of internal control over financial reporting, assessing the risk that a material weakness exists, testing and evaluating the design and operating effectiveness of internal control based on the assessed risk, and performing such other procedures as we considered necessary in the circumstances. We believe that our audit provides a reasonable basis for our opinion.\nDefinition and Limitations of Internal Control over Financial Reporting\nA company’s internal control over financial reporting is a process designed to provide reasonable assurance regarding the reliability of financial reporting and the preparation of financial statements for external purposes in accordance with generally accepted accounting principles. A company’s internal control over financial reporting includes those policies and procedures that (1) pertain to the maintenance of records that, in reasonable detail, accurately and fairly reflect the transactions and dispositions of the assets of the company; (2) provide reasonable assurance that transactions are recorded as necessary to permit preparation of financial statements in accordance with generally accepted accounting principles, and that receipts and expenditures of the company are being made only in accordance with authorizations of management and directors of the company; and (3) provide reasonable assurance regarding prevention or timely detection of unauthorized acquisition, use, or disposition of the company’s assets that could have a material effect on the financial statements.\nBecause of its inherent limitations, internal control over financial reporting may not prevent or detect misstatements. Also, projections of any evaluation of effectiveness to future periods are subject to the risk that controls may become inadequate because of changes in conditions, or that the degree of compliance with the policies or procedures may deteriorate.\n/s/ Deloitte & Touche LLP\nPittsburgh, Pennsylvania\nFebruary 27, 2020\nANSYS, INC. AND SUBSIDIARIES\nCONSOLIDATED BALANCE SHEETS\nThe accompanying notes are an integral part of the consolidated financial statements.\nANSYS, INC. AND SUBSIDIARIES\nCONSOLIDATED STATEMENTS OF INCOME\nThe accompanying notes are an integral part of the consolidated financial statements.\nANSYS, INC. AND SUBSIDIARIES\nCONSOLIDATED STATEMENTS OF COMPREHENSIVE INCOME\nThe accompanying notes are an integral part of the consolidated financial statements.\nANSYS, INC. AND SUBSIDIARIES\nCONSOLIDATED STATEMENTS OF CASH FLOWS\nThe accompanying notes are an integral part of the consolidated financial statements.\nANSYS, INC. AND SUBSIDIARIES\nCONSOLIDATED STATEMENTS OF STOCKHOLDERS' EQUITY\nThe accompanying notes are an integral part of the consolidated financial statements.\nANSYS, INC. AND SUBSIDIARIES\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nDecember 31, 2019\n1.\nOrganization\nWe develop and globally market engineering simulation software and services widely used by engineers, designers, researchers and students across a broad spectrum of industries and academia, including aerospace and defense, automotive, electronics, semiconductors, energy, materials and chemical processing, turbomachinery, consumer products, healthcare, and sports.\nAs defined by the accounting guidance for segment reporting, we operate as one segment.\nGiven the integrated approach to the multi-discipline problem-solving needs of our customers, a single sale of software may contain components from multiple product areas and include combined technologies. We also have a multi-year product and integration strategy that will result in new, combined products or changes to the historical product offerings. As a result, it is impracticable for us to provide accurate historical or current reporting among our various product lines.\n2.\nAccounting Policies\nAccounting Principles\nThe financial statements and accompanying notes are prepared in accordance with accounting principles generally accepted in the United States. Certain items in the consolidated financial statements and the notes to the consolidated financial statements of prior years have been reclassified to conform to the current year's presentation. These reclassifications had no effect on reported net income, comprehensive income, cash flows, total assets or total liabilities and stockholders' equity.\nPrinciples of Consolidation\nThe accompanying consolidated financial statements include our accounts and those of our wholly owned subsidiaries. All intercompany accounts and transactions have been eliminated.\nRecently Adopted Accounting Guidance\nLeases: In February 2016, the Financial Accounting Standards Board (FASB) issued Accounting Standards Update (ASU) No. 2016-02, Leases (Topic 842) (ASU 2016-02). We adopted ASU 2016-02 and its related amendments (collectively known as Accounting Standards Codification (ASC) 842) on January 1, 2019 using the modified retrospective approach. Results for reporting periods beginning after January 1, 2019 are presented under ASC 842, while prior period amounts are not adjusted and continue to be reported in accordance with ASC 840, Leases. ASC 842 requires virtually all leases, other than leases of intangible assets, to be recorded on the balance sheet with a right-of-use (ROU) asset and a corresponding lease liability.\nWe elected the package of practical expedients permitted under the transition guidance within the new standard, which allowed us to carry forward our historical assessments of whether a contract contains a lease, lease classification and initial direct costs. In addition, we elected the accounting policy to combine the lease and nonlease components as a single component for all asset classes.\nWe determine if an arrangement is a lease at inception. Leases are classified as either operating or finance leases based on certain criteria. This classification determines the timing and presentation of expenses on the income statement, as well as the presentation of the related cash flows and balance sheet. Operating leases are recorded on the balance sheet as operating lease right-of-use assets, other accrued expenses and liabilities, and long-term operating lease liabilities. We currently have no finance leases.\nROU assets and related liabilities are recorded at lease commencement based on the present value of the lease payments over the expected lease term. Lease payments include future increases unless the increases are based on changes in an index or rate. As our leases do not usually provide an implicit rate, our incremental borrowing rate is used to calculate ROU assets and related liabilities. The incremental borrowing rate is determined based on our estimated credit rating, the term of the lease, the economic environment where the asset resides and full collateralization. The ROU assets and related lease liabilities include optional renewals for which we are reasonably certain to exercise; whereas, optional terminations are included unless it is reasonably certain not to be elected.\nThe adoption of the new standard resulted in the recognition of ROU assets of $90.9 million and lease liabilities of $92.5 million, and corresponding deferred tax assets and liabilities, on our consolidated balance sheet as of January 1, 2019. The adoption had no impact on our consolidated statements of income or cash flows.\nImplementation cost accounting for cloud computing arrangements: In August 2018, the FASB issued ASU No. 2018-15, Intangibles-Goodwill and Other-Internal-Use Software (Subtopic 350-40): Customer's Accounting for Implementation Costs Incurred in a Cloud Computing Arrangement That Is a Service Contract (ASU 2018-15). The standard aligns the accounting for costs incurred to implement a cloud computing arrangement (CCA) that is a service arrangement with the guidance on capitalizing costs associated with developing or obtaining internal-use software. Under ASU 2018-15, an entity would apply Subtopic 350-40 to determine which implementation costs related to a CCA that is a service contract should be capitalized. The standard does not change the accounting for the service component of a CCA. The associated cash flows will be reflected within operating activities.\nWe retrospectively adopted the guidance during the quarter ended December 31, 2019. The adoption resulted in the reclassification of cash flows associated with implementation costs related to CCAs that are service contracts on our consolidated statements of cash flows. This resulted in a decrease to operating cash flows, and a corresponding increase to investing cash flows, of $2.5 million, $1.4 million and $2.8 million for the years ending December 31, 2019, 2018 and 2017, respectively. The adoption had no impact on our consolidated balance sheets or consolidated statements of income.\nAccounting Guidance Issued and Not Yet Adopted\nCredit losses: In June 2016, the FASB issued ASU No. 2016-13, Financial Instruments - Credit Losses (Topic 326): Measurement of Credit Losses on Financial Instruments (ASU 2016-13). The current guidance requires the allowance for doubtful accounts to be estimated based on an incurred loss model, which considers past and current conditions. ASU 2016-13 requires companies to use an expected loss model that also considers reasonable and supportable forecasts of future conditions. ASU 2016-13 is effective for annual periods beginning after December 15, 2019, including interim periods within that reporting period. Early adoption is permitted for annual periods beginning after December 15, 2018, including interim periods within that reporting period. The standard requires a cumulative-effect adjustment to the balance sheet as of the beginning of the first reporting period in which the guidance is effective. We will adopt the standard effective January 1, 2020 and do not expect the adoption of the new standard to have a material effect on our consolidated financial statements.\nIncome taxes: In December 2019, the FASB issued ASU No. 2019-12, Income Taxes (Topic 740): Simplifying the Accounting for Income Taxes (ASU 2019-12), as part of its initiative to reduce complexity in the accounting standards. The amendments in ASU 2019-12 eliminate certain exceptions related to the approach for intraperiod tax allocation, the methodology for calculating income taxes in an interim period and the recognition of deferred tax liabilities for outside basis differences. ASU 2019-12 also clarifies and simplifies other aspects of the accounting for income taxes. ASU 2019-12 is effective for fiscal years, and interim periods within those fiscal years, beginning after December 15, 2020. Early adoption is permitted, including adoption in any interim period. We are currently evaluating the impact that this guidance will have upon our financial position and results of operations, if any.\nUse of Estimates\nThe preparation of financial statements in conformity with accounting principles generally accepted in the United States requires management to make estimates and assumptions that affect the reported amounts of assets and liabilities and disclosure of contingent assets and liabilities at the date of the financial statements. Estimates also affect the amounts of revenue and expenses during the reported periods. Significant estimates included in these consolidated financial statements include:\n•\nAllowances for doubtful accounts receivable\n•\nIncome tax accruals, including those related to the Tax Cuts and Jobs Act\n•\nUncertain tax positions\n•\nTax valuation reserves\n•\nFair value of stock-based compensation and probabilities of performance award attainment\n•\nContract revenue\n•\nStandalone selling prices of our products and services\n•\nAcquired deferred revenue\n•\nUseful lives for depreciation and amortization\n•\nValuations of goodwill and other intangible assets\n•\nDeferred compensation\n•\nLoss contingencies\n•\nOperating lease assets and liabilities\nActual results could differ from these estimates. Changes in estimates are recorded in the results of operations in the period that the changes occur.\nRevenue Recognition\nOur revenue is derived principally from the licensing of computer software products and from related maintenance contracts. We adopted ASC 606 on January 1, 2018. ASC 606 requires an entity to evaluate revenue recognition by identifying a contract with a customer, identifying the performance obligations in the contract, determining the transaction price, allocating the transaction price to the performance obligations in the contract, and recognizing revenue when (or as) the entity satisfies a performance obligation.\nRevenue Recognition Policy 2019 and 2018 (ASC 606)\nWe enter into contracts that include combinations of products, maintenance and services, which are accounted for as separate performance obligations with differing revenue recognition patterns.\nRevenue from perpetual licenses is classified as software license revenue. Software license revenue is recognized up front upon delivery of the licensed product and/or the utility that enables the customer to access authorization keys, provided that an enforceable contract has been received. Typically, our perpetual licenses are sold with post-contract support (PCS), which includes unspecified technical enhancements and customer support. We allocate value in bundled perpetual and PCS arrangements based on the standalone selling prices of the perpetual license and PCS. Revenue from PCS is classified as maintenance revenue and is recognized ratably over the term of the contract, as we satisfy the PCS performance obligation over time.\nIn addition to perpetual licenses, we sell time-based lease licenses. Lease licenses are sold only as a bundled arrangement that includes the rights to a term software license and PCS. Utilizing observable inputs, we determined that 50% of the estimated standalone selling price of the lease license is attributable to the term license and 50% is attributable to the PCS. This determination considered the value relationship for our products between PCS to time-based lease licenses, the value relationship between PCS and perpetual licenses, the average economic life of our products, software renewal rates and the price of the bundled arrangement in relation to the perpetual licensing approach. Consistent with the perpetual sales, the license component is classified as software license revenue and recognized as revenue up front at the commencement of the lease upon delivery of the licensed product and/or utility that enables the customer to access authorization keys. The PCS is classified as maintenance revenue and is recognized ratably over the term of the contract, as we satisfy the PCS performance obligation over time.\nRevenue from training, support and other services is recognized as the services are performed. For contracts in which the service consists of a single performance obligation, such as providing a training class to a customer, we recognize revenue upon completion of the performance obligation. For service contracts that are longer in duration and often include multiple performance obligations (for example, both training and consulting), we measure the progress toward completion of the obligations and recognize revenue accordingly. In measuring progress towards the completion of performance obligations, we typically utilize output-based estimates for services with contractual billing arrangements that are not based on time and materials, and estimate output based on the total tasks completed as compared to the total tasks required for each work contract. Input-based estimates are utilized for services that involve general consultations with contractual billing arrangements based on time and materials, utilizing direct labor as the input measure. Proceeds from customers for the purpose of expediting road-map items, developing new products or creating specific features and functionality for existing products is classified as revenue.\nWe also execute arrangements through independent channel partners in which the channel partners are authorized to market and distribute our software products to end users of our products and services in specified territories. In sales facilitated by channel partners, the channel partner bears the risk of collection from the end-user customer. We recognize revenue from transactions with channel partners in a manner consistent with the direct sales described above for both perpetual and time-based licenses. Revenue from channel partner transactions is the amount remitted to us by the channel partners. This amount includes a fee for PCS that is compensation for providing technical enhancements and the second level of technical support to the end user, which is recognized over the period that PCS is to be provided.\nNon-income related taxes collected from customers and remitted to governmental authorities are recorded on the consolidated balance sheet as accounts receivable and accrued expenses. The collection and payment of these amounts are reported on a net basis in the consolidated statements of income and do not impact reported revenues or expenses.\nWe do not offer right of return. We warrant to our customers that our software will perform substantially as specified in our current user manuals. We have not experienced significant claims related to software warranties beyond the scope of\nmaintenance support, which we are already obligated to provide. The warranty is not sold, and cannot be purchased, separately. The warranty does not provide any type of additional service to the customer or performance obligation for us.\nOur agreements with our customers generally require us to indemnify the customer against claims that our software infringes third-party patent, copyright, trademark or other proprietary rights. Such indemnification obligations are generally limited in a variety of industry-standard respects, including our right to replace an infringing product.\nSignificant Judgments (ASC 606)\nOur contracts with customers typically include promises to transfer licenses and services to a customer. Judgment is required to determine if the promises are separate performance obligations, and if so, to allocate the transaction price to each performance obligation. We use the estimated standalone selling price method to allocate the transaction price for each performance obligation. The estimated standalone selling price is determined using all information reasonably available to us, including market conditions and other observable inputs. The corresponding revenues are recognized as the related performance obligations are satisfied.\nWe apply a practical expedient to expense sales commissions as incurred when the amortization period would have been one year or less. Sales commissions associated with the initial year of multi-year contracts are expensed as incurred due to their immateriality. Sales commissions associated with multi-year contracts beyond the initial year are subject to an employee service requirement and are expensed as incurred as they are not considered incremental costs to obtain a contract.\nWe are required to adjust promised amounts of consideration for the effects of the time value of money if the timing of the payments provides the customer or us with a significant financing benefit. We consider various factors in assessing whether a financing component exists, including the duration of the contract, market interest rates and the timing of payments. Our contracts do not include a significant financing component requiring adjustment to the transaction price.\nRevenue Recognition Policy 2017 (ASC 605)\nRevenue from perpetual licenses was classified as license revenue and was recognized upon delivery of the licensed product and/or the utility that enabled the customer to access authorization keys, provided that acceptance had occurred and a signed contractual obligation was received, the price was fixed and determinable, and collectibility of the receivable was probable. We determined the fair value of PCS sold together with perpetual licenses based on the rate charged for PCS when sold separately. Revenue from PCS contracts was classified as maintenance and service revenue and was recognized ratably over the term of the contract.\nRevenue for software lease licenses was classified as license revenue and was recognized over the period of the lease contract. Typically, our software leases include PCS which, due to the short term (principally one year or less) of our software lease licenses, were not permitted to be separated from lease revenue for accounting purposes. As a result, both the lease licenses and PCS were recognized ratably over the lease period. We included the revenue for the entire lease arrangement within software license revenue in the consolidated statements of income.\nMany of our semiconductor products are typically licensed via longer term leases of 24-36 months. We recognized revenue for these licenses over the term of the lease contract. Because we did not have vendor-specific objective evidence of the fair value of these leases, we also recognized revenue from perpetual licenses over the term of the lease contract during the infrequent occurrence of these licenses being sold with semiconductor leases in multiple-element arrangements.\nRevenue from training, support and other services was recognized as the services were performed. We applied the specific performance method to contracts in which the service consisted of a single act, such as providing a training class to a customer, and the proportional performance method to other service contracts that were longer in duration and often included multiple acts (for example, both training and consulting). In applying the proportional performance method, we typically utilized output-based estimates for services with contractual billing arrangements that were not based on time and materials, and estimated output based on the total tasks completed as compared to the total tasks required for each work contract. Input-based estimates were utilized for services that involved general consultations with contractual billing arrangements based on time and materials, utilizing direct labor as the input measure.\nThe accounting treatment under ASC 605 associated with arrangements through independent channel partners, non-income related taxes, warranties and indemnification obligations is consistent with the accounting treatment under ASC 606 described above.\nCash and Cash Equivalents\nCash and cash equivalents consist primarily of highly liquid investments such as deposits held at major banks and money market funds. Cash equivalents are carried at cost, which approximates fair value. Our cash and cash equivalents balances comprise the following:\nOur money market fund balances are held in various funds of a single issuer.\nProperty and Equipment\nProperty and equipment is stated at cost. Depreciation is computed using the straight-line method over the estimated useful lives of the various classes of assets, which range from one year to forty years. Repairs and maintenance are charged to expense as incurred. Gains or losses from the sale or retirement of property and equipment are included in operating income.\nResearch and Development\nResearch and development costs are expensed as incurred. Internally developed software costs required to be capitalized as defined by the accounting guidance are not material to our consolidated financial statements.\nBusiness Combinations\nWhen we consummate an acquisition, the assets acquired and the liabilities assumed are recognized separately from goodwill at their acquisition date fair values. Goodwill as of the acquisition date is measured as the excess of the fair value of consideration transferred over the acquisition date fair value of the net identifiable assets acquired. While best estimates and assumptions are used to accurately value assets acquired and liabilities assumed at the acquisition date as well as contingent consideration, where applicable, our estimates are inherently uncertain and subject to refinement. As a result, during the measurement period, which may be up to one year from the acquisition date, we record adjustments to the assets acquired and liabilities assumed with the corresponding offset to goodwill as we obtain new information about facts and circumstances that existed as of the acquisition date that, if known, would have affected the measurement of the amounts recognized as of that date. Upon the earlier of the conclusion of the measurement period or final determination of the values of assets acquired or liabilities assumed, any subsequent adjustments are recorded in the consolidated statements of income.\nGoodwill and Other Intangible Assets\nGoodwill represents the excess of the fair value of consideration transferred over the fair value of net identifiable assets acquired. Other intangible assets consist of trade names, customer lists, contract backlog and acquired software and technology. Intangible assets that are not considered to have an indefinite useful life are amortized over their useful lives, which range from two years to seventeen years. Amortization expense for intangible assets was $36.9 million, $40.8 million and $49.8 million for the years ended December 31, 2019, 2018 and 2017, respectively.\nWe test goodwill and indefinite-lived intangible assets for impairment at least annually by performing a quantitative assessment of whether the fair value of each reporting unit or asset exceeds its carrying amount. We have one reporting unit. Goodwill is tested at this reporting unit level and indefinite-lived intangible assets are tested at the individual asset level. This requires us to assess and make judgments regarding a variety of factors which impact the fair value of the reporting unit or asset being tested, including business plans, anticipated future cash flows, economic projections and other market data.\nWe perform our annual impairment tests for goodwill and indefinite-lived intangible assets as of January 1 of each year unless there is an indicator that would require a test during the year. We periodically review the carrying value of other intangible assets and will recognize impairments when events or circumstances indicate that such assets may be impaired.\nConcentrations of Credit Risk\nWe have a concentration of credit risk with respect to revenue and trade receivables due to the use of certain significant channel partners to market and sell our products. We perform periodic credit evaluations of our customers' financial condition and generally do not require collateral. The following table outlines concentrations of risk with respect to our revenue:\nNo single customer accounted for more than 5% of our revenue in 2019, 2018 or 2017.\nIn addition to the concentration of credit risk with respect to trade receivables, our cash and cash equivalents are also exposed to concentration risk. Our cash and cash equivalent accounts are insured through various public and private bank deposit insurance programs, foreign and domestic; however, a significant portion of our funds are not insured. The following table outlines concentrations of risk with respect to our cash and cash equivalents:\nAllowance for Doubtful Accounts\nWe make judgments as to our ability to collect outstanding receivables and provide allowances for a portion of receivables when collection becomes doubtful. Provisions are made based upon a specific review of all significant outstanding invoices from both value and delinquency perspectives. For those invoices not specifically reviewed, provisions are estimated at differing rates based upon the age of the receivable and the geographic area of origin. In determining these percentages, we consider our historical collection experience and current economic trends in the customer's industry and geographic region. We recorded provisions for bad debts of $2.9 million, $1.6 million and $1.5 million for the years ended December 31, 2019, 2018 and 2017, respectively.\nIncome Taxes\nWe account for income taxes under the asset and liability method, which requires the recognition of deferred tax assets and liabilities for the expected future tax consequences of events that have been included in the financial statements. Under this method, deferred tax assets and liabilities are determined based on the differences between the financial statement and tax bases of assets and liabilities using enacted tax rates in effect for the year in which the differences are expected to reverse. The effect of a change in tax rates on deferred tax assets and liabilities is recognized in income in the period of the enactment date.\nWe record net deferred tax assets to the extent we believe these assets will more likely than not be realized. In making such determination, we consider all available positive and negative evidence, including scheduled reversals of deferred tax liabilities, projected future taxable income, tax planning strategies and recent financial operations. In the event we determine that we will be able to realize deferred tax assets for which a valuation allowance was used to reduce their carrying value, the adjustment to the valuation allowance will be recorded as a reduction to the provision for income taxes.\nTax benefits related to uncertain tax positions taken or expected to be taken on a tax return are recorded when such benefits meet a more-likely-than-not threshold. Otherwise, these tax benefits are recorded when a tax position has been effectively settled, which means that the statute of limitations has expired or the appropriate taxing authority has completed its examination even though the statute of limitations remains open.\nWe recognize interest and penalties related to income taxes within the income tax expense line in the consolidated statements of income. Accrued interest and penalties are included within the related tax liability line in the consolidated balance sheets.\nForeign Currencies\nCertain of our sales and intercompany transactions are denominated in foreign currencies. These transactions are translated to the functional currency at the exchange rate on the transaction date. Assets and liabilities denominated in a currency other than our functional currency or our subsidiaries' functional currencies are translated at the effective exchange rate on the balance sheet date. Gains and losses resulting from foreign exchange transactions are included in other expense, net. We recorded net foreign exchange losses of $2.5 million, $3.1 million and $1.9 million for the years ended December 31, 2019, 2018 and 2017, respectively.\nThe financial statements of our foreign subsidiaries are translated from the functional (local) currency to U.S. Dollars. Assets and liabilities are translated at the exchange rates on the balance sheet date. Results of operations are translated at average exchange rates, which approximate rates in effect when the underlying transactions occurred.\nAccumulated Other Comprehensive Loss\nAccumulated other comprehensive loss is composed entirely of foreign currency translation adjustments.\nEarnings Per Share\nBasic earnings per share (EPS) amounts are computed by dividing earnings by the weighted average number of common shares outstanding during the period. Diluted EPS amounts assume the issuance of common stock for all potentially dilutive equivalents outstanding. To the extent stock awards are anti-dilutive, they are excluded from the calculation of diluted EPS.\nThe details of basic and diluted EPS are as follows:\nStock-Based Compensation\nWe account for stock-based compensation in accordance with share-based payment accounting guidance. The guidance requires an entity to measure the cost of employee services received in exchange for an award of equity instruments based on the grant-date fair value of the award. The cost is recognized over the period during which an employee is required to provide services in exchange for the award, typically the vesting period.\nFair Value of Financial Instruments\nWe account for certain assets and liabilities at fair value in accordance with the accounting guidance applicable to fair value measurements and disclosures. The carrying values of cash, cash equivalents, short-term investments, accounts receivable, accounts payable, accrued expenses, other accrued liabilities and short-term obligations are deemed to be reasonable estimates of their fair values because of their short-term nature.\n3.\nRevenue from Contracts with Customers\nAdoption of ASC 606, Revenue from Contracts with Customers\nWe adopted ASC 606 on January 1, 2018 using the modified retrospective approach for all contracts not completed as of the date of adoption. Results for reporting periods beginning after January 1, 2018 are presented under ASC 606, while prior period amounts are not adjusted and continue to be reported in accordance with ASC 605. The adoption of ASC 606 represents a change in accounting principle that will more closely align revenue recognition with the delivery of our software licenses, maintenance and services.\nWe recorded an increase to retained earnings of $242.4 million, or $183.1 million net of tax, on January 1, 2018 due to the cumulative effect of the ASC 606 adoption, with the impact primarily derived from revenue related to time-based software lease licenses. Software lease license revenue was recognized ratably over the term of the contract under the previous guidance; however, approximately 50% of the contract is recognized up front at the commencement of the lease under ASC 606 with the remainder recognized ratably to maintenance and service revenue.\nDisaggregation of Revenue\nThe following table summarizes revenue:\nOur software licenses revenue is recognized up front, while maintenance and service revenue is generally recognized over the term of the contract.\nDeferred Revenue\nDeferred revenue consists of billings made or payments received in advance of revenue recognition from customer agreements. The timing of revenue recognition may differ from the timing of billings to customers. Payment terms vary by the type and location of customer and the products or services offered. The time between invoicing and when payment is due is not significant.\nThe changes in deferred revenue, inclusive of both current and long-term deferred revenue, during the years ended December 31, 2019 and 2018 were as follows:\nRevenue allocated to remaining performance obligations represents contracted revenue that has not yet been recognized, which includes both deferred revenue and backlog. Our backlog represents installment billings for periods beyond the current\nquarterly billing cycle. Revenue recognized during the years ended December 31, 2019 and 2018 included amounts in deferred revenue and backlog at the beginning of the period of $475.9 million and $387.2 million, respectively.\nTotal revenue allocated to remaining performance obligations as of December 31, 2019 will be recognized as revenue as follows:\n4.\nAcquisitions\n2019 Acquisitions\nOn November 1, 2019, we completed the acquisition of 100% of the shares of LST, the premier provider of explicit dynamics and other advanced finite element analysis technology. The acquisition empowers our customers to solve a new class of engineering challenges, including developing safer automobiles, aircraft and trains while reducing or even eliminating the need for costly physical testing. The transaction closed with a purchase price of $777.8 million, which included $470.6 million in cash and the issuance of 1.4 million shares of our common stock in an unregistered offering to the prior owners of LST. The fair value of the common stock issued as consideration was based on the volume-weighted average price of our common stock on November 1, 2019 of $220.74, resulting in a fair value of $307.2 million.\nOn February 1, 2019, we completed the acquisition of 100% of the shares of Granta Design for a purchase price of $208.7 million, paid in cash and inclusive of final net working capital adjustments. The acquisition of Granta Design, the premier provider of materials information technology, expands our portfolio into this important area, giving customers access to materials intelligence, including data that is critical to successful simulations.\nAdditionally, during the year ended December 31, 2019, we acquired Dynardo, Helic and DfR Solutions to combine the acquired technologies with our existing comprehensive multiphysics portfolio. These acquisitions were not individually significant. The combined purchase price of these other acquisitions was $136.2 million, paid in cash.\nDuring the year ended December 31, 2019, we incurred $6.6 million in acquisition-related expenses, recognized as selling, general and administrative expense on the consolidated statements of income.\nThe assets and liabilities of the acquisitions have been recorded based upon management's estimates of their fair market values as of each respective date of acquisition. The following tables summarize the fair values of consideration transferred and the fair values of identified assets acquired and liabilities assumed at each respective date of acquisition:\nFair Value of Consideration Transferred:\nRecognized Amounts of Identifiable Assets Acquired and Liabilities Assumed:\nLST has uncertain tax positions inclusive of interest and penalties of $34.0 million and a corresponding indemnification asset. The uncertain tax positions reflect potential federal and state tax liabilities associated with tax years 2016 to 2019. Settlements of the tax positions, if any, will be funded by the indemnification asset that was created in accordance with the executed Agreement and Plan of Merger.\nThe goodwill, which is generally not tax-deductible, is attributed to intangible assets that do not qualify for separate recognition, including the assembled workforce of the acquired business and the synergies expected to arise as a result of the acquisitions.\nThe fair values of the assets acquired and liabilities assumed are based on preliminary calculations. The estimates and assumptions for these items are subject to change as additional information about what was known and knowable at the acquisition date is obtained during the measurement period (up to one year from the acquisition date).\nWe determined the fair value of our intangible assets using various valuation techniques, including the relief-from-royalty method and the multi-period excess earnings method. These models utilize certain unobservable inputs classified as Level 3 measurements as defined by ASC 820, Fair Value Measurements and Disclosures. The determination of fair value requires considerable judgment and is sensitive to changes in underlying assumptions, estimates and market factors. Estimating fair value requires us to make assumptions and estimates regarding our future plans, as well as industry and economic conditions. These assumptions and estimates include, but are not limited to: royalty rate, discount rate and attrition rate.\nThe valuation method and assumptions used to determine the fair value of the significant intangible assets acquired in 2019 are as follows:\nThe operating results of each acquisition have been included in our consolidated financial statements since each respective date of acquisition. The effects of the business combinations were not material to our consolidated results of operations individually. The table presented below reflects the aggregate impact on our results of operations of the 2019 acquisitions from the date of acquisition to December 31, 2019. The operating income does not include integration costs borne directly by us and our non-acquired subsidiaries as a result of the acquisitions.\n2018 Acquisition\nOn May 2, 2018, we completed the acquisition of 100% of the shares of OPTIS, a premier provider of software for scientific simulation of light, human vision and physics-based visualization, for a purchase price of $291.0 million, paid in cash. The acquisition extends our portfolio into the area of optical simulation to provide comprehensive sensor solutions, covering visible and infrared light, electromagnetics and acoustics for camera, radar and lidar.\nThe operating results of OPTIS have been included in our consolidated financial statements since May 2, 2018, the date of acquisition.\nThe assets and liabilities of OPTIS have been recorded based upon management's estimates of their fair market values as of the acquisition date. The following tables summarize the fair value of consideration transferred and the fair values of identified assets acquired and liabilities assumed at the acquisition date:\nFair Value of Consideration Transferred:\nRecognized Amounts of Identifiable Assets Acquired and Liabilities Assumed:\nThe goodwill, which is generally not tax-deductible, is attributed to intangible assets that do not qualify for separate recognition, including the assembled workforce of the acquired business and the synergies expected to arise as a result of the acquisition of OPTIS.\nDuring the one-year measurement period since the OPTIS acquisition date, we adjusted the fair values of the assets acquired and liabilities assumed, with the offset recorded as a $2.6 million increase to goodwill. These adjustments were made as we obtained new information about facts and circumstances that existed as of the acquisition date that, if known, would have affected the measurement of the amounts recognized as of that date.\nFull pro forma results of operations have not been presented as the effects of the OPTIS business combination were not material to our consolidated results of operations. The table presented below reflects the impact of OPTIS from the date of acquisition to December 31, 2018. The operating loss does not include integration costs borne directly by us and our non-OPTIS subsidiaries as a result of the acquisition.\n2017 Acquisitions\nDuring the year ended December 31, 2017, we completed various acquisitions to expand our customer base and accelerate the development of new and innovative products to the marketplace while lowering design and engineering costs for customers. The acquisitions were not individually significant. The combined purchase price of the acquisitions was approximately $67.0 million. The 2017 technology acquisitions are further described in the table below:\nThe operating results of each acquisition have been included in our consolidated financial statements since each respective date of acquisition. The effects of the business combinations were not material to our consolidated results of operations individually or in the aggregate.\n5.\nOther Receivables and Current Assets and Other Accrued Expenses and Liabilities\nOur other receivables and current assets, and other accrued expenses and liabilities, comprise the following balances:\nReceivables related to unrecognized revenue represent the current portion of billings made for customer contracts that have not yet been recognized as revenue.\n6.\nProperty and Equipment\nProperty and equipment consists of the following:\nDepreciation expense related to property and equipment was $23.6 million, $18.4 million and $17.9 million for the years ended December 31, 2019, 2018 and 2017, respectively.\n7.\nGoodwill and Intangible Assets\nGoodwill represents the excess of the fair value of consideration transferred over the fair value of net identifiable assets acquired. Identifiable intangible assets acquired in business combinations are recorded based on their fair values on the date of acquisition.\nDuring the first quarter of 2019, we completed the annual impairment test for goodwill and the indefinite-lived intangible asset and determined that these assets had not been impaired as of the test date, January 1, 2019. No other events or circumstances changed during the year ended December 31, 2019 that would indicate that the fair values of our reporting unit and indefinite-lived intangible asset are below their carrying values.\nIntangible assets are classified as follows:\nFinite-lived intangible assets are amortized over their estimated useful lives of two years to seventeen years. Amortization expense for the intangible assets reflected above was $36.9 million, $40.8 million and $49.8 million for the years ended December 31, 2019, 2018 and 2017, respectively.\nAs of December 31, 2019, estimated future amortization expense for the intangible assets reflected above is as follows:\nThe changes in goodwill during the years ended December 31, 2019 and 2018 were as follows:\n(1) In accordance with the accounting for business combinations, we recorded adjustments to goodwill for the effect of changes in the provisional fair values of the assets acquired and liabilities assumed during the measurement period (up to one year from the acquisition date) as we obtained new information about facts and circumstances that existed as of the acquisition date that, if known, would have affected the measurement of the amounts recognized as of that date.\n8.\nFair Value Measurement\nThe valuation hierarchy for disclosure of assets and liabilities reported at fair value prioritizes the inputs for such valuations into three broad levels:\n•\nLevel 1: quoted prices (unadjusted) in active markets for identical assets or liabilities;\n•\nLevel 2: quoted prices for similar assets and liabilities in active markets or inputs that are observable for the asset or liability, either directly or indirectly through market corroboration, for substantially the full term of the financial instrument; or\n•\nLevel 3: unobservable inputs based on our own assumptions used to measure assets and liabilities at fair value.\nA financial asset's or liability's classification within the hierarchy is determined based on the lowest level input that is significant to the fair value measurement.\nThe following tables provide the assets carried at fair value and measured on a recurring basis:\nThe cash equivalents in the preceding tables represent money market funds, valued at net asset value, with carrying values which approximate their fair values because of their short-term nature.\nThe short-term investments in the preceding tables represent deposits held by certain foreign subsidiaries. The deposits have fixed interest rates with original maturities ranging from three months to one year.\nThe deferred compensation plan investments in the preceding tables represent trading securities held in a rabbi trust for the benefit of the non-employee Directors. These securities consist of mutual funds traded in an active market with quoted prices. As a result, the plan assets are classified as Level 1 in the fair value hierarchy. The plan assets are recorded within other long-term assets on our consolidated balance sheets.\n9.\nLeases\nWe primarily have operating leases for office space and leased cars included in our ROU assets and lease liabilities. Our executive offices and those related to certain domestic product development, marketing, production and administration are located in a 186,000 square foot office facility in Canonsburg, Pennsylvania. The term of the lease is 183 months, which began on October 1, 2014 and expires on December 31, 2029. The lease agreement includes options to renew the contract through August 2044, an option to lease additional space in January 2025 and an option to terminate the lease in December 2025. No options are included in the lease liability as renewal is not reasonably certain. In addition, we are reasonably certain we will not terminate the lease agreement. Absent the exercise of options in the lease, our base rent (inclusive of property taxes and certain operating costs) was $4.3 million per annum for the first five years of the lease term, $4.5 million per annum for years six through ten and $4.7 million per annum for years eleven through fifteen.\nThe components of our global lease cost reflected in the consolidated statements of income for the year ended December 31, 2019 are as follows:\n(1) Variable lease cost includes common area maintenance, property taxes, utilities and fluctuations in rent due to a change in an index or rate.\nFor the years ended December 31, 2018 and 2017, lease cost totaled $21.3 million and $18.4 million, respectively.\nOther information related to operating leases for the year ended December 31, 2019 is as follows:\nAs of December 31, 2019, the weighted-average remaining lease term of operating leases was 7.7 years, and the weighted-average discount rate of operating leases was 3.7%.\nThe maturity schedule of the operating lease liabilities as of December 31, 2019 is as follows:\n(1)Includes the current portion of operating lease liabilities of $18.2 million, which is reflected in other accrued expenses and liabilities in the consolidated balance sheets.\nAs of December 31, 2019, we had operating office leases that have not yet commenced with combined lease obligations of $16.3 million. The leases commence in 2020 and have a weighted-average lease term of 7.2 years.\nThe future minimum lease payments under ASC 840, including termination fees, under noncancellable operating leases for office space in effect at December 31, 2018 were as follows:\n10.\nDebt\nIn February 2019, we entered into a credit agreement for a $500.0 million unsecured revolving credit facility, which includes a $50.0 million sublimit for the issuance of letters of credit, with Bank of America, N.A. as the Administrative Agent. The revolving credit facility becomes payable in full on February 22, 2024 and is available for general corporate purposes, including, among others, to finance acquisitions and capital expenditures.\nIn connection with the acquisition of LST, we amended our existing credit agreement (amended credit agreement). The amendment provides for a new $500.0 million unsecured term loan facility to finance the acquisition. The term loan was funded on November 1, 2019 and matures on November 1, 2024. Principal on the term loan will be payable on the last business day of each fiscal quarter commencing with the ninth full fiscal quarter after the funding date at a rate of 1.25% per quarter, increasing to 2.50% per quarter after the next four fiscal quarters.\nBorrowings under the amended credit agreement will accrue interest at the Eurodollar rate plus an applicable margin or at the base rate, at our election. For the quarter ended December 31, 2019, we elected to apply the Eurodollar rate. The base rate is the applicable margin plus the highest of (i) the federal funds rate plus 0.500%, (ii) the Bank of America prime rate and (iii) the Eurodollar rate plus 1.000%. The applicable margin for these borrowings is a percentage per annum based on the lower of (1) a pricing level determined by our then-current consolidated leverage ratio and (2) a pricing level determined by our debt ratings (if such debt ratings exist). This results in a margin ranging from 1.125% to 1.750% and 0.125% to 0.750% for the Eurodollar rate and base rate, respectively. The interest rate in effect as of December 31, 2019 was 2.964%.\nThe amended credit agreement contains language in the event the Eurodollar rate is not available due to LIBOR changes. If this occurs, the base rate will be used for borrowings. However, we may work with the Administrative Agent to amend the agreement to replace the Eurodollar rate with (i) one or more rates based on the Secured Overnight Financing Rate (SOFR); or (ii) another alternative benchmark rate, subject to the lenders' approval.\nThe amended credit agreement contains customary representations and warranties, affirmative and negative covenants and events of default. The amended credit agreement also contains a financial covenant requiring us to maintain a consolidated leverage ratio of indebtedness to earnings before interest, taxes, depreciation and amortization not exceeding 3.50 to 1.00 as of the end of any fiscal quarter (for the four-quarter period ending on such date) with an opportunity for a temporary increase in such consolidated leverage ratio to 4.00 to 1.00 upon the consummation of certain qualified acquisitions for which the aggregate consideration is at least $250.0 million.\nAs of December 31, 2019, there were no outstanding borrowings under the unsecured revolving credit agreement, and the carrying value of the term loan was $498.5 million, which is net of $1.5 million of unamortized debt issuance costs. We were in compliance with all covenants.\nAs of December 31, 2019, scheduled maturities of total debt for each of the five succeeding fiscal years is as follows:\n(1)We repaid $75.0 million of the unsecured term loan in January 2020 prior to its scheduled maturity date. As such, the payment is reflected as current on our consolidated balance sheet but not in the table above.\n11.\nIncome Taxes\nIncome before income taxes included the following components:\nThe provision for income taxes was composed of the following:\nThe reconciliation of the U.S. federal statutory tax rate to the consolidated effective tax rate was as follows:\nOn December 22, 2017, the U.S. government enacted comprehensive tax legislation commonly referred to as the Tax Cuts and Jobs Act (Tax Reform). Tax Reform made broad and complex changes to the U.S. tax code, including, but not limited to, (1) reducing the U.S. federal corporate tax rate from 35 percent to 21 percent; (2) requiring companies to pay a one-time federal income tax on certain unrepatriated earnings of foreign subsidiaries (transition tax); (3) generally eliminating U.S. federal income taxes on dividends from foreign subsidiaries; (4) creating a new provision designed to tax global intangible low-taxed income (GILTI) which allows for the possibility of using foreign tax credits (FTCs) and a deduction of up to 50 percent to offset the income tax liability (subject to some limitations); (5) repealing the domestic production activity deduction; (6) creating the foreign-derived intangible income deduction; (7) creating the base erosion anti-abuse tax, a new minimum tax; (8) allowing for full expensing of qualified property through bonus depreciation; and (9) creating limitations on the deductibility of certain executive compensation.\nThe SEC staff issued Staff Accounting Bulletin (SAB) 118, which provides guidance on accounting for the tax effects of Tax Reform. SAB 118 provided a measurement period that was limited to one year from enactment for companies to complete the accounting under ASC 740, Income Taxes. In accordance with SAB 118, throughout the measurement period, a company must reflect the income tax effects of those aspects of Tax Reform for which the accounting under ASC 740 was complete in the financial statements. To the extent that a company’s accounting for certain income tax effects of Tax Reform was incomplete, but a reasonable estimate was able to be made, the company must record a provisional estimate in the financial statements. If a company could not determine a provisional estimate to be included in the financial statements, it should continue to apply ASC 740 on the basis of the tax laws that were in effect immediately before the enactment of Tax Reform.\nAs further discussed below, we finalized our provisional Tax Reform calculations as of the end of the measurement period, based on guidance and information available as of the reporting date. The U.S. government has not yet issued final guidance related to a portion of the new rules enacted as part of Tax Reform. Subsequent adjustments, if any, will be recorded in the period in which guidance is finalized.\nOur accounting for the impact of the reduction in the U.S. federal corporate tax rate on our deferred tax assets and liabilities is complete. Tax Reform reduced the corporate tax rate to 21 percent, effective January 1, 2018. Consequently, we recorded a net adjustment to deferred income tax expense of $1.9 million for the year ended December 31, 2017 to revalue our deferred tax assets and liabilities. No further adjustments were recorded for the years ended December 31, 2019 and 2018.\nOur accounting for the transition tax is complete. Reasonable estimates of certain effects were calculated and a provisional adjustment of $16.0 million was recorded in the December 31, 2017 financial statements. To determine the amount of the transition tax, we determined, in addition to other factors, the amount of post-1986 earnings and profits (E&P) of the relevant subsidiaries, as well as the amount of non-U.S. income taxes paid on such earnings. Based on revised E&P calculations updated during the measurement period, we recognized an additional measurement-period adjustment for the year ended December 31, 2018 of $0.9 million to the transition tax obligation and a corresponding adjustment to tax expense. In February 2019, the U.S. government published final regulations relating to transition tax. In accordance with the final regulations, we recognized a post-measurement period reduction for the year ended December 31, 2019 of $1.8 million to the transition tax obligation and a corresponding adjustment to tax expense, resulting in a final transition tax obligation of $15.1 million. We have elected to pay this liability over eight years; however, in accordance with IRS issued guidance, tax overpayments from the year ended\nDecember 31, 2017 are required to be applied to the transition tax obligation. Based on this guidance, the entire balance of the obligation has been paid as of December 31, 2019.\nOur accounting for the indefinite reinvestment assertion is complete. In general, it is our intention to permanently reinvest all earnings in excess of previously taxed amounts. As part of Tax Reform, substantially all of the previous earnings of our non-U.S. subsidiaries were taxed through the transition tax and current earnings are taxed as part of GILTI tax expense. These taxes increased our previously taxed earnings and allow for the repatriation of the majority of our foreign earnings without any residual U.S. federal tax. While we believe that the financial reporting bases may be greater than the tax bases of investments in foreign subsidiaries for any earnings in excess of previously taxed amounts, such amounts are considered permanently reinvested. The cumulative temporary difference related to such permanently reinvested earnings is approximately $32.8 million and we would anticipate the tax effect on those earnings to be immaterial as a result of Tax Reform. During the year ended December 31, 2018, we repatriated $144.3 million of foreign cash. We did not make any adjustments related to our indefinite reinvestment assertion during the years ended December 31, 2019 and 2018.\nOur accounting policy choice for GILTI is complete. Under U.S. GAAP, we are allowed to make an accounting policy choice of either (1) treating taxes due on future U.S. inclusions in taxable income related to GILTI as a current-period expense when incurred (the period cost method) or (2) factoring such amounts into the measurement of our deferred taxes (the deferred method). We selected the period cost method and recorded GILTI tax expense of $0.6 million and $0.4 million in the financial statements for the years ended December 31, 2019 and 2018, respectively.\nThe components of deferred tax assets and liabilities are as follows:\nThe valuation allowance decreased by $4.2 million for the year ended December 31, 2019. Due to an enacted law change in a foreign jurisdiction during the year ended December 31, 2019, certain expenses will become nondeductible for tax purposes in 2020, resulting in the ability to utilize net operating losses in a jurisdiction where we previously determined utilization was remote. Considering all positive and negative evidence, we determined significant positive evidence exists to release $6.7 million of valuation allowance previously established. This decrease in the valuation allowance is offset by other increases in unrealizable tax assets. As of each reporting date, management considers new evidence, both positive and negative, that could affect the future realization of deferred tax assets. If management determines it is more likely than not that an asset, or a portion of an asset, will not be realized, a valuation allowance is recorded.\nAs of December 31, 2019, we had federal net operating loss carryforwards of $4.2 million. These losses expire between 2025 - 2037, and are subject to limitations on their utilization. Deferred tax assets of $0.3 million have been recorded for state operating loss carryforwards. These losses expire between 2030 - 2038, and are subject to limitations on their utilization. We had total foreign net operating loss carryforwards of $142.0 million, of which $113.2 million are not currently subject to expiration dates. The remainder, $28.8 million, expires between 2024 - 2036. We had tax credit carryforwards of $4.1 million, of which $1.2 million are subject to limitations on their utilization. Approximately $0.6 million of these tax credit\ncarryforwards are not currently subject to expiration dates. The remainder, $3.5 million, expires in various years between 2020 - 2039.\nThe following is a reconciliation of the total amounts of unrecognized tax benefits:\nWe believe that it is reasonably possible that approximately $8.3 million of uncertain tax positions included in the table above may be resolved within the next twelve months as a result of settlement with a taxing authority or a lapse of the statute of limitations. If the unrecognized tax benefit as of December 31, 2019 were to be recognized, a benefit of $47.3 million would impact the effective tax rate.\nWe recognize interest and penalties related to income taxes as income tax expense. During the years ended December 31, 2019, 2018 and 2017, we recorded penalty expense of $0.5 million, $0.8 million and $1.1 million, respectively. We recorded interest expense of less than $0.1 million, interest income of $0.1 million and interest expense of $0.4 million for the years ended December 31, 2019, 2018 and 2017, respectively. As of December 31, 2019, we accrued a liability for penalties of $11.7 million and interest of $6.6 million. As of December 31, 2018, we accrued a liability for penalties of $4.7 million and interest of $4.0 million.\nWe are subject to taxation in the U.S. and various states and foreign jurisdictions. In the U.S., our only major tax jurisdiction, the 2016 - 2019 tax years are open to examination by the Internal Revenue Service.\n12.\nPension and Profit-Sharing Plans\nWe have a 401(k)/profit-sharing plan for all qualifying domestic employees that permits participants to defer a portion of their pay pursuant to Section 401(k) of the Internal Revenue Code. We make matching contributions on behalf of each eligible participant in an amount equal to 100% of the first 3% and an additional 25% of the next 5%, for a maximum total of 4.25% of the employee's compensation. We may make a discretionary contribution based on the participant's eligible compensation, provided the employee is employed at the end of the year and has worked at least 1,000 hours. We also maintain and contribute to various defined contribution and defined benefit pension arrangements for our international employees. We meet the minimum statutory funding requirements for our foreign plans. As of December 31, 2019, the total unfunded portion of the defined benefit obligations is $11.2 million.\nExpenses related to our retirement programs were $16.3 million in 2019, $12.4 million in 2018 and $10.1 million in 2017.\n13.\nNon-Compete and Employment Agreements\nOur employees have signed agreements under which they have agreed not to disclose trade secrets or confidential information that, where legally permitted, restrict engagement in or connection with any business that is competitive with us anywhere in the world while employed by us (and, in some cases, for specified periods thereafter in relevant geographic areas), and that any products or technology created by them during their term of employment are our property. In addition, we require all channel partners to enter into agreements not to disclose our trade secrets and other proprietary information.\nWe have an employment agreement with our Chief Executive Officer. This agreement provides for, among other things, in the case of termination by us other than for Cause (as defined therein) or by the Chief Executive Officer for Good Reason (as defined therein) and subject to his execution and delivery of a release of claims against us, he will receive minimum severance payments equal to the sum of two times his base salary and target bonus to be paid out over two years from the date of\ntermination and up to two years of COBRA payments for health care coverage after termination. During his employment with us and for two years thereafter, following termination of employment under certain circumstances described in the contract, he will be subject to non-competition and non-solicitation obligations.\nWe also have employment agreements with several other employees, primarily in foreign jurisdictions. The terms of these employment agreements generally include annual compensation and non-compete clauses.\n14.\nStock-Based Compensation\nWe have an equity incentive plan - the Fifth Amended and Restated ANSYS, Inc. 1996 Stock Option and Grant Plan (Stock Plan). The Stock Plan, as amended, authorizes the grant of approximately 39.8 million shares of our common stock in the form of: (i) incentive stock options (ISOs), (ii) nonqualified stock options, (iii) common stock with or without vesting or other restrictions, (iv) common stock upon the attainment of specified performance goals, (v) restricted stock awards, (vi) the right to receive cash dividends with the holders of the common stock as if the recipient held a specified number of shares of the common stock, (vii) deferred stock awards, (viii) restricted stock unit awards, (ix) stock appreciation rights and (x) cash-based awards.\nThe Stock Plan provides that: (i) the exercise price of any stock option must be no less than the fair value of the stock at the date of grant and (ii) the exercise price of an ISO held by an optionee who possesses more than 10% of the total combined voting power of all classes of stock must be no less than 110% of the fair market value of the stock at the time of grant. The Compensation Committee of the Board of Directors has the authority to set expiration dates that are no later than ten years from the date of grant (or five years for an optionee who meets the 10% criterion), payment terms, and other provisions for each grant. Shares associated with unexercised options or reacquired shares of common stock (except those shares withheld as a result of tax withholding, shares used to pay an option exercise price or pursuant to a net issuance) become available again for option grants and common stock-related awards under the Stock Plan.\nThe Compensation Committee of the Board of Directors may, at its sole discretion, accelerate the date or dates on which an award granted under the Stock Plan may vest or extend, in the case of a stock option, the exercise period up to the expiration date of the option, subject to the terms and conditions of the Stock Plan. Upon termination of service of a participant due to the participant’s death or disability, the vesting of restricted stock units held by the participant accelerates (in case of performance-based vesting, subject to the attainment of the performance requirement).\nIn the event of a \"sale event,\" defined in the Stock Plan as a \"Transaction,\" all outstanding awards will be assumed or continued by the successor entity, with appropriate adjustment in the awards to reflect the transaction. In such event, except as the Compensation Committee may otherwise specify with respect to particular awards in the award agreements, if the service relationship of the holder of an award is terminated without cause on or within 18 months after the sale event, then all awards held by such holder will become fully vested and exercisable at that time. If there is a sale event in which the successor entity refuses to assume or continue outstanding awards, then subject to the consummation of the sale event, all awards with time-based vesting conditions will become fully vested and exercisable at the effective time of the sale event and all awards with performance-based vesting conditions may become vested at the discretion of the Compensation Committee and then all such awards will terminate at the time of the sale event. In the event of the termination of stock options or stock appreciation rights in connection with a sale event, the Compensation Committee may either make or provide for a cash payment to the holders of such awards equal to the difference between the per share transaction consideration and the exercise price of such awards or permit each holder to have at least a 15-day period to exercise such awards prior to their termination.\nWe currently issue shares related to exercised stock options or vested awards from our existing pool of treasury shares and have no specific policy to repurchase treasury shares as stock options are exercised or as awards vest. If the treasury pool is depleted, we will issue new shares.\nTotal stock-based compensation expense recognized for the years ended December 31, 2019, 2018 and 2017 is as follows:\nStock Options\nPrior to 2017, we granted stock option awards. The value of each stock option award was estimated on the date of grant, or date of acquisition for options issued in a business combination, using the Black-Scholes option pricing model (Black-Scholes model). The determination of the fair value of stock-based payment awards using an option pricing model was affected by our stock price as well as assumptions regarding a number of complex and subjective variables. These variables included our stock volatility during the preceding six years, actual and projected employee stock option exercise behaviors, interest rate assumptions using the five-year U.S. Treasury Note yield on date of grant or acquisition date, and expected dividends. The stock-based compensation expense for options is recorded ratably over the requisite service period.\nForfeitures of awards are accounted for as they occur.\nAs of December 31, 2019, total unrecognized estimated compensation cost related to unvested stock options granted prior to that date was $1.0 million, which is expected to be recognized over a weighted average period of less than 1.0 year.\nInformation regarding stock option transactions is summarized below:\nHistorical and future expected forfeitures have not been significant and, as a result, the outstanding option amounts reflected in the tables above approximate the options expected to vest.\nInformation regarding stock options outstanding as of December 31, 2019 is summarized below:\nRestricted Stock Units\nUnder the terms of the Fifth Amended and Restated ANSYS, Inc. 1996 Stock Option and Grant Plan, we issue various restricted stock unit awards. The following table summarizes the types of awards and vesting conditions:\nThe fair values of restricted stock units (RSUs) with a market condition were estimated using a Monte Carlo simulation model and are recognized over the vesting period. The determination of the fair values of the awards was affected by the grant date and several variables, each of which has been identified in the chart below:\nThe fair value of RSUs with operating performance metrics is based on the fair market value of our stock on the date of the grant and is recognized from the grant date through the conclusion of the measurement period associated with each operating performance metric based on management's estimates concerning the probability of vesting.\nThe fair value of RSUs with only a service condition is based on the fair market value of our stock on the date of the grant and is recognized over the vesting period.\nTotal compensation expense for employee RSU awards recorded for the years ended December 31, 2019, 2018 and 2017 was $109.9 million, $77.4 million and $46.3 million, respectively.\nInformation regarding all employee RSU transactions is summarized below:\n(1) Includes all RSUs granted during the year. RSUs with operating performance conditions are issued annually and have one or three performance cycles. Performance conditions are assigned at the beginning of each performance cycle and are reflected as grants at target at that time.\n(2) RSUs with a market or performance condition are granted at target and vest based on achievement of the market or operating performance and service conditions. The actual number of RSUs issued may be more or less than the target RSUs depending on the achievement of the market or operating performance conditions.\nBoard of Directors\nDuring and prior to 2015, we granted deferred stock awards to non-employee Directors, which are rights to receive shares of common stock upon termination of service as a Director. Associated with these awards, we established a non-qualified 409(a) deferred compensation plan with assets held under a rabbi trust to provide Directors an opportunity to diversify their vested awards. During open trading windows and at their elective option, the Directors may convert their Ansys shares into a variety of non-Ansys-stock investment options in order to diversify a portion of their holdings, subject to meeting ownership guidelines.\nInformation regarding deferred stock awards to non-employee Directors is summarized below:\nIn 2019, 2018 and 2017, we granted 11,259, 13,632 and 18,018 RSUs to non-employee Directors, respectively, which will vest in full upon the earlier of one year from the date of grant or the date of the next regular meeting of stockholders. If a non-employee Director retires prior to the vest date, the non-employee Director receives a pro-rata portion of the RSUs. The weighted-average grant date fair values per RSU were $187.53, $165.71 and $123.38 for the years ended December 31, 2019, 2018 and 2017, respectively. Total compensation expense associated with the awards recorded for the years ended December 31, 2019, 2018 and 2017 was $2.5 million, $2.3 million and $2.6 million, respectively.\nEmployee Stock Purchase Plan\nOur 1996 Employee Stock Purchase Plan (the “Purchase Plan”) was adopted by the Board of Directors on April 19, 1996 and was subsequently approved by our stockholders. The stockholders approved an amendment to the Purchase Plan in May 2016 to increase the number of shares available for offerings to 1.8 million shares. The Purchase Plan is administered by the Compensation Committee. Offerings under the Purchase Plan commence on each February 1 and August 1, and have a duration of six months. An employee who owns or is deemed to own shares of stock representing in excess of 5% of the combined voting power of all classes of our stock may not participate in the Purchase Plan.\nDuring each offering, an eligible employee may purchase shares under the Purchase Plan by authorizing payroll deductions of up to 10% of his or her cash compensation during the offering period. The maximum number of shares that may be purchased by any participating employee during any offering period is limited to 3,840 shares (as adjusted by the Compensation Committee from time to time). Unless the employee has previously withdrawn from the offering, his or her accumulated payroll deductions will be used to purchase common stock on the last business day of the period at a price equal to 90% of the fair market value of the common stock on the first or last day of the offering period, whichever is lower. Under applicable tax rules, an employee may not accrue the right to purchase more than $25,000 of common stock, based on the grant-date fair value, in any calendar year in which the option is outstanding at any time. As of December 31, 2019, 1.6 million shares of common stock had been issued under the Purchase Plan. The total compensation expense recorded under the Purchase Plan during the years ended December 31, 2019, 2018 and 2017 was $2.0 million, $1.8 million and $1.2 million, respectively.\n15.\nStock Repurchase Program\nUnder our stock repurchase program, we repurchased shares as follows:\nIn February 2018, our Board of Directors increased the number of shares authorized for repurchase to a total of 5.0 million shares under the stock repurchase program. As of December 31, 2019, 3.5 million shares remained available for repurchase under the program.\n16.\nRoyalty Agreements\nWe have entered into various renewable license agreements under which we have been granted access to the licensor's technology and the right to sell the technology in our product line. Royalties are payable to developers of the software at various rates and amounts, which generally are based upon unit sales, revenue or flat fees. Royalty fees are reported in cost of software licenses and were $22.4 million, $16.9 million and $16.0 million for the years ended December 31, 2019, 2018 and 2017, respectively.\n17.\nGeographic Information\nRevenue to external customers is attributed to individual countries based upon the location of the customer. Revenue by geographic area was as follows:\nProperty and equipment by geographic area was as follows:\n18.\nUnconditional Purchase Obligations\nWe have entered into various unconditional purchase obligations which primarily include royalties and software licenses and services. We expended $24.2 million, $22.4 million and $14.1 million related to unconditional purchase obligations that existed as of the beginning of each year for the years ended December 31, 2019, 2018 and 2017, respectively. Future expenditures under unconditional purchase obligations in effect as of December 31, 2019 are as follows:\n19.\nRestructuring\nDuring the fourth quarter of 2016, we initiated workforce realignment activities to reallocate resources to align with our future strategic plans. We completed the workforce realignment activities as of September 30, 2017. We incurred related restructuring charges as follows:\nThe restructuring charges are included in the presentation of cost of software licenses; cost of maintenance and service; research and development expense; and selling, general and administrative expense. The gross charges were fully paid as of March 31, 2018.\n20.\nContingencies and Commitments\nWe are subject to various investigations, claims and legal proceedings that arise in the ordinary course of business, including commercial disputes, labor and employment matters, tax audits, alleged infringement of intellectual property rights and other matters. In our opinion, the resolution of pending matters is not expected to have a material adverse effect on our consolidated results of operations, cash flows or financial position. However, each of these matters is subject to various uncertainties and it is possible that an unfavorable resolution of one or more of these proceedings could materially affect our results of operations, cash flows or financial position.\nOur Indian subsidiary has several service tax audits pending that have resulted in formal inquiries being received on transactions through mid-2012. We could incur tax charges and related liabilities of approximately $7.2 million. The service tax issues raised in our notices and inquiries are very similar to the case, M/s Microsoft Corporation (I) (P) Ltd. Vs. Commissioner of Service Tax, New Delhi, wherein the Delhi Customs, Excise and Service Tax Appellate Tribunal (CESTAT) passed a favorable ruling to Microsoft. The Microsoft case ruling was subsequently challenged in the Supreme Court by the Indian tax authority. We can provide no assurances on the impact that the present Microsoft case’s decision will have on our cases. We are uncertain as to when these service tax matters will be concluded.\nWe sell software licenses and services to our customers under contractual agreements. Such agreements generally include certain provisions indemnifying the customer against claims of intellectual property infringement by third parties arising from such customer’s usage of our products or services. To date, payments related to these indemnification provisions have been immaterial. For several reasons, including the lack of prior material indemnification claims, we cannot determine the maximum amount of potential future payments, if any, related to such indemnification provisions.\nSCHEDULE II\nANSYS, INC. AND SUBSIDIARIES\nValuation and Qualifying Accounts\nExhibit No.\nExhibit\n3.1\nRestated Certificate of Incorporation of the Company; filed herewith.\n3.2\nThird Amended and Restated By-laws of the Company (filed as Exhibit 3.1 to the Company's Current Report on Form 8-K, filed January 19, 2018, and incorporated herein by reference).\n4.1\nDescription of Securities; filed herewith.\n10.1\nForm of Indemnification Agreement between ANSYS, Inc. and Non-Employee Directors (filed as Exhibit 10.1 to the Company's Current Report on Form 8-K, filed March 20, 2013, and incorporated herein by reference).*\n10.2\nNon-Employee Director Deferred Compensation Plan (filed as Exhibit 10.2 to the Company's Quarterly Report on Form 10-Q, filed November 7, 2019, and incorporated herein by reference).*\n10.3\nExecutive Severance Plan, as amended and restated, dated July 29, 2014; filed herewith.*\n10.4\nFourth Amended and Restated ANSYS, Inc. 1996 Stock Option and Grant Plan (filed as Exhibit 10.1 to the Company's Current Report on Form 8-K, filed May 17, 2011, and incorporated herein by reference).*\n10.5\nForm of Deferred Stock Unit Agreement under the Fourth Amended and Restated ANSYS, Inc. 1996 Stock Option and Grant Plan; filed herewith.*\n10.6\nForm of Employee Non-Qualified Stock Option Agreement under the Fourth Amended and Restated ANSYS, Inc. 1996 Stock Option and Grant Plan (filed as Exhibit 10.1 to the Company's Quarterly Report on Form 10-Q, filed May 2, 2013, and incorporated herein by reference).*\n10.7\nForm of Restricted Stock Unit Agreement under the Fourth Amended and Restated ANSYS, Inc. 1996 Stock Option and Grant Plan (filed as Exhibit 10.39 to the Company's Annual Report on Form 10-K, filed February 27, 2014, and incorporated herein by reference).*\n10.8\nFifth Amended and Restated ANSYS, Inc. 1996 Stock Option and Grant Plan (filed as Appendix 1 to the registrant’s Definitive Proxy Statement on Schedule 14A filed with the SEC on March 31, 2016 and incorporated herein by reference).*\n10.9\nForm of Non-Qualified Stock Option Agreement under the Fifth Amended and Restated ANSYS, Inc. 1996 Stock Option and Grant Plan (filed as Exhibit 10.36 to the Company's Annual Report on Form 10-K, filed February 23, 2017, and incorporated herein by reference).*\n10.10\n2017 Form of Restricted Stock Unit Agreement under the Fifth Amended and Restated ANSYS, Inc. 1996 Stock Option and Grant Plan (filed as Exhibit 10.35 to the Company's Annual Report on Form 10-K, filed February 23, 2017, and incorporated herein by reference).*\n10.11\n2018 Form of Restricted Stock Unit Agreement under the Fifth Amended and Restated ANSYS, Inc. 1996 Stock Option and Grant Plan; filed herewith.*\n10.12\n2019 Form of Restricted Stock Unit Agreement under the Fifth Amended and Restated ANSYS, Inc. 1996 Stock Option and Grant Plan; filed herewith.*\n10.13\nForm of Restricted Stock Unit Award Agreement (Non-Employee Directors) under the Fifth Amended and Restated ANSYS, Inc. 1996 Stock Option and Grant Plan; filed herewith.*\n10.14\n2018 Form of Award Notice (Operating Margin) under the Fifth Amended and Restated ANSYS, Inc. 1996 Stock Option and Grant Plan; filed herewith.*\n10.15\n2018 Form of Award Notice (Total Shareholder Return) under the Fifth Amended and Restated ANSYS, Inc. 1996 Stock Option and Grant Plan; filed herewith.*\n10.16\n2019 Form of Award Notice (Annual Contract Value) under the Fifth Amended and Restated ANSYS, Inc. 1996 Stock Option and Grant Plan; filed herewith.*\n10.17\n2019 Form of Award Notice (Total Shareholder Return) under the Fifth Amended and Restated ANSYS, Inc. 1996 Stock Option and Grant Plan; filed herewith.*\n10.18\n2019 Form of Special Performance Stock Unit Agreement under the Fifth Amended and Restated ANSYS, Inc. 1996 Stock Option and Grant Plan; filed herewith.*\n10.19\nEmployment Agreement between ANSYS, Inc. and Ajei S. Gopal, dated August 29, 2016 (filed as Exhibit 10.1 to the Company's Current Report on Form 8-K, filed August 29, 2016, and incorporated herein by reference).*\n10.20\nForm of Non-Qualified Stock Option Agreement with Ajei S. Gopal (filed as Exhibit 10.3 to the Company's Current Report on Form 8-K, filed August 29, 2016, and incorporated herein by reference).*\n10.21\nLease by and between ANSYS, Inc. and Quattro Investment Group, L.P., dated as of September 14, 2012 (filed as Exhibit 10.1 to the Company's Current Report on Form 8-K, filed September 18, 2012, and incorporated herein by reference).\n10.22\nCredit Agreement, dated as of February 22, 2019, among ANSYS, Inc. as borrower, Bank of America, N.A. as Administrative Agent and the banks listed therein (filed as Exhibit 10.1 to the Company’s Quarterly Report on Form 10-Q, filed May 2, 2019, and incorporated herein by reference).\n10.23\nFirst Amendment to Credit Agreement dated October 16, 2019, by and among ANSYS, Inc., the lenders party thereto and Bank of America, N.A. (filed as Exhibit 10.1 to the Company's Current Report on Form 8-K, filed October 21, 2019, and incorporated herein by reference).\n21.1\nSubsidiaries of the Registrant; filed herewith.\n23.1\nConsent of Deloitte & Touche LLP, independent registered public accounting firm.\n24.1\nPowers of Attorney. Contained on the Signatures page of the Company's Annual Report on Form 10-K for the fiscal year ended December 31, 2019 and incorporated herein by reference.\n31.1\nCertification of Chief Executive Officer pursuant to Section 302 of the Sarbanes-Oxley Act of 2002.\n31.2\nCertification of Chief Financial Officer pursuant to Section 302 of the Sarbanes-Oxley Act of 2002.\n32.1\nCertification pursuant to 18 U.S.C. Section 1350, as adopted pursuant to Section 906 of the Sarbanes-Oxley Act of 2002.\n32.2\nCertification pursuant to 18 U.S.C. Section 1350, as adopted pursuant to Section 906 of the Sarbanes-Oxley Act of 2002.\n101.INS\nInline XBRL Instance Document (the instance document does not appear in the Interactive Data File because its XBRL tags are embedded within the Inline XBRL document)\n101.SCH\nInline XBRL Taxonomy Extension Schema\n101.CAL\nInline XBRL Taxonomy Extension Calculation Linkbase\n101.DEF\nInline XBRL Taxonomy Extension Definition Linkbase\n101.LAB\nInline XBRL Taxonomy Extension Label Linkbase\n101.PRE\nInline XBRL Taxonomy Extension Presentation Linkbase\nCover Page Interactive Data File (formatted as Inline XBRL and contained in Exhibit 101)\n*\nIndicates management contract or compensatory plan, contract or arrangement.",
    "item_16": "ITEM 16.\nFORM 10-K SUMMARY\nNone.",
    "stock_ticker": "ANSS"
}