{
    "cik": "1091667",
    "company": "CHARTER COMMUNICATIONS, INC. /MO/",
    "filing_type": "10-K",
    "filing_date": "2023-01-27",
    "period_of_report": "2022-12-31",
    "sic": "4841",
    "state_of_inc": null,
    "state_location": "CT",
    "fiscal_year_end": "1231",
    "filing_html_index": "https://www.sec.gov/Archives/edgar/data/1091667/0001091667-23-000024-index.html",
    "htm_filing_link": "https://www.sec.gov/Archives/edgar/data/1091667/000109166723000024/chtr-20221231.htm",
    "complete_text_filing_link": "https://www.sec.gov/Archives/edgar/data/1091667/0001091667-23-000024.txt",
    "filename": "1091667_10K_2022_0001091667-23-000024.htm",
    "item_1": "Item 1. Business.\nIntroduction\nWe are a leading broadband connectivity company and cable operator serving more than 32 million customers in 41 states through our Spectrum brand. Over an advanced high-capacity, two-way telecommunications network, we offer a full range of state-of-the-art residential and business services including Spectrum Internet®, TV, Mobile and Voice. For small and medium-sized companies, Spectrum Business® delivers the same suite of broadband products and services coupled with special features and applications to enhance productivity, while for larger businesses and government entities, Spectrum Enterprise™ provides highly customized, fiber-based solutions. Spectrum Reach® delivers tailored advertising and production for the modern media landscape. We also distribute award-winning news coverage and sports programming to our customers through Spectrum Networks.\nOur network, which we own and operate, passes over an estimated 55 million households and businesses across the United States. Our strategy is focused on the evolution of our network, expansion of our footprint, and the execution of high quality operations, including customer service. It allows us to maintain a state-of-the-art network delivering the most compelling converged connectivity services in a capital and time-efficient manner, and in turn, offer advanced services to consumers at highly attractive prices, together with outstanding customer service. Offering high quality, competitively priced products and outstanding service allows us to increase both the number of customers we serve over our fully deployed network and the number of products we sell to each customer. This combination also reduces the number of service transactions we perform per relationship, yielding higher customer satisfaction and lower customer churn, which results in lower costs to acquire and serve customers and greater profitability.\nEvolution - Expanding the Capability of Our Network\nOver the next three years, we plan to evolve our hybrid fiber coaxial network using a number of technologies, including spectrum expansion, initially to 1.2 GHz and then to 1.8 GHz, high splits to increase upstream speeds, Distributed Access Architecture (\"DAA\") and DOCSIS 4.0 technology. Through this process, which we expect to essentially complete by year end 2025, we will transform our network to enable multi-gigabit data speeds to customers. Those faster speeds will be offered in conjunction with our Spectrum mobile product and Advanced WiFi, providing customers seamless and convenient, ultra-fast converged connectivity in attractively priced packages, including Spectrum One, introduced in October 2022. In addition, we expect our network evolution to enable us to offer fiber on demand across the majority of our footprint. We also offer a comprehensive video product, and Xumo, a next generation streaming platform jointly owned with Comcast Corporation (\"Comcast\"), will create an app-based video platform with the ability to provide streaming video packages, leverage our Spectrum TV® application, aggregate consumer streaming applications, and provide an industry leading voice search.\nExpansion - Building Our Future by Extending Our Network\nRural builds present strategic expansion opportunities of our footprint to unserved and underserved passings. Over the next several years, we expect to invest over $6 billion, a portion of which we expect to offset with government funding including over $1.7 billion of support awarded through December 31, 2022 in the Rural Development Opportunity Fund (“RDOF”) auction and other federal, state and municipal grants. We expect to participate in additional federal, state and municipal grant programs over the coming years. This investment will allow us to offer a suite of broadband connectivity services including fixed Internet, WiFi and mobile to more than one million estimated passings in unserved areas in states where we currently operate. We have also renewed our focus on building to more passings inside and at the edge of our existing network. To accomplish all of this, we have invested in new teams, new training and new equipment. These investments will allow us to generate long-term infrastructure-style returns by taking further advantage of the efficiencies of the scale and quality of our network and construction capabilities while offering our high quality products and services to more homes and businesses.\nExecution - Turning Our Strategy Into Success\nWe have competitive services and promote and package our services in ways that allow customers to have better products and save money. In addition, our focus on service quality complements our products and price. We improve the customer experience by digitizing service where customers prefer, performing proactive maintenance, and investing in systems and in our operations teams. As part of our investment in operations teams, we are making targeted adjustments to job structure, pay and benefits and career paths to improve the skills and tenure of our workforce.\nOur principal executive offices are located at 400 Washington Blvd., Stamford, Connecticut 06902. Our telephone number is (203) 905-7801, and we have a website accessible at ir.charter.com. Our Annual Reports on Form 10-K, Quarterly Reports on Form 10-Q and Current Reports on Form 8-K, and all amendments thereto, are available on our website free of charge as soon as reasonably practicable after they have been filed. The information posted on our website is not incorporated into this annual report.\nCorporate Entity Structure\nThe chart below sets forth our entity structure and that of our direct and indirect subsidiaries. The chart does not include all of our affiliates and subsidiaries and, in some cases, we have combined separate entities for presentation purposes. The equity ownership percentages shown below for Charter Communications Holdings, LLC (“Charter Holdings”) are approximations. Indebtedness amounts shown below are principal amounts as of December 31, 2022. See Note 8 to the accompanying consolidated financial statements contained in “Part II. Item 8. Financial Statements and Supplementary Data,” which also includes the accreted values of the indebtedness described below.\nFootprint\nWe operate in geographically diverse areas which are managed centrally on a consolidated level. The map below highlights our footprint along with our planned rural expansion over the next several years based on grants awarded as of December 31, 2022.\nProducts and Services\nWe offer our customers subscription-based Internet services, video services, and mobile and voice services. Our services are offered to residential and commercial customers on a subscription basis, with prices and related charges based on the types of service selected, whether the services are sold as a “bundle” or on an individual basis, and based on the equipment necessary to receive our services. Bundled services including some combination of our Internet, video, voice and/or mobile products are available to substantially all of our passings.\nThe following table summarizes our customer statistics for Internet, video, voice and mobile as of December 31, 2022 and 2021 (in thousands except per customer data and footnotes).\n(a)We calculate the aging of customer accounts based on the monthly billing cycle for each account. On that basis, as of December 31, 2022 and 2021, customers include approximately 144,100 and 128,300 customers, respectively, whose accounts were over 60 days past due, approximately 52,800 and 26,800 customers, respectively, whose accounts were over 90 days past due, and approximately 214,100 and 43,200 customers, respectively, whose accounts were over 120 days past due. Bad debt expense associated with these past due accounts has been reflected in our consolidated statements of operations. The increase in past due accounts is predominately due to pre-existing and incremental unsubsidized services, including video services, for those customers participating in government assistance programs. These customers are downgraded to a fully subsidized Internet-only service.\n(b)Customer relationships include the number of customers that receive one or more levels of service, encompassing Internet, video and voice services, without regard to which service(s) such customers receive. Customers who reside in residential multiple dwelling units (“MDUs”) and that are billed under bulk contracts are counted based on the number of billed units within each bulk MDU. Total customer relationships exclude enterprise and mobile-only customer relationships.\n(c)Monthly residential revenue per residential customer is calculated as total residential annual revenue divided by twelve divided by average residential customer relationships during the respective year and excludes mobile revenue and customers.\n(d)Monthly SMB revenue per SMB customer is calculated as total SMB annual revenue divided by twelve divided by average SMB customer relationships during the respective year and excludes mobile revenue and customers.\n(e)Mobile lines include phones and tablets which require one of our standard rate plans (e.g., \"Unlimited\" or \"By the Gig\"). Mobile lines exclude wearables and other devices that do not require standard phone rate plans.\n(f)Enterprise PSUs represent the aggregate number of fiber service offerings counting each separate service offering at each customer location as an individual PSU.\nResidential Services\nConnectivity Services\nWe provide our customers with a suite of broadband connectivity services including fixed Internet, WiFi and mobile which when bundled together provides our customers with a differentiated converged connectivity experience while saving consumers and businesses money.\nWe offer Spectrum Internet products with speeds up to 1 Gbps across our entire footprint. Spectrum Internet bundled with our in-home Advanced WiFi allows multiple people within a single household to stream high definition (“HD”) video content while simultaneously using our Internet service for other purposes including two-way video conferencing, among other things.\nOur in-home WiFi product provides our Internet customers with high performance wireless routers and a managed WiFi service to maximize their wireless Internet experience. We offer Advanced WiFi service across nearly all of our residential footprint along with WiFi 6 routers capable of delivering speeds over 1 Gbps. With Advanced WiFi, customers enjoy a cloud-optimized WiFi connection and have the ability to view and control their WiFi network through our Spectrum application (“My Spectrum App”). The service enables parental control schedules to be set for children’s devices or limit access entirely to unknown devices attempting to access the network.\nCustomers also have the option to add Spectrum WiFi pods to Advanced WiFi. WiFi pods are small, discreet access points that plug into electrical outlets in the home, providing broader and more consistent WiFi coverage. In 2022, we began rolling out Spectrum Security Shield across the residential footprint which protects all devices in the home using network-based security. This free security suite provides end point protection to computers in the home, enabling protection against computer viruses, spyware and threats from malicious actors across the Internet.\nWe also offer the capabilities of the Advanced WiFi service to MDUs as Advanced Community WiFi (“ACW”). With ACW, tenants will receive the same visibility and control over their apartment’s WiFi networks through the My Spectrum App, while building managers will be able to see and manage the entire building’s network through a purpose-built property service portal.\nOur Spectrum Mobile service is offered to customers subscribing to our Internet service, and runs on Verizon Communications Inc.’s (\"Verizon\") mobile network, combined with Spectrum WiFi. We offer nationwide fifth generation (\"5G\") service at no incremental cost to our mobile customers enabling them to stream content several times faster and reducing latency when connecting to apps or webpages where 5G coverage exists. In addition, we continue to focus on improving the customer experience and integrating our mobile and fixed Internet products, providing greater WiFi access, speeds and performance using more than 500,000 of our out-of-home WiFi access points across our footprint combined with approximately 25 million out-of-home WiFi access points from other networks with which we partner, providing near nationwide coverage. In 2022, we launched an enhancement to our connectivity services with Spectrum Mobile Speed Boost at Home (“Speed Boost”). Customers are eligible for Speed Boost if they have both Spectrum Mobile and Spectrum Internet, a DOCSIS 3.1 modem and an Advanced WiFi router. When connected on their Spectrum Mobile device through their secure in-home WiFi private service set identifier (“SSID”), customers are now experiencing the fastest overall speeds up to 1 Gbps. The Spectrum Mobile SSID accelerates offload data from our mobile virtual network operator (\"MVNO\") cellular network to our own WiFi network and we expect it to be available across our footprint in 2023.\nWe provide wireline voice communications services using voice over Internet protocol (\"VoIP\") technology to transmit digital voice signals over our network. Our voice services include unlimited local and long distance calling to the United States, Canada, Mexico and Puerto Rico, voicemail, call waiting, caller ID, call forwarding and other features and offers international calling either by the minute, or through packages of minutes per month. For customers that subscribe to both our voice and video offerings, caller ID on TV is also available in most areas. We also offer Call Guard, an advanced caller ID and robocall blocking solution, for our residential and SMB voice customers. Call Guard reduces customer frustration and improves security by blocking malicious calls while ensuring our customers continue to receive the legitimate automated calls they need from schools or healthcare providers.\nVideo Services\nWe provide our customers with a choice of video programming services on a variety of platforms including through a digital set-top box or an Internet Protocol (\"IP\") device. Video customers have access to a variety of programming packages with approximately 375 channels available in home and out of home allowing our customers to access the programming they want, when they want it, on any device. Our video customers also have access to programmer authenticated applications such as Fox Now, Showtime and ESPN and direct to consumer applications such as Netflix and YouTube on certain set-top boxes. In June 2022, we entered into a joint venture with Comcast to develop and offer a next-generation streaming platform, Xumo, with the ability to provide streaming video packages, leverage our Spectrum TV® application, aggregate consumer streaming applications, and provide an industry leading voice search, with the benefit of new revenue streams.\nOur video service also includes access to an interactive programming guide with parental controls and in virtually all of our footprint, video on demand (“VOD”) or pay-per-view services. VOD service allows customers to select from approximately 90,000 titles at any time. VOD programming options may be accessed at no additional cost if the content is associated with a customer’s linear subscription, or for a fee on a transactional basis. VOD services are also offered on a subscription basis included in a digital tier premium channel subscription or for a monthly fee. Pay-per-view channels allow customers to pay on a per-event basis to view a single showing of a one-time special sporting event, music concert, or similar event on a commercial-free basis. We also offer digital video recorder (“DVR”) service that enables customers to digitally record programming and to pause and rewind live programming on set-top boxes and cloud DVR service, which allows customers to schedule, record and watch their favorite programming anytime from connected IP devices as well as SpectrumTV.com.\nCustomers are increasingly accessing their subscription video content through our highly rated Spectrum TV application via mobile devices and connected IP devices, such as Roku, Xumo TV and Samsung TV. Access to the Spectrum TV application is included in all Spectrum TV video plans and allows users to stream content across a growing number of platforms as well as access their full TV lineup, watch on demand content and gives them the ability to program their DVR from anywhere. Customers are also able to purchase their video services within the Spectrum TV application.\nCommercial Services\nWe offer scalable broadband communications solutions for businesses and carrier organizations of all sizes, selling Internet access, data networking, fiber connectivity to cellular towers and office buildings, video entertainment services and business telephone services.\nSmall and Medium Business\nSpectrum Business offers Internet, voice and video services to SMBs over our hybrid fiber coaxial network. In addition, we offer our Spectrum Mobile service to SMB customers. Spectrum Business includes a full range of video programming and offers Internet speeds up to 1 Gbps across our entire footprint. Spectrum Business also includes a set of business services including static IP and business WiFi, e-mail and security, and voice services through either a traditional voice offering or hosted voice solution. In December 2022, we launched Spectrum Business Connect with RingCentral as our new SMB communications solution that includes Spectrum Internet, voice and complementary mobility features, and allows our customers’ remote and office employees to stay more easily connected regardless of their location. We also offer Wireless Internet Backup to our SMB customers which is designed to enhance and protect Internet service for SMBs in the event of a network disruption.\nEnterprise\nSpectrum Enterprise offers tailored communications products and managed service solutions over a high-capacity last-mile network with speeds up to 100 Gbps to larger businesses and government entities (local, state and federal), in addition to wholesale services to mobile and wireline carriers. The Spectrum Enterprise product portfolio includes connectivity services such as Internet Access (fiber, wireless and coax delivered); Wide Area Network (\"WAN\") solutions (Ethernet, Software Defined (“SD”)-WAN and cloud connectivity) that privately and securely connect geographically dispersed customer locations and cloud service providers; and Managed Services which address a wide range of enterprise networking (e.g. routing, Local Area Network (“LAN”), WiFi) and security (e.g. firewall, Distributed Denial of Service (“DDoS”) protection) challenges. To meet the communications needs of these more sophisticated customers, Spectrum Enterprise also offers an array of voice trunking services and unified messaging, communications and collaboration solutions. In December 2022, we launched Unified Communications with RingCentral, which integrates Spectrum Enterprise’s managed services to complement its other solutions and gives customers more choices for enhancing their digital experience across locations and devices. In addition, for\nindustries such as hospitality, education and healthcare where specialized video solutions are demanded, Spectrum Enterprise offers a wide range of solutions designed to meet those requirements. Spectrum Enterprise serves businesses nationally by combining its large serviceable footprint with a robust portfolio of fiber lit buildings and a significant wholesale partner network. As a result, these customers benefit by obtaining advanced solutions from a single provider who is committed to an exceptional customer experience and who delivers compelling value by simplifying procurement and offering competitive pricing potentially reducing our customers' costs.\nAdvertising Services\nOur advertising sales division, Spectrum Reach, offers local, regional and national businesses the opportunity to advertise in individual and multiple service areas on cable television networks, various streaming services and numerous advanced advertising platforms. We receive revenues from the sale of local advertising across various platforms for networks such as TBS, CNN and ESPN. We insert local advertising on up to 100 channels in over 90 markets. Our large footprint provides opportunities for advertising customers to address broader regional audiences from a single provider and thus reach more customers with a single transaction. Our size also provides scale to invest in new technology to create more targeted and addressable advertising capabilities.\nAvailable advertising time is generally sold by our advertising sales force. In some service areas, we have formed advertising interconnects or entered into representation agreements with other video distributors, including, among others, Verizon, DirecTV and Comcast, under which we sell advertising on behalf of those operators. In other service areas, we enter into representation agreements under which another operator in the area will sell advertising on our behalf. These arrangements enable us and our partners to represent and deliver commercials on their inventory across wider geographic areas, replicating the reach of local broadcast television stations to the extent possible. In addition, we enter into interconnect agreements from time to time with other cable operators, which, on behalf of a number of video operators, sells advertising time to national and regional advertisers in individual or multiple service areas.\nAdditionally, we sell the advertising inventory of our owned and operated local sports and news channels, of our regional sports networks that carry Los Angeles Lakers’ basketball games and other sports programming and of SportsNet LA, a regional sports network that carries Los Angeles Dodgers’ baseball games and other sports programming.\nIn 2022, we expanded our deployment of household addressability (\"HHA\"), which allows for more precise targeting across our footprint. Additionally, in conjunction with other MVPDs, Spectrum Reach enables multi-channel cable networks (e.g. AMC, Discovery) to deploy HHA on their own inventory in our footprint, charging them an enablement fee. We also continue to further enhance our Ad Portal, which allows small businesses to purchase local cable advertising and/or creative services via our web portal with limited sales personnel interaction at a price within their budgets. Our fully deployed Audience App, which uses our proprietary set-top box viewership data (all anonymized and aggregated), allows us to create data-driven linear TV campaigns for local advertisers. In 2022, Spectrum Reach launched its first programmatic sales platform allowing advertising agencies and advertisers to buy inventory in a fully automated way. Streaming TV, which is largely comprised of Spectrum TV application impressions, as well as those from numerous over-the-top streaming content providers, is part of our suite of advanced advertising products available to the marketplace. Spectrum Reach is also now employing multi-screen deterministic attribution services for television and streaming services that lets advertisers know the effectiveness of their advertising on Spectrum Reach’s platform.\nOther Services\nRegional Sports Networks\nWe have an agreement with the Los Angeles Lakers for rights to distribute all locally available Los Angeles Lakers’ games through 2033. We broadcast those games on our regional sports network, Spectrum SportsNet. American Media Productions, LLC (\"American Media Productions\"), an unaffiliated third party, owns SportsNet LA, a regional sports network carrying the Los Angeles Dodgers’ baseball games and other sports programming. In accordance with agreements with American Media Productions, we act as the network’s exclusive affiliate and advertising sales representative and have certain branding and programming rights with respect to the network. In addition, we provide certain production and technical services to American Media Productions. The affiliate, advertising, production and programming agreements continue through 2038. We also own 26.8% of Sterling Entertainment Enterprises, LLC (doing business as SportsNet New York), a New York City-based regional sports network that carries New York Mets’ baseball games as well as other regional sports programming.\nNews Channels\nWe own and manage 37 local news channels, including Spectrum News NY1® and Spectrum News SoCal, 24-hour news channels focused on New York City and Los Angeles, respectively. Our local news channels connect the diverse communities and neighborhoods we serve providing 24/7 hyperlocal content, focusing on news, programming and storytelling that addresses the deeper needs and interests of our customers. Customers can also read, watch and listen to news stories by our Spectrum News journalists and local partner publications on their mobile device on our Spectrum News application and certain smart TVs and streaming devices.\nPricing of Our Products and Services\nOur revenues are principally derived from the monthly fees customers pay for the services we provide. We typically charge a one-time installation fee which is sometimes waived or discounted in certain sales channels during certain promotional periods.\nOur Spectrum pricing and packaging (\"SPP\") generally offers a standardized price across our services and add-on services allowing customers to design a bundle offering that fits their needs. We believe SPP:\n•offers a higher quality and more value-based set of services relative to our competitors, including fast Internet speeds, hundreds of HD channels and a transparent pricing structure;\n•offers simplicity for customers to understand our offers, and for our employees in service delivery;\n•drives our ability to package more services at the time of sale, thus increasing revenue per customer;\n•drives higher customer satisfaction, lower service calls and churn; and\n•allows for gradual price increases at the end of promotional periods.\nWe also have specialized offerings to enhance affordability of our Internet product for qualified low-income households, including Spectrum Internet Assist, a 30 megabits per second (\"Mbps\") service, and Internet 100, a 100 Mbps service. Both are low cost and include a modem for no additional charge. In addition, many of our customers are eligible for a subsidy through the Federal Communications Commission's (\"FCC\") Affordable Connectivity Program (\"ACP\") which provides eligible low-income households with up to $30 per month towards Internet service.\nIn October 2022, we introduced Spectrum One, which brings together in a high-value package, Spectrum Internet, Advanced WiFi and Unlimited Spectrum Mobile, offering consumers fast, reliable and secure online connections on their favorite devices at home and on-the-go. Alternatively, our mobile customers can choose one of two simple ways to pay for data. Customers can choose from unlimited or by-the-gig data usage plans and can easily switch between mobile data plans during the month. All plans include 5G service, free nationwide talk and text, and simple pricing that includes all taxes and fees. Customers can also purchase mobile devices and accessory products and have the option to pay for devices under interest-free monthly installment plans. Our device portfolio includes 5G models from Apple, Google and Samsung and we offer trade-in options along with a bring-your-own-device (“BYOD”) program which lowers the costs for our customers switching to Spectrum Mobile from other mobile operators.\nOur Network Technology\nOur network includes three key components: a national backbone, regional/metro networks and a “last-mile” network. Both our national backbone and regional/metro network components utilize a redundant IP ring/mesh fiber architecture. The national backbone component provides connectivity from regional demarcation points to nationally centralized content, connectivity and services. The regional/metro network components provide connectivity between the regional demarcation points and headends within a specific geographic area and enable the delivery of content and services between these network components.\nOur last-mile network utilizes a hybrid fiber coaxial cable (“HFC”) architecture, which combines the use of fiber optic cable with coaxial cable. In most systems, we deliver our signals via fiber optic cable from the headend to a group of nodes, and use coaxial cable to deliver the signal from individual nodes to the homes served by that node. Our design standard allows spare fiber strands to each node to be utilized for additional residential traffic capacity, and enterprise customer needs as they arise. For our Spectrum Enterprise customers, fiber optic cable is extended to the customer’s site. For certain new buildouts, including for our rural construction initiative, and MDU sites, we utilize a fiber deployment. We believe that this hybrid network design provides high capacity and signal quality with a cost efficient path to increased speeds.\nHFC architecture benefits include:\n•bandwidth capacity to enable traditional and two-way video and broadband services;\n•dedicated bandwidth for delivering two-way services, signal quality and higher service reliability, which provides an advantage over fixed wireless offerings;\n•the ability to upgrade capacity at a lower incremental capital cost relative to our competitors; and\n•a powered network enabling Advanced WiFi out-of-home and our future 5G small cell access points.\nOur systems currently provide a two-way all-digital platform, leveraging DOCSIS 3.1 technology and bandwidth of 750 megahertz or greater, to virtually all of our estimated passings. This bandwidth-rich network enables us to offer a large selection of HD channels and Spectrum Internet Gig across all of our footprint which enables us to provide fast, reliable and secure online connections and meet nearly all current residential customer demands today. Over the next three years, we intend to deploy network enhancements to upgrade our footprint initially expanding our spectrum to 1.2 Ghz through a module upgrade in the hub, node and amplifier and using high splits to deliver multi-gig speed capabilities while using the current DOCSIS 3.1 customer premise equipment. Later, we will continue to expand our spectrum to 1.2 Ghz but will use DAA to deliver even faster speeds when using the next generation of DOCSIS modem, DOCSIS 4.0. Next, we will begin to deploy DOCSIS 4.0 technology, to further increase our spectrum to 1.8 Ghz enabling even higher speed capabilities. This network evolution will also allow us to extend fiber services to the home in a success based “Fiber on Demand” manner and is the technology currently deployed in our rural fiber buildouts. We plan to complement our wireline investments with planned WiFi upgrades for in-home routers. With nearly 500 million devices connected wirelessly to our network in our customer's homes and businesses, we will unlock our network investments for multi-gigabit speeds through the deployment of WiFi 6E in 2023.\nWe own 210 Citizen Broadband Radio Service (\"CBRS\") Priority Access Licenses (\"PALs\") and intend to use these licenses along with unlicensed CBRS spectrum to build our own 5G data-only mobile network on targeted 5G small cell sites leveraging our HFC network to provide power and data connectivity to the majority of the sites. These 5G small cells, combined with growing WiFi capabilities, increase speed and reliability along with improving our cost structure through offload onto our owned networks. In 2022, we began a trial of the 5G network, which will inform our deployment plan for 5G small cell sites, as part of our broader multi-year 5G mobile network buildout, based on disciplined cost reduction targets.\nRural Construction Initiative\nIn 2022, we continued our rural broadband construction initiative in which we intend to expand our network to offer a suite of broadband connectivity services including fixed Internet, WiFi and mobile to more than one million estimated passings in unserved areas in states where we currently operate. We expect to invest over $6 billion over the next several years, a portion of which we expect to offset with government funding including over $1.7 billion of support awarded through December 31, 2022 in the RDOF auction and other federal, state and municipal grants, and we expect to participate in additional federal, state and municipal grant programs over the coming years. In addition to construction in areas subsidized by various government grants, we expect to continue rural construction in areas near our current plant and in areas surrounding subsidized construction where synergies can be achieved. These investments will allow us to generate long-term infrastructure-style returns by further taking advantage of the efficiencies of the scale and quality of our network and construction capabilities while offering our high quality products and services to more homes and businesses. We expect these newly-served homes will be enabled to engage in distance learning, remote work, telemedicine and other bandwidth-heavy applications that require high speed broadband connectivity. Newly-served rural areas will also benefit from our high-value SPP structure including our voice and mobile offerings, as well as our comprehensive selection of video products. The successful and timely execution of such fiber-based construction is dependent on a variety of external factors, including the make-ready and utility pole permitting processes. With fewer homes and businesses in these areas, broadband providers need to access multiple poles per home, as opposed to multiple homes per pole in higher-density settings. As a result, pole applications, pole replacement rules and their affiliated issue resolution processes are all factors that can have a significant impact on construction timing and speed to completion. The RDOF auction rules and other subsidy grants establish construction milestones for the build-out utilizing subsidized funding. Failure to meet those milestones could subject us to financial penalties.\nManagement, Customer Operations and Marketing\nOur operations are centralized, with senior executives responsible for coordinating and overseeing operations, including establishing company-wide strategies, policies and procedures. Sales and marketing, field operations, customer operations, network operations, engineering, advertising sales, human resources, legal, government relations, information technology and finance are all directed at the corporate level. Regional and local field operations are responsible for customer premise service transactions and maintaining and constructing that portion of our network which is located outdoors. Our field operations\nstrategy includes completing a significant portion of our activity with our employees which we find drives consistent and higher quality services. In 2022, our in-house field operations workforce handled approximately 80% of our customer premise service transactions.\nWe continue to focus on improving the customer experience through enhanced product offerings, reliability of services, and delivery of quality customer service. As part of our operating strategy, we insource most of our customer operations workload. Our in-house call centers handle nearly all of our total customer service calls. We manage our customer service call centers centrally to ensure a consistent, high quality customer experience. In addition, we route calls by call type to specific agents that only handle such call types, enabling agents to become experts in addressing specific customer needs, creating a better customer experience. Service from our call centers continues to become more efficient as a result of new tool enhancements that give our front-line customer service agents more context and real-time information about the customer and their services which allows them to more effectively troubleshoot and resolve issues. Our call center agent desktop interface tool enables virtualization of all call centers thereby better serving our customers. Virtualization allows calls to be routed across our call centers regardless of the location origin of the call, reducing call wait times, and saving costs.\nWe also provide customers with the opportunity to interact with us in the manner they choose through self-service options on our customer website and mobile device application, or via telephonic communication, online chat and social media. Our customer websites and mobile applications enable customers to pay their bills, manage their accounts, order and activate new services and utilize self-service help and support. In addition, our self-install program has been beneficial for customers who need flexibility in the timing of their installation.\nWe sell our residential and commercial services using national brand platforms known as Spectrum, Spectrum Business, Spectrum Enterprise and Spectrum Reach. These brands reflect our comprehensive approach to industry-leading products, driven by speed, performance and innovation. Our marketing strategy emphasizes the sale of our bundled services through targeted direct response marketing programs to existing and potential customers, and increases awareness and the value of the Spectrum brand. Our marketing organization creates and executes marketing programs intended to grow customer relationships, increase the number of services we sell per relationship, retain existing customers and cross-sell additional products to current customers. We monitor the effectiveness of our marketing efforts, customer perception, competition, pricing, and service preferences, among other factors, in order to increase our responsiveness to our customers and to improve our sales and customer retention. The marketing organization manages all residential and SMB sales channels including inbound, direct sales, on-line, outbound telemarketing and stores.\nProgramming\nWe believe that offering a wide variety of video programming choices influences a customer’s decision to subscribe to and retain our cable video services. We obtain basic and premium programming, usually pursuant to written contracts from a number of suppliers. Media corporation and broadcast station group consolidation has, however, resulted in fewer suppliers and additional selling power on the part of programming suppliers.\nProgramming is usually made available to us for a license fee, which is generally paid based on the number of customers to whom we make that programming available. Programming license fees may include “volume” discounts and other financial incentives and/or ongoing marketing support, as well as discounts for channel placement or service penetration. For home shopping channels, we typically receive a percentage of the revenue attributable to our customers’ purchases. We also offer VOD and pay-per-view channels of movies and events that are subject to a revenue split with the content provider.\nCompetition\nResidential Services\nWe face intense competition for residential customers, both from existing competitors and, as a result of the rapid development of new technologies, services and products, from new entrants.\nInternet Competition\nOur residential Internet service faces competition across our footprint from fiber-to-the-home (\"FTTH\"), fixed wireless broadband, Internet delivered via satellite and DSL services. AT&T Inc. (\"AT&T\"), Frontier Communications Corporation (“Frontier”) and Verizon are our primary FTTH competitors. Given the FTTH deployments of our competitors, launches of broadband services offering 1 Gbps speed have recently grown. Several competitors, including AT&T, Frontier, Verizon,\nWideOpenWest, Inc. (\"WOW\") and Google Fiber, deliver 1 Gbps broadband speed (and some deliver multi Gbps) in at least a portion of their footprints which overlap our footprint. Additionally, several national mobile network operators offer Long Term Evolution (“LTE”) or 5G delivered fixed wireless home Internet service in our markets. In several markets, we also face competition from one or more fixed wireless providers that deliver point-to-point Internet connectivity. DSL service is offered across our footprint often at prices lower than our Internet services, although typically at speeds much lower than the minimum speeds we offer as part of SPP. In addition, a growing number of commercial areas, such as retail malls, restaurants and airports, offer WiFi Internet service. Numerous local governments are also considering or actively pursuing publicly subsidized WiFi Internet access networks. These options offer alternatives to cable-based Internet access. We face terrestrial broadband Internet (defined as at least 25 Mbps) competition from three primary competitors, AT&T, Frontier and Verizon, in approximately 35%, 11% and 5% of our operating footprint, respectively.\nVideo Competition\nOur residential video service faces competition from DBS service providers, which have a national footprint and compete in all of our operating areas. DBS providers offer satellite-delivered pre-packaged programming services that can be received by relatively small and inexpensive receiving dishes. DBS providers offer aggressive promotional pricing, exclusive programming and video services that are comparable in many respects to our residential video service. Our residential video service also faces competition from large telecommunications companies, primarily Verizon, which offer wireline video services in significant portions of our operating areas.\nOur residential video service also faces growing competition across our footprint from a number of other sources, including companies that deliver linear network programming, movies and television shows on demand and other video content over broadband Internet connections to televisions, computers, tablets and mobile devices. These competitors include virtual multichannel video programming distributors (“vMVPDs”) such as Hulu Live, YouTube TV, Sling TV, Philo and DirecTV Stream. Other online video business models and products have also developed, some offered by programmers that have not traditionally sold programming directly to consumers, including, (i) subscription video on demand (“SVOD”) services such as Netflix, Apple TV+, Amazon Prime, Hulu Plus, Disney+, HBO Max, Peacock, Paramount+, AMC+, Starz and Showtime Anytime, (ii) ad-supported free online video products, including YouTube and Pluto TV, some of which offer programming for free to consumers that we currently purchase for a fee, (iii) pay-per-view products, such as iTunes, and (iv) additional offerings from mobile providers which continue to integrate and bundle video services and mobile products. Historically, we have generally viewed SVOD online video services as complementary to our own video offering. As the proliferation of online video services grows, however, services from vMVPDs and direct to consumer offerings, as well as piracy and password sharing, negatively impact the number of customers purchasing our video product.\nVoice Competition\nOur residential voice service competes with wireless and wireline phone providers across our footprint, as well as other forms of communication, such as text messaging on cellular phones, instant messaging, social networking services, video conferencing and email. We also compete with “over-the-top” phone providers, such as Vonage, Skype, magicJack, Google Voice and Ooma, Inc., as well as companies that sell phone cards at a cost per minute for both national and international service. The increase in the number of different technologies capable of carrying voice services and the number of alternative communication options available to customers as well as the replacement of wireline services by wireless have intensified the competitive environment in which we operate our residential voice service.\nMobile Competition\nOur mobile service faces competition from national mobile network operators including AT&T, Verizon and T-Mobile US, Inc. (\"T-Mobile\"), fixed wireless providers, as well as a variety of regional operators and mobile virtual network operators. Most carriers offer unlimited data packages to customers while some also offer free devices. Various operators also offer wireless Internet services delivered over networks which they continue to enhance to deliver faster speeds. AT&T, Verizon and T-Mobile continue to expand 5G mobile services. Additionally, in connection with Dish Network Corporation’s acquisition of Sprint Corporation’s (“Sprint”) prepaid mobile services businesses, the FCC and Department of Justice (\"DOJ\") have imposed a timeline on Dish Network Corporation (70% by June 2023) for 5G network development and expansion. We also compete for retail activations with other resellers that buy bulk wholesale service from wireless service providers for resale.\nRegional Competitors\nIn some of our operating areas, other competitors have built networks that offer Internet, video and voice services that compete with our services. For example, in certain service areas, our residential Internet, video and voice services compete with WOW, altafiber, Google Fiber and Astound Broadband.\nAdditional Competition\nIn addition to multi-channel video providers, cable systems compete with other sources of news, information and entertainment, including over-the-air television broadcast reception, live events, movie theaters and the Internet. Competition is also posed by fixed wireless and satellite master antenna television (\"SMATV\") systems serving MDUs, such as condominiums, apartment complexes, and private residential communities.\nBusiness Services\nWe face intense competition across each of our business services product offerings. Our SMB Internet, video and voice services face competition from a variety of providers as described above. Our enterprise solutions also face competition from the competitors described above as well as cloud-based application-service providers, managed service providers and other telecommunications carriers, such as metro and regional fiber-based carriers.\nAdvertising\nWe face intense competition for advertising revenue across many different platforms and from a wide range of local and national competitors. Advertising competition has increased and will likely continue to increase as new advertising platforms seek to attract the same advertisers. We compete for advertising revenue against, among others, local broadcast stations, national cable and broadcast networks, radio stations, print media and online advertising companies and content providers.\nSeasonality and Cyclicality\nOur business is subject to seasonal and cyclical variations. Our results are impacted by the seasonal nature of customers receiving our cable services in college and vacation service areas. Our revenue is subject to cyclical advertising patterns and changes in viewership levels. Our advertising revenue is generally higher in the second and fourth calendar quarters of each year, due in part to increases in consumer advertising in the spring and in the period leading up to and including the holiday season. U.S. advertising revenue is also cyclical, benefiting in even-numbered years from advertising related to candidates running for political office and issue-oriented advertising. Our capital expenditures and trade working capital are also subject to significant seasonality based on the timing of subscriber growth, network programs, specific projects and construction.\nRegulation and Legislation\nThe following summary addresses the key regulatory and legislative developments affecting the cable industry and our services for both residential and commercial customers. Cable systems and related communications networks and services are extensively regulated by the federal government (primarily the FCC), certain state governments and many local governments. A failure to comply with these regulations could subject us to substantial penalties. Our business can be dramatically impacted by changes to the existing regulatory framework, whether triggered by legislative, administrative, or judicial rulings. Congress and the FCC have frequently revisited the subject of communications regulation and they are likely to do so again in the future. We could be materially disadvantaged in the future if we are subject to new laws, regulations or regulatory actions that do not equally impact our key competitors. For example, Internet-delivered streaming video services compete with our traditional video service, but they are not subject to the same level of federal, state, and local regulation. We cannot provide assurance that the already extensive regulation of our business will not be expanded in the future. In addition, through May 2023, we are subject to Charter-specific conditions regarding certain business practices as a result of the FCC’s approval of the merger in 2016 with Time Warner Cable Inc. (“TWC”) and acquisition of Bright House Networks, LLC (“Bright House”).\nVideo Service\nMust Carry/Retransmission Consent\nThere are two alternative legal methods for carriage of local broadcast television stations on cable systems. Federal “must carry” regulations require cable systems to carry local broadcast television stations upon the request of the local broadcaster.\nAlternatively, federal law includes “retransmission consent” regulations, by which popular commercial television stations can prohibit cable carriage unless the cable operator first negotiates for “retransmission consent,” which may be conditioned on significant payments or other concessions. Popular stations routinely invoke “retransmission consent” and demand substantial compensation increases in their negotiations with cable operators, thereby significantly increasing our operating costs.\nPole Attachments\nThe Communications Act of 1934, as amended (the “Communications Act”), requires many investor-owned utilities owning utility poles to provide cable systems with access to poles and conduits and also subjects the rates charged for this access to either federal or state regulation. The federally regulated rates now applicable to pole attachments used for cable or telecommunications services, including when offered together with Internet service, are substantially similar. The FCC's approach does not directly affect the rate in states that self-regulate, but many of those states have substantially the same rate for all communications attachments. We sometimes face challenges getting access to poles in rural areas when the FCC pole attachment rules do not apply.\nOther FCC Regulatory Matters\nThe Communications Act and FCC regulations cover a variety of additional areas applicable to our video services, including, among other things: (1) licensing of systems and facilities, including the grant of various spectrum licenses; (2) equal employment opportunity obligations; (3) customer service standards; (4) technical standards; (5) mandatory blackouts of certain network and syndicated programming; (6) restrictions on political advertising; (7) restrictions on advertising in children’s programming; (8) ownership restrictions; (9) posting of certain information on an FCC “public file” website, including but not limited to political advertising records, equal employment opportunity practices, compliance with children’s programming requirements, policies for commercial leased access, system information, and channel carriage information including disclosure of our ownership interests in channels we carry; (10) emergency alert systems; (11) inside wiring and contracts for MDU complexes; (12) accessibility of content, including requirements governing video-description and closed-captioning; (13) competitive availability of cable equipment; (14) the provision of up to 15% of video channel capacity for commercial leased access by unaffiliated third parties; and (15) public, education and government entity access requirements. Each of these regulations restricts our business practices to varying degrees and may impose additional costs on our operations.\nThe FCC regulates spectrum usage in ways that could impact our operations including for microwave backhaul, broadcast, unlicensed WiFi and CBRS. Our ability to access and use spectrum that may become available in the future is uncertain and may be limited by further FCC auction or allocation decisions. New spectrum obtained by other parties could also lead to additional wireless competition to our existing and future services.\nIt is possible that Congress or the FCC will expand or modify its regulation of cable systems or the services delivered over cable systems and competing services in the future, and we cannot predict at this time how that might impact our business.\nCopyright\nThe carriage of television and radio broadcast signals by cable systems are subject to a federal compulsory copyright license. The copyright law provides copyright owners the right to audit our payments under the compulsory license, and the Copyright Office is currently considering modifications to the license’s royalty calculations and reporting obligations. The possible modification or elimination of this license is the subject of continuing legislative proposals and administrative review and could adversely affect our ability to obtain desired broadcast programming.\nFranchise Matters\nOur cable systems generally are operated pursuant to nonexclusive franchises, permits, and similar authorizations granted by a municipality or other state or local government entity in order to utilize and cross public rights-of-way.\nCable franchises generally are granted for fixed terms and in many cases include monetary penalties for noncompliance and may be terminable if the franchisee fails to comply. The specific terms and conditions of cable franchises vary significantly between jurisdictions. They generally contain provisions governing cable operations, franchise fees, system construction, maintenance, technical performance, customer service standards, supporting and carrying public, education and government access channels, and changes in the ownership of the franchisee. Although local franchising authorities have considerable discretion in establishing franchise terms, certain federal protections benefit cable operators. For example, federal law imposes a cap on franchise fees of 5% of gross revenues from the provision of cable services over the cable system. In 2019, the FCC\nclarified that the value of in-kind contribution requirements set forth in cable franchises is subject to the statutory cap on franchise fees, and it reaffirmed that state and local authorities are barred from imposing franchise fees on revenues derived from non-cable services, such as Internet services, provided by cable operators over cable systems. Those rules were generally upheld by a federal court in 2021.\nA number of states have adopted franchising laws that provide for state-issued franchising. Generally, state-issued cable franchises are for a fixed term (or in perpetuity), streamline many of the traditional local cable franchise requirements and eliminate local negotiation and enforcement of terms.\nThe Communications Act provides for an orderly franchise renewal process in which granting authorities may not unreasonably deny renewals. If we fail to obtain renewals of franchises representing a significant number of our customers, it could have a material adverse effect on our consolidated financial condition, results of operations, or our liquidity. Similarly, if a franchising authority’s consent is required for the purchase or sale of a cable system, the franchising authority may attempt to impose more burdensome requirements as a condition for providing its consent.\nInternet Service\nThe FCC originally classified broadband Internet access services, such as those we offer, as an “information service,” which exempted the service from traditional communications common carrier laws and regulations. In 2015, the FCC reclassified broadband Internet access services as “telecommunications service” and, on that basis, imposed a number of “net neutrality” rules governing the provision of broadband service. In 2017, the FCC reversed its 2015 decision and eliminated the 2015 rules, other than a transparency requirement, which obligates us to disclose performance statistics and other service information to consumers. It is possible that the FCC might again revise its approach to broadband Internet access, or that Congress might enact legislation affecting the rules applicable to the service. The application of new legal requirements to our Internet services could adversely affect our business.\nThe FCC recently adopted new rules to expand the surviving transparency requirement by requiring us to post standardized labels similar to the format of food nutrition labels for each of our currently available consumer Internet offerings. These new rules are scheduled to take effect six months after approval by the federal Office of Management and Budget.\nThe 2017 FCC decision reclassifying Internet access services also ruled that state regulators may not impose obligations similar to federal network neutrality obligations that the FCC eliminated, but this blanket prohibition was vacated by the U.S. Court of Appeals in 2019. The court left open the possibility that individual state laws could be deemed preempted on a case by case basis if it is shown that they conflict with federal law. Several states have adopted rules similar to the network neutrality requirements that were eliminated by the FCC, and the California rules were upheld in federal court.\nCalifornia has also adopted other regulations on Internet services, including network resiliency rules to assure backup power is available after natural disasters and other outages, and it has an open proceeding to consider the imposition of service quality metrics on Internet service providers. New York adopted legislation that would have required Internet service providers to offer a discounted Internet service to qualifying low-income consumers, but a federal district judge enjoined enforcement as likely to be deemed rate regulation of Internet service that would be preempted by federal law. That decision is currently being appealed. We cannot predict what other legislation and regulations may be adopted by states or how challenges to such requirements will be resolved.\nIn recent years, the federal, state and local governments have offered billions of dollars in subsidies to companies deploying broadband to areas deemed to be “unserved” or “underserved,” using funds from the FCC’s RDOF auction in 2020, The American Rescue Plan Act of 2021 (“ARPA”), and The Infrastructure Investment and Jobs Act of 2021 (the “IIJA”). We support such subsidies, provided they are not directed to areas that are already served, and have sought and expect to continue to seek subsidies for our own broadband construction in unserved and underserved areas through programs including RDOF and those created pursuant to ARPA and, if regulatory requirements are reasonable, the IIJA. We have been awarded over $1.7 billion in the RDOF auction and other federal, state and municipal grants that will partially fund, along with our substantial additional investment, the construction of new broadband infrastructure to more than one million estimated passings. Our awards through RDOF and ARPA include a number of regulatory requirements, such as serving as the carrier of last resort and completing increasingly larger portions of the network construction by certain dates. If we fail to meet these obligations, we could be subject to substantial government penalties.\nThe market for our Internet services is affected by participation in and the general availability of programs that offer federal subsidies for certain low-income consumers for the purchase of Internet access service. In 2021, pursuant to Congressional\nappropriation for COVID relief, the FCC established a temporary monthly Emergency Broadband Benefit Program (\"EBBP\") subsidy of up to $50 for most eligible low-income households. With the funding for EBBP set to run out, Congress in the IIJA authorized $14.2 billion for the successor ACP that provides up to a $30 monthly discount for most eligible customers paid to the household’s broadband provider. We elected to participate in the EBBP and ACP, and the FCC regulates many of the terms on which we provide ACP services, including restrictions on our ability to refuse service to prospective eligible customers based upon their credit or payment history. The ACP discount enables eligible households to purchase our Spectrum Internet Assist service at no cost to them, and we cannot predict whether Congress or the FCC will provide additional funding to extend the ACP, or on what terms, when ACP funding runs out, which is expected to be at some point in 2024.\nWireline Voice Service\nThe FCC has never classified the VoIP wireline telephone services we offer as “telecommunications services” that are subject to traditional federal common carrier regulation, but instead has imposed some of these regulatory requirements on a case-by-case basis, such as requirements relating to 911 emergency services (“E911”), Communications Assistance for Law Enforcement Act (“CALEA”) (the statute governing law enforcement access to and surveillance of communications), Universal Service Fund contributions, customer privacy and Customer Proprietary Network Information protections, number portability, network outage reporting, rural call completion, disability access, regulatory fees, back-up power, robocall mitigation and discontinuance of service. It is possible that the FCC or Congress will impose additional federal requirements on our VoIP telephone services in the future.\nOur VoIP telephone services are subject to certain state and local regulatory fees such as E911 fees and contributions to state universal service funds. Additionally, to comply with RDOF program requirements, we have chosen in the RDOF areas to offer Lifeline VoIP telephone services subject to traditional federal and state common carrier regulations. Except where we have chosen to offer VoIP telephone services in such a manner, we believe that our VoIP telephone services should be governed primarily by federal regulation. A federal appellate court affirmed our successful challenge to Minnesota's attempt to generally apply telephone regulation to our VoIP services, but that ruling is limited to the seven states in the 8th Circuit. Some states have attempted to subject cable VoIP services, such as our VoIP telephone service, to state level regulation. California has imposed reporting and other obligations on our VoIP services, including backup power requirements, and has proposed the imposition of service quality metrics on VoIP services. We have registered with or obtained certificates or authorizations from the FCC and the state regulatory authorities in those states in which we offer competitive voice services in order to ensure the continuity of our services. However, it is unclear whether and how these and other ongoing regulatory matters ultimately will be resolved. State regulatory commissions and legislatures may continue to consider imposing regulatory requirements on our fixed telephone services.\nMobile Service\nOur Spectrum Mobile service offers mobile Internet access and telephone service. We provide this service as an MVNO using Verizon’s network and our network through Spectrum WiFi. As an MVNO, we are subject to many of the same FCC regulations that apply to facilities-based wireless carriers, as well as certain state or local regulations, including (but not limited to): E911, local number portability, customer privacy, CALEA, universal service fund contribution, robocall mitigation and hearing aid compatibility and safety and emission requirements for mobile devices. Spectrum Mobile’s broadband Internet access service is also subject to the FCC’s transparency rule. The FCC or other regulatory authorities may adopt new or different regulations for MVNOs and/or mobile service providers in the future, or impose new taxes or fees applicable to Spectrum Mobile, which could adversely affect the service offering or our business generally. For example, California has proposed the imposition of service quality metrics on mobile services.\nPrivacy and Information Security Regulation\nThe Communications Act limits our ability to collect, use, and disclose customers’ personally identifiable information for our Internet, video and voice services. We are subject to additional federal, state, and local laws and regulations that impose additional restrictions on the collection, use and disclosure of consumer information. All broadband providers are also obliged by CALEA to configure their networks in a manner that facilitates the ability of state and federal law enforcement, with proper legal process authorized under the Electronic Communications Privacy Act, to obtain records and information concerning our customers, including the content of their communications. Further, the FCC, Federal Trade Commission (“FTC”), and many states regulate and restrict the marketing practices of communications service providers, including telemarketing and sending unsolicited commercial emails. The FTC currently has the authority, pursuant to its general authority to enforce against unfair or deceptive acts and practices, to protect the privacy of Internet service customers, including our use and disclosure of certain customer information.\nOur operations are also subject to federal and state laws governing information security. In the event of an information security breach, such rules may require consumer and government agency notification and may result in regulatory enforcement actions with the potential of monetary forfeitures. The FCC, the FTC and state attorneys general regularly bring enforcement actions against companies related to information security breaches and privacy violations.\nVarious security standards provide guidance to telecommunications companies in order to help identify and mitigate cybersecurity risks. One such standard is the voluntary framework released by the National Institute for Standards and Technology (“NIST”) in 2014 and updated in 2018, in cooperation with other federal agencies and owners and operators of U.S. critical infrastructure. The NIST cybersecurity framework provides a prioritized and flexible model for organizations to identify and manage cyber risks inherent to their business. It was designed to supplement, not supersede, existing cybersecurity regulations and requirements. Several government agencies have encouraged compliance with the NIST cybersecurity framework, including the FCC and Department of Homeland Security’s Cybersecurity and Infrastructure Security Agency (“CISA”). We voluntarily follow NIST as part of our overall cybersecurity program. The FCC is considering expansion of its cybersecurity guidelines or the adoption of cybersecurity requirements. CISA is also developing cyber incident reporting rules, pursuant to 2022 legislative requirements, that require critical infrastructure entities to report substantial cyber incidents within 72 hours of their discovery.\nMany states and local authorities have considered legislative or other actions that would impose restrictions on our ability to collect, use and disclose, and safeguard certain consumer information, particularly with regard to our broadband Internet business. For example, the California Consumer Privacy Act (“CCPA”) and Maine’s Act to Protect Privacy of Online Customer Information both became effective in 2020. The CCPA, under certain circumstances, regulates companies’ use and disclosure of the personal information of California residents and authorizes enforcement actions by the California Attorney General and private class actions for data breaches. In addition, effective January 1, 2023, the California Consumer Privacy Rights Act (“CPRA”) amended CCPA to impose additional obligations on companies that handle the personal information of California residents. The Maine law regulates how Internet service providers use and disclose customers’ personal information and requires Internet service providers to take reasonable measures to protect customers’ personal information. Virginia's new privacy law became effective on January 1, 2023, and Colorado and Connecticut's new privacy laws will become effective later in 2023. Each of these laws will regulate the way that companies collect, use, and share personal information about consumers. Several other state legislatures are considering the adoption of new data security and cybersecurity legislation that could result in additional network and information security requirements for our business. The FTC has launched an Advance Notice of Proposed Rulemaking (“ANPR”) to explore rules related to the collection, analysis, and monetization of consumers' information. Congress may also adopt new privacy and data security obligations. We cannot predict whether any of these efforts will be successful or preempted, or how new legislation and regulations, if any, would affect our business.\nRemaining Commitments Related to the 2016 Merger with TWC and Acquisition of Bright House\nIn connection with approval of the 2016 merger with TWC and acquisition of Bright House (the “Transactions”), federal and state regulators imposed a number of post-transaction conditions on us, many of which have been fulfilled or have terminated. Remaining federal commitments will expire in 2023 and include the following.\nFCC Conditions\n•Refrain from charging usage-based prices or imposing data caps on any fixed mass market broadband Internet access service plans for seven years; and\n•Continue to support CableCARDs for use in third-party retail devices for seven years to the extent applicable following the FCC’s modification of the relevant rules in 2020.\nThe FCC conditions also contain a number of compliance reporting requirements.\nDOJ Conditions\nThe DOJ Order prohibits us from entering into or enforcing any agreement with a video programmer that forbids, limits or creates incentives to limit the video programmer’s provision of content to online video distributors (“OVDs”). We will not be able to avail ourselves of other distributors’ most favored nation (“MFN”) provisions if they are inconsistent with this prohibition. The DOJ’s conditions are effective for seven years after entry of the final judgment in September 2016.\nHuman Capital Management\nAs of December 31, 2022, we had approximately 101,700 active full-time equivalent employees. The vast majority of our employees sell or service our products. We believe that attracting, developing and retaining our highly-skilled workforce is critical to successfully executing our operating strategy. With competitive wages, robust and affordable healthcare benefits, a generous retirement program with company match, and opportunities for job training and advancement, our employees develop skills and expertise necessary to build a long and successful career with us. In addition, the diversity of the communities we serve is reflected in our workforce, and our success in serving these communities requires a commitment to diversity and inclusion in every aspect of our business. We value the unique backgrounds, perspectives, and experiences of our employees. Embracing these differences brings us together for the common mission of exceeding our customers’ needs. There are several ways in which we attract, develop, and retain highly qualified talent, including:\nPay and Benefits\n•We provide compensation packages that are market competitive, taking into account the location and responsibilities of the role.\n•All hourly employees have a starting minimum wage of at least $20 per hour, which is well above any state or federal minimum wage level.\n•Nearly 85% of our employees are eligible for additional variable compensation based on their performance (e.g., annual performance bonus or sales commission).\n•We offer enhanced career progression opportunities, including annual bonus eligibility for all frontline supervisors and other salaried employees not already on a commission or bonus plan.\n•We provide high-quality, comprehensive medical, dental, and vision coverage for all full-time and part-time employees. It is our priority to keep this coverage affordable for our employees and their families, and so for the last ten years, we have absorbed the full premium cost increase for medical, dental, and vision coverage.\n•We provide competitive financial benefits to all employees such as a 401(k) retirement plan with a dollar for dollar company match up to 6% of their eligible pay. In addition, most of our employees are also eligible to receive an additional non-elective contribution equal to 3% of their eligible pay.\n•We have a stock incentive plan and grant equity awards to eligible employees on an annual basis.\nTraining and Development\n•The substantial skills, experience and industry knowledge of our employees and our training of our customer-facing employees benefit our operations and performance. We offer thousands of learning experiences spanning leadership development, new hire, and professional skills training both online and in the classroom.\n•In 2022, we increased our education assistance benefit to provide reimbursement of up to $10,000 per year.\n•The vast majority of our customer-facing roles have the opportunity for upward advancement including through supervisory and leadership roles. Our Field Operations organization has a formalized self-progression structure where employees who maintain exceptional levels of performance can complete online coursework to advance to next level within their job family.\n•Our Broadband Technician Apprenticeship Program is one of our promising strategies for building our skilled workforce. This program, certified by the U.S. Department of Labor, is aligned with our broadband technician career progression and includes thousands of hours of on-the-job training along with classroom instruction. When enrolled employees complete the program, they become certified broadband technicians.\n•We conduct annual talent planning to review the overall performance of our leaders and their potential to serve in larger, more complex roles. Executive leadership reviews the results of talent conversations, which open possibilities for career growth opportunities and cross-organizational movement.\nDiversity and Inclusion\n•We are committed to diversity and inclusion in every aspect of our business. We strive to deliver high quality products and services that exceed our customers’ expectations, and embrace the unique perspectives and experiences of our employees and partners and the communities we serve.\n•We have five Business Resource Groups (“BRGs”) focused on people with disabilities, the LGBTQ community, employees with multicultural backgrounds, veterans and women. These voluntary groups connect employees with shared characteristics, life experiences, and interests, and enable them to engage in activities that advance our culture of inclusion and contribute to business success. Our BRGs have empowered our team members to grow and succeed by providing networking, mentorship and skill-building opportunities.",
    "item_1A": "Item 1A. Risk Factors.\nRisks Related to Our Business\nWe operate in a very competitive business environment, which affects our ability to attract and retain customers and can adversely affect our business, operations and financial results.\nThe industry in which we operate is highly competitive and has become more so in recent years. In some instances, we compete against companies with fewer regulatory burdens, access to better financing and greater and more favorable brand name recognition. Increasing consolidation in the telecommunications and content industries have provided additional benefits to certain of our competitors, either through access to financing, resources, or efficiencies of scale including the ability to launch new video services.\nOur Internet service faces competition from other companies’ FTTH, fixed wireless broadband, Internet delivered via satellite and DSL services. Various operators offer wireless Internet services delivered over networks which they continue to enhance to deliver faster speeds and also continue to expand 5G mobile services. Our voice and mobile services compete with wireless and wireline phone providers, as well as other forms of communication, such as text, instant messaging, social networking services, video conferencing and email. Competition from these companies, including intensive marketing efforts with aggressive pricing and exclusive programming, may have an adverse impact on our ability to attract and retain customers.\nOur video service faces competition from a number of sources, including DBS services, and companies that deliver linear network programming, movies and television shows on demand and other video content over broadband Internet connections to televisions, computers, tablets and mobile devices often with password sharing among multiple users and security that makes content susceptible to piracy. Newer products and services, particularly alternative methods for the distribution, sale and viewing of content will likely continue to be developed, further increasing the number of competitors that we face.\nThe increasing number of choices available to audiences, including low-cost or free choices, could negatively impact not only consumer demand for our products and services, but also advertisers’ willingness to purchase advertising from us. We compete for the sale of advertising revenue with television networks and stations, as well as other advertising platforms, such as online media, radio and print. Competition related to our service offerings to businesses continues to increase as well, as more companies deploy more fiber to more buildings, which may negatively impact our growth and put pressure on margins.\nA failure to effectively anticipate or adapt to new technologies and changes in customer expectations and behavior could significantly adversely affect our competitive position with respect to the leisure time and discretionary spending of our customers and, as a result, affect our business and results of operations. Competition may also reduce our expected growth of future cash flows which may contribute to future impairments of our franchises and goodwill and our ability to meet cash flow requirements, including debt service requirements. For additional information regarding the competition we face, see “Item 1. Business -Competition” and “-Regulation and Legislation.”\nWe depend on third-party service providers, suppliers and licensors; thus, if we are unable to procure the necessary services, equipment, software or licenses on reasonable terms and on a timely basis, our ability to offer services could be impaired, and our growth, operations, business, financial results and financial condition could be materially adversely affected.\nWe depend on a limited number of third-party service providers, suppliers and licensors to supply some of the services, hardware, software and operational support necessary to provide some of our services and execute our network evolution and rural construction initiatives. Some of our hardware, software and operational support vendors, and service providers represent our sole source of supply or have, either through contract or as a result of intellectual property rights, a position of some exclusivity. Our ability to provide some services and complete our network evolution and rural construction initiatives might be materially adversely affected, or the need to procure or develop alternative sources of the affected materials or services might interrupt or delay our ability to serve existing and new customers, if any of these parties experience or engage in the following:\n•breach or terminate or elect not to renew their agreements with us or otherwise fail to perform their obligations in a timely manner;\n•demand exceeds these vendors’ capacity;\n•tariffs are imposed that impact vendors' ability to perform their obligations or significantly increase the amount we pay;\n•experience operating or financial difficulties;\n•significantly increase the amount we are required to pay (including demands for substantial non-monetary compensation) for necessary products or services; or\n•cease production of any necessary product due to lack of demand, profitability or a change in ownership or are otherwise unable to provide the equipment or services we need in a timely manner at our specifications and at reasonable prices.\nOur third-party service providers, suppliers and licensors have been disrupted by worker absenteeism, quarantines, restrictions on employees’ ability to work, office and factory closures, disruptions to ports and other shipping infrastructure, border closures, or other travel or health-related restrictions over the last three years. In addition, the existence of only a limited number of vendors of key technologies can lead to less product innovation and higher costs. These events could materially and adversely affect our ability to retain and attract customers and our operations, business, financial results and financial condition.\nWe may not have the ability to pass on to our customers all of the increases in programming costs, which could adversely affect our cash flow and operating margins.\nProgramming costs are our single largest expense item. Our programming costs have historically increased in excess of customary inflationary and cost-of-living type increases. While decreases in video customers combined with a change in the mix of customers choosing lower cost packages have lowered total programming cost increases, we expect contractual programming rates per service subscriber to continue to increase as a result of annual increases pursuant to our programming contracts and contract renewals with programmers. Although we pass along amounts paid for local broadcast station retransmission consent to the majority of our customers, the inability to fully pass programming cost increases on to our customers has had, and is expected in the future to have, an adverse impact on our cash flow and operating margins associated with the video product. Additionally, the demands of large media companies, with additional selling power as a result of media and broadcast station groups consolidation, who link carriage of their most popular networks to carriage and cost increases of their less popular networks, and require us to carry their most popular networks to a large percentage of our video subscribers, have limited our flexibility in selling more tailored and cost-sensitive programming packages for consumers. In order to mitigate impacts to our operating margins due to increasing programming rates, we continue to review our pricing and programming packaging strategies.\nIncreases in the cost of sports programming and the amounts paid for local broadcast station retransmission consent have been the largest contributors to the growth in our programming costs over the last few years. Federal law allows commercial television broadcast stations to make an election between “must-carry” rights and an alternative “retransmission-consent” regime. When a station opts for the retransmission consent regime, we are not allowed to carry the station’s signal without that station’s permission. In retransmission-consent negotiations, broadcasters often condition consent with respect to one station on carriage of one or more other stations or programming services in which they or their affiliates have an interest. Carriage of these other services, as well as increased fees for retransmission rights, may increase our programming expenses and diminish the amount of capacity we have available to introduce new services, which could have an adverse effect on our business and financial results.\nOur programming contracts are generally for a fixed period of time, with potentially significant spend subject to negotiated renewal in any particular year. We will seek to renew these agreements on terms that we believe are favorable. There can be no assurance that these agreements will be renewed on favorable or comparable terms. To the extent that we are unable to reach agreement with certain programmers on terms that we believe are reasonable, we have been, and may in the future be, forced to remove such programming channels from our line-up, which may result in a loss of customers. Any failure to carry programming that is attractive to our customers could adversely impact our customer levels, operations and financial results.\nAny failure to respond to technological developments and meet customer demand for new products and services could adversely affect our ability to compete effectively.\nWe operate in a highly competitive, consumer-driven and rapidly changing environment. From time to time, we may pursue strategic initiatives to launch products or enhancements to our products. Our success is, to a large extent, dependent on our ability to acquire, develop, adopt, upgrade and exploit new and existing technologies to address consumers’ changing demands and distinguish our services from those of our competitors. We may not be able to accurately predict technological trends or the success of new products and services. If we choose technologies or equipment that are less effective, cost-efficient or attractive to customers than those chosen by our competitors, if technologies or equipment on which we have chosen to rely cease to be available to us on reasonable terms or conditions, if we offer services that fail to appeal to consumers, are not available at competitive prices or that do not function as expected, if we are not able to fund the expenditures necessary to keep pace with technological developments, or if we are no longer able to make our services available to our customers on a third-\nparty device on which a substantial number of customers have relied to access our services, our competitive position could deteriorate, and our business and financial results could suffer.\nThe ability of some of our competitors to introduce new technologies, products and services more quickly than we do may adversely affect our competitive position. Furthermore, advances in technology, decreases in the cost of existing technologies or changes in competitors’ product and service offerings may require us in the future to make additional research and development expenditures or to offer, at no additional charge or at a lower price, certain products and services that we currently offer to customers separately or at a premium. In addition, the uncertainty of our ability, and the costs, to obtain intellectual property rights from third parties could impact our ability to respond to technological advances in a timely and effective manner.\nAny failure to maintain and expand our upgraded systems and provide advanced services in a timely manner, or to anticipate the demands of the marketplace, could materially adversely affect our ability to attract and retain customers. In addition, as we continue to grow our mobile services using virtual network operator rights from a third party, we expect continued growth-related sales and marketing and other customer acquisition costs as well as negative working capital impacts from the timing of device-related cash flows when we provide devices pursuant to equipment installation plans. We also continue to consider and pursue opportunities in the mobile space which may include the acquisition of additional licensed spectrum and may include entering into or expanding joint ventures or partnerships with wireless or cable providers which may require significant investment. For example, we now hold CBRS PALs to support existing and future mobile services. These licenses are subject to revocation and expiration. Although we expect to be able to maintain and renew these licenses, the loss of one or more licenses could significantly impair our ability to offload mobile traffic and achieve cost reductions. If we are unable to continue to grow our mobile business and achieve the outcomes we expect from our investments in the mobile business, our growth, financial condition and results of operations could be adversely affected.\nOur business may be adversely affected if we cannot continue to license or enforce the intellectual property rights on which our business depends.\nWe rely on patent, copyright, trademark and trade secret laws and licenses and other agreements with our employees, customers, suppliers and other parties to establish and maintain our intellectual property rights in technology and the products and services used in our operations. Also, because of the rapid pace of technological change, we both develop our own technologies, products and services and rely on technologies developed or licensed by third parties. However, any of our intellectual property rights, or the rights of our suppliers, could be challenged or invalidated, or such intellectual property rights may not be sufficient to permit us to take advantage of current industry trends or otherwise to provide competitive advantages, which could result in costly redesign efforts, discontinuance of certain product or service offerings or other competitive harm. We may not be able to obtain or continue to obtain licenses from these third parties on reasonable terms, if at all. In addition, claims of intellectual property infringement could require us to enter into royalty or licensing agreements on unfavorable terms, incur substantial monetary liability or be enjoined preliminarily or permanently from further use of the intellectual property in question, which could require us to change our business practices or offerings and limit our ability to compete effectively. Even unsuccessful claims can be time-consuming and costly to defend and may divert management’s attention and resources away from our business. Infringement claims continue to be brought frequently in the communications and entertainment industries, and we are also often a party to such litigation alleging that certain of our services or technologies infringe the intellectual property rights of others.\nVarious events could disrupt or result in unauthorized access to our networks, information systems or properties and could impair our operating activities and negatively impact our reputation and financial results.\nNetwork and information systems technologies are critical to our operating activities, both for our internal uses, such as network management, and supplying services to our customers, including customer service operations and programming delivery. Network or information system shutdowns or other service disruptions caused by events such as computer hacking, phishing, dissemination of computer viruses, worms and other destructive or disruptive software, “cyber attacks” such as ransomware, process breakdowns, denial of service attacks and other malicious activity pose increasing risks. Both unsuccessful and successful “cyber attacks” on companies have continued to increase in frequency, scope and potential harm in recent years. While we develop and maintain systems seeking to prevent systems-related events and security breaches from occurring, the development and maintenance of these systems is costly and requires ongoing monitoring and updating as techniques used in such attacks become more sophisticated and change frequently. We, and the third parties on which we rely, may be unable to anticipate these techniques or implement adequate preventive measures. While from time to time attempts\nhave been made to access our network, these events have not as yet resulted in any material release of information, degradation or disruption to our network and information systems.\nOur network and information systems are also vulnerable to damage or interruption from power outages, telecommunications failures, accidents, natural disasters (including extreme weather arising from short-term or any long-term changes in weather patterns), terrorist attacks and similar events. Our system redundancy may be ineffective or inadequate, and our disaster recovery planning may not be sufficient for all eventualities.\nAny of these events, if directed at, or experienced by, us or technologies upon which we depend, could have adverse consequences on our network, our customers and our business, including degradation of service, service disruption, excessive call volume to call centers, and damage to our or our customers’ equipment and data. Large expenditures may be necessary to repair or replace damaged property, networks or information systems or to protect them from similar events in the future. Moreover, the amount and scope of insurance that we maintain against losses resulting from any such events or security breaches may not be sufficient to cover our losses or otherwise adequately compensate us for any disruptions to our business that may result. Any such significant service disruption could result in damage to our reputation and credibility, customer dissatisfaction and ultimately a loss of customers or revenue. Any significant loss of customers or revenue, or significant increase in costs of serving those customers, could adversely affect our growth, financial condition and results of operations.\nFurthermore, our operating activities could be subject to risks caused by misappropriation, misuse, leakage, falsification or accidental release or loss of information maintained in our information technology systems and networks and those of our third-party vendors, including customer, personnel and vendor data. We provide certain confidential, proprietary and personal information to third parties in connection with our business, and there is a risk that this information may be compromised.\nWe process, store, and transmit large amounts of data, including the personal information of our customers. Ongoing increases in the potential for misuse of personal information, the public’s awareness of the importance of safeguarding personal information, and the volume of legislation that has been adopted or is being considered regarding the protection, privacy, and security of personal information have resulted in increases to our information-related risks. We could be exposed to significant costs if such risks were to materialize, and such events could damage our reputation, credibility and business and have a negative impact on our revenue. We could be subject to regulatory actions and claims made by consumers in private litigations involving privacy issues related to consumer data collection and use practices. We also could be required to expend significant capital and other resources to remedy any such security breach.\nOur exposure to the economic conditions of our current and potential customers, vendors and third parties could adversely affect our cash flow, results of operations and financial condition.\nWe are exposed to risks associated with the economic conditions of our current and potential customers, the potential financial instability of our customers and their financial ability to purchase our products. If there were a prolonged general economic downturn, we may experience increased cancellations or non-payment by our customers or unfavorable changes in the mix of products purchased. This may include an increase in the number of homes that replace their video service with Internet-delivered and/or over-air content, as well as an increase in the number of Internet and voice customers substituting mobile data and voice products for wireline services, which would negatively impact our ability to attract customers, increase rates and maintain or increase revenue. In addition, our ability to gain new customers is dependent to some extent on growth in occupied housing in our service areas, which is influenced by both national and local economic conditions. Weak economic conditions may also have a negative impact on our advertising revenue. These events have adversely affected us in the past, and may adversely affect our cash flow, results of operations and financial condition if a downturn were to continue.\nIn addition, we are susceptible to risks associated with the potential financial instability of the vendors and third parties on which we rely to provide products and services or to which we outsource certain functions. The same economic conditions that may affect our customers, as well as volatility and disruption in the capital and credit markets, also could adversely affect vendors and third parties and lead to significant increases in prices, reduction in output or the bankruptcy of our vendors or third parties upon which we rely. Any interruption in the services provided by our vendors or by third parties could adversely affect our cash flow, results of operation and financial condition.\nIf we are unable to retain key employees, our ability to manage our business could be adversely affected.\nOur operational results have depended, and our future results will depend, upon the retention and continued performance of our management team. Our ability to retain and hire new key employees for management positions could be impacted adversely by the competitive environment for management talent in the broadband communications and technology industries. The loss of\nthe services of key members of management and the inability or delay in hiring new key employees could adversely affect our ability to manage our business and our future operational and financial results.\nRisks Related to Our Indebtedness\nWe have a significant amount of debt and expect to incur significant additional debt, including secured debt, in the future, which could adversely affect our financial condition and our ability to react to changes in our business.\nWe have a significant amount of debt and expect to (subject to applicable restrictions in our debt instruments) incur additional debt in the future as we maintain our stated objective of 4.0 to 4.5 times Adjusted EBITDA leverage (net debt divided by the last twelve months Adjusted EBITDA). As of December 31, 2022, our total principal amount of debt was approximately $97.4 billion with a leverage ratio of 4.47 times Adjusted EBITDA. As of December 31, 2022, $70.7 billion of our debt was rated investment grade and $26.7 billion was rated high yield debt. This split rating allows us to access both the investment grade debt market and the high yield debt market.\nOur significant amount of debt could have consequences, such as:\n•impact our ability to raise additional capital at reasonable rates, or at all;\n•make us vulnerable to interest rate increases, in part because approximately 15% of our borrowings as of December 31, 2022 were, and may continue to be, subject to variable rates of interest;\n•expose us to increased interest expense to the extent we refinance existing debt with higher cost debt;\n•require us to dedicate a significant portion of our cash flow from operating activities to make payments on our debt, reducing our funds available for working capital, capital expenditures, and other general corporate expenses;\n•limit our flexibility in planning for, or reacting to, changes in our business, the cable and telecommunications industries, and the economy at large;\n•place us at a disadvantage compared to our competitors that have proportionately less debt; and\n•adversely affect our relationship with customers and suppliers.\nTo the extent our current debt amounts increase more than expected, our business results are lower than expected, or credit rating agencies downgrade our debt limiting our access to investment grade markets, the related risks that we now face will intensify.\nIn addition, a portion of our variable rate indebtedness may use London Interbank Offering Rate (“LIBOR”) as a benchmark for establishing the rate. The United Kingdom’s Financial Conduct Authority, which regulates LIBOR, stopped publishing one week and 2 month U.S. Dollar (“USD”) LIBOR rates after 2021 with remaining USD LIBOR rates ceasing to be published after June 30, 2023. In the United States, the U.S. Federal Reserve, in conjunction with the Alternative Reference Rates Committee, a steering committee comprised of large U.S. financial institutions, has proposed the Secured Overnight Financing Rate (“SOFR”), a new index calculated by short-term repurchase agreements backed by Treasury securities, as an alternative to LIBOR. In addition, the overall financial markets may be disrupted as a result of the phase-out or replacement of LIBOR. Uncertainty as to the nature of such phase out and selection of an alternative reference rate, together with disruption in the financial markets, could increase the cost of our variable rate indebtedness.\nAs a result of the pending cessation of LIBOR, we amended the Charter Operating credit agreement to replace LIBOR with SOFR as the interest rate benchmark for the revolving credit facility and certain of the term loans thereunder. SOFR may fluctuate based on general economic conditions, general interest rates, Federal Reserve rates and the supply of and demand for credit in the market.\nThe agreements and instruments governing our debt contain restrictions and limitations that could significantly affect our ability to operate our business, as well as significantly affect our liquidity.\nThe indentures governing the CCO Holdings, LLC (\"CCO Holdings\") notes contain a number of significant covenants that could adversely affect our ability to operate our business, our liquidity, and our results of operations. These covenants restrict, among other things, CCO Holdings, CCO Holdings Capital Corp. and all of their restricted subsidiaries’ ability to:\n•incur additional debt;\n•pay dividends on equity or repurchase equity;\n•make investments;\n•sell all or substantially all of their assets or merge with or into other companies;\n•sell assets;\n•in the case of restricted subsidiaries, create or permit to exist dividend or payment restrictions with respect to CCO Holdings, guarantee their parent companies debt, or issue specified equity interests;\n•engage in certain transactions with affiliates; and\n•grant liens (with respect to only CCO Holdings).\nAdditionally, the Charter Operating credit facilities require Charter Operating to comply with a maximum total leverage covenant and a maximum first lien leverage covenant. The Charter Operating credit facilities, the Charter Operating notes, the TWC, LLC senior notes and debentures, and the TWCE debentures include customary negative covenants, including restrictions on the ability to incur liens securing indebtedness for borrowed money and consolidating, merging or conveying or transferring substantially all of the respective obligor’s assets. The breach of any covenants or obligations in our indentures or credit facilities, not otherwise waived or amended, could result in a default under the applicable debt obligations and could trigger acceleration of those obligations, which in turn could trigger cross defaults under other agreements governing our long-term indebtedness. In addition, the secured lenders under our secured notes and the Charter Operating credit facilities could foreclose on their collateral, which includes equity interests in substantially all of our subsidiaries, and exercise other rights of secured creditors.\nRisks Related to Ownership Position of Liberty Broadband Corporation and Advance/Newhouse Partnership\nLiberty Broadband Corporation (\"Liberty Broadband\") and Advance/Newhouse Partnership (“A/N”) have governance rights that give them influence over corporate transactions and other matters.\nLiberty Broadband currently owns a significant amount of Charter Class A common stock and is entitled to certain governance rights with respect to Charter. A/N currently owns Charter Class A common stock and a significant amount of membership interests in our subsidiary Charter Holdings, which are convertible into Charter Class A common stock, and is entitled to certain governance rights with respect to Charter. Members of the Charter board of directors include a director who is also an officer and director of Liberty Broadband and directors who are current or former officers and directors of A/N. Mr. Greg Maffei is the President and Chief Executive Officer of Liberty Broadband. Steven Miron is the Chief Executive Officer of A/N and Michael Newhouse is co-president of the parent of A/N and its affiliates. As of December 31, 2022, Liberty Broadband beneficially held approximately 27.64% of Charter’s voting stock and A/N beneficially held approximately 12.48% of Charter’s voting stock. Pursuant to the Amended and Restated Stockholders Agreement among Charter, Liberty Broadband and A/N, dated as of May 23, 2015 (as amended, the “Stockholders Agreement”), Liberty Broadband currently has the right to designate up to three directors as nominees for Charter’s board of directors and A/N currently has the right to designate up to two directors as nominees for Charter’s board of directors. Each of A/N and Liberty Broadband is entitled to nominate at least one director to each of the committees of Charter's board of directors, subject to applicable stock exchange listing rules and certain specified voting or equity ownership thresholds for each of A/N and Liberty Broadband, and provided that the Nominating and Corporate Governance Committee and the Compensation and Benefit Committee each have at least a majority of directors independent from A/N, Liberty Broadband and Charter (referred to as the “unaffiliated directors” in the Stockholders Agreement).\nThe Stockholders Agreement and Charter’s amended and restated certificate of incorporation fixes the size of the board at 13 directors. Liberty Broadband and A/N are required to vote (subject to the applicable voting cap) their respective shares of Charter Class A common stock and Charter Class B common stock for the director nominees nominated by the nominating and corporate governance committee of the board of directors, including the respective designees of Liberty Broadband and A/N, and against any other nominees, except that, with respect to the unaffiliated directors, Liberty Broadband and A/N must instead vote in the same proportion as the voting securities are voted by stockholders other than A/N and Liberty Broadband or any group which includes any of them are voted, if doing so would cause a different outcome with respect to the unaffiliated directors. As a result of their rights under the Stockholders Agreement and their significant equity and voting stakes in Charter, Liberty Broadband and/or A/N, who may have interests different from those of other stockholders, will be able to exercise substantial influence over certain matters relating to the governance of Charter, including the approval of significant corporate actions, such as mergers and other business combination transactions.\nThe Stockholders Agreement provides A/N and Liberty Broadband with preemptive rights with respect to issuances of Charter equity in connection with certain transactions, and in the event that A/N or Liberty Broadband exercises these rights, holders of Charter Class A common stock may experience further dilution.\nThe Stockholders Agreement provides that A/N and Liberty Broadband will have certain contractual preemptive rights over issuances of Charter equity securities in connection with capital raising transactions. Holders of Charter Class A common stock will not be entitled to similar preemptive rights with respect to such transactions. As a result, if Liberty Broadband and/or A/N\nelect to exercise their preemptive rights, (i) these parties would not experience the dilution experienced by the other holders of Charter Class A common stock, and (ii) such other holders of Charter Class A common stock may experience further dilution of their interest in Charter upon such exercise.\nRisks Related to Regulatory and Legislative Matters\nOur business is subject to extensive governmental legislation and regulation, which could adversely affect our business.\nRegulation of the cable industry has increased cable operators’ operational and administrative expenses and limited their revenues. Cable operators are subject to numerous laws and regulations including those covering the following:\n•the provision of high-speed Internet service, including net neutrality and broadband label transparency rules;\n•the provision of voice communications, including rules for emergency communications, outage reporting, Customer Proprietary Network Information (“CPNI”) reporting and efforts to limit unwanted robocalls;\n•cable franchise renewals and transfers;\n•the provisioning, marketing and billing of cable and Internet equipment;\n•customer and employee privacy and data security;\n•copyright royalties for retransmitting broadcast signals;\n•the circumstances when a cable system must carry a broadcast station and the circumstances when it first must obtain retransmission consent to carry a broadcast station;\n•limitations on our ability to enter into exclusive agreements with multiple dwelling unit complexes and control our inside wiring;\n•equal employment opportunity;\n•the resiliency of our networks to maintain service during and after disasters and power outages;\n•emergency alert systems, disability access, pole attachments, commercial leased access and technical standards;\n•marketing practices, customer service, and consumer protection; and\n•approval for mergers and acquisitions often accompanied by the imposition of restrictions and requirements on an applicant’s business in order to secure approval of the proposed transaction.\nLegislators and regulators at all levels of government frequently consider changing, and sometimes do change, existing statutes, rules, regulations, or interpretations thereof, or prescribe new ones. Any future legislative, judicial, regulatory or administrative actions may increase our costs or impose additional restrictions on our businesses.\nChanges to existing statutes, rules, regulations, or interpretations thereof, or adoption of new ones, or participation in new regulatory programs, could have an adverse effect on our business.\nThere are ongoing efforts to amend or expand the federal, state, and local regulation of some of the services offered over our cable systems, particularly our retail broadband Internet access service. Potential legislative and regulatory changes could adversely impact our business by increasing our costs and competition and limiting our ability to offer services in a manner that would maximize our revenue potential. These changes could include, for example, the reclassification of Internet services as regulated telecommunications services or other utility-style regulation of Internet services; restrictions on how we manage our Internet access services and networks; the adoption of new privacy restrictions on our collection, use and disclosure of certain customer information; new data security and cybersecurity mandates that could result in additional network and information security and cyber incident reporting requirements for our business; new restraints on our discretion over programming decisions; new restrictions on the rates we charge to consumers for one or more of the services or equipment options we offer; changes to the cable industry’s compulsory copyright license to carry broadcast signals; new requirements to assure the availability of navigation devices from third-party providers; new Universal Service Fund contribution obligations on our Internet service revenues that would add to the cost of that service; increases in government-administered broadband subsidies to rural areas that could result in subsidized overbuilding of our facilities; the exhaustion of funding for the FCC’s ACP or any changes to that program that could make it more difficult for us to provide services to low-income consumers; changes to the FCC’s administration of spectrum; pending court challenges to the legality of the FCC’s Universal Service programs, which, if successful, could adversely affect our receipt of universal service funds, including but not limited to FCC RDOF grants to expand our network, FCC E-rate funds to serve schools and libraries and FCC Rural Health Care funds to serve eligible health care providers; and changes in the regulatory framework for VoIP telephone service, including the scope of regulatory obligations associated with our VoIP telephone service and our ability to interconnect our VoIP telephone service with incumbent providers of traditional telecommunications service.\nAs a winning bidder in the FCC’s RDOF auction in 2020, we must comply with numerous FCC and state requirements to continue receiving such funding. To comply with these requirements, in RDOF areas, we have chosen to offer certain of our VoIP telephone services, such as our Lifeline services, subject to certain traditional federal and state common carrier regulations. Additionally, in some areas where we are building pursuant to subsidy programs, we will offer certain of our broadband Internet access services subject to required discounts and other marketing-related terms. If we fail to comply with those requirements, the governing regulatory agency could consider us in default and we could incur substantial penalties or forfeitures. If we fail to attain certain specified infrastructure build-out requirements under the RDOF program, the FCC could also withhold future support payments until those shortcomings are corrected. Any failure to comply with the rules and requirements of a subsidy grant could result in us being suspended or disbarred from future governmental programs or contracts for a significant period of time, which could adversely affect our results of operations and financial condition.\nIf any laws or regulations are enacted that would expand the regulation of our services, they could affect our operations and require significant expenditures. We cannot predict future developments in these areas, and any changes to the regulatory framework for our Internet, video, mobile or VoIP services could have a negative impact on our business and results of operations.\nIt remains uncertain what rule changes, if any, will ultimately be adopted by Congress, the FCC and state legislatures, and what operating or financial impact any such rules might have on us, including on the operation of our broadband networks, customer privacy and the user experience. In addition, the FCC, the FTC, and various state agencies and attorney generals actively investigate industry practices and could impose substantial forfeitures for alleged regulatory violations.\nTax legislation and administrative initiatives or challenges to our tax and fee positions could adversely affect our results of operations and financial condition.\nWe operate cable systems in locations throughout the United States and, as a result, we are subject to the tax laws and regulations of federal, state and local governments. From time to time, legislative and administrative bodies change laws and regulations that change our effective tax rate or tax payments. Certain states and localities have imposed or are considering imposing new or additional taxes or fees on our services or changing the methodologies or base on which certain fees and taxes are computed. Potential changes include additional taxes or fees on our services which could impact our customers, changes to income tax sourcing rules and other changes to general business taxes, central/unit-level assessment of property taxes and other matters that could increase our income, franchise, sales, use and/or property tax liabilities. In addition, federal, state and local tax laws and regulations are extremely complex and subject to varying interpretations. There can be no assurance that our tax positions will not be challenged by relevant tax authorities or that we would be successful in any such challenge.\nOur cable system franchises are subject to non-renewal or termination and are non-exclusive. The failure to renew a franchise or the grant of additional franchises in one or more service areas could adversely affect our business.\nOur cable systems generally operate pursuant to franchises, permits, and similar authorizations issued by a state or local governmental authority controlling the public rights-of-way. Many franchises establish comprehensive facilities and service requirements, as well as specific customer service standards and monetary penalties for non-compliance. In many cases, franchises are terminable if the franchisee fails to comply with significant provisions set forth in the franchise agreement governing system operations. Franchises are generally granted for fixed terms and must be periodically renewed. Franchising authorities may resist granting a renewal if either past performance or the prospective operating proposal is considered inadequate. Franchise authorities often demand concessions or other commitments as a condition to renewal. In some instances, local franchises have not been renewed at expiration, and we have operated and are operating under either temporary operating agreements or without a franchise while negotiating renewal terms with the local franchising authorities.\nWe cannot assure you that we will be able to comply with all significant provisions of our franchise agreements and certain of our franchisors have from time to time alleged that we have not complied with these agreements. Additionally, although historically we have renewed our franchises without incurring significant costs, we cannot assure you that we will be able to renew, or to renew as favorably, our franchises in the future. A termination of or a sustained failure to renew a franchise in one or more service areas could adversely affect our business in the affected geographic area.\nOur cable system franchises are non-exclusive. Consequently, local and state franchising authorities can grant additional franchises to competitors in the same geographic area or operate their own cable systems. In some cases, local government entities and municipal utilities may legally compete with us on more favorable terms.",
    "item_1B": "Item 1B. Unresolved Staff Comments.\nNone.",
    "item_1C": "",
    "item_2": "Item 2. Properties.\nOur principal physical assets consist of cable distribution plant and equipment, including signal receiving, encoding and decoding devices, headend reception facilities, distribution systems, and customer premise equipment for each of our cable systems.\nOur cable plant and related equipment are generally attached to utility poles under pole rental agreements with local public utilities and telephone companies, and in certain locations are buried in underground ducts or trenches. We own or lease real property for signal reception sites, and own our service vehicles.\nWe generally lease space for business offices. Our headend and tower locations are located on owned or leased parcels of land, and we generally own the towers on which our equipment is located.\nThe physical components of our cable systems require maintenance as well as periodic upgrades to support the new services and products we introduce. See “Item 1. Business - Our Network Technology.” We believe that our properties are generally in good operating condition and are suitable for our business operations.",
    "item_3": "Item 3. Legal Proceedings.\nThe legal proceedings information set forth in Note 20 to the accompanying consolidated financial statements contained in “Part II. Item 8. Financial Statements and Supplementary Data” in this Annual Report on Form 10-K is incorporated herein by reference.",
    "item_4": "Item 4. Mine Safety Disclosures.\nNot applicable.\nPART II",
    "item_5": "Item 5. Market for Registrant’s Common Equity, Related Stockholder Matters and Issuer Purchases of Equity Securities.\nCharter’s Class A common stock is listed on the NASDAQ Global Select Market under the symbol “CHTR.” As of December 31, 2022, there were approximately 10,000 holders of record of Charter’s Class A common stock and one holder of Charter's Class B common stock. Charter has not paid cash dividends on its common stock and does not intend to do so in the foreseeable future. During 2022, there were no unregistered sales of securities of the registrant.\nSecurities Authorized for Issuance Under Equity Compensation Plans\nThe following information is provided as of December 31, 2022 with respect to equity compensation plans:\n(1) This total does not include 6,845 shares issued pursuant to restricted stock grants made under our 2019 Stock Incentive Plan, which are subject to vesting based on continued service.\nFor information regarding securities issued under our equity compensation plans, see Note 16 to our accompanying consolidated financial statements contained in “Part II. Item 8. Financial Statements and Supplementary Data.”\nPerformance Graph\nThe performance graph required by Item 5 will be included in Charter’s 2023 Proxy Statement (the “Proxy Statement”) under the headings “Compensation Discussion and Analysis,” or in amendment to this Annual Report on Form 10-K and is incorporated herein by reference.\nPurchases of Equity Securities by the Issuer\nThe following table presents Charter’s purchases of equity securities completed during the fourth quarter of 2022 (dollars in millions, except per share data).\n(1)Includes 4,132, 21,063 and 9,646 shares withheld from employees for the payment of taxes and exercise costs upon the exercise of stock options or vesting of other equity awards for the months of October, November and December 2022, respectively.\n(2)During the three months ended December 31, 2022, Charter purchased approximately 3.0 million shares of its Class A common stock for approximately $1.0 billion, which includes 1.2 million Charter class A common shares purchased from Liberty Broadband pursuant to the LBB Letter Agreement at an average price per unit of $354.97, or $432 million. Charter Holdings purchased 0.6 million Charter Holdings common units from A/N at an average price per unit of $363.53, or $223\nmillion during the three months ended December 31, 2022. As of December 31, 2022, Charter had remaining board authority to purchase an additional $414 million of Charter’s Class A common stock and/or Charter Holdings common units, excluding purchases from Liberty Broadband. In addition to open market purchases including pursuant to Rule 10b5-1 plans adopted from time to time, Charter may also buy shares of Charter Class A common stock, from time to time, pursuant to private transactions outside of its Rule 10b5-1 plan and any such repurchases may also trigger the repurchases from A/N pursuant to and to the extent provided in the A/N Letter Agreement or Liberty pursuant to the LBB Letter Agreement. See \"Part II. Item 7. Management's Discussion and Analysis of Financial Condition and Results of Operations - Liquidity and Capital Resources.\"",
    "item_6": "Item 6. [Reserved]\nNot applicable.",
    "item_7": "Item 7. Management’s Discussion and Analysis of Financial Condition and Results of Operations.\nReference is made to “Part I. Item 1A. Risk Factors” and “Cautionary Statement Regarding Forward-Looking Statements,” which describe important factors that could cause actual results to differ from expectations and non-historical information contained herein. In addition, the following discussion should be read in conjunction with the audited consolidated financial statements and accompanying notes thereto of Charter included in “Part II. Item 8. Financial Statements and Supplementary Data.”\nOverview\nWe are a leading broadband connectivity company and cable operator serving more than 32 million customers in 41 states through our Spectrum brand. Over an advanced high-capacity, two-way telecommunications network, we offer a full range of state-of-the-art residential and business services including Spectrum Internet, TV, Mobile and Voice. For small and medium-sized companies, Spectrum Business delivers the same suite of broadband products and services coupled with special features and applications to enhance productivity, while for larger businesses and government entities, Spectrum Enterprise provides highly customized, fiber-based solutions. Spectrum Reach delivers tailored advertising and production for the modern media landscape. We also distribute award-winning news coverage and sports programming to our customers through Spectrum Networks. See “Part I. Item 1. Business - Products and Services” for further description of these services, including customer statistics for different services.\nDuring the year ended December 31, 2022, we added 1,728,000 mobile lines, 344,000 Internet customers and 126,000 residential and SMB customer relationships, which excludes mobile-only customers. We continue to see lower customer move rates and switching behavior among providers, which has reduced our selling opportunities. In October 2022, we introduced Spectrum One, which brings together Spectrum Internet, Advanced WiFi and Unlimited Spectrum Mobile, to offer consumers fast, reliable and secure online connections on their favorite devices at home and on-the-go in a high-value package which contributed to our increase in mobile lines in the fourth quarter. In 2022, we also made targeted investments in employee wages and benefits inside of our operations to build employee skill sets and tenure as well as continued to invest in digitization of our customer service platforms and proactive maintenance all with the goal of improving the customer experience, reducing transactions and driving customer growth.\nWe spent $1.8 billion on our rural construction initiative during the year ended December 31, 2022. We expect that over time, our rural construction initiative will support customer growth and in 2022, we constructed over 200,000 rural passings. In addition, we continue to evolve and upgrade our network to provide higher Internet speeds and reliability and invest in our products and customer service platforms. We currently offer Spectrum Internet products with speeds up to 1 Gbps across our entire footprint and over the next three years, we plan to upgrade our network to provide multi-gigabit speeds. Our Advanced WiFi, a managed WiFi service that provides customers an optimized home network while providing greater control of their connected devices with enhanced security and privacy, is available to nearly all Internet customers. We continue to invest in our ability to provide a differentiated Internet connectivity experience for our mobile and fixed Internet customers with the availability of over 500,000 out of home WiFi access points across our footprint. In addition, we continue to work towards the construction of our own 5G mobile data-only network leveraging our CBRS PALs. By continually improving our product set and offering consumers the opportunity to save money by switching to our services, we believe we can continue to penetrate our expanding footprint and attract more spend on additional products for our existing customers.\nIn June 2022, we entered into a joint venture with Comcast to develop and offer a next-generation streaming platform, Xumo, on a variety of streaming devices and smart TVs. Our investment is approximately $981 million with $271 million paid in 2022 and with the remaining non-cancelable required contributions to be paid over multiple years.\nWe believe Spectrum-branded mobile services will drive higher sales of our core products, create longer customer lives and increase profitability and cash flow over time. During the years ended December 31, 2022 and 2021, our mobile product line increased revenues by $3.0 billion and $2.2 billion, respectively, reduced Adjusted EBITDA by approximately $343 million and $311 million, respectively, and reduced free cash flow by approximately $1.1 billion and $853 million, respectively. Mobile Adjusted EBITDA may continue to be negative primarily as a result of growth-related sales and marketing and other customer acquisition costs for mobile services, and depending on the pace of that growth. We also expect to continue to see negative free cash flow from the timing of device-related cash flows when we sell devices to customers pursuant to equipment installment plans and capital expenditures related to CBRS build-out.\nWe realized revenue, Adjusted EBITDA and income from operations during the periods presented as follows (in millions; all percentages are calculated using whole numbers; minor differences may exist due to rounding).\nAdjusted EBITDA is defined as net income attributable to Charter shareholders plus net income attributable to noncontrolling interest, net interest expense, income taxes, depreciation and amortization, stock compensation expense, other income (expenses), net and other operating (income) expenses, net, such as special charges and (gain) loss on sale or retirement of assets. See “-Use of Adjusted EBITDA and Free Cash Flow” for further information on Adjusted EBITDA and free cash flow.\nGrowth in total revenue was primarily due to growth in our residential Internet, mobile and commercial customers, price adjustments and higher advertising sales. Adjusted EBITDA growth and changes in income from operations were impacted by growth in revenue and increases in operating costs and expenses, primarily mobile, costs to service customers and marketing.\nApproximately 90% of our revenues for each of the years ended December 31, 2022 and 2021 are attributable to monthly subscription fees charged to customers for our Internet, video, voice, mobile and commercial services as well as regional sports and news channels. Generally, these customer subscriptions may be discontinued by the customer at any time subject to a fee for certain commercial customers. The remaining 10% of revenue is derived primarily from advertising revenues, franchise and other regulatory fee revenues (which are collected by us but then paid to local authorities), sales of mobile and video devices, processing fees or reconnection fees charged to customers to commence or reinstate service, installation, VOD and pay-per-view programming, and commissions related to the sale of merchandise by home shopping services.\nCritical Accounting Policies and Estimates\nCertain of our accounting policies require our management to make difficult, subjective and/or complex judgments. Management has discussed these policies with the Audit Committee of Charter’s board of directors, and the Audit Committee has reviewed the following disclosure. We consider the following policies to be the most critical in understanding the estimates, assumptions and judgments that are involved in preparing our financial statements, and the uncertainties that could affect our results of operations, financial condition and cash flows:\n•Capitalization of labor and overhead costs\n•Income taxes\n•Defined benefit pension plans\nCapitalization of labor and overhead costs\nCosts associated with network construction or upgrades, placement of the customer drop to the dwelling and the placement of outlets within a dwelling along with the costs associated with the deployment of new customer premise equipment necessary to provide Internet, video or voice services, are capitalized. Costs capitalized include materials, direct labor and certain indirect\ncosts. These indirect costs consist of compensation and overhead costs associated with support functions. While our capitalization is based on specific activities, once capitalized, we track these costs on a composite basis by fixed asset category at the cable system level, and not on a specific asset basis. For assets that are sold or retired, we remove the estimated applicable cost and accumulated depreciation. The costs of disconnecting service and removing customer premise equipment from a dwelling and the costs to reconnect a customer drop or to redeploy previously installed customer premise equipment are charged to operating expense as incurred. Costs for repairs and maintenance are charged to operating expense as incurred, while plant and equipment replacement, including replacement of certain components, betterments, and replacement of cable drops and outlets, are capitalized.\nWe make judgments regarding the installation and construction activities to be capitalized. We capitalized direct labor and overhead of $1.8 billion and $1.7 billion for the years ended December 31, 2022 and 2021, respectively. We capitalize direct labor and overhead using standards developed from actual costs and applicable operational data. We calculate standards annually (or more frequently if circumstances dictate) for items such as the labor rates, overhead rates, and the actual amount of time required to perform a capitalizable activity. For example, the standard amounts of time required to perform capitalizable activities are based on studies of the time required to perform such activities. Overhead rates are established based on an analysis of the nature of costs incurred in support of capitalizable activities, and a determination of the portion of costs that is directly attributable to capitalizable activities. The impact of changes that resulted from these studies were not material in the periods presented.\nLabor costs directly associated with capital projects are capitalized. Capitalizable activities performed in connection with installations include such activities as:\n•dispatching a “truck roll” to the customer’s dwelling or business for service connection or placement of new equipment;\n•costs to package and ship new equipment to a customer's home for self-installation;\n•verification of serviceability to the customer’s dwelling or business (i.e., determining whether the customer’s dwelling is capable of receiving service by our cable network);\n•customer premise activities performed by in-house field technicians and third-party contractors in connection with the installation, replacement and betterment of equipment and materials to enable Internet, video or voice services; and\n•verifying the integrity of the customer’s network connection by initiating test signals downstream from the headend to the customer premise equipment, as well as testing signal levels at the utility pole or pedestal.\nJudgment is required to determine the extent to which overhead costs incurred result from specific capital activities, and therefore should be capitalized. The primary costs that are included in the determination of the overhead rate are (i) employee benefits and payroll taxes associated with capitalized direct labor, (ii) direct variable costs associated with capitalizable activities, (iii) the cost of support personnel, such as care personnel and dispatchers, who assist with capitalizable installation activities, and (iv) indirect costs directly attributable to capitalizable activities.\nWhile we believe our existing capitalization policies are appropriate, a significant change in the nature or extent of our operating practices could affect management’s judgment about the extent to which we should capitalize direct labor or overhead in the future. We monitor the appropriateness of our capitalization policies, and perform updates to our internal studies on an ongoing basis to determine whether facts or circumstances warrant a change to our capitalization policies.\nIncome taxes\nCharter has federal tax net operating loss carryforwards that expire in 2035 resulting from the operations of Charter Communications Holding Company, LLC and its subsidiaries and from loss carryforwards received as a result of the merger with TWC. In addition, Charter has state tax net operating loss carryforwards that generally expire in the years 2023 through 2042. Such tax loss carryforwards can accumulate and be used to offset Charter’s future taxable income. Charter's federal tax loss carryforwards are subject to Section 382 and other restrictions. Charter also has indefinite life carryforwards as a result of Section 163(j) interest limitations.\nIn assessing the realizability of deferred tax assets, management considers whether it is more likely than not that some portion or all of the deferred tax assets will be realized. In evaluating the need for a valuation allowance, management takes into account various factors, including the expiration date (if any) of such carryforwards, the expected level of future taxable income, available tax planning strategies and reversals of existing taxable temporary differences.\nApproximately $11 million of valuation allowance associated with federal capital loss carryforwards and approximately $29 million of valuation allowance associated with state tax loss carryforwards and other miscellaneous deferred tax assets is\nrecorded on the December 31, 2022 consolidated balance sheet. No valuation allowance is deemed necessary as of December 31, 2022 related to the Section 163(j) interest limitation, based on the indefinite life carryforward, expected reversal of various deferred tax liabilities (primarily GAAP fixed asset depreciation), and a history of utilizing interest expense disallowance carryovers. We will continue to monitor this deferred tax asset and update the valuation allowance analysis as needed.\nIn determining our tax provision for financial reporting purposes, we establish a reserve for uncertain tax positions unless such positions are determined to be “more likely than not” of being sustained upon examination, based on their technical merits. In evaluating whether a tax position has met the more-likely-than-not recognition threshold, we presume the position will be examined by the appropriate taxing authority that has full knowledge of all relevant information. A tax position that meets the more-likely-than-not recognition threshold is measured to determine the amount of benefit to be recognized in our financial statements. The tax position is measured as the largest amount of benefit that has a greater than 50% likelihood of being realized when the position is ultimately resolved. There is considerable judgment involved in determining whether positions taken on the tax return are “more likely than not” of being sustained. We adjust our uncertain tax reserve estimates periodically because of ongoing examinations by, and settlements with, the various taxing authorities, as well as changes in tax laws, regulations and interpretations.\nCharter is currently under examination by the Internal Revenue Service (\"IRS\") for income tax purposes for 2016 and 2019. Charter's 2020 and 2021 tax years remain open for examination and assessment. Charter’s 2017 and 2018 tax years remain open solely for purposes of loss and credit carryforwards. Charter’s short period return dated May 17, 2016 (prior to the merger with TWC and acquisition of Bright House) and prior years remain open solely for purposes of examination of Charter’s loss and credit carryforwards. The IRS is currently examining Charter Holdings’ income tax returns for 2016, 2019 and 2021. Charter Holdings’ 2020 tax year remains open for examination and assessment, while 2017 and 2018 remain open solely for purposes of credit carryforwards. The IRS is currently examining TWC’s income tax returns for 2011 through 2015. Prior to TWC’s separation from Time Warner Inc. (“Time Warner”) in March 2009, TWC was included in the consolidated U.S. federal and certain state income tax returns of Time Warner. The IRS has examined Time Warner’s 2008 through 2010 income tax returns and the appeal results are being evaluated. We do not anticipate that these examinations will have a material impact on our consolidated financial position or results of operations. In addition, we are also subject to ongoing examinations of our tax returns by state and local tax authorities for various periods. Activity related to these state and local examinations did not have a material impact on our consolidated financial position or results of operations during the year ended December 31, 2022, nor do we anticipate a material impact in the future.\nDefined benefit pension plans\nWe sponsor qualified and unqualified defined benefit pension plans that provide pension benefits to a majority of employees who were employed by TWC before the merger with TWC. As of December 31, 2022, the accumulated benefit obligation and fair value of plan assets was $2.2 billion and $2.6 billion, respectively, and the net funded asset was recorded as a $362 million noncurrent asset, $5 million current liability and $17 million long-term liability. As of December 31, 2021, the accumulated benefit obligation and fair value of plan assets was $3.4 billion and $3.5 billion, respectively, and the net funded asset was recorded as a $114 million noncurrent asset, $4 million current liability and $27 million long-term liability.\nPension benefits are based on formulas that reflect the employees’ years of service and compensation during their employment period. Actuarial gains or losses are changes in the amount of either the benefit obligation or the fair value of plan assets resulting from experience different from that assumed or from changes in assumptions. We have elected to follow a mark-to-market pension accounting policy for recording the actuarial gains or losses annually during the fourth quarter, or earlier if a remeasurement event occurs during an interim period. We use a December 31 measurement date for our pension plans.\nWe recognized net periodic pension benefit of $254 million and $305 million in 2022 and 2021, respectively. Net periodic pension benefit or expense is determined using certain assumptions, including the expected long-term rate of return on plan assets, discount rate and mortality assumptions. We determined the discount rate used to compute pension expense based on the yield of a large population of high-quality corporate bonds with cash flows sufficient in timing and amount to settle projected future defined benefit payments. In developing the expected long-term rate of return on assets, we considered the current pension portfolio’s composition, past average rate of earnings, and our asset allocation targets. We used a discount rate of 5.46% to determine the December 31, 2022 pension plan benefit obligation. A decrease in the discount rate of 25 basis points would result in an $83 million increase in our pension plan benefit obligation as of December 31, 2022 and net periodic pension expense recognized in 2022 under our mark-to-market accounting policy. The expected long-term rate of return on plan assets used to determine net periodic pension benefit for the year ended December 31, 2023 is expected to be 5.00%. A decrease in the expected long-term rate of return of 25 basis points to 4.75%, while holding all other assumptions constant, would result in\na decrease in our 2023 net periodic pension benefit of approximately $6 million. See Note 21 to the accompanying consolidated financial statements contained in “Part II. Item 8. Financial Statements and Supplementary Data” for additional discussion on these assumptions.\nResults of Operations\nA discussion of changes in our results of operations during the year ended December 31, 2021 compared to the year ended December 31, 2020 has been omitted from this Annual Report on Form 10-K, but may be found in “Item 7. Management’s Discussion and Analysis of Financial Condition and Results of Operations” in our Annual Report on Form 10-K for the year ended December 31, 2021, filed with the SEC on January 28, 2022, which is available free of charge on the SEC's website at www.sec.gov and on our investor relations website at ir.charter.com.\nThe following table sets forth the consolidated statements of operations for the periods presented (dollars in millions, except per share data):\nRevenues. Total revenues grew $2.3 billion or 4.5% during the year ended December 31, 2022 as compared to 2021 primarily due to increases in the number of residential Internet, mobile and commercial customers, price adjustments and higher advertising sales.\nRevenues by service offering were as follows (dollars in millions; all percentages are calculated using whole numbers; minor differences may exist due to rounding):\nThe increase in Internet revenues from our residential customers was attributable to the following (dollars in millions):\nThe increase related to rate and product mix was primarily due to promotional roll-off and rate adjustments. Residential Internet customers grew by 275,000 in 2022 compared to 2021.\nVideo revenues consist primarily of revenues from basic and digital video services provided to our residential customers, as well as franchise fees, equipment service fees and video installation revenue. The decrease in video revenues was attributable to the following (dollars in millions):\nResidential video customers decreased by 719,000 in 2022 compared to 2021. The increase related to rate and product mix was primarily due to price adjustments and promotional roll-off and was partly offset by a higher mix of lower cost video packages within our video customer base\nThe decrease in voice revenues from our residential customers was attributable to the following (dollars in millions):\nResidential wireline voice customers decreased by 924,000 in 2022 compared to 2021.\nThe increase in SMB commercial revenues was attributable to the following (dollars in millions):\nSMB customers increased by 64,000 in 2022 compared to 2021.\nEnterprise revenues increased $104 million during the year ended December 31, 2022 as compared to the corresponding period in 2021 primarily due to an increase in Internet PSUs offset by a $16 million one-time benefit incurred during the year ended December 31, 2021 as well as lower wholesale PSUs. Enterprise PSUs increased by 12,000 in 2022 compared to 2021.\nAdvertising sales revenues consist primarily of revenues from commercial advertising customers, programmers and other vendors, as well as local cable and advertising on regional sports and news channels. Advertising sales revenues increased $288 million during the year ended December 31, 2022 as compared to the corresponding period in 2021 primarily due to an increase in political revenue.\nDuring the years ended December 31, 2022 and 2021, mobile revenues included approximately $1.3 billion and $909 million of device revenues, respectively, and approximately $1.7 billion and $1.3 billion of service revenues, respectively. The increases in revenues are a result of an increase of 1,728,000 lines from December 31, 2021 to December 31, 2022.\nOther revenues consist of revenue from processing fees, regional sports and news channels (excluding intercompany charges or advertising sales on those channels), subsidy revenue, home shopping, video device sales, wire maintenance fees and other miscellaneous revenues. Other revenues increased approximately $34 million during the year ended December 31, 2022 as compared to the corresponding period in 2021 primarily due to subsidy revenue related to our rural construction initiative and an increase in processing fees offset by a decrease in sales of video devices.\nOperating costs and expenses. The increase in our operating costs and expenses, exclusive of items shown separately in the consolidated statements of operations, was attributable to the following (dollars in millions):\nProgramming costs were approximately $11.6 billion and $11.8 billion for the years ended December 31, 2022 and 2021, representing 35% and 38% of total operating costs and expenses, respectively. Programming costs consist primarily of costs paid to programmers for basic, digital, premium, video on demand, and pay-per-view programming. Programming costs decreased as a result of fewer customers and a higher mix of lower cost video packages within our video customer base offset by contractual rate adjustments, including renewals and increases in amounts paid for retransmission consent.\nRegulatory, connectivity and produced content decreased $191 million during the year ended December 31, 2022 compared to the corresponding period in 2021 primarily due to lower costs of video devices sold to customers and regulatory pass-through fees as well as lower sports rights costs as a result of more basketball games during 2021 as compared to 2022 as the prior period had additional games due to the delayed start of the 2020 - 2021 National Basketball Association (\"NBA\") season as a result of COVID-19.\nCosts to service customers increased $379 million during the year ended December 31, 2022 compared to the corresponding period in 2021 primarily due to higher bad debt, adjustments to job structure, pay and benefits to build a more skilled and longer tenured workforce and fuel costs.\nMobile costs of $3.4 billion and $2.5 billion for the years ended December 31, 2022 and 2021, respectively, were comprised of mobile device, mobile service, customer acquisition and operating costs. The increase is attributable to an increase in the number of mobile lines.\nThe increase in other expense was attributable to the following (dollars in millions):\nAdvertising sales expense increased during the year ended December 31, 2022 compared to the corresponding prior period due to higher costs of sales fees driven by higher political revenue. Corporate costs increased primarily due to higher computer and software expense and labor costs.\nDepreciation and amortization. Depreciation and amortization expense decreased by $442 million during the year ended December 31, 2022 compared to the corresponding period in 2021 primarily due to certain assets acquired in acquisitions becoming fully depreciated offset by an increase in depreciation as a result of more recent capital expenditures.\nOther operating expenses, net. The decrease in other operating expenses, net was attributable to the following (dollars in millions):\nFor more information, see Note 14 to the accompanying consolidated financial statements contained in “Part II. Item 8. Financial Statements and Supplementary Data.”\nInterest expense, net. Net interest expense increased by $519 million in 2022 from 2021 primarily due to an increase in weighted average debt outstanding of approximately $8.3 billion as well as an increase in weighted average interest rates. The increase in weighted average debt outstanding is primarily due to the issuance of notes throughout 2021 and 2022.\nOther income (expenses), net. The change in other income (expenses), net is attributable to the following (dollars in millions):\nSee Note 15 and the Notes referenced above to the accompanying consolidated financial statements contained in “Item 1. Financial Statements” for more information.\nIncome tax expense. We recognized income tax expense of $1.6 billion and $1.1 billion for the years ended December 31, 2022 and 2021, respectively. Income tax expense increased during the year ended December 31, 2022 compared to the corresponding period in 2021 primarily as a result of an increase in pretax income, lower benefit from state tax rate changes and decreased recognition of excess tax benefits resulting from share-based compensation during 2021. For more information, see Note 17 to the accompanying consolidated financial statements contained in “Part II. Item 8. Financial Statements and Supplementary Data.”\nNet income attributable to noncontrolling interest. Net income attributable to noncontrolling interest for financial reporting purposes represents A/N’s portion of Charter Holdings’ net income based on its effective common unit ownership interest and the preferred dividend of $70 million for the year ended December 31, 2021. For more information, see Note 10 to the accompanying consolidated financial statements contained in “Part II. Item 8. Financial Statements and Supplementary Data.”\nNet income attributable to Charter shareholders. Net income attributable to Charter shareholders was $5.1 billion and $4.7 billion for the years ended December 31, 2022 and 2021, respectively, primarily as a result of the factors described above.\nUse of Adjusted EBITDA and Free Cash Flow\nWe use certain measures that are not defined by U.S. generally accepted accounting principles (“GAAP”) to evaluate various aspects of our business. Adjusted EBITDA and free cash flow are non-GAAP financial measures and should be considered in addition to, not as a substitute for, net income attributable to Charter shareholders and net cash flows from operating activities reported in accordance with GAAP. These terms, as defined by us, may not be comparable to similarly titled measures used by other companies. Adjusted EBITDA and free cash flow are reconciled to net income attributable to Charter shareholders and net cash flows from operating activities, respectively, below.\nAdjusted EBITDA eliminates the significant non-cash depreciation and amortization expense that results from the capital-intensive nature of our businesses as well as other non-cash or special items, and is unaffected by our capital structure or investment activities. However, this measure is limited in that it does not reflect the periodic costs of certain capitalized tangible and intangible assets used in generating revenues and our cash cost of financing. These costs are evaluated through other financial measures.\nFree cash flow is defined as net cash flows from operating activities, less capital expenditures and changes in accrued expenses related to capital expenditures.\nManagement and Charter’s board of directors use Adjusted EBITDA and free cash flow to assess our performance and our ability to service our debt, fund operations and make additional investments with internally generated funds. In addition, Adjusted EBITDA generally correlates to the leverage ratio calculation under our credit facilities or outstanding notes to determine compliance with the covenants contained in the facilities and notes (all such documents have been previously filed with the SEC). For the purpose of calculating compliance with leverage covenants, we use Adjusted EBITDA, as presented, excluding certain expenses paid by our operating subsidiaries to other Charter entities. Our debt covenants refer to these expenses as management fees, which fees were in the amount of $1.4 billion and $1.3 billion for the years ended December 31, 2022 and 2021, respectively.\nA reconciliation of Adjusted EBITDA and free cash flow to net income attributable to Charter shareholders and net cash flows from operating activities, respectively, is as follows (dollars in millions):\nLiquidity and Capital Resources\nOverview\nWe have significant amounts of debt. The principal amount of our debt as of December 31, 2022 was $97.4 billion, consisting of $13.9 billion of credit facility debt, $56.8 billion of investment grade senior secured notes and $26.7 billion of high-yield senior unsecured notes. Our business requires significant cash to fund principal and interest payments on our debt. As of December 31, 2022, $70.7 billion of our debt was rated investment grade and $26.7 billion was rated high yield debt. This split rating allows us to access both the investment grade debt market and the high yield debt market.\nOur projected cash needs and projected sources of liquidity depend upon, among other things, our actual results, and the timing and amount of our expenditures. As we continue to grow our market penetration of our mobile product, we will continue to experience negative working capital impacts from the timing of device-related cash flows when we sell devices to customers pursuant to equipment installment plans. Further, in 2022, Charter has become a meaningful federal cash tax payer as the majority of our net operating losses have been utilized. Free cash flow was $6.1 billion and $8.7 billion for the years ended December 31, 2022 and 2021, respectively. See table below for factors impacting free cash flow during the year ended December 31, 2022 compared to 2021. As of December 31, 2022, the amount available under our credit facilities was approximately $4.0 billion and cash on hand was approximately $645 million. We expect to utilize free cash flow, cash on hand and availability under our credit facilities as well as future refinancing transactions to further extend the maturities of our obligations. The timing and terms of any refinancing transactions will be subject to market conditions among other considerations. Additionally, we may, from time to time, and depending on market conditions and other factors, use cash on hand and the proceeds from securities offerings or other borrowings to retire our debt through open market purchases, privately negotiated purchases, tender offers or redemption provisions. We believe we have sufficient liquidity from cash on hand, free cash flow and Charter Operating’s revolving credit facility as well as access to the capital markets to fund our projected cash needs.\nWe continue to evaluate the deployment of our cash on hand and anticipated future free cash flow including to invest in our business growth and other strategic opportunities, including expanding the capacity of our network, the expansion of our network through our rural broadband construction initiative, the build-out and deployment of our CBRS spectrum, and mergers and acquisitions as well as stock repurchases and dividends. Charter's target leverage of net debt to the last twelve months Adjusted EBITDA remains at 4 to 4.5 times Adjusted EBITDA, and up to 3.5 times Adjusted EBITDA at the Charter Operating first lien level. Our leverage ratio was 4.47 times Adjusted EBITDA as of December 31, 2022. As Adjusted EBITDA grows, we expect to increase the total amount of our indebtedness to maintain leverage within Charter's target leverage range. Excluding purchases from Liberty Broadband discussed below, during the years ended December 31, 2022 and 2021, Charter purchased in the public market approximately 14.5 million and 15.9 million shares, respectively, of Charter Class A common stock for approximately $7.1 billion and $10.9 billion, respectively. Since the beginning of its buyback program in September 2016 through the year ended December 31, 2022, Charter has purchased in the public market approximately 149.4 million\nshares of Class A common stock and Charter Holdings common units for approximately $68.5 billion, including purchases from Liberty Broadband and A/N discussed below.\nIn February 2021, Charter and Liberty Broadband entered into a letter agreement (the “LBB Letter Agreement”). The LBB Letter Agreement implements Liberty Broadband’s obligations under the Stockholders Agreement to participate in share repurchases by Charter. Under the LBB Letter Agreement, Liberty Broadband will sell to Charter, generally on a monthly basis, a number of shares of Charter Class A common stock representing an amount sufficient for Liberty Broadband’s ownership of Charter to be reduced such that it does not exceed the ownership cap then applicable to Liberty Broadband under the Stockholders Agreement at a purchase price per share equal to the volume weighted average price per share paid by Charter for shares repurchased during such immediately preceding calendar month other than (i) purchases from A/N, (ii) purchases in privately negotiated transactions or (iii) purchases for the withholding of shares of Charter Class A common stock pursuant to equity compensation programs of Charter. Charter purchased from Liberty Broadband 6.2 million and 6.1 million shares of Charter Class A common stock for approximately $3.0 billion and $4.2 billion during the years ended December 31, 2022 and 2021, respectively. In January 2023, Charter purchased from Liberty Broadband an additional 0.1 million shares of Charter Class A common stock for approximately $42 million.\nIn December 2016, Charter and A/N entered into a letter agreement, as amended in December 2017 (the \"A/N Letter Agreement\"), that requires A/N to sell to Charter or to Charter Holdings, on a monthly basis, a number of shares of Charter Class A common stock or Charter Holdings common units that represents a pro rata participation by A/N and its affiliates in any repurchases of shares of Charter Class A common stock from persons other than A/N effected by Charter during the immediately preceding calendar month, at a purchase price equal to the average price paid by Charter for the shares repurchased from persons other than A/N during such immediately preceding calendar month. A/N and Charter both have the right to terminate or suspend the pro rata repurchase arrangement on a prospective basis. During the years ended December 31, 2022 and 2021, Charter Holdings purchased from A/N 3.2 million and 3.3 million Charter Holdings common units, respectively, for approximately $1.6 billion and $2.2 billion, respectively.\nAs of December 31, 2022, Charter had remaining board authority to purchase an additional $414 million of Charter’s Class A common stock and/or Charter Holdings common units, excluding purchases from Liberty Broadband. Although Charter expects to continue to buy back its common stock consistent with its leverage target range, Charter is not obligated to acquire any particular amount of common stock, and the timing of any purchases that may occur cannot be predicted and will largely depend on market conditions and other potential uses of capital. Purchases may include open market purchases, tender offers or negotiated transactions.\nAs possible acquisitions, swaps or dispositions arise, we actively review them against our objectives including, among other considerations, improving the operational efficiency, geographic clustering of assets, product development or technology capabilities of our business and achieving appropriate return targets, and we may participate to the extent we believe these possibilities present attractive opportunities. However, there can be no assurance that we will actually complete any acquisitions, dispositions or system swaps, or that any such transactions will be material to our operations or results.\nFree Cash Flow\nFree cash flow decreased $2.6 billion during the year ended December 31, 2022 compared to the corresponding prior period due to the following (dollars in millions):\nFree cash flow was reduced by $1.1 billion and $853 million during the years ended December 31, 2022 and 2021, respectively, due to mobile impacts negatively affecting working capital, capital expenditures and Adjusted EBITDA. The increase in capital expenditures is primarily due to the rural construction initiative of $1.8 billion during the year ended December 31, 2022. Cash\npaid for taxes, net increased as Charter has become a meaningful federal cash tax payer in 2022. Other, net for the year ended December 31, 2022 includes the payment of litigation settlements including the payment of a previously recorded litigation settlement with Sprint Communications Company L.P. and T-Mobile USA, Inc. See Note 14 to the accompanying consolidated financial statements contained in “Part II. Item 8. Financial Statements and Supplementary Data.”\nHistorical Operating, Investing, and Financing Activities\nCash and Cash Equivalents. We held $645 million and $601 million in cash and cash equivalents as of December 31, 2022 and 2021, respectively.\nOperating Activities. Net cash provided by operating activities decreased $1.3 billion during the year ended December 31, 2022 compared to the year ended December 31, 2021, primarily due to an increase in cash paid for taxes, higher cash paid for interest and the payment of litigation settlements offset by an increase in Adjusted EBITDA of $986 million.\nInvesting Activities. Net cash used in investing activities for the years ended December 31, 2022 and 2021 was $9.1 billion and $7.8 billion, respectively. The increase in cash used was primarily due to an increase in capital expenditures, offset by changes in accrued expenses related to capital expenditures that increased by $473 million.\nFinancing Activities. Net cash used in financing activities decreased $3.1 billion during the year ended December 31, 2022 compared to the year ended December 31, 2021 primarily due to a decrease in the purchase of treasury stock and noncontrolling interest offset by a decrease in the amount by which borrowings of long-term debt exceeded repayments.\nCapital Expenditures\nWe have significant ongoing capital expenditure requirements. Capital expenditures were $9.4 billion and $7.6 billion for the years ended December 31, 2022 and 2021, respectively. The increase was primarily due to an increase in line extensions and customer premise equipment. The increase in line extensions was primarily due to the rural construction initiative. See the table below for more details.\nWe currently expect full year 2023 capital expenditures, excluding line extensions, to be between $6.5 billion and $6.8 billion. We expect 2023 line extensions capital expenditures to approximate $4 billion. The actual amount of capital expenditures in 2023 will depend on a number of factors including, but not limited to, the pace of our network evolution and rural construction initiatives, supply chain timing and growth rates in our residential and commercial businesses.\nOur capital expenditures are funded primarily from cash flows from operating activities and borrowings on our credit facility. In addition, our accrued liabilities related to capital expenditures increased $553 million and $80 million for the years ended December 31, 2022 and 2021, respectively.\nThe following tables present our major capital expenditures categories in accordance with National Cable and Telecommunications Association (“NCTA”) disclosure guidelines for the years ended December 31, 2022 and 2021. These disclosure guidelines are not required disclosures under GAAP, nor do they impact our accounting for capital expenditures under GAAP (dollars in millions):\n(a)Customer premise equipment includes costs incurred at the customer residence to secure new customers and revenue generating units, including customer installation costs and customer premise equipment (e.g., digital receivers and cable modems).\n(b)Scalable infrastructure includes costs not related to customer premise equipment, to secure growth of new customers and revenue generating units, or provide service enhancements (e.g., headend equipment).\n(c)Line extensions include network costs associated with entering new service areas (e.g., fiber/coaxial cable, amplifiers, electronic equipment, make-ready and design engineering).\n(d)Upgrade/rebuild includes costs to modify or replace existing fiber/coaxial cable networks, including betterments.\n(e)Support capital includes costs associated with the replacement or enhancement of non-network assets due to technological and physical obsolescence (e.g., non-network equipment, land, buildings and vehicles).\n(f)The rural construction initiative subcategory includes expenditures associated with our Rural Construction Initiative (for which separate reporting was initiated in 2022), excluding customer premise equipment and installation.\nDebt\nAs of December 31, 2022, the accreted value of our total debt was approximately $97.6 billion, as summarized below (dollars in millions):\n(a)The accreted values presented in the table above represent the principal amount of the debt adjusted for original issue discount or premium at the time of sale, deferred financing costs, and, in regards to debt assumed in acquisitions, fair value premium adjustments as a result of applying acquisition accounting plus the accretion of those amounts to the balance sheet date. However, the amount that is currently payable if the debt becomes immediately due is equal to the principal amount of the debt. In regards to the Sterling Notes, the principal amount of the debt and any premium or discount is remeasured into US dollars as of each balance sheet date. We have availability under our credit facilities of approximately $4.0 billion as of December 31, 2022.\n(b)In general, the obligors have the right to redeem all of the notes set forth in the above table in whole or in part at their option, beginning at various times prior to their stated maturity dates, subject to certain conditions, upon the payment of the outstanding principal amount (plus a specified redemption premium) and all accrued and unpaid interest.\n(c)Principal amount includes £625 million valued at $755 million as of December 31, 2022 using the exchange rate as of December 31, 2022.\n(d)Principal amount includes £650 million valued at $786 million as of December 31, 2022 using the exchange rate as of December 31, 2022.\nIn 2022, Charter Operating entered into an amendment to its credit agreement. Also in 2022, CCO Holdings and CCO Holdings Capital Corp. jointly issued $2.7 billion aggregate principal amount of senior unsecured notes and Charter Operating and Charter Communications Operating Capital Corp. jointly issued $3.5 billion aggregate principal amount of senior secured notes. The notes were issued at varying rates, prices and maturity dates and the net proceeds were used to pay related fees and expenses and for general corporate purposes, including funding buybacks of Charter Class A common stock and Charter Holdings common units as well as repaying certain indebtedness.\nSee Note 8 to the accompanying consolidated financial statements contained in “Part II. Item 8. Financial Statements and Supplementary Data” for further details regarding our outstanding debt and other financing arrangements, including certain information about maturities, covenants and restrictions related to such debt and financing arrangements. The agreements and instruments governing our debt and financing arrangements are complicated and you should consult such agreements and instruments which are filed with the SEC for more detailed information.\nAt December 31, 2022, Charter Operating had a consolidated leverage ratio of approximately 3.0 to 1.0 and a consolidated first lien leverage ratio of 3.0 to 1.0. Both ratios are in compliance with the ratios required by the Charter Operating credit facilities of 5.0 to 1.0 consolidated leverage ratio and 4.0 to 1.0 consolidated first lien leverage ratio. A failure by Charter Operating to maintain the financial covenants would result in an event of default under the Charter Operating credit facilities and the debt of CCO Holdings. See “Part I. Item 1A. Risk Factors - The agreements and instruments governing our debt contain restrictions and limitations that could significantly affect our ability to operate our business, as well as significantly affect our liquidity.”\nRecently Issued Accounting Standards\nSee Note 22 to the accompanying consolidated financial statements contained in “Part II. Item 8. Financial Statements and Supplementary Data” for a discussion of recently issued accounting standards.",
    "item_7A": "Item 7A. Quantitative and Qualitative Disclosures About Market Risk.\nCross-currency derivative instruments are used to manage foreign exchange risk on the Sterling Notes by effectively converting £1.275 billion aggregate principal amount of fixed-rate British pound sterling denominated debt, including annual interest payments and the payment of principal at maturity, to fixed-rate U.S. dollar denominated debt. The fair value of our cross-currency derivatives included in other long-term liabilities on our consolidated balance sheets was $570 million and $290 million as of December 31, 2022 and 2021, respectively. For more information, see Note 11 to the accompanying consolidated financial statements contained in “Part II. Item 8. Financial Statements and Supplementary Data.”\nAs of December 31, 2022 and 2021, the weighted average interest rate on the credit facility debt was approximately 5.9% and 1.6%, respectively, and the weighted average interest rate on the senior notes was approximately 5.0% and 4.9%, respectively, resulting in a blended weighted average interest rate of 5.1% and 4.5%, respectively. The interest rate on approximately 85% and 87% of the total principal amount of our debt was fixed as of December 31, 2022 and 2021, respectively.\nThe table set forth below summarizes the fair values and contract terms of financial instruments subject to interest rate risk maintained by us as of December 31, 2022 (dollars in millions):\nInterest rates on variable-rate debt are estimated using the average implied forward LIBOR or SOFR for the year of maturity based on the yield curve in effect at December 31, 2022 including applicable bank spread.",
    "item_8": "Item 8. Financial Statements and Supplementary Data.\nOur consolidated financial statements, the related notes thereto, and the reports of independent accountants are included in this annual report beginning on page.",
    "item_9": "Item 9. Changes in and Disagreements with Accountants on Accounting and Financial Disclosure.\nNone.",
    "item_9A": "Item 9A. Controls and Procedures.\nConclusion Regarding the Effectiveness of Disclosure Controls and Procedures\nAs of the end of the period covered by this report, under the supervision and with the participation of our management, including our Chief Executive Officer and Chief Financial Officer, we have evaluated the effectiveness of the design and operation of disclosure controls and procedures with respect to the information generated for use in this annual report. The evaluation was based upon reports and certifications provided by a number of executives. Based on, and as of the date of that evaluation, our Chief Executive Officer and Chief Financial Officer concluded that the disclosure controls and procedures were effective to provide reasonable assurances that information required to be disclosed in the reports we file or submit under the Securities Exchange Act of 1934 is recorded, processed, summarized and reported within the time periods specified in the SEC’s rules and forms.\nIn designing and evaluating the disclosure controls and procedures, our management recognized that any controls and procedures, no matter how well designed and operated, can provide only reasonable, not absolute, assurance of achieving the desired control objectives, and management necessarily was required to apply its judgment in evaluating the cost-benefit relationship of possible controls and procedures. Based upon the above evaluation, we believe that our controls provide such reasonable assurances.\nDuring the quarter ended December 31, 2022, there was no change in our internal control over financial reporting that has materially affected, or is reasonably likely to materially affect, our internal control over financial reporting.\nManagement’s Report on Internal Control Over Financial Reporting\nOur management is responsible for establishing and maintaining adequate internal control over financial reporting (as defined in Rule 13a-15(f) under the Exchange Act) for the Company. Our internal control system was designed to provide reasonable assurance to our management and board of directors regarding the preparation and fair presentation of published financial statements.\nManagement has assessed the effectiveness of our internal control over financial reporting as of December 31, 2022. In making this assessment, we used the criteria set forth by the Committee of Sponsoring Organizations of the Treadway Commission (“COSO”) in Internal Control - Integrated Framework (2013). Based on management’s assessment utilizing these criteria we believe that, as of December 31, 2022, our internal control over financial reporting was effective.\nOur independent auditors, KPMG LLP, have audited our internal control over financial reporting as stated in their report on page.",
    "item_9B": "Item 9B. Other Information.\nOn January 26, 2023, Charter entered into an employment agreement (the “Fischer Employment Agreement”) with Jessica Fischer, our Chief Financial Officer.\nThe Fischer Employment Agreement, which is effective as of February 5, 2023, has a term ending February 5, 2025 (or upon an earlier termination of employment) and provides that Ms. Fischer will continue to serve as Chief Financial Officer. The Fischer Employment Agreement provides that Ms. Fischer will receive an annual base salary of at least $800,000 and a target annual cash bonus opportunity of 150% of her annual base salary.\nMs. Fischer will also continue to participate in our employee benefit plans and receive perquisites as generally provided to our other senior executives. In addition, consistent with Ms. Fischer’s prior employment agreement, we will continue to reimburse Ms. Fischer for all reasonable and necessary expenses incurred in connection with the performance of her duties.\nIf the employment of Ms. Fischer is terminated involuntarily by us without cause or by her for good reason, she would be entitled to (a) a cash severance payment equal to two times the sum of her annual base salary and target annual bonus opportunity for the year in which the termination occurs, (b) a cash payment equal to the cost of COBRA coverage for 24 months, and (c) outplacement services for up to 12 months.\nThe termination benefits described above are subject to Ms. Fischer’s execution of a release of claims in favor of Charter and its affiliates. In addition, Ms. Fischer has agreed to comply with covenants concerning non-disclosure of confidential information, assignment of intellectual property and non-disparagement of Charter and, for two years following termination, covenants concerning non-competition and non-solicitation of customers of Charter and its affiliates and, for one year following termination, covenants concerning non-solicitation of employees of Charter and its affiliates.\nA copy of the Fischer Employment Agreement is filed herewith as Exhibit 10.71(b), and is incorporated herein by reference. The foregoing description of the Fischer Employment Agreement does not purport to be complete and is qualified in its entirety by reference to the full text of that document.",
    "item_9C": "Item 9C. Disclosure Regarding Foreign Jurisdictions that Prevent Inspections.\nNot applicable.\nPART III",
    "item_10": "Item 10. Directors, Executive Officers and Corporate Governance.\nThe information required by Item 10 will be included in the Proxy Statement under the headings “Proposal No. 1: Election of Directors,” “Delinquent Section 16(a) Reports,” and “Code of Ethics,” or in amendment to this Annual Report on Form 10-K and is incorporated herein by reference.",
    "item_11": "Item 11. Executive Compensation.\nThe information required by Item 11 will be included in the Proxy Statement under the headings “Compensation Discussion and Analysis,” “Proposal No. 1: Election of Directors - 2022 Director Compensation,” “Compensation Committee Interlocks and Insider Participation” and “Report of the Compensation and Benefits Committee” or in an amendment to this Annual Report on Form 10-K and is incorporated herein by reference. Information contained in the Proxy Statement or an amendment to this Annual Report on Form 10-K under the caption “Report of the Compensation and Benefits Committee” is furnished and not deemed filed with the SEC.",
    "item_12": "Item 12. Security Ownership of Certain Beneficial Owners and Management and Related Stockholder Matters.\nThe information required by Item 12 will be included in the Proxy Statement under the heading “Certain Beneficial Owners of Charter Class A Common Stock” or in amendment to this Annual Report on Form 10-K and is incorporated herein by reference.",
    "item_13": "Item 13. Certain Relationships and Related Transactions, and Director Independence.\nThe information required by Item 13 will be included in the Proxy Statement under the heading “Certain Relationships and Related Transactions” and “Proposal No. 1: Election of Directors” or in amendment to this Annual Report on Form 10-K and is incorporated herein by reference.",
    "item_14": "Item 14. Principal Accountant Fees and Services.\nThe information required by Item 14 will be included in the Proxy Statement under the heading “Accounting Matters” or in amendment to this Annual Report on Form 10-K and is incorporated herein by reference.\nPART IV",
    "item_15": "Item 15. Exhibits and Financial Statement Schedules.\n(a) The following documents are filed as part of this annual report:\n(1) Financial Statements.\nA listing of the financial statements, notes and reports of independent public accountants required by \"Part II. Item 8. Financial Statements and Supplementary Data\" begins on page of this annual report.\n(2) Financial Statement Schedules.\nNo financial statement schedules are required to be filed by Items 8 and 15(c) because they are not required or are not applicable, or the required information is set forth in the applicable financial statements or notes thereto.\n(3) The index to the exhibits begins on page E-1 of this annual report.",
    "item_16": "Item 16. Form 10-K Summary.\nNone.",
    "stock_ticker": "CHTR"
}