{
    "cik": "277948",
    "company": "CSX CORP",
    "filing_type": "10-K",
    "filing_date": "2021-02-10",
    "period_of_report": "2020-12-31",
    "sic": "4011",
    "state_of_inc": "VA",
    "state_location": "FL",
    "fiscal_year_end": "1231",
    "filing_html_index": "https://www.sec.gov/Archives/edgar/data/277948/0000277948-21-000014-index.html",
    "htm_filing_link": "https://www.sec.gov/Archives/edgar/data/277948/000027794821000014/csx-20201231.htm",
    "complete_text_filing_link": "https://www.sec.gov/Archives/edgar/data/277948/0000277948-21-000014.txt",
    "filename": "277948_10K_2020_0000277948-21-000014.htm",
    "item_1": "Item 1. Business\nCSX Corporation, together with its subsidiaries (\"CSX\" or the “Company”), based in Jacksonville, Florida, is one of the nation's leading transportation companies. The Company provides rail-based freight transportation services including traditional rail service, the transport of intermodal containers and trailers, as well as other transportation services such as rail-to-truck transfers and bulk commodity operations. CSX and the rail industry provide customers with access to an expansive and interconnected transportation network that plays a key role in North American commerce and is critical to the long-term economic success and improved global competitiveness of the United States. In addition, freight railroads provide the most economical and environmentally efficient means to transport goods over land.\nCSX Transportation, Inc.\nCSX’s principal operating subsidiary, CSX Transportation, Inc. (“CSXT”), provides an important link to the transportation supply chain through its approximately 19,500 route-mile rail network, which serves major population centers in 23 states east of the Mississippi River, the District of Columbia and the Canadian provinces of Ontario and Quebec. It has access to over 70 ocean, river and lake port terminals along the Atlantic and Gulf Coasts, the Mississippi River, the Great Lakes and the St. Lawrence Seaway. This access allows the Company to meet the dynamic transportation needs of manufacturers, industrial producers, the automotive industry, construction companies, farmers and feed mills, wholesalers and retailers, and energy producers. The Company’s intermodal business links customers to railroads via trucks and terminals. CSXT also serves thousands of production and distribution facilities through track connections with other Class I railroads and more than 230 short-line and regional railroads.\nCSXT is also responsible for the Company's real estate sales, leasing, acquisition and management and development activities. Substantially all of these activities are focused on supporting railroad operations.\nOther Entities\nIn addition to CSXT, the Company’s subsidiaries include CSX Intermodal Terminals, Inc. (“CSX Intermodal Terminals”), Total Distribution Services, Inc. (“TDSI”), Transflo Terminal Services, Inc. (“Transflo”), CSX Technology, Inc. (“CSX Technology”) and other subsidiaries. CSX Intermodal Terminals owns and operates a system of intermodal terminals, predominantly in the eastern United States, and also provides drayage services (the pickup and delivery of intermodal shipments) for certain customers. TDSI serves the automotive industry with distribution centers and storage locations. Transflo connects non-rail served customers to the many benefits of rail by transferring products from rail to trucks. The biggest Transflo markets are chemicals and agriculture, which includes shipments of plastics and ethanol. CSX Technology and other subsidiaries provide support services for the Company.\nCSX 2020 Form 10-K p.3\nCSX CORPORATION\nPART I\nLines of Business\nDuring 2020, the Company's services generated $10.6 billion of revenue and served three primary lines of business: merchandise, intermodal and coal.\n•The merchandise business shipped 2.5 million carloads (43 percent of volume) and generated 67 percent of revenue in 2020. The Company’s merchandise business is comprised of shipments in the following diverse markets: chemicals, agricultural and food products, automotive, minerals, forest products, metals and equipment, and fertilizers.\n•The intermodal business shipped 2.7 million units (46 percent of volume) and generated 16 percent of revenue in 2020. The intermodal business combines the superior economics of rail transportation with the flexibility of trucks and offers a cost and environmental advantage over long-haul trucking. Through a network of approximately 30 terminals, the intermodal business serves all major markets east of the Mississippi River and transports mainly manufactured consumer goods in containers, providing customers with truck-like service for longer shipments.\n•The coal business shipped 637 thousand carloads (11 percent of volume) and generated 13 percent of revenue in 2020. The Company transports domestic coal, coke and iron ore to electricity-generating power plants, steel manufacturers and industrial plants as well as export coal to deep-water port facilities. Approximately one-quarter to one-third of export coal and the majority of the domestic coal that the Company transports is used for generating electricity or industrial purposes.\nOther revenue accounted for 4 percent of the Company’s total revenue in 2020. This category includes revenue from regional subsidiary railroads, demurrage, storage at intermodal facilities, revenue for customer volume commitments not met, switching, other incidental charges and adjustments to revenue reserves. Revenue from regional railroads includes shipments by railroads that the Company does not directly operate. Demurrage represents charges assessed when freight cars or other equipment are held beyond a specified period of time. Switching represents charges assessed when a railroad switches cars for a customer or another railroad.\nHuman Capital\nMost of the Company’s employees provide or support transportation services. The Company had nearly 19,300 employees as of December 2020, which includes approximately 15,700 employees that are members of a labor union. For the 13 rail unions that participate in national bargaining, a round of negotiations for benefits, wages and work rules is underway. Typically, these negotiations take several years. Current agreements remain in place until modified by new agreements.\nCSX prioritizes workplace safety for employees and is committed to continued safety improvement through enhanced training, processes and technology. The attainment of key safety targets is a component of management's annual incentive program. The FRA Personal Injury Frequency Index, a measure of the number of FRA-reportable injuries per 200,000 man-hours, was 0.81 in 2020 and 0.90 in 2019, representing a 10% improvement year over year. Compared to 2019, both the number of injuries and the number of man-hours declined in 2020. In response to the novel coronavirus (\"COVID-19\") pandemic, additional policies and procedures were developed to protect the health and safety of employees. A cross-functional task force continues to monitor the situation to ensure that appropriate safety measures are being taken.\nCSX 2020 Form 10-K p.4\nCSX CORPORATION\nPART I\nThe Compensation and Talent Management Committee of the Board of Directors is charged with oversight of human capital management. The Company is committed to developing a culture that promotes workforce diversity and inclusion and encourages ethical behavior. In 2019, CSX was recognized as a “Best Place to Work for Disability Inclusion” by Disability:IN and the American Association of People with Disabilities after receiving a 100% score on their disability equality index. The CSX Code of Ethics serves as a guiding standard for ethical behavior and covers many types of matters, including discrimination and harassment as well as safety. Annually, all management employees are required, and union employees are highly encouraged, to complete ethics training.\nOperating Model\nThe Company is focused on developing and strictly maintaining a scheduled service plan with an emphasis on optimizing assets. When this operating model is executed effectively, customer service is improved, enabling the Company to better compete for an increased share of the U.S. freight market. Further, this model leads to reduced costs and strong free cash flow generation.\nFinancial Information\nSee Item 7. Management’s Discussion and Analysis of Financial Condition and Results of Operations for operating revenue, operating income and total assets for each of the last three fiscal years.\nCompany History\nA leader in freight rail transportation for more than 190 years, the Company’s heritage dates back to the early nineteenth century when The Baltimore and Ohio Railroad Company (“B&O”) - the nation’s first common carrier - was chartered in 1827. Since that time, the Company has built on this foundation to create a railroad that could safely and reliably service the ever-increasing demands of a growing nation.\nSince its founding, numerous railroads have combined with the former B&O through merger and consolidation to create what has become CSX. Each of the railroads that combined into the CSX family brought new geographical reach to valuable markets, gateways, cities, ports and transportation corridors.\nCSX Corporation was incorporated in 1978 under Virginia law. In 1980, the Company completed the merger of the Chessie System and Seaboard Coast Line Industries into CSX. The merger allowed the Company to connect northern population centers and Appalachian coal fields to growing southeastern markets. Later, the Company’s acquisition of key portions of Conrail, Inc. (\"Conrail\") allowed CSXT to link the northeast, including New England and the New York metropolitan area, with Chicago and midwestern markets as well as the growing areas in the Southeast already served by CSXT. This current rail network allows the Company to directly serve every major market in the eastern United States with safe, dependable, environmentally responsible and fuel efficient freight transportation and intermodal service.\nCSX 2020 Form 10-K p.5\nCSX CORPORATION\nPART I\nCompetition\nThe business environment in which the Company operates is highly competitive. Shippers typically select transportation providers that offer the most compelling combination of service and price. Service requirements, both in terms of transit time and reliability, vary by shipper and commodity. As a result, the Company’s primary competition varies by commodity, geographic location and mode of available transportation and includes other railroads, motor carriers that operate similar routes across its service area and, to a less significant extent, barges, ships and pipelines.\nCSXT’s primary rail competitor is Norfolk Southern Railway, which operates throughout much of the Company’s territory. Other railroads also operate in parts of the Company’s territory. Depending on the specific market, competing railroads and deregulated motor carriers may exert pressure on price and service levels. For further discussion on the risk of competition to the Company, see Item 1A. Risk Factors.\nRegulatory Environment\nThe Company's operations are subject to various federal, state, provincial (Canada) and local laws and regulations generally applicable to businesses operating in the United States and Canada. In the U.S., the railroad operations conducted by the Company's subsidiaries, including CSXT, are subject to the regulatory jurisdiction of the Surface Transportation Board (“STB”), the Federal Railroad Administration (“FRA”), and its sister agency within the U.S. Department of Transportation (\"DOT\"), the Pipeline and Hazardous Materials Safety Administration (“PHMSA”). Together, FRA and PHMSA have broad jurisdiction over railroad operating standards and practices, including track, freight cars, locomotives and hazardous materials requirements. In addition, the U.S. Environmental Protection Agency (“EPA”) has regulatory authority with respect to matters that impact the Company's properties and operations.\nThe Transportation Security Administration (“TSA”), a component of the Department of Homeland Security, has broad authority over railroad operating practices that may have homeland security implications. In Canada, the railroad operations conducted by the Company’s subsidiaries, including CSXT, are subject to the regulatory jurisdiction of the Canadian Transportation Agency.\nAlthough the Staggers Act of 1980 significantly deregulated the U.S. rail industry, the STB has broad jurisdiction over rail carriers. The STB regulates routes, fuel surcharges, conditions of service, rates for non-exempt traffic, acquisitions of control over rail common carriers and the transfer, extension or abandonment of rail lines, among other railroad activities. Any new rules from the STB regarding, among other things, competitive access or revenue adequacy could have a material adverse effect on the Company's financial condition, results of operations and liquidity as well as its ability to invest in enhancing and maintaining vital infrastructure. For further discussion on regulatory risks to the Company, see Item 1A. Risk Factors.\nCSX 2020 Form 10-K p.6\nCSX CORPORATION\nPART I\nPositive Train Control\nIn 2008, Congress enacted the Rail Safety Improvement Act, which included a mandate that all Class I freight railroads implement an interoperable positive train control system (“PTC”) by the initial deadline of December 31, 2015. Subsequently, the Positive Train Control Enforcement and Implementation Act of 2015 extended this deadline. In accordance with this Act, the Company completed installation of all PTC hardware by December 31, 2018, and the PTC system was fully operational and interoperable before December 31, 2020. PTC is designed to prevent train-to-train collisions, over-speed derailments, incursions into established work-zone limits, and train diversions onto another set of tracks. PTC must be installed on all main lines with passenger and commuter operations as well as most of those over which toxic-by-inhalation hazardous materials are transported.\nWhile the Company expects ongoing PTC costs, PTC implementation is complete at a total cost of $2.4 billion. Implementation costs included installing new equipment along tracks, upgrading locomotives, adding communication equipment and developing new technologies.\nOther Information\nCSX makes available on its website www.csx.com, free of charge, its annual reports on Form 10-K, quarterly reports on Form 10-Q, current reports on Form 8-K and all amendments to those reports as soon as reasonably practicable after such reports are filed with or furnished to the Securities and Exchange Commission (“SEC”). The information on the CSX website is not part of this annual report on Form 10-K. Additionally, the Company has posted its code of ethics on its website, which is also available to any shareholder who requests it. This Form 10-K and other SEC filings made by CSX are also accessible through the SEC’s website at www.sec.gov.\nCSX has included the certifications of its Chief Executive Officer (“CEO”) and the Chief Financial Officer (“CFO”) required by Section 302 of the Sarbanes-Oxley Act of 2002 (“the Act”) as Exhibit 31, as well as Section 906 of the Act as Exhibit 32 to this Form 10-K report.\nFor additional information concerning business conducted by the Company during 2020, see Item 7. Management's Discussion and Analysis of Financial Condition and Results of Operations.\nCSX 2020 Form 10-K p.7\nCSX CORPORATION\nPART I",
    "item_1A": "Item 1A. Risk Factors\nThe risks set forth in the following risk factors could have a material adverse effect on the Company's financial condition, results of operations or liquidity, and could cause those results to differ materially from those expressed or implied in the Company's forward-looking statements. Additional risks and uncertainties not currently known to the Company or that the Company currently does not deem to be material also may materially impact the Company's financial condition, results of operations or liquidity.\nRegulatory, Legislative and Legal\nNew legislation or regulatory changes could impact the Company's earnings or restrict its ability to independently negotiate prices.\nLegislation passed by Congress, new regulations issued by federal agencies or executive orders issued by the President of the United States could significantly affect the revenues, costs, including income taxes, and profitability of the Company's business. In addition, statutes or regulations imposing price constraints or affecting rail-to-rail competition could adversely affect the Company's profitability.\nGovernment regulation and compliance risks may adversely affect the Company's operations and financial results.\nThe Company is subject to the jurisdiction of various regulatory agencies, including the STB, FRA, PHMSA, TSA, EPA and other state, provincial and federal regulatory agencies for a variety of economic, health, safety, labor, environmental, tax, legal and other matters. New or modified rules or regulations by these agencies could increase the Company's operating costs, adversely impact revenue or reduce operating efficiencies and affect service performance. Noncompliance with applicable laws or regulations could erode public confidence in the Company and can subject the Company to fines, penalties and other legal or regulatory sanctions.\nCSXT, as a common carrier by rail, is required by law to transport hazardous materials, which could expose the Company to significant costs and claims.\nA train accident involving the transport of hazardous materials could result in significant claims arising from personal injury, property or natural resource damage, environmental penalties and remediation obligations. Such claims, if insured, could exceed existing insurance coverage or insurance may not continue to be available at commercially reasonable rates. Under federal regulations, CSXT is required to transport hazardous materials under the legal duty referred to as the common carrier mandate.\nCSXT is also required to comply with regulations regarding the handling of hazardous materials. In November 2008, the TSA issued final rules placing significant new security and safety requirements on passenger and freight railroad carriers, rail transit systems and facilities that ship hazardous materials by rail. Noncompliance with these rules can subject the Company to significant penalties and could be a factor in litigation arising out of a train accident. Finally, legislation preventing the transport of hazardous materials through certain cities could result in network congestion and increase the length of haul for hazardous substances, which could increase operating costs, reduce operating efficiency or increase the risk of an accident involving the transport of hazardous materials.\nCSX 2020 Form 10-K p.8\nCSX CORPORATION\nPART I\nThe Company may be subject to various claims and lawsuits that could result in significant expenditures.\nAs part of its railroad and other operations, the Company is subject to various claims and lawsuits related to disputes over commercial practices, labor and unemployment matters, occupational and personal injury claims, property damage, environmental and other matters. The Company may experience material judgments or incur significant costs to defend existing and future lawsuits. Although the Company maintains insurance to cover some of these types of claims and establishes reserves when appropriate, final amounts determined to be due on any outstanding matters may exceed the Company's insurance coverage or differ materially from the recorded reserves. Additionally, the Company could be impacted by adverse developments not currently reflected in the Company's reserve estimates.\nOperational, Safety and Business Disruption\nAn epidemic or pandemic, including the ongoing COVID-19 pandemic, and the initiatives to reduce its transmission could adversely affect the Company's business.\nThe Company could be materially and adversely affected by a public health crisis, including a widespread epidemic or pandemic. As COVID-19 has spread globally, including significant impacts in the United States, CSX continues to take a variety of measures to ensure the availability of its transportation services, promote the safety and security of its employees and support the communities in which it operates. However, public and private sector policies and initiatives to reduce the transmission of COVID-19, such as closures of businesses and manufacturing facilities, the promotion of social distancing, the adoption of working from home by companies and institutions, and travel restrictions could continue to adversely affect demand for the commodities and products that the Company transports, including import and export volume.\nIn addition, COVID-19 and the related initiatives to reduce transmission may result in greater supply chain disruption, which could continue to have an adverse impact on volumes and make it more difficult for the Company to serve its customers. The extent to which this coronavirus impacts operations will depend on future developments, which are highly uncertain and cannot be predicted with confidence, including the duration of the outbreak, new information which may emerge concerning the severity of this coronavirus and the actions to contain the coronavirus or treat its impact, among others. Moreover, operations could be negatively affected if a significant number of employees are quarantined as the result of exposure to a contagious illness. To the extent COVID-19 adversely affects the Company's business and financial results, it may also have the effect of heightening many of the other risks described under Part I, Item 1A (Risk Factors) of this annual report on Form 10-K.\nThe Company relies on the security, stability and availability of its technology systems to operate its business.\nThe Company relies on information technology in all aspects of its business. The performance and reliability of the Company's technology systems are critical to its ability to operate and compete safely and effectively. A cybersecurity attack, which is a deliberate theft of data or impairment of information technology systems, or other significant disruption or failure, could result in a service interruption, train accident, misappropriation of confidential information, process failure, security breach or other operational difficulties. Such an event could result in decreased revenues and increased capital, insurance or operating costs, including increased security costs to protect the Company's infrastructure. Insurance maintained by the Company to protect against loss of business and other related consequences resulting from cyber incidents may not be sufficient to cover all damages. A disruption or compromise of the Company's information technology systems, even for short periods of time, could have a material adverse effect.\nCSX 2020 Form 10-K p.9\nCSX CORPORATION\nPART I\nNetwork constraints could have a negative impact on service and operating efficiency.\nCSXT could experience rail network difficulties related to: (i) unpredictable increases in demand; (ii) locomotive or crew shortages; (iii) extreme weather conditions; (iv) impacts from changes in yard capacity, or network structure or composition, including train routes; (v) increased passenger activities; or (vi) regulatory changes impacting where and how fast CSXT can transport freight or maintain routes, which could impact CSXT's operational fluidity, leading to deterioration of service, asset utilization and overall efficiency.\nFuture acts of terrorism, war or regulatory changes to combat the risk of terrorism may cause significant disruptions in the Company's operations.\nTerrorist attacks, along with any government response to those attacks, may adversely affect the Company's financial condition, results of operations or liquidity. CSXT's rail lines, other key infrastructure and information technology systems may be targets or indirect casualties of acts of terror or war. This risk could cause significant business interruption and result in increased costs and liabilities and decreased revenues. In addition, premiums charged for some or all of the insurance coverage currently maintained by the Company could increase dramatically, or the coverage may no longer be available.\nFurthermore, in response to the heightened risk of terrorism, federal, state and local governmental bodies are proposing and, in some cases, have adopted legislation and regulations relating to security issues that impact the transportation industry. For example, the Department of Homeland Security adopted regulations that require freight railroads to implement additional security protocols when transporting hazardous materials. Complying with these or future regulations could continue to increase the Company's operating costs and reduce operating efficiencies.\nSevere weather or other natural occurrences could result in significant business interruptions and expenditures in excess of available insurance coverage.\nThe Company's operations may be affected by external factors such as severe weather and other natural occurrences, including floods, fires, hurricanes and earthquakes. As a result, the Company's rail network may be damaged, its workforce may be unavailable, fuel costs may rise and significant business interruptions could occur. In addition, the performance of locomotives and railcars could be adversely affected by extreme weather conditions. Insurance maintained by the Company to protect against loss of business and other related consequences resulting from these natural occurrences is subject to coverage limitations, depending on the nature of the risk insured. This insurance may not be sufficient to cover all of the Company's damages or damages to others, and this insurance may not continue to be available at commercially reasonable rates. Even with insurance, if any natural occurrence leads to a catastrophic interruption of service, the Company may not be able to restore service without a significant interruption in operations.\nCSX 2020 Form 10-K p.10\nCSX CORPORATION\nPART I\nCompetitive, Economic and Financial\nThe Company faces competition from other transportation providers.\nThe Company experiences competition in pricing, service, reliability and other factors from various transportation providers including railroads and motor carriers that operate similar routes across its service area and, to a less significant extent, barges, ships and pipelines. Other transportation providers generally use public rights-of-way that are built and maintained by governmental entities, while CSXT and other railroads must build and maintain rail networks largely using internal resources. Any future improvements or expenditures materially increasing the quality or reducing the cost of alternative modes of transportation such as through the use of automation, autonomy or electrification, or legislation providing for less stringent size or weight restrictions on trucks, could negatively impact the Company's competitive position. Additionally, any future consolidation in the rail industry could materially affect the regulatory and competitive environment in which the Company operates.\nGlobal economic conditions could negatively affect demand for commodities and other freight.\nA decline or disruption in general domestic and global economic conditions that affects demand for the commodities and products the Company transports, including import and export volume, could reduce revenues or have other adverse effects on the Company's cost structure and profitability. For example, slower rates of economic growth in Asia, contraction of European economies, and changes in the global supply of seaborne coal or price of seaborne coal have adverse impacts on U.S. export coal volume and result in lower coal revenue for CSX. Additionally, changes to trade agreements or policies could result in reduced import and export volumes due to increased tariffs and lower consumer demand. If the Company experiences significant declines in demand for its transportation services with respect to one or more commodities and products, the Company may experience reduced revenue and increased operating costs, workforce adjustments, and other related activities, which could have a material adverse effect on the Company's financial condition, results of operations and liquidity.\nChanging dynamics in the U.S. and global energy markets could negatively impact profitability.\nIncreases in production and source locations of natural gas in the U.S. have resulted in lower natural gas prices in CSX’s service territory. As a result of sustained low natural gas prices, many coal-fired power plants have been displaced by natural gas-fired power generation facilities. If natural gas prices were to remain low, additional coal-fired plants could be displaced, which would likely further reduce the Company's domestic coal volumes and revenues. Additionally, crude oil prices combined with changes in pipeline capacity have resulted in volatility in domestic crude oil production, which has affected crude oil volumes for CSX.\nWeaknesses in the capital and credit markets could negatively impact the Company’s access to capital.\nThe Company regularly relies on capital markets for the issuance of long-term debt instruments, commercial paper and bank financing from time to time. Instability or disruptions of the capital markets, including credit markets, or the deterioration of the Company’s financial condition due to internal or external factors, could restrict or prohibit access and could increase financing costs. A significant deterioration of the Company’s financial condition could also reduce credit ratings and could limit or affect its access to external sources of capital and increase the costs of short and long-term debt financing.\nCSX 2020 Form 10-K p.11\nCSX CORPORATION\nPART I\nClimate Change and Environmental\nThe Company’s operations and financial results could be negatively impacted by climate change and regulatory and legislative responses to climate change.\nThere is potential for operational impacts from changing weather patterns or rising sea levels in the Company's operational territory, which could impact the Company's network or other assets. Climate change and other emissions-related laws and regulations have been proposed and, in some cases adopted, on the federal, state, provincial and local levels. These final and proposed laws and regulations take the form of restrictions, caps, taxes or other controls on emissions. In particular, the EPA has issued various regulations and may issue additional regulations targeting emissions, including rules and standards governing emissions from certain stationary sources and from vehicles.\nAny of these pending or proposed laws or regulations, including any proposed or implemented under the Biden administration, could adversely affect the Company's operations and financial results by, among other things: (i) reducing coal-fired electricity generation due to mandated emission standards; (ii) reducing the consumption of coal as a viable energy resource in the United States and Canada; (iii) increasing the Company's fuel, capital and other operating costs and negatively affecting operating and fuel efficiencies; and (iv) making it difficult for the Company's customers in the U.S. and Canada to produce products in a cost competitive manner. Any of these factors could reduce the amount of shipments the Company handles and have a material adverse effect on the Company's financial condition, results of operations or liquidity.\nThe Company is subject to environmental laws and regulations that may result in significant costs.\nThe Company is subject to wide-ranging federal, state, provincial and local environmental laws and regulations concerning, among other things, emissions into the air, ground and water; the handling, storage, use, generation, transportation and disposal of waste and other materials; the clean-up of hazardous material and petroleum releases and the health and safety of our employees. If the Company violates or fails to comply with these laws and regulations, CSX could be fined or otherwise sanctioned by regulators. The Company can also be held liable for consequences arising out of human exposure to any hazardous substances for which CSX is responsible. In certain circumstances, environmental liability can extend to formerly owned or operated properties, leased properties, adjacent properties and properties owned by third parties or Company predecessors, as well as to properties currently owned, leased or used by the Company.\nThe Company has been, and may in the future be, subject to allegations or findings to the effect that it has violated, or is strictly liable under, environmental laws or regulations, and such violations can result in the Company's incurring fines, penalties or costs relating to the cleanup of environmental contamination. Although the Company believes it has appropriately recorded current and long-term liabilities for known and reasonably estimable future environmental costs, it could incur significant costs that exceed reserves or require unanticipated cash expenditures as a result of any of the foregoing. The Company also may be required to incur significant expenses to investigate and remediate known, unknown or future environmental contamination.\nCSX 2020 Form 10-K p.12\nCSX CORPORATION\nPART I\nAvailability of Critical Supplies and Labor\nDisruption to a key railroad industry supplier could negatively affect operating efficiency and increase costs.\nThe capital intensive and unique nature of core rail equipment (including rail, ties, rolling stock equipment and locomotives) limits the number of railroad equipment suppliers. If any of the current manufacturers stops production or experiences a supply shortage, CSXT could experience a significant cost increase or material shortage. In addition, a few critical railroad suppliers are foreign and, as such, adverse developments in international relations, new trade regulations, disruptions in international shipping or increases in global demand could make procurement of these supplies more difficult or increase CSXT's costs. Additionally, if a fuel supply shortage were to arise, the Company would be negatively impacted.\nFailure to complete negotiations on collective bargaining agreements could result in strikes and/or work stoppages.\nMost of CSX's employees are represented by labor unions and are covered by collective bargaining agreements. These agreements are either bargained for nationally by the National Carriers Conference Committee or locally between CSX and the union. Such agreements are negotiated over the course of several years and previously have not resulted in any extended work stoppages. Under the Railway Labor Act's procedures (which include mediation, cooling-off periods and the possibility of an intervention by the President of the United States), during negotiations neither party may take action until the procedures are exhausted. If, however, CSX is unable to negotiate acceptable agreements, the employees covered by the Railway Labor Act could strike, which could result in loss of business and increased operating costs as a result of higher wages or benefits paid to union members.\nThe unavailability of critical resources could adversely affect the Company’s operational efficiency and ability to meet demand.\nMarketplace conditions for resources like locomotives as well as the availability of qualified personnel, particularly engineers and conductors, could each have a negative impact on the Company’s ability to meet demand for rail service. Although the Company believes that it has adequate resources and personnel for the current business environment, unpredictable increases in demand for rail services or extreme weather conditions may exacerbate such risks, which could have a negative impact on the Company’s operational efficiency and otherwise have a material adverse effect on the Company’s financial condition, results of operations, or liquidity in a particular period.",
    "item_1B": "Item 1B. Unresolved Staff Comments\nNone\nCSX 2020 Form 10-K p.13\nCSX CORPORATION\nPART I",
    "item_1C": "",
    "item_2": "Item 2. Properties\nThe Company’s properties primarily consist of track and its related infrastructure, locomotives and freight cars and equipment. These categories and the geography of the network are described below.\nTrack and Infrastructure\nServing 23 states, the District of Columbia, and the Canadian provinces of Ontario and Quebec, the CSXT rail network serves, among other markets, New York, Philadelphia and Boston in the Northeast and Mid-Atlantic, the southeast markets of Atlanta, Miami and New Orleans, and the midwestern markets of St. Louis, Memphis and Chicago.\nCSXT’s track structure includes mainline track, connecting terminals and yards, track within terminals and switching yards, sidings used for passing trains, track connecting CSXT's track to customer locations and track that diverts trains from one track to another known as turnouts. Total track miles, which reflect the size of CSXT’s network that connects markets, customers and western railroads, are greater than CSXT’s approximately 19,500 route miles. At December 2020, the breakdown of track miles was as follows:\nTrack\nMiles\nSingle mainline track 19,605\nOther mainline track 5,695\nTerminals and switching yards 9,289\nPassing sidings and turnouts 896\nTotal 35,485\nIn addition to its physical track structure, the Company operates numerous yards and terminals for rail and intermodal service. These serve as points of connectivity between the Company and its local customers and as sorting facilities where railcars and intermodal containers are received, classed for destination and placed onto outbound trains, or arrive and are delivered to the customer. The Company’s largest yards and terminals based on 2020 volume (number of railcars or intermodal containers processed) are listed below.\nYards and Terminals Annual Volume\nWaycross, GA 907,445\nBedford Park Intermodal Terminal (Chicago) 896,474\nNashville, TN 653,643\nAvon, IN (Indianapolis) 626,868\nCincinnati, OH 603,773\nSelkirk, NY 597,966\nFairburn, GA Intermodal Terminal (Atlanta) 424,377\nWalbridge, OH (Toledo) 389,169\nChicago, IL 334,743\nLouisville, KY 296,277\nCSX 2020 Form 10-K p.14\nCSX CORPORATION\nPART I\nNetwork Geography\nCSXT’s operations are primarily focused on four major transportation networks and corridors that are defined geographically and by commodity flows below.\nInterstate 90 (I-90) Corridor - This CSXT corridor links Chicago and the Midwest to metropolitan areas in New York and New England. This route, also known as the “waterlevel route,” has minimal hills and grades and nearly all of it has two main tracks (referred to as double track). These engineering attributes permit the corridor to support high-speed service across intermodal, automotive and merchandise commodities. This corridor is a primary route for import traffic coming from the far east through western ports moving eastward across the country, through Chicago and into the population centers in the Northeast. The I-90 Corridor is also a critical link between ports in New York, New Jersey, and Pennsylvania and consumption markets in the Midwest. This route carries goods from all three of the Company’s major markets - merchandise, intermodal and coal.\nInterstate 95 (I-95) Corridor - The CSXT I-95 Corridor connects Charleston, Jacksonville, Miami and many other cities throughout the Southeast with the heavily populated mid-Atlantic and northeastern cities of Baltimore, Philadelphia and New York. CSXT primarily transports food and consumer products, as well as metals and chemicals along this line. It is the leading rail corridor along the eastern seaboard south of the District of Columbia and provides access to major eastern ports.\nSoutheastern Corridor - This critical part of the network runs between CSXT’s western gateways of Chicago, St. Louis and Memphis through the cities of Nashville, Birmingham, and Atlanta and markets in the Southeast. The Southeastern Corridor is the premier rail route connecting these key cities, gateways, and markets and positions CSXT to efficiently handle projected traffic volumes of intermodal, automotive and general merchandise traffic. The corridor also provides direct rail service between the coal reserves of the southern Illinois basin and the demand for coal in the Southeast.\nCoal Network - The CSXT coal network connects the coal mining operations in the Appalachian mountain region and Illinois basin with industrial areas in the Southeast, Northeast and Mid-Atlantic, as well as many river, lake, and deep water port facilities. The domestic coal market has declined significantly over the last decade and export coal remains subject to a high degree of volatility. CSXT’s coal network remains well positioned to supply utility markets in both the Northeast and Southeast and to transport coal shipments for export outside of the U.S. Approximately one-quarter to one-third of export coal and the majority of the domestic coal that the Company transports is used for generating electricity or industrial purposes.\nSee the following page for a map of the CSX Rail Network. Also included on the map, CSX Operating Agreement indicates areas within which CSX can operate through trackage rights beyond the CSX network.\nCSX 2020 Form 10-K p.15\nCSX CORPORATION\nPART I\nCSX Rail Network\nCSX 2020 Form 10-K p.16\nCSX CORPORATION\nPART I\nLocomotives\nAs of December 2020, CSXT owns or long-term leases more than 3,500 locomotives. From time to time, the Company also short-term leases locomotives based on business needs. Freight locomotives are used primarily to pull trains while switching locomotives are used in yards. Auxiliary units are typically used to provide extra traction for heavy trains in hilly terrain. Of owned locomotives, approximately 66% were in active service as of December 31, 2020, and the remainder were in storage to be utilized as needed. Storing locomotives and equipment allows the Company to quickly adjust its active fleet based on demand and other factors while avoiding delays due to supply limitations or excessive lead times to acquire additional equipment. As of December 2020, CSXT’s fleet of owned or long-term leased locomotives consisted of the following types:\nLocomotives % Average Age\n(years)\nFreight 3,142 89 % 21\nSwitching 219 6 % 42\nAuxiliary units 178 5 % 28\nTotal locomotives 3,539 100 % 21\nEquipment\nThe Company owns or long-term leases equipment, including several types of freight cars and intermodal containers. Of total owned and long-term leased equipment, approximately 77% was in active service as of December 31, 2020, and the remainder were in storage to be utilized as needed. As of December 2020, the Company’s owned and long-term leased equipment consisted of the following:\nEquipment Number of Units %\nGondolas 18,656 37 %\nMulti-level flat cars 11,161 22 %\nCovered hoppers 7,832 16 %\nOpen-top hoppers 6,970 14 %\nBox cars 4,247 9 %\nFlat cars 658 1 %\nOther cars 242 1 %\nSubtotal freight cars 49,766 100 %\nContainers 17,434\nTotal equipment 67,200\nAt any time, over half of the railcars on the CSXT system are not owned or leased by the Company. Examples of these include railcars owned by other railroads (which are utilized by CSXT), shipper-furnished or private cars (which are generally used only in that shipper’s service), multi-level railcars used to transport automobiles (which are shared between railroads) and double-stack railcars, or well cars (which are industry pooled), that allow for two intermodal containers to be loaded one above the other.\nCSX 2020 Form 10-K p.17\nCSX CORPORATION\nPART I\nThe Company’s revenue-generating equipment, either owned or long-term leased, consists of freight cars and containers as described below.\nGondolas - Support CSXT’s metals markets and provide transport for woodchips and other bulk commodities. Some gondolas are equipped with special hoods for protecting products like coil and sheet steel.\nMulti-level flat cars - Transport finished automobiles and are differentiated by the number of levels: bi-levels for large vehicles such as pickup trucks and SUVs and tri-levels for sedans and smaller automobiles.\nCovered hoppers - Have a permanent roof and are segregated based upon commodity density. Lighter bulk commodities such as grain, fertilizer, flour, salt, sugar, clay and lime are shipped in large cars called jumbo covered hoppers. Heavier commodities like cement, ground limestone and industrial sand are shipped in small cube covered hoppers.\nOpen-top hoppers - Transport heavy dry bulk commodities such as coal, coke, stone, sand, ores and gravel that are resistant to weather conditions.\nBox cars - Include a variety of tonnages, sizes, door configurations and heights to accommodate a wide range of finished products, including paper, auto parts, appliances and building materials. Insulated box cars deliver food products, canned goods, beer and wine.\nFlat cars - Used for shipping intermodal containers and trailers or bulk and finished goods, such as lumber, pipe, plywood, drywall and pulpwood.\nOther cars - Primarily leased refrigerator cars and slab steel cars.\nContainers - Weather-proof boxes used for bulk shipment of freight.",
    "item_3": "Item 3. Legal Proceedings\nFor further details, please refer to Note 8. Commitments and Contingencies of this annual report on Form 10-K.",
    "item_4": "Item 4. Mine Safety Disclosure\nNot Applicable\nCSX 2020 Form 10-K p.18\nCSX CORPORATION\nPART I\nExecutive Officers of the Registrant\nExecutive officers of the Company are elected by the CSX Board of Directors and generally hold office until the next annual election of officers. There are no family relationships or any arrangement or understanding between any officer and any other person pursuant to which such officer was elected. As of the date of this filing, the executive officers’ names, ages and business experience are:\nName and Age Business Experience During Past Five Years\nJames M. Foote, 67\nPresident and Chief Executive Officer\nFoote has served as President and Chief Executive Office since December 2017. He joined CSX in October 2017 as Chief Operating Officer, with responsibility for both operations and sales and marketing.\nMr. Foote has more than 40 years of railroad industry experience. Most recently, he was President and Chief Executive Officer of Bright Rail Energy. Before heading Bright Rail, he was Executive Vice President, Sales and Marketing with Canadian National Railway Company. At Canadian National, Mr. Foote also served as Vice President - Investor Relations and Vice President Sales and Marketing - Merchandise.\nKevin S. Boone, 43\nExecutive Vice President and Chief Financial Officer\nBoone was named Executive Vice President and Chief Financial Officer in October 2019 after serving as Interim Chief Financial Officer since May 2019. In this role, he is responsible for all financial aspects of the Company's business including financial and economic analysis, accounting, tax, treasury, real estate and purchasing activities.\nMr. Boone has more than 19 years of experience in finance, accounting, mergers and acquisitions, and transportation performance analysis. He joined CSX in September 2017 as Vice President of Corporate Affairs and Chief Investor Relations Officer and was later named Vice President, Marketing and Strategy leading research and data analysis to advance growth strategies for CSX. Before joining CSX in 2017, Mr. Boone worked as a Senior Equity Research Analyst at Janus Capital. He also served as a Vice President at Morgan Stanley in equity research and an associate at Merrill Lynch in the mergers and acquisitions group.\nJamie J. Boychuk, 43\nExecutive Vice President of Operations\nBoychuk has served as CSXT's Executive Vice President of Operations since October 2019. In this role, he is responsible for mechanical, engineering, transportation and network operations, including terminals.\nSince joining CSXT in 2017, he has held the positions of Senior Vice President of Network, Engineering, Mechanical and Intermodal Operations; Vice President of Scheduled Railroading; and Assistant Vice President of Transportation Support. Mr. Boychuk previously worked at Canadian National Railway, where he served for 20 years in various operational roles of increasing responsibility, including sub-region General Manager.\nNathan D. Goldman, 63\nExecutive Vice President and Chief Legal Officer\nGoldman has served as Executive Vice President and Chief Legal Officer, and Corporate Secretary of CSX since November 2017. In this role, he directs the Company’s legal affairs, government relations, corporate communications, risk management, public safety, environmental, and audit functions.\nDuring his 17 years with the Company, Mr. Goldman has previously served as Vice President of Risk Compliance and General Counsel and has overseen work in compliance, risk management and safety programs.\nCSX 2020 Form 10-K p.19\nCSX CORPORATION\nPART I\nName and Age Business Experience During Past Five Years\nDiana B. Sorfleet, 56\nExecutive Vice President and Chief Administrative Officer\nSorfleet was named Executive Vice President and Chief Administrative Officer in July 2018. In this role, her responsibilities include human resources, information technology, labor relations, people systems and analytics, total rewards and aviation.\nDuring her 9 years with the Company, Ms. Sorfleet has previously served as Chief Human Resources Officer. Prior to joining CSX, she worked in human resources for 20 years.\nMark K. Wallace, 51\nExecutive Vice President and Chief Sales & Marketing Officer\nWallace has served as Executive Vice President of Sales and Marketing since July 2018. In his current role, Mr. Wallace is responsible for the commercial organization. He joined the Company in March 2017 and previously served as Executive Vice President and Chief Administrative Officer and Executive Vice President of Corporate Affairs and Chief of Staff to the CEO.\nPrior to joining CSX, he served as the Vice President of Corporate Affairs at Canadian Pacific Railway Limited with responsibility for the corporate communications and public affairs, investor relations, facilities and real estate functions. Prior to his time at Canadian Pacific, Mr. Wallace spent more than 15 years in various senior management positions with Canadian National Railway Company.\nAngela C. Williams, 46\nVice President and Chief Accounting Officer\nWilliams has served as Vice President and Chief Accounting Officer of CSX since March 2018. She is responsible for financial and regulatory reporting, freight billing and collections, payroll, accounts payable and various other accounting processes.\nDuring her 17 years with the Company, she previously served as Assistant Vice President - Assistant Controller and in other various accounting roles. With more than 24 years of experience, Williams held various accounting and auditing positions prior to joining CSX. Ms. Williams is a Certified Public Accountant.\nCSX 2020 Form 10-K p.20\nCSX CORPORATION\nPART II",
    "item_5": "Item 5. Market for Registrant’s Common Equity, Related Stockholder Matters and Issuer Purchases of Equity Securities\nMarket Information\nCSX’s common stock is listed on the Nasdaq Global Select Market, which is its principal trading market, and is traded over-the-counter and on exchanges nationwide. The official trading symbol is “CSX.”\nDescription of Common and Preferred Stock\nA total of 1.8 billion shares of common stock are authorized, of which 762,529,119 shares were outstanding as of December 31, 2020. Each share is entitled to one vote in all matters requiring a vote of shareholders. There are no preemptive rights, which are privileges extended to select shareholders that would allow them to purchase additional shares before other members of the general public in the event of an offering. At January 31, 2021, the latest practicable date that is closest to the filing date, there were 24,100 common stock shareholders of record. The weighted average of common shares outstanding, which was used in the calculation of diluted earnings per share, was 768 million as of December 31, 2020. (See Note 2, Earnings Per Share.) A total of 25 million shares of preferred stock is authorized, none of which is currently outstanding.\nThe following table sets forth, for the quarters indicated, the dividends declared on CSX common stock.\nQuarter\n1st 2nd 3rd 4th Year\n2020 $ 0.26 $ 0.26 $ 0.26 $ 0.26 $ 1.04\n2019 $ 0.24 $ 0.24 $ 0.24 $ 0.24 $ 0.96\nStock Performance Graph\nThe cumulative shareholder returns, assuming reinvestment of dividends, on $100 invested at December 31, 2015 are illustrated on the graph below. The Company references the Standard & Poor's 500 Stock Index (“S&P 500 ®”), and the Dow Jones U.S. Transportation Average Index, which provide comparisons to a broad-based market index and other companies in the transportation industry.\nCSX 2020 Form 10-K p.21\nCSX CORPORATION\nPART II\nCSX Purchases of Equity Securities\nThe Company continues to repurchase shares under the $5 billion program announced in January 2019. On October 21, 2020, the Company announced a new, incremental $5 billion share repurchase program. For more information about share repurchases, see Note 2 Earnings Per Share. Share repurchase activity of $203 million for the fourth quarter 2020 was as follows:\nCSX Purchases of Equity Securities for the Quarter\nFourth Quarter Total Number of Shares Purchased\nAverage Price Paid per Share Total Number of Shares Purchased as Part of Publicly Announced Plans or Programs(a)\nApproximate Dollar Value of Shares that May Yet Be Purchased Under the Plans or Programs\nBeginning Balance $ 1,092,188,096\nOctober 1 - October 31, 2020 978,384 $ 78.51 978,384 6,015,375,220\nNovember 1 - November 30, 2020 348,885 78.81 334,275 5,989,233,126\nDecember 1 - December 31, 2020 1,110,784 90.03 1,110,784 5,889,233,126\nEnding Balance 2,438,053 $ 83.80 2,423,443 $ 5,889,233,126\n(a) The difference between the \"Total Number of Shares Purchased\" and the \"Total Number of Shares Purchased as Part of Publicly Announced Plans or Programs\" of 14,610 shares for the quarter represents shares purchased to fund the Company's contribution to a 401(k) plan that covers certain union employees.",
    "item_6": "Item 6. Selected Financial Data\nNot Applicable\nCSX 2020 Form 10-K p.22\nCSX CORPORATION\nPART II",
    "item_7": "Item 7. Management's Discussion and Analysis of Financial Condition and Results of Operations\nTERMS USED BY CSX\nWhen used in this report, unless otherwise indicated by the context, these terms are used to mean the following:\nCar hire - A charge paid by one railroad for its use of cars belonging to another railroad or car owner.\nClass I freight railroad - One of the largest line haul freight railroads as determined based on operating revenue; the exact revenue required to be in each class is periodically adjusted for inflation by the Surface Transportation Board. Smaller railroads are classified as Class II or Class III.\nCommon carrier mandate - A federal mandate that requires U.S. railroads to accommodate reasonable requests from shippers to carry any freight, including hazardous materials.\nDemurrage - A charge assessed by railroads for the use of rail cars by shippers or receivers of freight beyond a specified free time.\nDepartment of Transportation (\"DOT\") - A U.S. government agency with jurisdiction over matters of all modes of transportation.\nDepreciation study - Conducted by a third-party specialist and analyzed by management, a periodic statistical analysis of fixed asset service lives, salvage values, accumulated depreciation, and other factors for group assets along with a comparison of similar asset groups at other companies.\nDouble-stack - Stacking containers two-high on specially equipped cars.\nEnvironmental Protection Agency (“EPA”) - A U.S. government agency that has regulatory authority with respect to environmental law.\nFederal Railroad Administration (\"FRA\") - The branch of the DOT that is responsible for developing and enforcing railroad safety regulations, including safety standards for rail infrastructure and equipment.\nFree cash flow - The calculation of a non-GAAP measure by using net cash provided by operating activities and adjusting for property additions and certain other investing activities. Free cash flow is a measure of cash available for paying dividends, share repurchases and principal reduction on outstanding debt.\nGroup-life depreciation - A type of depreciation in which assets with similar useful lives and characteristics are aggregated into groups. Instead of calculating depreciation for individual assets, depreciation is calculated as a whole for each group.\nIncidental revenue - Revenue for switching, demurrage, storage, etc.\nIntermodal - A flexible way of transporting freight over highway, rail and water without being removed from the original transportation equipment, namely a container or trailer.\nMainline - The main track thoroughfare, exclusive of terminals, yards, sidings and turnouts.\nCSX 2020 Form 10-K p.23\nCSX CORPORATION\nPART II\nPipeline and Hazardous Materials Safety Administration (“PHMSA”) - An agency within the DOT that, together with the FRA, has broad jurisdiction over railroad operating standards and practices, including hazardous materials requirements.\nPositive Train Control (\"PTC\") - An interoperable train control system designed to prevent train-to-train collisions, over-speed derailments, incursions into established work-zone limits, and train diversions onto another set of tracks.\nRevenue adequacy - The achievement of a rate of return on investment at least equal to the industry cost of investment capital, as measured by the STB.\nShipper - A customer shipping freight via rail.\nSiding - Track adjacent to the mainline used for passing trains.\nStaggers Act of 1980 - Congressional law that significantly deregulated the rail industry, replacing the regulatory structure in existence since the 1887 Interstate Commerce Act. Where previously rates were controlled by the Interstate Commerce Commission, the Staggers Act allowed railroads to establish their own rates for shipments, enhancing their ability to compete with other modes of transportation.\nSurface Transportation Board (\"STB\") - An independent governmental adjudicatory body administratively housed within the DOT, responsible for the economic regulation of interstate surface transportation within the United States.\nSwitching - Putting cars in a specific order, placing cars for loading, retrieving empty cars or adding or removing cars from a train at an intermediate point.\nTerminal - A facility, typically owned by a railroad, for the handling of freight and for the breaking up, making up, forwarding and servicing of trains.\nTransportation Security Administration (“TSA”) - A component of the Department of Homeland Security with broad authority over railroad operating practices that may have homeland security implications.\nTTX Company (\"TTX\") - A company that provides its owner-railroads with standardized fleets of intermodal, automotive and general use railcars at time and mileage rates. CSX owns about 20 percent of TTX's common stock, and the remainder is owned by the other leading North American railroads and their affiliates.\nTurnout - A track that diverts trains from one track to another.\nYard - A system of tracks, other than main tracks and sidings, used for making up trains, storing cars and other purposes.\nCSX 2020 Form 10-K p.24\nCSX CORPORATION\nPART II\n2020 HIGHLIGHTS\n• Revenue of $10.6 billion decreased $1.4 billion or 11% versus the prior year.\n• Expenses of $6.2 billion decreased $751 million or 11% year over year.\n• Operating income of $4.4 billion decreased $603 million or 12% year over year.\n• Operating ratio of 58.8% increased 40 basis points from 58.4%.\n• Earnings per diluted share of $3.60 decreased $0.57 or 14% year over year.\nRESULTS OF OPERATIONS\n2020 vs. 2019 Results of Operations\nFiscal Years\n2020 2019 $\nChange %\nChange\n(Dollars in Millions)\nRevenue $ 10,583 $ 11,937 $ (1,354) (11) %\nExpense\nLabor and Fringe 2,275 2,616 341 13\nMaterials, Supplies and Other 1,684 1,749 65 4\nDepreciation 1,383 1,349 (34) (3)\nFuel 541 906 365 40\nEquipment and Other Rents 338 352 14 4\nTotal Expense 6,221 6,972 751 11\nOperating Income 4,362 4,965 (603) (12)\nInterest Expense (754) (737) (17) (2)\nOther Income - Net 19 88 (69) (78)\nIncome Tax Expense (862) (985) 123 12\nNet Earnings $ 2,765 $ 3,331 $ (566) (17)\nEarnings Per Diluted Share:\nNet Earnings $ 3.60 $ 4.17 $ (0.57) (14) %\nOperating Ratio 58.8 % 58.4 % (40) bps\nCSX 2020 Form 10-K p.25\nCSX CORPORATION\nPART II\nGlobal economic uncertainty, including the effects of COVID-19 global pandemic, continues to impact the Company's results of operations. Demand for rail services saw large and rapid declines in the first half of the year, followed by steep sequential increases in the second half, but the effects of the disruption of global manufacturing, supply chains and consumer spending as a result of the COVID-19 pandemic are ongoing. While operating cash flows have also been impacted by these economic conditions, the Company maintains a strong cash balance and access to committed funding sources and other sources of external liquidity if required. As this is a dynamic situation, it is difficult to determine the future impacts of the pandemic. The full implications of COVID-19, including the extent of its impact on the Company’s financial and operating results, will be determined by the length of time that the pandemic continues, its effect on the demand for the Company’s transportation services and the supply chain, as well as the effect of governmental regulations imposed in response to the pandemic. The duration of the pandemic is dependent on several factors, including the timing of vaccine production and distribution as well as the impacts of virus mutations and case resurgences across the country.\nCSX employees that provide efficient and reliable rail service are essential to keeping supply chains fluid in response to this challenge. Accordingly, business operations have been modified to ensure the safety of employees across the network while continuing to provide a high level of service to customers. A cross-functional task force monitors and coordinates the Company’s response to COVID-19. Policies and procedures established to protect the health and safety of employees and customers and to safeguard CSX operations include rigorous cleaning regimens for equipment and facilities, provision of sanitation supplies, distribution of disposable face coverings, facilitation of social distancing measures and administration of temperature testing at certain facilities. These precautions remain in place despite the easing of pandemic restrictions by state and local governments across the network. Additionally, remote work arrangements have been made where possible in order to reduce the density of employees in a single location, and alternative locations for key functions, such as dispatch, are being utilized as needed.\nIn March 2020, the Coronavirus Aid, Relief, and Economic Security Act (“CARES Act”) was enacted to provide relief to businesses in response to the COVID-19 pandemic. The most significant remaining impact to the Company is the deferral of certain payroll tax payments to 2021 and 2022. The provisions of the CARES Act are not expected to have an impact on CSX’s results of operations or effective tax rate.\nCSX 2020 Form 10-K p.26\nCSX CORPORATION\nPART II\nVolume and Revenue (Unaudited)\nVolume (Thousands of units); Revenue (Dollars in Millions); Revenue Per Unit (Dollars)\nVolume Revenue Revenue Per Unit\n2020 2019 % Change 2020 2019 % Change 2020 2019 % Change\nChemicals(a)\n664 670 (1) % $ 2,309 $ 2,349 (2) % $ 3,477 $ 3,506 (1) %\nAgricultural and Food Products 463 469 (1) % 1,386 1,410 (2) % 2,994 3,006 - %\nAutomotive 344 456 (25) % 920 1,236 (26) % 2,674 2,711 (1) %\nMinerals(a)\n321 337 (5) % 538 559 (4) % 1,676 1,659 1 %\nForest Products(a)\n270 283 (5) % 824 862 (4) % 3,052 3,046 - %\nMetals and Equipment(a)\n239 249 (4) % 675 742 (9) % 2,824 2,980 (5) %\nFertilizers 234 243 (4) % 424 431 (2) % 1,812 1,774 2 %\nTotal Merchandise 2,535 2,707 (6) % 7,076 7,589 (7) % 2,791 2,803 - %\nIntermodal 2,720 2,670 2 % 1,702 1,760 (3) % 626 659 (5) %\nCoal 637 843 (24) % 1,397 2,070 (33) % 2,193 2,456 (11) %\nOther - - - % 408 518 (21) % - - - %\nTotal 5,892 6,220 (5) % $ 10,583 $ 11,937 (11) % $ 1,796 $ 1,919 (6) %\n(a) In first quarter 2020, changes were made in the categorization of certain lines of business, impacting Chemicals, Minerals, Forest Products, and Metals and Equipment. The impacts were not material and prior periods have been reclassified to conform to the current presentation.\nCSX 2020 Form 10-K p.27\nCSX CORPORATION\nPART II\nRevenue\nThe COVID-19 pandemic significantly impacted overall volume in 2020. Total revenue decreased $1.4 billion, in 2020 or 11%, when compared to the previous year due to declines in coal, lower merchandise volumes, decreases in fuel recovery and lower other revenue. These decreases were partially offset by pricing increases in merchandise and volume and pricing increases in intermodal.\nMerchandise Volume\nChemicals - Declined due to reduced frac sand and waste shipments, partially offset by growth in plastics shipments.\nAgricultural and Food Products - Decreased due to lower shipments of feed grain as well as food and consumer products, partially offset by growth in sweeteners and oils.\nAutomotive - Declined due to lower North American vehicle production.\nMinerals - Decreased due to lower shipments for aggregates and other minerals.\nForest Products - Declined due to lower shipments of printing paper and building products, partially offset by higher pulpboard shipments.\nMetals and Equipment - Declined due to lower metals shipments, primarily in the steel, construction and scrap markets, as well as reduced equipment shipments.\nFertilizers - Declined due to reduced short-haul phosphate shipments.\nIntermodal Volume\nIncreases in both domestic and international shipments resulted from tightening truck capacity and inventory replenishments in the second half of the year and growth in rail volumes from east coast ports.\nCoal Volume\nDomestic coal declined primarily due to lower shipments of utility coal as a result of continued competition from natural gas and reduced electrical demand, as well as lower steel and industrial shipments due to lower industrial production. Export coal declined due to reduced international shipments of thermal and metallurgical coal as a result of lower global benchmark prices.\nOther\nOther revenue decreased $110 million versus prior year primarily due to lower affiliate revenue, lower revenue for demurrage and a favorable contract settlement with a customer in the prior year.\nCSX 2020 Form 10-K p.28\nCSX CORPORATION\nPART II\nExpense\nIn 2020, total expenses decreased $751 million, or 11%, compared to prior year. Descriptions of each expense category as well as significant year-over-year changes are described below.\nLabor and Fringe expenses include employee wages and related payroll taxes, health and welfare costs, pension, other post-retirement benefits and incentive compensation. These expenses decreased $341 million due to the following items:\n•Efficiency and volume savings of $288 million primarily resulted from structural changes to the train plan that resulted in reduced crew starts as well as lower headcount.\n•Incentive compensation decreased $86 million primarily due to lower expected annual incentive payouts as well as higher prior year accelerated stock compensation expense for certain retirement-eligible employees.\n•Other costs increased $33 million primarily due to inflation and several other non-significant items, including severance costs.\nMaterials, Supplies and Other expenses consist primarily of contracted services to maintain infrastructure and equipment, terminal and pier services and professional services. This category also includes costs related to materials, travel, casualty claims, environmental remediation, train accidents, property and sales tax, utilities and other items including gains on property dispositions. Total materials, supplies and other expenses decreased $65 million driven by the following:\n•Efficiency and volume savings of $185 million primarily resulted from lower operating support costs, lower terminal costs as a result of record productivity levels at intermodal terminals, and reduced equipment maintenance expenses.\n•Gains from real estate and line sales were $35 million in 2020 compared to $151 million in 2019.\n•All other costs increased $4 million primarily due to inflation and other non-significant costs that were mostly offset by a $22 million non-railroad asset impairment in the prior year related to an intermodal terminal sale agreement.\nDepreciation expense primarily relates to recognizing the costs of capital assets, such as locomotives, railcars and track structure, over their respective useful lives, which are reviewed periodically as part of depreciation studies. This expense is impacted primarily by the capital expenditures made each year. Depreciation expense increased $34 million primarily due to the impacts of the 2019 equipment depreciation study as well as a larger net asset base.\nFuel expense includes locomotive diesel fuel as well as non-locomotive fuel. This expense is largely driven by the market price and locomotive consumption of diesel fuel. Fuel expense decreased $365 million primarily due to a 31% price decrease that drove savings of $243 million, volume savings and a 5% improvement in fuel efficiency.\nEquipment and Other expenses include rent paid for freight cars owned by other railroads or private companies, net of rents received by CSXT for use of its equipment. This category of expenses also includes expenses for short-term and long-term leases of locomotives, railcars, containers and trailers, offices and other rentals. These expenses decreased $14 million primarily due to volume savings, partially offset by higher days per load for automotive and other merchandise markets that resulted in increased car hire costs.\nCSX 2020 Form 10-K p.29\nCSX CORPORATION\nPART II\nInterest Expense\nInterest Expense includes interest on long-term debt, equipment obligations and finance leases. Interest expense increased $17 million as higher average debt balances were partially offset by lower average rates.\nOther Income - Net\nOther Income - Net includes investment gains, losses and interest income, as well as components of net periodic pension and post-retirement benefit cost and other non-operating activities. Other income decreased $69 million primarily due to a $38 million increase in debt repurchase expense and decreased interest income driven by lower interest rates, partially offset by higher average cash and short-term investment balances.\nIncome Tax Expense\nIncome Tax Expense decreased $123 million primarily due to lower earnings before income taxes, partially offset by lower tax benefits from the impacts of stock option exercises and the vesting of other equity awards as well as prior year benefits from the resolution of certain state tax matters.\nNet Earnings and Earnings per Diluted Share\nNet Earnings decreased $566 million to $2.8 billion, and earnings per diluted share decreased $0.57 to $3.60, due to the factors mentioned above. Average shares outstanding was lower as a result of share repurchase activity during the year and had a favorable impact on earnings per diluted share.\n2019 vs. 2018 Results of Operations\nSee discussion of 2019 results of operations compared to 2018 results of operations in Part II, Item 7, Management’s Discussion and Analysis of Financial Condition and Results of Operations in the Company's Annual Report on Form 10-K for the year ended December 31, 2019.\nCSX 2020 Form 10-K p.30\nCSX CORPORATION\nPART II\nNon-GAAP Measures - Unaudited\nCSX reports its financial results in accordance with United States generally accepted accounting principles (\"GAAP\"). CSX also uses certain non-GAAP measures that fall within the meaning of Securities and Exchange Commission Regulation G and Regulation S-K Item 10(e), which may provide users of the financial information with additional meaningful comparison to prior reported results. Non-GAAP measures do not have standardized definitions and are not defined by GAAP. Therefore, CSX’s non-GAAP measures are unlikely to be comparable to similar measures presented by other companies. The presentation of these non-GAAP measures should not be considered in isolation from, as a substitute for, or as superior to the financial information presented in accordance with GAAP. Reconciliations of non-GAAP measures to corresponding GAAP measures are below.\nFree Cash Flow\nManagement believes that free cash flow is useful to investors as it is important in evaluating the Company’s financial performance. More specifically, free cash flow measures cash generated by the business after reinvestment. This measure represents cash available for both equity and bond investors to be used for dividends, share repurchases or principal reduction on outstanding debt. Free cash flow is calculated by using net cash from operations and adjusting for property additions and certain other investing activities, which includes proceeds from property dispositions. This measure should be considered in addition to, rather than a substitute for, cash provided by operating activities. Free cash flow before dividends decreased $832 million year-over-year to $2.6 billion primarily due to lower net cash provided by operating activities and lower proceeds from property dispositions.\nThe following table reconciles cash provided by operating activities (GAAP measure) to free cash flow and adjusted free cash flow (both non-GAAP measures).\nFiscal Years\n2020 2019\n(Dollars in Millions)\nNet cash provided by operating activities (a)\n$ 4,263 $ 4,850\nProperty additions (1,626) (1,657)\nOther investing activities (b)\n9 285\nFree Cash Flow, before dividends (non-GAAP) $ 2,646 $ 3,478\n(a) Net cash provided by operating activities for the year ended December 31, 2020, includes the impact of $21 million paid to settle a liability for non-controlling interest in an affiliate.\n(b) For the year ended December 31, 2020, certain other investing activities used in the calculation of free cash flow do not include the impact of a $30 million deposit paid by the Company related to its signed definitive agreement to acquire Pan Am Railways, Inc. This transaction remains subject to regulatory review and approval by the Surface Transportation Board. This deposit is included in the other investing activities total on the consolidated cash flow statement for the year ended December 31, 2020.\nCSX 2020 Form 10-K p.31\nCSX CORPORATION\nPART II\nOperating Statistics (Estimated)\nFiscal Years\n2020 2019 Improvement/\n(Deterioration)\nOperations Performance\nTrain Velocity (Miles per hour)(a)\n20.2 20.5 (1) %\nDwell (Hours)(a)\n9.3 8.6 (8) %\nCars Online 112,718 117,562 4 %\nRevenue Ton-Miles (Billions)\nMerchandise 124.4 128.0 (3) %\nIntermodal 28.1 26.9 4 %\nCoal 30.1 41.1 (27) %\nTotal Revenue Ton-Miles 182.6 196.0 (7) %\nTotal Gross Ton-Miles (Billions)\n358.3 388.3 (8) %\nOn-Time Originations 87 % 89 % (2) %\nOn-Time Arrivals 77 % 79 % (3) %\nSafety\nFRA Personal Injury Frequency Index 0.81 0.90 10 %\nFRA Train Accident Rate 2.76 2.35 (17) %\n(a) The methodologies for calculating train velocity, dwell and cars online differ from those prescribed by the STB as the Company believes these numbers more accurately reflect railroad performance. CSXT will continue to report these metrics, using the prescribed methodology, to the STB on a weekly basis. See additional discussion on the Company's website.\nCertain operating statistics are estimated and can continue to be updated as actuals settle.\nKey Performance Measures Definitions:\nTrain Velocity - Average train speed between origin and destination in miles per hour (does not include locals, yard jobs, work trains or passenger trains). Train velocity measures the profiled schedule of trains (from departure to arrival and all interim time), and train profiles are periodically updated to align with a changing operation.\nDwell - Average amount of time in hours between car arrival to and departure from the yard.\nCars Online - Average number of active freight rail cars on lines operated by CSX, excluding rail cars that are being repaired, in storage, those that have been sold, or private cars dwelling at a customer location more than one day.\nRevenue Ton-Miles (RTM's) - The movement of one revenue-producing ton of freight over a distance of one mile.\nGross Ton-Miles (GTM's) - The movement of one ton of train weight over one mile. GTM's are calculated by multiplying total train weight by distance the train moved. Total train weight is comprised of the weight of the freight cars and their contents.\nOn-Time Originations - Percent of scheduled road trains that depart the origin yard on time or ahead of schedule.\nOn-Time Arrivals - Percent of scheduled road trains that arrive at the destination yard on time to within two hours of scheduled arrival.\nFRA Personal Injury Frequency Index - Number of FRA-reportable injuries per 200,000 man-hours.\nFRA Train Accident Rate - Number of FRA-reportable train accidents per million train-miles.\nThe Company is committed to continuous improvement in safety and service performance through training, innovation and investment. Training and safety programs are designed to prevent incidents that can adversely impact employees, customers and communities. Technological innovations that can detect and avoid many types of human factor incidents are designed to serve as an additional layer of protection for the Company's employees. Continued capital investment in the Company's assets, including track, bridges, signals, equipment and detection technology also supports safety performance.\nDespite operating challenges presented by the COVID-19 pandemic, the Company remained focused on safety, service and controlling costs. Train velocity was roughly in line with last year’s record performance, declining 1% relative to 2019. Dwell increased by 8% compared to last year, while cars online decreased by 4% in 2020.\nCSX 2020 Form 10-K p.32\nCSX CORPORATION\nPART II\nFrom a safety perspective, the FRA personal injury index improved 10% and train-accident rate increased 17% from the prior year. In 2020, the number of FRA reportable injuries reached a new all-time record low for the second consecutive year. The number of FRA reportable train accidents remained at a record-low level, but a reduction in train miles negatively impacted the FRA train accident rate. The Company is committed to operational and safety improvement, while remaining focused on reducing risk and enhancing the overall safety of its employees, customers and communities in which the Company operates.\nLIQUIDITY AND CAPITAL RESOURCES\nLiquidity is a company’s ability to generate adequate amounts of cash to meet both current and future needs for obligations as they mature and to provide for planned capital expenditures, including those to address regulatory and legislative requirements. To have a complete picture of a company’s liquidity, its sources and uses of cash, balance sheet and external factors should be reviewed.\nSignificant Cash Flows\nThe following charts highlight the components of the change in cash and cash equivalents for operating, investing and financing activities for full years 2020 and 2019.\nIn 2020, the Company generated $4.3 billion of cash provided by operating activities, which was $587 million lower than prior year primarily driven by lower cash-generating income and unfavorable working capital activities. Net cash used in investing activities was $649 million, a decrease in net spend of $1.5 billion from the prior year primarily as a result of higher net sales of short-term investments, partially offset by lower proceeds from property dispositions. Net cash used in financing activities was $1.4 billion, which represents a decrease in net spend of $1.2 billion from the prior year primarily driven by lower share repurchases, partially offset by lower proceeds from debt issuances and higher debt repayments.\nSources of Cash and Liquidity\nThe Company has multiple sources of liquidity, including cash generated from operations and financing sources. The Company filed a shelf registration statement with the SEC in February 2019 which is unlimited as to amount and may be used to issue debt or equity securities at CSX’s discretion, subject to market conditions and CSX Board authorization. While CSX seeks to give itself flexibility with respect to cash requirements, there can be no assurance that market conditions would permit CSX to sell such securities on acceptable terms at any given time, or at all. In 2020, CSX issued a total of $1.0 billion of new long-term debt.\nCSX 2020 Form 10-K p.33\nCSX CORPORATION\nPART II\nCSX has access to a $1.2 billion five-year unsecured revolving credit facility backed by a diverse syndicate of banks that expires in March 2024. As of December 31, 2020, the Company had no outstanding balances under this facility. See Note 10, Debt and Credit Agreements for more information. The Company also has a commercial paper program, backed by the revolving credit facility, under which the Company may issue unsecured commercial paper notes up to a maximum aggregate principal amount of $1.0 billion outstanding at any one time. As of December 31, 2020, the Company had no outstanding debt under the commercial paper program.\nUses of Cash\nCSX uses current cash balances for general corporate purposes, which may include working capital requirements, repayment of additional indebtedness outstanding from time to time, repurchases of CSX's common stock, capital investments, improvements in productivity and other cost reduction initiatives. The Company also uses cash for scheduled payments of debt and leases.\nIn 2020, CSX continued to invest in its business to create long-term value for shareholders. The Company is committed to maintaining and improving its existing infrastructure and to positioning itself for long-term, profitable growth through optimizing network and terminal capacity. Funds used for property additions are further described below.\nFiscal Years\nCapital Expenditures (Dollars in Millions)\n2020 2019\nTrack $ 858 $ 860\nBridges, Signals and Other 508 493\nTotal Infrastructure 1,366 1,353\nStrategic Projects and Commercial Facilities 143 141\nLocomotives 57 55\nRegulatory (including PTC) 39 91\nFreight Cars 21 17\nTotal Capital Expenditures $ 1,626 1,657\nPlanned capital investments for 2021 are expected to be between $1.7 billion and $1.8 billion. Of the total 2021 investment, the majority will be used to sustain the core infrastructure and the remaining amounts will be allocated to projects supporting service enhancements, productivity initiatives and profitable growth. CSX intends to fund capital investments through cash generated from operations.\nPTC implementation is complete at a total cost of $2.4 billion, which included installing new equipment along tracks, upgrading locomotives, adding communication equipment and developing new technologies. While the Company expects ongoing PTC costs, future PTC implementation costs are not expected to be material.\nCSX is continually evaluating market and regulatory conditions that could affect the Company’s ability to generate sufficient returns on capital investments. CSX may revise its future estimates for capital spending as a result of changes in business conditions, tax legislation or the enactment of new laws or regulations, which could have a material adverse effect on the Company’s operations and financial performance in the future (see Risk Factors under Item 1A of this Form 10-K).\nCSX 2020 Form 10-K p.34\nCSX CORPORATION\nPART II\nCSX is committed to returning cash to shareholders. Capital structure, capital investments and cash distributions, including dividends and share repurchases, are reviewed at least annually by the Board of Directors. On February 10, 2021, the Company's Board of Directors authorized an 8% increase in the quarterly cash dividend to $0.28 per common share. Management's assessment of market conditions and other factors guides the timing and volume of repurchases. Future share repurchases are expected to be funded by cash on hand, cash generated from operations and debt issuances.\nMaterial Changes in the Consolidated Balance Sheets and Working Capital\nCSX's balance sheet reflects its strong capital base and the impact of CSX's balanced approach in deploying capital for the benefit of its shareholders, which includes investments in infrastructure, dividend payments and share repurchases. Further, CSX is well positioned from a liquidity standpoint. The Company ended the year with $3.1 billion of cash, cash equivalents and short-term investments.\nTotal assets as well as total liabilities and shareholders' equity increased $1.5 billion from prior year end. The increase in assets was primarily due to the net increase of $1.2 billion in cash and short-term investments as well as $276 million in net property additions. The net increase in cash and short-term investments was driven by $4.3 billion in cash from operations and proceeds from the issuance of $1.0 billion of long-term debt. These increases were partially offset by property additions of $1.6 billion, share repurchases of $867 million, dividends paid of $797 million and long-term debt repayments of $745 million.\nTotal liabilities increased $289 million from prior year end primarily due to the issuance of $1.0 billion of long-term debt and a $207 million increase in deferred tax liabilities primarily driven by accelerated tax depreciation. These increases were partially offset by debt repayments of $745 million and a $234 million decrease in accounts payable primarily due to the conversion of accounts payable to Conrail into notes payable. Total shareholders' equity increased $1.2 billion from prior year end primarily driven by net earnings of $2.8 billion, partially offset by share repurchases of $867 million and dividends paid of $797 million.\nWorking capital is considered a measure of a company’s ability to meet its short-term needs. CSX had a working capital surplus of $2.4 billion at December 2020 and $1.1 billion at December 2019, an increase of $1.3 billion. The increase in current assets was primarily driven by the net increase in cash and short-term investments described above and the decrease in current liabilities was due to lower accounts payable partially offset by higher current maturities of long-term debt.\nThe Company’s working capital balance varies due to factors such as the timing of scheduled debt payments and changes in cash and cash equivalent balances. Although the Company currently has a surplus, a working capital deficit is not unusual for CSX or other companies in the industry and does not indicate a lack of liquidity. The Company continues to maintain adequate current assets to satisfy current liabilities and maturing obligations when they come due. Furthermore, CSX has sufficient financial capacity, including its revolving credit facility, commercial paper program and shelf registration statement to manage its day-to-day cash requirements and any anticipated obligations. The Company from time to time accesses the credit markets for additional liquidity.\nCSX 2020 Form 10-K p.35\nCSX CORPORATION\nPART II\nCredit Ratings\nCredit ratings reflect an independent agency’s judgment on the likelihood that a borrower will repay a debt obligation at maturity. The ratings reflect many considerations, such as the nature of the borrower’s industry and its competitive position, the size of the company, its liquidity and access to capital and the sensitivity of a company’s cash flows to changes in the economy. The two largest rating agencies, Standard & Poor’s Ratings Services (“S&P”) and Moody’s Investors Service (“Moody’s”), use alphanumeric codes to designate their ratings. The highest quality rating for long-term credit obligations is AAA and Aaa for S&P and Moody’s, respectively. A credit rating is not a recommendation to buy, sell or hold securities and may be subject to revision or withdrawal at any time by the assigning rating agency.\nThe cost and availability of unsecured financing are materially affected by CSX's long-term credit ratings. CSX's credit ratings remained stable during 2020. As of December 2020 and December 2019, S&P's long-term rating on CSX was BBB+ (Stable), and Moody's was Baa1 (Stable). Ratings of BBB- and Baa3 or better by S&P and Moody’s, respectively, reflect ratings on debt obligations that fall within a band of credit quality considered to be investment grade. If CSX's credit ratings were to decline to below investment-grade levels, the Company could experience significant increases in its interest cost for new debt. In addition, a decline in CSX’s credit ratings to below investment grade levels could adversely affect the market’s demand, and thus the Company’s ability to readily issue new debt. The Company is committed to maintaining an investment-grade credit profile.\nGuaranteed Notes Issued By CSXT\nIn March 2020, the SEC adopted amendments to reduce and simplify the financial disclosure requirements for guarantors and issuers of guaranteed registered securities effective January 4, 2021, with early voluntary compliance permitted. CSX elected to comply with these amendments effective second quarter 2020. As a result, separate condensed consolidating financial information for wholly-owned subsidiaries who issued or guaranteed notes is no longer included in the footnotes to the financial statements in Quarterly and Annual Reports on Form 10-Q and Form 10-K. Also in accordance with the amendments, CSX is not required to present combined summary financial information regarding such subsidiary issuers and guarantors because the assets, liabilities and results of operations of the combined issuers and guarantors of the notes are not materially different from the corresponding amounts presented in the consolidated financial statements.\nIn 2007, CSXT, a wholly-owned subsidiary of CSX Corporation, issued $381 million of secured equipment notes maturing in 2023 in a registered public offering. CSX Corporation has fully and unconditionally guaranteed the notes. At CSXT’s option, CSXT may redeem any or all of the notes, in whole or in part, at any time, at the redemption price including premium. In the case of loss or destruction of any item of equipment securing the notes, if CSXT does not substitute another item of equipment for the item suffering such loss or destruction, CSXT will be required to redeem the notes in part at par. The guarantee of the notes will rank equally in right of payment with all existing and future senior obligations of CSX Corporation and will be effectively subordinated to all future secured indebtedness of CSX Corporation to the extent of the assets securing such indebtedness. The guarantee is subject to release in limited circumstances only upon the occurrence of certain customary conditions. As of December 31, 2020, the principal balance of these secured equipment notes was $160 million.\nCSX 2020 Form 10-K p.36\nCSX CORPORATION\nPART II\nSCHEDULE OF CONTRACTUAL OBLIGATIONS AND COMMERCIAL COMMITMENTS\nThe following tables set forth maturities of the Company's contractual obligations and other significant commitments:\nType of Obligation 2021 2022 2023 2024 2025 Thereafter Total\n(Dollars in Millions) (Unaudited)\nContractual Obligations\nTotal Debt (See Note 10) $ 401 $ 162 $ 139 $ 551 $ 601 $ 14,851 $ 16,705\nInterest on Debt 712 698 684 680 661 10,805 14,240\nPurchase Obligations (See Note 8) 234 226 248 284 298 1,985 3,275\nOther Post-Employment Benefits (a)\n33 26 25 25 24 102 235\nOperating Leases - Net (See Note 7) 47 43 36 36 35 1,172 1,369\nAgreements with Conrail (See Note 15) 30 30 30 22 - - 112\nTotal Contractual Obligations $ 1,457 $ 1,185 $ 1,162 $ 1,598 $ 1,619 $ 28,915 $ 35,936\nOther Commitments (b)\n$ 74 $ 2 $ - $ - $ - $ - $ 76\n(a) Other post-employment benefits include estimated other post-retirement medical and life insurance payments and payments under non-qualified pension plans that are unfunded. No amounts are included for funded pension obligations as no contributions are currently required. See Note 9, Employee Benefit Plans.\n(b) Other commitments of $76 million consisted of surety bonds, letters of credit, uncertain tax positions and public private partnerships. Surety bonds of $29 million and letters of credit of $27 million arise from assurances issued by a third-party that CSX will fulfill certain obligations and are typically a contract, state, federal or court requirement. Uncertain tax positions of $16 million, which include interest and penalties, are all included in year 2021 as the year of settlement cannot be reasonably estimated. Contractual commitments related to public-private partnerships are $4 million.\nCSX 2020 Form 10-K p.37\nCSX CORPORATION\nPART II\nOFF-BALANCE SHEET ARRANGEMENTS\nFor detailed information about the Company’s guarantees, operating leases and purchase obligations, see Note 8, Commitments and Contingencies. There are no off-balance sheet arrangements that are reasonably likely to have a material effect on the Company’s financial condition, results of operations or liquidity.\nLABOR AGREEMENTS\nApproximately 15,700 of the Company's nearly 19,300 employees are members of a labor union. In November 2019, notices were served to the 13 rail unions that participate in national bargaining to begin negotiations for benefits, wages and work rules for the next labor bargaining round for 2020. Current agreements remain in place until modified by these negotiations. Typically, such negotiations take several years before agreements are reached.\nCRITICAL ACCOUNTING ESTIMATES\nThe preparation of financial statements in conformity with accounting principles generally accepted in the United States requires that management make estimates in reporting the amounts of certain assets and liabilities, the disclosure of contingent assets and liabilities at the date of the financial statements and certain revenues and expenses during the reporting period. Actual results may differ from those estimates. These estimates and assumptions are discussed with the Audit Committee of the Board of Directors on a regular basis. Significant estimates using management judgment are made for the following areas:\n•personal injury, environmental and legal reserves;\n•pension and post-retirement medical plan accounting; and\n•depreciation policies for assets under the group-life method.\nPersonal Injury, Environmental and Legal Reserves\nPersonal Injury\nPersonal Injury reserves of $131 million and $129 million for 2020 and 2019, respectively, represent liabilities for employee work-related and third-party injuries. CSXT retains an independent actuary to assist management in assessing the value of personal injury claims. The methodology used by the actuary includes a development factor to reflect growth or reduction in the value of these personal injury claims. It is based largely on CSXT's historical claims and settlement experience. Actual results may vary from estimates due to the number, type and severity of the injury, costs of medical treatments and uncertainties in litigation. For additional details, including a description of our related accounting policies, see Note 5, Casualty, Environmental and Other Reserves in the consolidated financial statements.\nCSX 2020 Form 10-K p.38\nCSX CORPORATION\nPART II\nCritical Accounting Estimates, continued\nEnvironmental\nEnvironmental reserves were $76 million and $74 million in 2020 and 2019, respectively. The Company is a party to various proceedings related to environmental issues, including administrative and judicial proceedings involving private parties and regulatory agencies. The Company has been identified as a potentially responsible party at approximately 220 environmentally impaired sites. The Company reviews its potential liability with respect to each site identified, giving consideration to a number of factors such as:\n•type of clean-up required;\n•nature of the Company’s alleged connection to the location (e.g., generator of waste sent to the site or owner or operator of the site);\n•extent of the Company’s alleged connection (e.g., volume of waste sent to the location and other relevant factors); and\n•number, connection and financial viability of other named and unnamed potentially responsible parties at the location.\nConditions that are currently unknown could, at any given location, result in additional exposure, the amount and materiality of which cannot presently be reasonably estimated. For additional details, including a description of our related accounting policies, see Note 5, Casualty, Environmental and Other Reserves in the consolidated financial statements.\nLegal\nThe Company is involved in litigation incidental to its business and is a party to a number of legal actions and claims, various governmental proceedings and private civil lawsuits. The Company evaluates all exposures relating to legal liabilities at least quarterly and adjusts reserves when appropriate. The amount of a particular reserve may be influenced by factors that include official rulings, newly discovered or developed evidence, or changes in laws, regulations and evidentiary standards. An unexpected adverse resolution of one or more of these items could have a material adverse effect on the Company's financial condition, results of operations or liquidity in that particular period. For additional details, including a description of our related accounting policies, see Note 5, Casualty, Environmental and Other Reserves in the consolidated financial statements. Additionally, see Item 3. Legal Proceedings for further discussion of these items.\nPension and Post-retirement Medical Plan Accounting\nThe Company sponsors defined benefit pension plans principally for salaried, management personnel. For employees hired prior to 2003, the plans provide eligible employees with retirement benefits based predominantly on years of service and compensation rates near retirement. For employees hired between 2003 and 2019, benefits are determined based on a cash balance formula, which provides benefits by utilizing interest and pay credits based upon age, service and compensation. Beginning in 2020, the CSX Pension Plan was closed to new participants. As of December 2020, the projected benefit obligation for the Company’s pension plans was $3.3 billion.\nCSX 2020 Form 10-K p.39\nCSX CORPORATION\nPART II\nCritical Accounting Estimates, continued\nIn addition to these plans, the Company sponsors a post-retirement medical plan and a life insurance plan that provide certain benefits to full-time, salaried, management employees hired prior to 2003 upon their retirement if certain eligibility requirements are met. Changes to the post-retirement medical and life insurance plans were communicated to participants in October 2018. Beginning in 2019, both the life insurance benefit for eligible active employees and health savings account contributions made by the Company to eligible retirees younger than 65 were eliminated. Beginning in 2020, the employer-funded health reimbursement arrangements for eligible retirees 65 years or older were eliminated. As a result of these plan amendments, the Company recognized a decrease of $102 million in the post-retirement benefit liability and a corresponding gain in other comprehensive income in 2018. As of December 2020, the projected benefit obligation for the Company’s other post-retirement benefit plans was $96 million.\nFor information related to the funded status of the Company's pension and other post-retirement benefit plans, see Note 9, Employee Benefit Plans.\nThe accounting for these plans is subject to the guidance provided in the Compensation-Retirement Benefits Topic in the ASC. This rule requires that management make certain assumptions relating to the following:\n•discount rates used to measure future obligations and interest expense;\n•long-term rate of return on plan assets;\n•salary scale inflation rates; and\n•other assumptions.\nThe Company engages independent actuaries to compute the amounts of liabilities and expenses relating to these plans subject to the assumptions that the Company determines are appropriate based on historical trends, current market rates and future projections. These amounts are reviewed by management.\nDiscount Rates\nDiscount rates affect the amount of liability recorded and the service and interest cost components of pension and post-retirement expense. Discount rates reflect the rates at which pension and other post-retirement benefits could be effectively settled, or in other words, how much it would cost the Company to buy enough high quality bonds to generate cash flow equal to the Company's expected future benefit payments. The Company determines the discount rate based on the market yield as of year-end for high quality corporate bonds whose maturities match the plans' expected benefit payments.\nThe Company measures the service and interest cost components of the net pension and post-retirement benefits expense by using individual spot rates matched with separate cash flows for each future year. Under the spot rate approach, individual spot discount rates along the same high quality corporate bonds yield curve used to measure the pension and post-retirement benefit liabilities are applied to the relevant projected cash flows at the relevant maturity.\nCSX 2020 Form 10-K p.40\nCSX CORPORATION\nPART II\nCritical Accounting Estimates, continued\nThe weighted average discount rates used by the Company to value its 2020 pension and post-retirement obligations are 2.43 percent and 2.07 percent, respectively. For 2019, the weighted average discount rates used by the Company to value its pension and post-retirement obligations were 3.13 percent and 2.87 percent, respectively. Discount rates may differ for pension and post-retirement benefits due to varying duration of the liabilities for projected payments for each plan. As of December 2020, the estimated duration of pensions and post-retirement benefits is approximately 12 years and 8 years, respectively.\nEach year, these discount rates are reevaluated and adjusted using the current market interest rates for high quality corporate bonds to reflect the best estimate of the current effective settlement rates. In general, if interest rates decline or rise, the assumed discount rates will change.\nLong-term Rate of Return on Plan Assets\nThe expected long-term average rate of return on plan assets reflects the average rate of earnings expected on the funds invested, or to be invested, to provide for benefits included in the projected benefit obligation. In estimating that rate, the Company gives appropriate consideration to the returns being earned by the plan assets in the funds and the rates of return expected to be available for reinvestment as well as the current and projected asset mix of the funds. Management, with the assistance of an outsourced investment manager, balances market expectations obtained from various investment managers with both market and actual plan historical returns to develop a reasonable estimate of the expected long-term rate of return on assets. As this assumption is long term, the annual review may result in less frequent adjustment than other assumptions used in pension accounting. The long-term rate of return on plan assets used by the Company to value its benefit cost for the subsequent plan year was 6.75 percent in both 2020 and 2019.\nSalary Scale Inflation Rates\nSalary scale inflation rates are based on current trends and historical data accumulated by the Company. The Company reviews recent wage increases and management incentive compensation payments over the past five years in its assessment of salary scale inflation rates. The Company used a salary scale rate of 4.60 percent in both 2020 and 2019 to value its pension obligations.\nOther Assumptions\nThe calculations made by the actuaries also include assumptions relating to health care cost trend rates, mortality rates, turnover and retirement age. These assumptions are based upon historical data, recent plan experience and industry trends and are determined by management.\n2021 Estimated Pension and Post-retirement Expense\nNet periodic pension and post-retirement benefits expenses for 2021 are expected to be a $21 million credit and a $5 million credit, respectively. Net periodic pension and post-retirement benefits expenses for 2021 are expected to include service cost expense of $38 million and $1 million, respectively. Service cost expense is included in labor and fringe on the consolidated income statement and all other components of net pension expense and post-retirement benefits expense are included in other income - net. Net periodic pension expense and post-retirement benefits expense in 2020 were costs of $3 million and less than $1 million, respectively. The net decrease in the expected expense is primarily due to expected favorable pension asset experience.\nCSX 2020 Form 10-K p.41\nCSX CORPORATION\nPART II\nCritical Accounting Estimates, continued\nThe following sensitivity analysis illustrates the effects of a one percent change in certain assumptions like discount rates, long-term rate of return and salaries on the 2021 estimated pension and post-retirement expense:\n(Dollars in Millions) Pension Expense Post-Retirement Expense\nDiscount Rate $ 20 $ 1\nLong-term Rate of Return $ 28 N/A\nSalary Inflation $ 5 N/A\nDepreciation Policies for Assets Utilizing the Group-Life Method\nThe depreciable assets of the Company are depreciated using either the group-life or straight-line method of accounting, which are both acceptable depreciation methods in accordance with GAAP. The Company depreciates its railroad assets, including main-line track, locomotives and freight cars, using the group-life method of accounting. Assets depreciated under the group-life method comprise 87% of total fixed assets of $45.5 billion on a gross basis at December 31, 2020. The remaining depreciable assets of the Company, including non-railroad assets and assets under finance leases, are depreciated using the straight-line method on a per asset basis. Land is not depreciated.\nManagement performs a review of depreciation expense and useful lives on a regular basis. Under the group-life method, the service lives and salvage values for each group of assets are determined by completing periodic depreciation studies and applying management’s methods to determine the service lives of its properties. There are several factors taken into account during the depreciation study and they include:\n•statistical analysis of historical life and salvage data for each group of property;\n•statistical analysis of historical retirements for each group of property;\n•evaluation of current operations;\n•evaluation of technological advances and maintenance schedules;\n•previous assessment of the condition of the assets;\n•management's outlook on the future use of certain asset groups;\n•expected net salvage to be received upon retirement; and\n•comparison of assets to the same asset groups with other companies.\nThe Company completed a depreciation study for its road and track assets in 2020 and for equipment assets in 2019, both of which resulted in changes to accumulated depreciation, service lives, salvage values, and other related factors for certain assets. Recent experience with depreciation studies has resulted in changes to accumulated depreciation and depreciation rates that did not materially affect the Company's depreciation expense of $1.4 billion, $1.3 billion and $1.3 billion for 2020, 2019 and 2018, respectively. A one percent change in the average estimated useful life of all group-life assets would result in an approximate $12 million change to the Company’s annual depreciation expense. For additional details, including a more detailed description of our related accounting policies, see Note 6, Properties in the consolidated financial statements.\nNew Accounting Pronouncements and Changes in Accounting Policy\nSee Note 1, Nature of Operations and Significant Accounting Policies under the caption “New Accounting Pronouncements and Changes in Accounting Policy.”\nCSX 2020 Form 10-K p.42\nCSX CORPORATION\nPART II\nFORWARD-LOOKING STATEMENTS\nCertain statements in this report and in other materials filed with the Securities and Exchange Commission, as well as information included in oral statements or other written statements made by the Company, are forward-looking statements. The Company intends for all such forward-looking statements to be covered by the safe harbor provisions for forward-looking statements within the meaning of the Private Securities Litigation Reform Act of 1995 and the provisions of Section 27A of the Securities Act of 1933 and Section 21E of the Securities Exchange Act of 1934. These forward-looking statements within the meaning of the Private Securities Litigation Reform Act may contain, among others, statements regarding:\n•projections and estimates of earnings, revenues, margins, volumes, rates, cost-savings, expenses, taxes or other financial items;\n•expectations as to results of operations and operational initiatives;\n•expectations as to the effect of claims, lawsuits, environmental costs, commitments, contingent liabilities, labor negotiations or agreements on the Company's financial condition, results of operations or liquidity;\n•management's plans, strategies and objectives for future operations, capital expenditures, workforce levels, dividends, share repurchases, safety and service performance, proposed new services and other matters that are not historical facts, and management's expectations as to future performance and operations and the time by which objectives will be achieved; and\n•future economic, industry or market conditions or performance and their effect on the Company's financial condition, results of operations or liquidity.\nForward-looking statements are typically identified by words or phrases such as \"will,\" \"should,\" “believe,” “expect,” “anticipate,” “project,” “estimate,” “preliminary” and similar expressions. The Company cautions against placing undue reliance on forward-looking statements, which reflect its good faith beliefs with respect to future events and are based on information currently available to it as of the date the forward-looking statement is made. Forward-looking statements should not be read as a guarantee of future performance or results and will not necessarily be accurate indications of the timing when, or by which, such performance or results will be achieved.\nForward-looking statements are subject to a number of risks and uncertainties and actual performance or results could differ materially from those anticipated by any forward-looking statements. The Company undertakes no obligation to update or revise any forward-looking statement. If the Company does update any forward-looking statement, no inference should be drawn that the Company will make additional updates with respect to that statement or any other forward-looking statements.\nThe following important factors, in addition to those discussed in Part II, Item 1A. Risk Factors and elsewhere in this report, may cause actual results to differ materially from those contemplated by any forward-looking statements:\n•legislative, regulatory or legal developments involving transportation, including rail or intermodal transportation, the environment, hazardous materials, taxation, international trade and initiatives to further regulate the rail industry;\n•the outcome of litigation, claims and other contingent liabilities, including, but not limited to, those related to fuel surcharge, environmental matters, taxes, shipper and rate claims subject to adjudication, personal injuries and occupational illnesses;\nCSX 2020 Form 10-K p.43\nCSX CORPORATION\nPART II\n•changes in domestic or international economic, political or business conditions, including those affecting the transportation industry (such as the impact of industry competition, conditions, performance and consolidation, as well as the impact of international trade agreements and tariffs) and the level of demand for products carried by CSXT;\n•natural events such as severe weather conditions, including floods, fire, hurricanes and earthquakes, a pandemic crisis affecting the health of the Company's employees, its shippers or the consumers of goods, or other unforeseen disruptions of the Company's operations, systems, property, equipment or supply chain;\n•competition from other modes of freight transportation, such as trucking, and competition and consolidation or financial distress within the transportation industry generally;\n•the cost of compliance with laws and regulations that differ from expectations as well as costs, penalties and operational and liquidity impacts associated with noncompliance with applicable laws or regulations;\n•the impact of increased passenger activities in capacity-constrained areas, including potential effects of high speed rail initiatives, or regulatory changes affecting when CSXT can transport freight or service routes;\n•unanticipated conditions in the financial markets that may affect timely access to capital markets and the cost of capital, as well as management's decisions regarding share repurchases;\n•changes in fuel prices, surcharges for fuel and the availability of fuel;\n•the impact of natural gas prices on coal-fired electricity generation;\n•the impact of global supply and price of seaborne coal on CSX's export coal market;\n•availability of insurance coverage at commercially reasonable rates or insufficient insurance coverage to cover claims or damages;\n•the inherent business risks associated with safety and security, including the transportation of hazardous materials or a cybersecurity attack which would threaten the availability and vulnerability of information technology;\n•adverse economic or operational effects from actual or threatened war or terrorist activities and any governmental response;\n•loss of key personnel or the inability to hire and retain qualified employees;\n•labor and benefit costs and labor difficulties, including stoppages affecting either the Company's operations or customers' ability to deliver goods to the Company for shipment;\n•the Company's success in implementing its strategic, financial and operational initiatives;\n•the impact of conditions in the real estate market on the Company's ability to sell assets;\n•changes in operating conditions and costs or commodity concentrations;\n•the continued and uncertain impact of the COVID-19 pandemic; and\n•the inherent uncertainty associated with projecting economic and business conditions.\nOther important assumptions and factors that could cause actual results to differ materially from those in the forward-looking statements are specified elsewhere in this report and in CSX's other SEC reports, which are accessible on the SEC's website at www.sec.gov and the Company's website at www.csx.com. The information on the CSX website is not part of this annual report on Form 10-K.\nCSX 2020 Form 10-K p.44\nCSX CORPORATION\nPART II",
    "item_7A": "Item 7A. Quantitative and Qualitative Disclosures about Market Risk\nChanges in interest rates may impact the cost of future long-term debt issued by the Company, and as a result, represent interest rate risk to the Company. In an effort to manage this risk, CSX may use certain financial instruments such as interest rate forward contracts. The following information, together with information included in Note 10, Debt and Credit Agreements, describes the key aspects of such contracts and the related market risk to CSX.\nChanges in interest rates could impact the fair value of the Company's forward starting interest rate swap. On both April 29, 2020, and July 9, 2020, the Company executed a forward starting interest rate swap with a notional value of $250 million for an aggregate notional value of $500 million. These swaps were effected to hedge the benchmark interest rate associated with future interest payments related to the anticipated refinancing of notes due in 2027. The Company recognized an unrealized gain of $62 million net of tax during the year ended December 31, 2020 in the consolidated statements of comprehensive income with the related asset on the balance sheet as of December 31, 2020. Upon settlement of the swaps, which expire in 2027, the unrealized gain or loss in AOCI will be recognized in earnings as an adjustment to interest expense over the same period during which the hedged transaction affects earnings. As of December 31, 2020, the potential change in fair value resulting from a hypothetical 10% change in interest rates would not be material.\nAs of December 2020, CSX has no floating rate debt obligations outstanding. However, changes in interest rates could impact the fair value (but not the carrying value) of the Company's fixed rate long-term debt. The potential decrease in fair value of the Company's fixed rate long-term debt resulting from a hypothetical 10% increase in interest rates, or approximately 15 basis points, is estimated to be $428 million as of December 31, 2020. The underlying fair values of the Company's long-term debt were estimated based on quoted market prices or on the current rates offered for debt with similar terms and maturities.\nCSX 2020 Form 10-K p.45\nCSX CORPORATION\nPART II",
    "item_8": "Item 8. Financial Statements and Supplementary Data\nINDEX TO CONSOLIDATED FINANCIAL STATEMENTS\nPage\nReport of Independent Registered Public Accounting Firm 47\nCSX Corporation\nConsolidated Financial Statements and Notes to Consolidated Financial Statements\nHerewith:\nConsolidated Income Statements for the Fiscal Years Ended: 49\nDecember 31, 2020\nDecember 31, 2019\nDecember 31, 2018\nConsolidated Comprehensive Income Statements for the Fiscal Years Ended: 50\nDecember 31, 2020\nDecember 31, 2019\nDecember 31, 2018\nConsolidated Balance Sheets as of: 51\nDecember 31, 2020\nDecember 31, 2019\nConsolidated Cash Flow Statements for Fiscal Years Ended: 52\nDecember 31, 2020\nDecember 31, 2019\nDecember 31, 2018\nConsolidated Statements of Changes in Shareholders' Equity: 53\nDecember 31, 2020\nDecember 31, 2019\nDecember 31, 2018\nNotes to Consolidated Financial Statements 54\nCSX 2020 Form 10-K p.46\nCSX CORPORATION\nPART II\nItem 8. Financial Statements and Supplementary Data\nREPORT OF INDEPENDENT REGISTERED PUBLIC ACCOUNTING FIRM\nTo the Shareholders and the Board of Directors of CSX Corporation\nOpinion on the Financial Statements\nWe have audited the accompanying consolidated balance sheets of CSX Corporation (the Company) as of December 31, 2020 and 2019, and the related consolidated statements of income, comprehensive income, cash flows, and changes in shareholders’ equity for each of the three years in the period ended December 31, 2020, and the related notes (collectively referred to as the “consolidated financial statements”). In our opinion, the consolidated financial statements present fairly, in all material respects, the financial position of the Company at December 31, 2020 and 2019, and the results of its operations and its cash flows for each of the three years in the period ended December 31, 2020, in conformity with U.S. generally accepted accounting principles.\nWe also have audited, in accordance with standards of the Public Company Accounting Oversight Board (United States) (PCAOB), the Company’s internal control over financial reporting as of December 31, 2020, based on criteria established in Internal Control-Integrated Framework issued by the Committee of Sponsoring Organizations of the Treadway Commission (2013 framework), and our report dated February 10, 2021 expressed an unqualified opinion thereon.\nBasis for Opinion\nThese financial statements are the responsibility of the Company's management. Our responsibility is to express an opinion on the Company’s financial statements based on our audits. We are a public accounting firm registered with the PCAOB and are required to be independent with respect to the Company in accordance with the U.S. federal securities laws and the applicable rules and regulations of the Securities and Exchange Commission and the PCAOB.\nWe conducted our audits in accordance with the standards of the PCAOB. Those standards require that we plan and perform the audit to obtain reasonable assurance about whether the financial statements are free of material misstatement, whether due to error or fraud. Our audits included performing procedures to assess the risks of material misstatement of the financial statements, whether due to error or fraud, and performing procedures that respond to those risks. Such procedures included examining, on a test basis, evidence regarding the amounts and disclosures in the financial statements. Our audits also included evaluating the accounting principles used and significant estimates made by management, as well as evaluating the overall presentation of the financial statements. We believe that our audits provide a reasonable basis for our opinion.\nCritical Audit Matters\nThe critical audit matter communicated below is a matter arising from the current period audit of the financial statements that was communicated or required to be communicated to the audit committee and that: (1) relates to accounts or disclosures that are material to the financial statements and (2) involved our especially challenging, subjective, or complex judgments. The communication of the critical audit matter does not alter in any way our opinion on the consolidated financial statements, taken as a whole, and we are not, by communicating the critical audit matter below providing a separate opinion on the critical audit matter or on the accounts or disclosure to which it relates.\nCSX 2020 Form 10-K p.47\nCSX CORPORATION\nPART II\nItem 8. Financial Statements and Supplementary Data\nREPORT OF INDEPENDENT REGISTERED PUBLIC ACCOUNTING FIRM, continued\nDepreciation Policies for Assets Utilizing the Group-Life Method\nDescription of the Matter At December 31, 2020, assets depreciated under the group-life method comprised 87% of total gross fixed assets of $45.5 billion. As discussed in Note 6 of the consolidated financial statements, the group-life method aggregates assets with similar lives and characteristics into groups and depreciates each of these groups as a whole. When using the group-life method, an underlying assumption is that each group of assets, as a whole, is used and depreciated to the end of the group’s recoverable life. The Company utilizes different depreciable asset categories to account for depreciation expense for the railroad assets that are depreciated under the group-life method.\nUnder the group-life method, depreciation studies are completed to review asset service lives, salvage values, accumulated depreciation and other factors related to group assets. Depreciation studies are performed every three years for equipment assets and every six years for road and track assets. A depreciation study was performed in 2019 for equipment assets and 2020 for road and track assets. The most recent depreciation studies are reviewed by management each year to determine if there have been significant factors that result in changes to the group-life method key assumptions.\nAuditing depreciation expense for assets subject to the group-life method was complex and required the involvement of specialists due to the nature of the methods used in the depreciation studies to determine the useful service lives and salvage values of the Company’s assets. These methods have a significant effect on depreciation expense.\nHow We Addressed the Matter in Our Audit We obtained an understanding, evaluated the design and tested the operating effectiveness of controls over the Company’s process related to the assessment of periodic depreciation studies of its group-life assets. For example, we tested controls over management’s review of the depreciation study for road and track assets and review of depreciation expense and useful lives. We also tested controls over management’s review of asset activity and assumptions that could impact the most recent depreciation study of equipment assets.\nTo test the estimated useful lives and salvage values of the Company’s group-life assets, we performed audit procedures that included, among others: obtaining the periodic depreciation studies provided by the Company’s third-party specialist and subsequent updates by management; assessing the completeness and accuracy of the data provided to the third-party specialist and used by management; and including a specialist on our team to evaluate the methods used by the third-party specialist and management in determining the average service lives and salvage values of assets to perform the depreciation studies.\nWe compared the significant methods used by management to those used throughout the industry and within other depreciation studies. We also assessed the historical accuracy of management’s estimates via retrospective review and independently calculated a sample of the annual depreciation rates.\n/s/ Ernst & Young LLP\nWe have served as the Company’s auditor since 1981.\nJacksonville, Florida\nFebruary 10, 2021\nCSX 2020 Form 10-K p.48\nCSX CORPORATION\nPART II\nItem 8. Financial Statements and Supplementary Data\nCONSOLIDATED INCOME STATEMENTS\n(Dollars in Millions, Except Per Share Amounts)\nFiscal Years\n2020 2019 2018\nRevenue $ 10,583 $ 11,937 $ 12,250\nExpense\nLabor and Fringe 2,275 2,616 2,738\nMaterials, Supplies and Other 1,684 1,749 1,931\nDepreciation 1,383 1,349 1,331\nFuel 541 906 1,046\nEquipment and Other Rents 338 352 335\nTotal Expense 6,221 6,972 7,381\nOperating Income 4,362 4,965 4,869\nInterest Expense (754) (737) (639)\nOther Income - Net (Note 14) 19 88 74\nEarnings Before Income Taxes 3,627 4,316 4,304\nIncome Tax Expense (Note 12) (862) (985) (995)\nNet Earnings $ 2,765 $ 3,331 $ 3,309\nPer Common Share (Note 2)\nNet Earnings Per Share\nBasic $ 3.61 $ 4.18 $ 3.86\nAssuming Dilution $ 3.60 $ 4.17 $ 3.84\nAverage Common Shares Outstanding (Millions)\nBasic 766 796 857\nAssuming Dilution 768 798 861\nCertain prior year data has been reclassified to conform to the current presentation.\nSee accompanying Notes to Consolidated Financial Statements.\nCSX 2020 Form 10-K p.49\nCSX CORPORATION\nPART II\nItem 8. Financial Statements and Supplementary Data\nCONSOLIDATED COMPREHENSIVE INCOME STATEMENTS\n(Dollars in Millions)\nFiscal Years\n2020 2019 2018\nNet Earnings $ 2,765 $ 3,331 $ 3,309\nOther Comprehensive Income (Loss) - Net of Tax:\nPension and Other Post-Employment Benefits 21 (15) (164)\nInterest Rate Derivatives 62 - -\nOther (6) 1 (11)\nTotal Other Comprehensive Income (Loss) (Note 16) 77 (14) (175)\nComprehensive Earnings $ 2,842 $ 3,317 $ 3,134\nSee accompanying Notes to Consolidated Financial Statements.\nCSX 2020 Form 10-K p.50\nCSX CORPORATION\nPART II\nItem 8. Financial Statements and Supplementary Data\nCONSOLIDATED BALANCE SHEETS\n(Dollars in Millions)\nDecember December\n2020 2019\nASSETS\nCurrent Assets:\nCash and Cash Equivalents $ 3,129 $ 958\nShort-term Investments 2 996\nAccounts Receivable - Net (Note 11) 912 986\nMaterials and Supplies 302 261\nOther Current Assets 96 77\nTotal Current Assets 4,441 3,278\nProperties 45,530 45,100\nAccumulated Depreciation (13,086) (12,932)\nProperties - Net (Note 6) 32,444 32,168\nInvestment in Affiliates and Other Companies (Note 15) 1,985 1,879\nRight of Use Lease Asset (Note 7) 472 532\nOther Long-term Assets 451 400\nTotal Assets $ 39,793 $ 38,257\nLIABILITIES AND SHAREHOLDERS' EQUITY\nCurrent Liabilities:\nAccounts Payable $ 809 $ 1,043\nLabor and Fringe Benefits Payable 482 489\nCasualty, Environmental and Other Reserves (Note 5) 90 100\nCurrent Maturities of Long-term Debt (Note 10) 401 245\nIncome and Other Taxes Payable 73 69\nOther Current Liabilities 164 205\nTotal Current Liabilities 2,019 2,151\nCasualty, Environmental and Other Reserves (Note 5) 224 205\nLong-term Debt (Note 9) 16,304 15,993\nDeferred Income Taxes - Net (Note 12) 7,168 6,961\nLong-term Lease Liability (Note 7) 455 493\nOther Long-term Liabilities 513 591\nTotal Liabilities 26,683 26,394\nShareholders' Equity:\nCommon Stock, $1 Par Value (Note 3)\n763 773\nOther Capital 409 346\nRetained Earnings (Note 1) 12,527 11,404\nAccumulated Other Comprehensive Loss (Note 16) (598) (675)\nNon-controlling Minority Interest 9 15\nTotal Shareholders' Equity 13,110 11,863\nTotal Liabilities and Shareholders' Equity $ 39,793 $ 38,257\nCertain prior year data has been reclassified to conform to the current presentation.\nSee accompanying Notes to Consolidated Financial Statements.\nCSX 2020 Form 10-K p.51\nCSX CORPORATION\nPART II\nItem 8. Financial Statements and Supplementary Data\nCONSOLIDATED CASH FLOW STATEMENTS\n(Dollars in Millions)\nFiscal Years\n2020 2019 2018\nOPERATING ACTIVITIES\nNet Earnings $ 2,765 $ 3,331 $ 3,309\nAdjustments to Reconcile Net Earnings to Net Cash\nProvided by Operating Activities:\nDepreciation 1,383 1,349 1,331\nDeferred Income Taxes 180 273 279\nGains on Property Dispositions (35) (151) (154)\nCash Payments for Restructuring Charge - - (15)\nOther Operating Activities (32) (69) (117)\nChanges in Operating Assets and Liabilities:\nAccounts Receivable 83 45 (46)\nOther Current Assets (75) 68 101\nAccounts Payable (20) 98 104\nIncome and Other Taxes Payable 39 2 (104)\nOther Current Liabilities (25) (96) (47)\nNet Cash Provided by Operating Activities 4,263 4,850 4,641\nINVESTING ACTIVITIES\nProperty Additions (1,626) (1,657) (1,745)\nPurchases of Short-term Investments (426) (2,838) (736)\nProceeds from Sales of Short-term Investments 1,424 2,108 505\nProceeds from Property Dispositions 56 254 319\nOther Investing Activities (77) 31 (27)\nNet Cash Used in Investing Activities (649) (2,102) (1,684)\nFINANCING ACTIVITIES\nLong-term Debt Issued (Note 10) 1,000 2,000 3,000\nLong-term Debt Repaid (Note 10) (745) (518) (19)\nDividends Paid (797) (763) (751)\nShares Repurchased (867) (3,373) (4,671)\nOther Financing Activities (34) 6 (59)\nNet Cash Used in Financing Activities (1,443) (2,648) (2,500)\nNet Increase in Cash and Cash Equivalents 2,171 100 457\nCASH AND CASH EQUIVALENTS\nCash and Cash Equivalents at Beginning of Period 958 858 401\nCash and Cash Equivalents at End of Period $ 3,129 $ 958 $ 858\nSUPPLEMENTAL CASH FLOW INFORMATION\nInterest Paid - Net of Amounts Capitalized $ 750 $ 717 $ 614\nIncome Taxes Paid $ 664 $ 691 $ 814\nCertain prior year data has been reclassified to conform to the current presentation.\nSee accompanying Notes to Consolidated Financial Statements.\nCSX 2020 Form 10-K p.52\nCSX CORPORATION\nPART II\nItem 8. Financial Statements and Supplementary Data\nCONSOLIDATED STATEMENTS OF CHANGES\nIN SHAREHOLDERS’ EQUITY\n(Dollars in Millions)\nCommon Shares Outstanding (Thousands)\nCommon Stock and Other Capital Retained Earnings Accumulated\nOther\nComprehensive\nIncome\n(Loss) (a)\nNon-\ncontrolling Minority Interest Total Shareholders' Equity\nDecember 31, 2017 889,851 $ 1,107 $ 14,084 $ (486) $ 16 $ 14,721\nComprehensive Earnings:\nNet Earnings - - 3,309 - - 3,309\nOther Comprehensive Loss (Note 16) - - - (175) - (175)\nTotal Comprehensive Earnings 3,134\nCommon stock dividends,$0.88 per share\n- - (751) - - (751)\nShare Repurchases (72,264) (72) (4,599) - - (4,671)\nOther 593 32 114 - 1 147\nDecember 31, 2018 818,180 1,067 12,157 (661) 17 12,580\nComprehensive Earnings:\nNet Earnings - - 3,331 - - 3,331\nOther Comprehensive Loss (Note 16) - - - (14) - (14)\nTotal Comprehensive Earnings 3,317\nCommon stock dividends, $0.96 per share\n- - (763) - - (763)\nShare Repurchases (47,819) (48) (3,325) - - (3,373)\nOther 3,110 100 4 - (2) 102\nDecember 31, 2019 773,471 1,119 11,404 (675) 15 11,863\nComprehensive Earnings:\nNet Earnings - - 2,765 - - 2,765\nOther Comprehensive Income (Note 16) - - - 77 - 77\nTotal Comprehensive Earnings 2,842\nCommon stock dividends, $1.04 per share\n- - (797) - - (797)\nShare Repurchases (12,614) (13) (854) - - (867)\nOther 1,672 66 9 - (6) 69\nDecember 31, 2020 762,529 $ 1,172 $ 12,527 $ (598) $ 9 $ 13,110\n(a) Accumulated Other Comprehensive Loss year-end balances shown above are net of tax. The associated taxes were $156 million, $184 million and $180 million for 2020, 2019 and 2018, respectively. For additional information see Note 16, Other Comprehensive Income.\nSee accompanying Notes to Consolidated Financial Statements.\nCSX 2020 Form 10-K p.53\nCSX CORPORATION\nPART II\nItem 8. Financial Statements and Supplementary Data\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nNOTE 1. Nature of Operations and Significant Accounting Policies\nBusiness\nCSX Corporation together with its subsidiaries (\"CSX\" or the “Company”), based in Jacksonville, Florida, is one of the nation's leading transportation companies. The Company provides rail-based transportation services including traditional rail service, the transport of intermodal containers and trailers, as well as other transportation services such as rail-to-truck transfers and bulk commodity operations.\nCSX Transportation, Inc.\nCSX’s principal operating subsidiary, CSX Transportation, Inc. (“CSXT”), provides an important link to the transportation supply chain through its approximately 19,500 route mile rail network, which serves major population centers in 23 states east of the Mississippi River, the District of Columbia and the Canadian provinces of Ontario and Quebec. It has access to over 70 ocean, river and lake port terminals along the Atlantic and Gulf Coasts, the Mississippi River, the Great Lakes and the St. Lawrence Seaway. The Company’s intermodal business links customers to railroads via trucks and terminals. CSXT also serves thousands of production and distribution facilities through track connections to more than 230 short-line and regional railroads.\nCSXT is also responsible for the Company's real estate sales, leasing, acquisition and management and development activities. Substantially all of these activities are focused on supporting railroad operations.\nOther Entities\nIn addition to CSXT, the Company’s subsidiaries include CSX Intermodal Terminals, Inc. (“CSX Intermodal Terminals”), Total Distribution Services, Inc. (“TDSI”), Transflo Terminal Services, Inc. (“Transflo”), CSX Technology, Inc. (“CSX Technology”) and other subsidiaries. CSX Intermodal Terminals owns and operates a system of intermodal terminals, predominantly in the eastern United States, and also provides drayage services (the pickup and delivery of intermodal shipments) for certain customers. TDSI serves the automotive industry with distribution centers and storage locations. Transflo connects non-rail served customers to the many benefits of rail by transferring products from rail to trucks. The biggest Transflo markets are chemicals and agriculture, which include shipments of plastics and ethanol. CSX Technology and other subsidiaries provide support services for the Company.\nAcquisition of Pan-Am Railways\nOn November 30, 2020, CSX signed a definitive agreement to acquire Pan Am Railways, Inc. (“Pan Am”) which owns and operates a highly integrated, nearly 1,200-mile rail network and has a partial interest in the more than 600-mile Pan Am Southern system. This will expand CSX’s reach in Connecticut, New York and Massachusetts while adding Vermont, New Hampshire and Maine to its existing network. A $30 million deposit paid by the Company related to its agreement to acquire Pan Am is included in other investing activities on the consolidated cash flow statement. This transaction remains subject to regulatory review and approval by the Surface Transportation Board.\nCSX 2020 Form 10-K p.54\nCSX CORPORATION\nPART II\nItem 8. Financial Statements and Supplementary Data\nNOTE 1. Nature of Operations and Significant Accounting Policies, continued\nLines of Business\nDuring 2020, the Company's services generated $10.6 billion of revenue and served three primary lines of business: merchandise, intermodal and coal.\n•The merchandise business shipped 2.5 million carloads (43 percent of volume) and generated 67 percent of revenue in 2020. The Company’s merchandise business is comprised of shipments in the following diverse markets: chemicals, agricultural and food products, automotive, minerals, forest products, metals and equipment, and fertilizers.\n•The intermodal business shipped 2.7 million units (46 percent of volume) and generated 16 percent of revenue in 2020. The intermodal business combines the superior economics of rail transportation with the flexibility of trucks and offers a cost and environmental advantage over long-haul trucking. Through a network of approximately 30 terminals, the intermodal business serves all major markets east of the Mississippi River and transports mainly manufactured consumer goods in containers, providing customers with truck-like service for longer shipments.\n•The coal business shipped 637 thousand carloads (11 percent of volume) and generated 13 percent of revenue in 2020. The Company transports domestic coal, coke and iron ore to electricity-generating power plants, steel manufacturers and industrial plants as well as export coal to deep-water port facilities. Approximately one-quarter to one-third of export coal and the majority of the domestic coal that the Company transports is used for generating electricity or industrial purposes.\nOther revenue accounted for 4 percent of the Company’s total revenue in 2020. This revenue category includes revenue from regional subsidiary railroads, demurrage, storage at intermodal facilities, revenue for customer volume commitments not met, switching, other incidental charges and adjustments to revenue reserves. Revenue from regional railroads includes shipments by railroads that the Company does not directly operate. Demurrage represents charges assessed when freight cars or other equipment are held beyond a specified period of time. Switching represents charges assessed when a railroad switches cars for a customer or another railroad.\nEmployees\nThe Company's number of employees was nearly 19,300 as of December 2020, which includes approximately 15,700 union employees. Most of the Company’s employees provide or support transportation services.\nCSX 2020 Form 10-K p.55\nCSX CORPORATION\nPART II\nItem 8. Financial Statements and Supplementary Data\nNOTE 1. Nature of Operations and Significant Accounting Policies, continued\nBasis of Presentation\nIn the opinion of management, the accompanying consolidated financial statements contain all normal, recurring adjustments necessary to fairly present the financial position of CSX and its subsidiaries at December 31, 2020 and December 31, 2019, and the consolidated statements of income, comprehensive income, cash flows and changes in shareholders’ equity for fiscal years 2020, 2019 and 2018. Where applicable, prior year information has been reclassified to conform to current presentation. In addition, management has evaluated and disclosed all material events occurring subsequent to the date of the financial statements up to the date this annual report is filed on Form 10-K.\nFiscal Year\nThe Company's fiscal periods are based upon the calendar year. Except as otherwise specified, references to full years indicate CSX’s fiscal years ended on December 31, 2020, December 31, 2019 and December 31, 2018.\nPrinciples of Consolidation\nThe consolidated financial statements include results of operations of CSX and subsidiaries over which CSX has majority ownership or financial control. All significant intercompany accounts and transactions have been eliminated. Most investments in companies that were not majority-owned were carried at cost (if less than 20% owned and the Company has no significant influence) or were accounted for under the equity method (if the Company has significant influence but does not have control). These investments are reported within Investment in Affiliates and Other Companies on the consolidated balance sheets.\nCash and Cash Equivalents\nOn a daily basis, cash in excess of current operating requirements is invested in various highly liquid investments having a typical maturity date of three months or less at the date of acquisition. These investments are carried at cost, which approximates market value, and are classified as cash equivalents.\nInvestments\nInvestments in instruments with original maturities greater than three months that will mature in less than one year are classified as short-term investments. Investments with original maturities of one year or greater are initially classified within other long-term assets, and the classification is re-evaluated at each balance sheet date.\nCSX 2020 Form 10-K p.56\nCSX CORPORATION\nPART II\nItem 8. Financial Statements and Supplementary Data\nNOTE 1. Nature of Operations and Significant Accounting Policies, continued\nMaterials and Supplies\nMaterials and supplies in the consolidated balance sheets are carried at average cost and consist primarily of parts used in the repair and maintenance of track structure, equipment, and CSXT’s freight car and locomotive fleets, as well as fuel.\nNew Accounting Pronouncements\nIn June 2016, the FASB issued ASU Measurement of Credit Losses on Financial Instruments, which replaces current methods for evaluating impairment of financial instruments not measured at fair value, including trade accounts receivable and certain debt securities, with a current expected credit loss model. CSX was required to adopt this new standard update by January 1, 2020. Adoption did not have a material effect on the Company's results of operations.\nIn August 2018, the FASB issued ASU Changes to the Disclosure Requirements for Defined Benefit Plans as part of its disclosure effectiveness initiative, which modifies the disclosure requirements for employer-sponsored defined benefit pension and other postretirement plans. CSX was required to adopt this new standard update by January 1, 2020. Adoption did not have a material impact on the Company's disclosures.\nUse of Estimates\nThe preparation of financial statements in conformity with accounting principles generally accepted in the United States requires that management make estimates in reporting the amounts of certain assets and liabilities, the disclosure of contingent assets and liabilities at the date of the financial statements and the reported amount of certain revenues and expenses during the reporting period. Actual results may differ from those estimates. Critical accounting estimates using management judgment are made for the following areas:\n•personal injury, environmental and legal reserves (see Note 5, Casualty, Environmental and Other Reserves);\n•pension and post-retirement medical plan accounting (see Note 9, Employee Benefit Plans); and\n•depreciation policies for assets under the group-life method (see Note 6, Properties).\nCSX 2020 Form 10-K p.57\nCSX CORPORATION\nPART II\nItem 8. Financial Statements and Supplementary Data\nNOTE 2. Earnings Per Share\nThe following table sets forth the computation of basic earnings per share and earnings per share, assuming dilution:\nFiscal Years\n2020 2019 2018\nNumerator (Dollars in Millions):\nNet Earnings $ 2,765 $ 3,331 $ 3,309\nDividend Equivalents on Restricted Stock - - (1)\nNet Earnings, Attributable to Common Shareholders $ 2,765 $ 3,331 $ 3,308\nDenominator (Units in Millions):\nAverage Common Shares Outstanding 766 796 857\nOther Potentially Dilutive Common Shares 2 2 4\nAverage Common Shares Outstanding, Assuming Dilution 768 798 861\nNet Earnings Per Share, Basic $ 3.61 $ 4.18 $ 3.86\nNet Earnings Per Share, Assuming Dilution $ 3.60 $ 4.17 $ 3.84\nBasic earnings per share is based on the weighted-average number of shares of common stock outstanding. Earnings per share, assuming dilution, is based on the weighted-average number of shares of common stock outstanding and common stock equivalents adjusted for the effects of common stock that may be issued as a result of potentially dilutive instruments. CSX's potentially dilutive instruments are made up of equity awards including performance units and employee stock options.\nWhen calculating diluted earnings per share, the potential shares that would be outstanding if all outstanding stock options were exercised are included. This number is different from outstanding stock options, which is included in Note 4, Stock Plans and Share-Based Compensation, because it is offset by shares CSX could repurchase using the proceeds from these hypothetical exercises to obtain the common stock equivalent. The total average outstanding equity awards that were excluded from the diluted earnings per share calculation because their effect was antidilutive is in the table below.\nFiscal Years\n2020 2019 2018\nAntidilutive stock options excluded from Diluted EPS (in millions)\n2 1 -\nShare Repurchase Programs\nIn January 2019, the Company announced a $5 billion share repurchase program (\"January 2019 program\"). At December 31, 2020, approximately $889 million of authority remained under this program. On October 21, 2020, the Company announced a new, incremental $5 billion share repurchase program (“October 2020 program”). Total repurchase authority remaining as of December 31, 2020, was $5.9 billion. Previously, share repurchases were completed under a share repurchase program originally announced in October 2017 for $1.5 billion, and later increased to $5 billion in February 2018, that was completed in January 2019 (\"October 2017 program\").\nCSX 2020 Form 10-K p.58\nCSX CORPORATION\nPART II\nItem 8. Financial Statements and Supplementary Data\nNOTE 2. Earnings Per Share, continued\nShare repurchases may be made through a variety of methods including, but not limited to, open market purchases, purchases pursuant to Rule 10b5-1 plans, accelerated share repurchases and negotiated block purchases. The timing of share repurchases depends upon management's assessment of marketplace conditions and other factors, and the program remains subject to the discretion of the Board of Directors. Future share repurchases are expected to be funded by cash on hand, cash generated from operations and debt issuances. Shares are retired immediately upon repurchase. In accordance with the Equity Topic in the Accounting Standards Codification (\"ASC\"), the excess of repurchase price over par value is recorded in retained earnings.\nShare Repurchase Activity\nDuring 2020, 2019, and 2018, CSX repurchased the following shares:\nFiscal Years\n2020 2019 2018\nShares Repurchased (Units in Millions)\n13 48 72\nCost of Shares (Dollars in Millions)\n$ 867 $ 3,373 $ 4,671\nAverage Price Paid per Share $ 68.70 $ 70.54 $ 64.64\nOn October 17, 2019, the Company repurchased 4.7 million shares for $319 million from MR Argent Advisor LLC, a CSX shareholder, on behalf of certain limited partners of its affiliated funds (“Mantle Ridge”) under the January 2019 share repurchase program. A member of CSX’s Board of Directors, Paul C. Hilal, founded and controls Mantle Ridge and each of its related entities. Shares purchased from Mantle Ridge are included in the table above.\nAccelerated Share Repurchases\nShares repurchased under accelerated share repurchase agreements are included in the table above. In December 2020, the Company completed an accelerated share repurchase subject to an agreement to repurchase shares of the Company’s stock under the January 2019 program. Under this agreement, the Company paid a total of $100 million and received approximately 1.1 million shares.\nIn August 2019, the Company entered into an accelerated share repurchase agreement under the January 2019 program. Under this accelerated share repurchase agreement, the Company made a prepayment of $250 million to a financial institution and settlement occurred in September 2019. At settlement, the Company received approximately 4 million shares, calculated based on the volume-weighted average price of the Company’s common stock over the term of the agreement, less a discount.\nDuring 2018, the Company completed four accelerated share repurchase agreements under the October 2017 program. Under these agreements, the Company paid $1.5 billion and received approximately 22 million total shares.\nCSX 2020 Form 10-K p.59\nCSX CORPORATION\nPART II\nItem 8. Financial Statements and Supplementary Data\nNOTE 3. Shareholders’ Equity\nCommon and preferred stock consists of the following:\nCommon Stock, $1 Par Value\nDecember 2020\n(Units in Millions)\nCommon Shares Authorized 1,800\nCommon Shares Issued and Outstanding 763\nPreferred Stock\nPreferred Shares Authorized 25\nPreferred Shares Issued and Outstanding -\nHolders of common stock are entitled to one vote on all matters requiring a vote for each share held. Preferred stock is senior to common stock with respect to dividends and upon liquidation of CSX.\nNOTE 4. Stock Plans and Share-Based Compensation\nUnder CSX's share-based compensation plans, awards consist of performance units, stock options, restricted stock units and restricted stock awards for management and stock grants for directors. Awards granted under the various programs are determined and approved by the Compensation and Talent Management Committee of the Board of Directors. Awards to the Chief Executive Officer are approved by the full Board and awards to senior executives are approved by the Compensation and Talent Management Committee. In certain circumstances, the Chief Executive Officer or delegate approves awards to management employees other than senior executives. The Board of Directors approves awards granted to CSX's non-management directors upon recommendation of the Governance and Sustainability Committee.\nShare-based compensation expense for awards under share-based compensation plans and purchases made as part of the employee stock purchase plan is measured using the fair value of the award on the grant date and is recognized on a straight-line basis over the service period of the respective award or upon grant date to certain retirement-eligible employees whose agreements allow for continued vesting upon retirement. Forfeitures are recognized as they occur. Total pre-tax expense and income tax benefits associated with share-based compensation are shown in the table below. Income tax benefits include impacts from option exercises and the vesting of other equity awards.\nFiscal Years\n(Dollars in Millions) 2020 2019 2018\nShare-Based Compensation Expense\nStock Options $ 19 $ 18 $ 13\nRestricted Stock Units and Awards 6 8 6\nEmployee Stock Purchase Plan 5 4 2\nStock Awards for Directors 2 2 2\nPerformance Units (3) 42 28\nTotal Share-based Compensation Expense $ 29 $ 74 $ 51\nIncome Tax Benefit $ 19 $ 43 $ 26\nCSX 2020 Form 10-K p.60\nCSX CORPORATION\nPART II\nItem 8. Financial Statements and Supplementary Data\nNOTE 4. Stock Plans and Share-Based Compensation, continued\nLong-term Incentive Plans\nThe objective of the CSX Long-term Incentive Plans (“LTIP”) is to motivate and reward certain employees for achieving and exceeding certain financial goals. The 2020-2022 LTIP was adopted under the 2019 Stock and Incentive Award Plan and the 2019-2021 and 2018-2020 LTIPs were adopted under the 2010 Stock and Incentive Award Plan. Grants were made in performance units, with each unit being equivalent to one share of CSX common stock, and payouts will be made in CSX common stock. The payout range for most participants will be between 0% and 200% of the target awards depending on Company performance against predetermined goals for each three-year cycle.\nIn 2020, 2019, and 2018, target performance units were granted to certain employees under three separate LTIP plans covering three-year cycles: the 2020-2022 (\"2020-2022 LTIP\"), the 2019-2021 (“2019-2021 LTIP”), and the 2018-2020 (“2018-2020 LTIP”) plans. Payouts of performance units for the 2020-2022, 2019-2021 and 2018-2020 LTIP plans will be based on the achievement of certain goals, in each case excluding non-recurring items as disclosed in the Company’s financial statements.\n•For the 2020-2022 LTIP plan, the cumulative operating income and cumulative free cash flow over the plan period will each comprise 50% of the payout and will be measured independently of the other. Participants will receive stock dividend equivalents declared over the performance period based on the number of performance units paid upon vesting.\n•For the 2019-2021 LTIP plan, the cumulative operating ratio and cumulative free cash flow over the plan period will each comprise 50% of the payout and will be measured independently of the other.\n•For the 2018-2020 LTIP plan, the final year operating ratio and cumulative free cash flow over the plan period will each comprise 50% of the payout and will be measured independently of the other.\nFor these plans, payouts for certain executive officers are subject to formulaic upward or downward adjustment by up to 25%, capped at an overall payout of 200% for the 2018 plan and 250% for the 2019 and 2020 plans, based upon the Company’s total shareholder return relative to specified comparable groups over the performance period.\nThe fair value of the performance units awarded during the years ended December 2020, 2019 and 2018 were calculated primarily using a Monte-Carlo simulation model with the following weighted-average assumptions:\nWeighted-average assumptions used: 2020 2019 2018\nAnnual dividend yield n/a 1.4 % 1.6 %\nRisk-free interest rate 1.4 % 2.4 % 2.3 %\nAnnualized volatility 24.5 % 27.4 % 29.1 %\nExpected life (in years)\n2.9 2.8 2.9\nCSX 2020 Form 10-K p.61\nCSX CORPORATION\nPART II\nItem 8. Financial Statements and Supplementary Data\nNOTE 4. Stock Plans and Share-Based Compensation, continued\nPerformance unit grant and vesting information is summarized as follows:\nFiscal Years\n2020 2019 2018\nWeighted-average grant date fair value $ 76.17 $ 66.18 $ 55.57\nFair value of units vested in fiscal year ending (in millions)\n$ 18 $ 17 $ 14\nThe performance unit activity related to the outstanding long-term incentive plans and corresponding fair value is summarized as follows:\nPerformance Units Outstanding\n(in Thousands) Weighted-Average Fair Value at Grant Date\nUnvested at December 31, 2019 643 $ 60.58\nGranted 356 76.17\nForfeited (34) 66.71\nVested (325) 55.35\nUnvested at December 31, 2020 640 $ 71.59\nAs of December 2020, there was $2 million of total unrecognized compensation cost related to performance units that is expected to be recognized over a weighted-average period of approximately one year.\nStock Options\nStock options in 2020, 2019, and 2018 were primarily granted along with the corresponding LTIP plans. Under this program, an employee receives an award that provides the opportunity in the future to purchase CSX shares at the closing market price of the stock on the date the award is granted (the strike price). Options granted in 2020 and 2019 become exercisable either in equal installments on the anniversary of the grant date over a vesting period (three-year graded) or three years after the grant date (three-year cliff), depending on the individual grant. The options granted in 2018 vest three years after the grant date (three-year cliff). All options expire 10 years from the grant date if they are not exercised.\nThe fair value of stock options granted was estimated as of the dates of grant using the Black-Scholes option valuation model, which uses the following assumptions: dividend yield, risk-free interest rate, annualized volatility and expected life. The annual dividend yield is based on the most recent quarterly CSX dividend payment annualized. The risk-free interest rate is based on U.S. Treasury yield curve in effect at the time of grant. The annualized volatility is based on historical volatility of daily CSX stock price returns over a 6.0 year look-back period ending on the grant date. The expected life is calculated using the safe harbor approach due to lack of historical data on CSX options, which is the midpoint between the vesting schedule and contractual term (10 years).\nCSX 2020 Form 10-K p.62\nCSX CORPORATION\nPART II\nItem 8. Financial Statements and Supplementary Data\nNOTE 4. Stock Plans and Share-Based Compensation, continued\nAssumptions and inputs used to estimate fair value of stock options are summarized as follows:\nFiscal Years\n2020 2019 2018\nWeighted-average grant date fair value $ 18.94 $ 17.87 $ 14.65\nStock options valuation assumptions:\nAnnual dividend yield 1.2 % 1.3 % 1.5 %\nRisk-free interest rate 1.4 % 2.4 % 2.6 %\nAnnualized volatility 26.1 % 25.7 % 27.0 %\nExpected life (in years) 6.0 6.1 6.5\nOther pricing model inputs:\nWeighted-average grant-date market price of CSX stock (strike price) $ 79.58 $ 70.01 $ 54.19\nThe stock option activity is summarized as follows:\nStock Options Outstanding\n(in Thousands) Weighted-Average Exercise Price Weighted-Average Remaining Contractual Life\n(in Years) Aggregate Intrinsic Value\n(in Millions)\nOutstanding at December 31, 2019 3,795 $ 49.78\nGranted 1,339 79.58\nForfeited (131) 72.04\nExercised (786) 37.41\nOutstanding at December 31, 2020 4,217 $ 60.88 7.5 $ 126\nExercisable at December 31, 2020 1,257 $ 40.05 6.0 $ 64\nUnrecognized compensation expense related to stock options as of December 2020 was $18 million and is expected to be recognized over a weighted-average period of approximately two years. The Company issues new shares upon stock option exercises. There were no significant exercises during 2018. Additional information on stock option exercises is summarized as follows:\n(Dollars in Millions) 2020 2019\nIntrinsic value of stock options exercised $ 30 $ 87\nCash received from option exercises $ 29 $ 45\nCSX 2020 Form 10-K p.63\nCSX CORPORATION\nPART II\nItem 8. Financial Statements and Supplementary Data\nNOTE 4. Stock Plans and Share-Based Compensation, continued\nRestricted Stock Grants\nRestricted stock grants consist of units and awards, each equivalent to one share of CSX stock. Restricted stock units are primarily issued along with corresponding LTIP plans and vest three years after the date of grant. Separately, restricted stock awards generally vest over an employment period of up to five years. These awards are time-based and not based upon CSX’s attainment of operational targets. Participants receive cash or stock dividend equivalents on these shares, depending on the grant. Restricted stock grant and vesting information is summarized as follows:\nFiscal Years\n2020 2019 2018\nWeighted-average grant date fair value $ 79.30 $ 69.19 $ 62.60\nFair value of units and awards vested during fiscal year ended (in millions)\n$ 8 $ 7 $ 9\nThe restricted stock activity related to the outstanding long-term incentive plans and other awards and corresponding fair value is summarized as follows:\nRestricted Stock Units and Awards Outstanding\n(in Thousands) Weighted-Average Fair Value at Grant Date\nUnvested at December 31, 2019 427 $ 57.29\nGranted 106 79.30\nForfeited (24) 63.12\nVested (157) 48.42\nUnvested at December 31, 2020 352 $ 67.08\nAs of December 2020, unrecognized compensation expense for these restricted stock units and awards was approximately $9 million, which will be expensed over a weighted-average remaining period of two years.\nCSX 2020 Form 10-K p.64\nCSX CORPORATION\nPART II\nItem 8. Financial Statements and Supplementary Data\nNOTE 4. Stock Plans and Share-Based Compensation, continued\nStock Awards for Directors\nCSX’s non-management directors receive a base annual retainer of $112,500 to be paid quarterly in cash, unless the director chooses to defer the retainer in the form of cash or CSX common stock. Additionally, non-management directors receive an annual grant of common stock in the amount of approximately $162,500, with the number of shares to be granted based on the average closing price of CSX stock in the months of November, December and January. The independent non-executive Chairman also receives an annual grant of common stock in the amount of approximately $250,000, with the number of shares to be granted based on the average closing price of CSX stock in the months of November, December, and January. These awards are evaluated periodically by the Board of Directors.\nEmployee Stock Purchase Plan\nIn May 2018, shareholders approved the 2018 CSX Employee Stock Purchase Plan (“ESPP”) for the benefit of Company employees. The Company registered 4 million shares of common stock that may be issued pursuant to this plan. Under the ESPP, employees may contribute between 1% and 10% of base compensation, after-tax, to purchase up to $25,000 of market value CSX common stock per year at 85% of the closing market price on either the grant date or the last day of the six-month offering period, whichever is lower. During 2019 and 2020, the Company issued the following shares under this program.\nFiscal Years\n2020 2019\nShares issued (in thousands) 242 249\nWeighted average purchase price per share $ 60.40 $ 52.72\nNOTE 5. Casualty, Environmental and Other Reserves\nActivity related to casualty, environmental and other reserves is as follows:\nCasualty Environmental Other\n(Dollars in Millions) Reserves Reserves Reserves Total\nDecember 31, 2017 $ 228 $ 90 $ 56 $ 374\nCharged to Expense 21 10 41 72\nPayments (50) (20) (52) (122)\nDecember 31, 2018 199 80 45 324\nCharged to Expense 56 17 34 107\nPayments (68) (23) (35) (126)\nDecember 31, 2019 187 74 44 305\nCharged to Expense 55 20 32 107\nPayments (46) (18) (34) (98)\nDecember 31, 2020 $ 196 $ 76 $ 42 $ 314\nCSX 2020 Form 10-K p.65\nCSX CORPORATION\nPART II\nItem 8. Financial Statements and Supplementary Data\nNOTE 5. Casualty, Environmental and Other Reserves, continued\nPersonal injury and environmental reserves are considered critical accounting estimates due to the need for management judgment. In the table above, the impacts of changes in estimates are included in the charged to expense amount and were not material in 2020, 2019, or 2018. Casualty, environmental and other reserves are provided for in the consolidated balance sheets as shown in the table below.\nDecember 2020 December 2019\n(Dollars in Millions) Current Long-term Total Current Long-term Total\nCasualty:\nPersonal Injury $ 38 $ 93 $ 131 $ 42 $ 87 $ 129\nOccupational 11 54 65 6 52 58\nTotal Casualty $ 49 $ 147 $ 196 $ 48 $ 139 $ 187\nEnvironmental 23 53 76 31 43 74\nOther 18 24 42 21 23 44\nTotal $ 90 $ 224 $ 314 $ 100 $ 205 $ 305\nThese liabilities are accrued when probable and reasonably estimable in accordance with the Contingencies Topic in the ASC. Actual settlements and claims received could differ and final outcomes of these matters cannot be predicted with certainty. Considering the legal defenses currently available, the liabilities that have been recorded and other factors, it is the opinion of management that none of these items individually, when finally resolved, will have a material adverse effect on the Company's financial condition, results of operations or liquidity. Should a number of these items occur in the same period, however, their combined effect could be material in that particular period.\nCasualty\nCasualty reserves of $196 million and $187 million for 2020 and 2019, respectively, represent accruals for personal injury, occupational disease and occupational injury claims. The Company's self-insured retention amount for these claims is $75 million per occurrence. Currently, no individual claim is expected to exceed the self-insured retention amount. Most of the Company's casualty claims relate to CSXT. In accordance with the Contingencies Topic in the ASC, to the extent the value of an individual claim exceeds the self-insured retention amount, the Company would present the liability on a gross basis with a corresponding receivable for insurance recoveries.\nThese reserves fluctuate based upon the timing of payments as well as changes in estimate. Actual results may vary from estimates due to the number, type and severity of the injury, costs of medical treatments and uncertainties in litigation. Defense and processing costs, which historically have been insignificant and are anticipated to be insignificant in the future, are not included in the recorded liabilities. Changes in casualty reserves are included in materials, supplies and other on the consolidated income statements.\nCSX 2020 Form 10-K p.66\nCSX CORPORATION\nPART II\nItem 8. Financial Statements and Supplementary Data\nNOTE 5. Casualty, Environmental and Other Reserves, continued\nPersonal Injury\nPersonal injury reserves represent liabilities for employee work-related and third-party injuries. Work-related injuries for CSXT employees are primarily subject to the Federal Employers' Liability Act (\"FELA\"). CSXT retains an independent actuary to assist management in assessing the value of personal injury claims. An analysis is performed by the actuary quarterly and is reviewed by management. The methodology used by the actuary includes a development factor to reflect growth or reduction in the value of these personal injury claims based largely on CSXT's historical claims and settlement experience. These analyses did not result in a material adjustment to the personal injury reserve in 2020, 2019 or 2018.\nOccupational\nOccupational reserves represent liabilities arising from allegations of exposure to certain materials in the workplace (such as solvents, soaps, chemicals and diesel fumes), past exposure to asbestos or allegations of chronic physical injuries resulting from work conditions (such as repetitive stress injuries). Beginning in second quarter 2020, the Company retains an independent actuary to analyze the Company’s historical claim filings, settlement amounts, and dismissal rates to assist in determining future anticipated claim filing rates and average settlement values. This analysis is performed by the actuary and reviewed by management quarterly. Previously, the quarterly analysis was performed by management. There were no material adjustments to the occupational reserve in 2020, 2019 or 2018.\nEnvironmental\nEnvironmental reserves were $76 million and $74 million for 2020 and 2019, respectively. The Company is a party to various proceedings related to environmental issues, including administrative and judicial proceedings involving private parties and regulatory agencies. The Company has been identified as a potentially responsible party at approximately 220 environmentally impaired sites. Many of these are, or may be, subject to remedial action under the federal Comprehensive Environmental Response, Compensation and Liability Act of 1980 (\"CERCLA\"), also known as the Superfund Law, or similar state statutes. Most of these proceedings arose from environmental conditions on properties used for ongoing or discontinued railroad operations. A number of these proceedings, however, are based on allegations that the Company, or its predecessors, sent hazardous substances to facilities owned or operated by others for treatment, recycling or disposal. In addition, some of the Company’s land holdings were leased to others for commercial or industrial uses that may have resulted in releases of hazardous substances or other regulated materials onto the property and could give rise to proceedings against the Company.\nIn any such proceedings, the Company is subject to environmental clean-up and enforcement actions under the Superfund Law, as well as similar state laws that may impose joint and several liability for clean-up and enforcement costs on current and former owners and operators of a site without regard to fault or the legality of the original conduct. These costs could be substantial.\nCSX 2020 Form 10-K p.67\nCSX CORPORATION\nPART II\nItem 8. Financial Statements and Supplementary Data\nNOTE 5. Casualty, Environmental and Other Reserves, continued\nIn accordance with the Asset Retirement and Environmental Obligations Topic in the ASC, the Company reviews its role with respect to each site identified at least quarterly, giving consideration to a number of factors such as:\n•type of clean-up required;\n•nature of the Company’s alleged connection to the location (e.g., generator of waste sent to the site or owner or operator of the site);\n•extent of the Company’s alleged connection (e.g., volume of waste sent to the location and other relevant factors); and\n•number, connection and financial viability of other named and unnamed potentially responsible parties at the location.\nBased on management's review process, amounts have been recorded to cover contingent anticipated future environmental remediation costs with respect to each site to the extent such costs are reasonably estimable and probable. The recorded liabilities for estimated future environmental costs are undiscounted. The liability includes future costs for remediation and restoration of sites as well as any significant ongoing monitoring costs, but excludes any anticipated insurance recoveries. Payments related to these liabilities are expected to be made over the next several years. Environmental remediation costs are included in materials, supplies and other on the consolidated income statements.\nCurrently, the Company does not possess sufficient information to reasonably estimate the amounts of additional liabilities, if any, on some sites until completion of future environmental studies. In addition, conditions that are currently unknown could, at any given location, result in additional exposure, the amount and materiality of which cannot presently be reasonably estimated. Based upon information currently available, however, the Company believes its environmental reserves accurately reflect the estimated cost of remedial actions currently required.\nOther\nOther reserves were $42 million and $44 million for 2020 and 2019, respectively. These reserves include liabilities for various claims, such as property, automobile and general liability. Also included in other reserves are longshoremen disability claims related to a previously owned international shipping business (these claims are in runoff) as well as claims for current port employees.\nCSX 2020 Form 10-K p.68\nCSX CORPORATION\nPART II\nItem 8. Financial Statements and Supplementary Data\nNOTE 6. Properties\nDetails of the Company’s net properties are as follows:\n(Dollars in Millions) Accumulated Net Book Annual Depreciation Estimated Useful Life Depreciation\nDecember 2020 Cost Depreciation Value Rate ( Avg. Years) Method\nRoad\nRail and Other Track Material $ 8,449 $ (1,739) $ 6,710 2.5% 41 Group Life\nTies 6,284 (1,780) 4,504 3.5% 28 Group Life\nGrading 2,768 (614) 2,154 1.3% 75 Group Life\nBallast 3,238 (1,051) 2,187 2.6% 38 Group Life\nBridges, Trestles, and Culverts 2,688 (380) 2,308 1.7% 60 Group Life\nSignals and Interlockers 3,170 (944) 2,226 4.1% 24 Group Life/ Straight Line (a)\nBuildings 1,366 (529) 837 2.5% 40 Group Life\nOther 5,146 (2,101) 3,045 4.1% 25 Group Life\nTotal Road 33,109 (9,138) 23,971\nEquipment\nLocomotive 5,085 (1,849) 3,236 3.6% 27 Group Life\nFreight Cars 2,557 (540) 2,017 2.9% 35 Group Life\nWork Equipment and Other 2,585 (1,559) 1,026 8.2% 12 Group Life/ Straight Line (a)\nTotal Equipment 10,227 (3,948) 6,279\nLand 1,823 - 1,823 N/A N/A N/A\nConstruction In Progress 371 - 371 N/A N/A N/A\nTotal Properties $ 45,530 $ (13,086) $ 32,444\n(a) For depreciation method, certain asset categories contain intermodal terminals or technology-related assets, which are depreciated using the straight-line method.\nCSX 2020 Form 10-K p.69\nCSX CORPORATION\nPART II\nItem 8. Financial Statements and Supplementary Data\nNOTE 6. Properties, continued\n(Dollars in Millions) Accumulated Net Book Annual Depreciation Estimated Useful Life Depreciation\nDecember 2019 Cost Depreciation Value Rate (Avg. Years) Method\nRoad\nRail and Other Track Material $ 8,194 $ (1,719) $ 6,475 2.5% 40 Group Life\nTies 6,041 (1,666) 4,375 3.7% 27 Group Life\nGrading 2,763 (595) 2,168 1.4% 72 Group Life\nBallast 3,156 (1,013) 2,143 2.7% 37 Group Life\nBridges, Trestles, and Culverts 2,529 (334) 2,195 1.6% 61 Group Life\nSignals and Interlockers 3,077 (819) 2,258 4.0% 25 Group Life/ Straight Line (a)\nBuildings 1,335 (492) 843 2.5% 40 Group Life\nOther 5,030 (1,980) 3,050 4.2% 24 Group Life\nTotal Road 32,125 (8,618) 23,507\nEquipment\nLocomotive 5,320 (2,020) 3,300 3.6% 27 Group Life\nFreight Cars 2,964 (880) 2,084 2.9% 35 Group Life\nWork Equipment and Other 2,424 (1,414) 1,010 8.2% 12 Group Life/ Straight Line (a)\nTotal Equipment 10,708 (4,314) 6,394\nLand 1,836 - 1,836 N/A N/A N/A\nConstruction In Progress 431 - 431 N/A N/A N/A\nTotal Properties $ 45,100 $ (12,932) $ 32,168\n(a) For depreciation method, certain asset categories contain intermodal terminals or technology-related assets, which are depreciated using the straight-line method.\nCSX 2020 Form 10-K p.70\nCSX CORPORATION\nPART II\nItem 8. Financial Statements and Supplementary Data\nNOTE 6. Properties, continued\nCapital Expenditures\nThe Company’s capital investment includes purchased and self-constructed assets and property additions that substantially extend the service life or increase the utility of those assets. Indirect costs that can be specifically traced to capital projects are also capitalized. The Company is committed to maintaining and improving its existing infrastructure and expanding its network capacity for long-term growth. Rail operations are capital intensive and CSX accounts for these costs in accordance with GAAP and the Company’s capitalization policy. All properties are stated at historical cost less an allowance for accumulated depreciation.\nThe Company’s largest category of capital investment is the replacement of track assets and the acquisition or construction of new assets that enable CSX to enhance its operations or provide new capacity offerings to its customers. These construction projects are primarily completed by CSXT employees. Costs for track asset replacement and capacity projects that are capitalized include:\n•labor costs, because many of the assets are self-constructed;\n•costs to purchase or construct new track or to prepare ground for the laying of track;\n•welding (rail, field and plant), which are processes used to connect segments of rail;\n•new ballast, which is gravel and crushed stone that holds track in line;\n•fuels and lubricants associated with tie, rail and surfacing work, which is the process of raising track to a designated elevation over an extended distance;\n•cross, switch and bridge ties, which are the braces that support the rails on a track;\n•gauging, which is the process of standardizing the distance between rails;\n•handling costs associated with installing rail, ties or ballast;\n•usage charge of machinery and equipment utilized in construction or installation; and\n•other track materials.\nLabor is a significant cost in self-constructed track replacement work. CSXT engineering employees directly charge their labor to the track replacement project (the capitalized depreciable property). In replacing track, these employees concurrently perform deconstruction and installation of track material. Because of this concurrent process, CSX must estimate the amount of labor that is related to deconstruction versus installation. As a component of the depreciation study for road and track assets, management performs an analysis of labor costs related to the self-constructed track replacement work, which includes direct observation of track replacement processes. Through this analysis, CSX determined that approximately 20% of labor costs associated with track replacement is related to the deconstruction of old track, for which certain elements are expensed, and 80% is associated with the installation of new track, which is capitalized.\nCapital investment related to locomotives and freight cars comprises the second largest category of the Company’s capital assets. This category includes purchases of locomotives and freight cars as well as certain equipment leases that are considered to be finance leases in accordance with the Leases Topic in the ASC. In addition, costs to modify or rebuild these assets are capitalized if the investment incurred extends the asset’s service life or improves utilization. Improvement projects must meet specified dollar thresholds to be capitalized and are reviewed by management to determine proper accounting treatment. Routine repairs, overhauls and other maintenance costs, for all asset categories, are expensed as incurred.\nCSX 2020 Form 10-K p.71\nCSX CORPORATION\nPART II\nItem 8. Financial Statements and Supplementary Data\nNOTE 6. Properties, continued\nDepreciation Method\nThe depreciable assets of the Company are depreciated using either the group-life or straight-line method of accounting, which are both acceptable depreciation methods in accordance with GAAP. The Company depreciates its railroad assets, including main-line track, locomotives and freight cars, using the group-life method. Assets depreciated under the group-life method comprise 87% of total fixed assets of $45.5 billion on a gross basis as of December 2020. The remaining depreciable assets of the Company, including non-railroad assets and assets under finance leases, are depreciated using the straight-line method on a per asset basis. Land is not depreciated.\nThe group-life method aggregates assets with similar lives and characteristics into groups and depreciates each of these groups as a whole. When using the group-life method, an underlying assumption is that each group of assets, as a whole, is used and depreciated to the end of its group’s recoverable life. The Company currently utilizes different depreciable asset categories to account for depreciation expense for the railroad assets that are depreciated under the group-life method. By utilizing various depreciable categories, the Company can more accurately account for the use of its assets. All assets of the Company are depreciated on a time or life basis.\nThe group-life method of depreciation closely approximates the straight-line method of depreciation. Additionally, due to the nature of most of its assets (e.g. track is one contiguous, connected asset), the Company believes that this is the most accurate and effective way to properly depreciate its assets.\nEstimated Useful Life\nManagement performs a review of depreciation expense and useful lives on a regular basis. Under the group-life method, the service lives and salvage values for each group of assets are determined by completing periodic depreciation studies and applying management’s methods to determine the service lives of its properties. A depreciation study is the periodic review of asset service lives, salvage values, accumulated depreciation, and other related factors for group assets conducted by a third-party specialist, analyzed by the Company’s management and approved by the STB, the regulatory board that has broad jurisdiction over railroad practices. The STB requires depreciation studies be performed every three years for equipment assets (e.g., locomotives and freight cars) and every six years for road and track assets (e.g., bridges, signals, rail, ties, and ballast). The Company believes the frequency of depreciation studies currently required by the STB, complemented by annual data reviews conducted by a third-party specialist and analyzed by the Company's management, provides adequate review of asset service lives and that a more frequent review would not result in a material change due to the long-lived nature of most of the assets.\nThe Company completed a depreciation study for its road and track assets in 2020 and for equipment assets in 2019, both of which resulted in changes to accumulated depreciation, service lives, salvage values, and other related factors for certain assets. Recent experience with depreciation studies has resulted in changes to accumulated depreciation and depreciation rates that did not materially affect the Company's depreciation expense of $1.4 billion, $1.3 billion and $1.3 billion for 2020, 2019 and 2018, respectively.\nCSX 2020 Form 10-K p.72\nCSX CORPORATION\nPART II\nItem 8. Financial Statements and Supplementary Data\nNOTE 6. Properties, continued\nGroup-Life Assets Sales and Retirements\nSince the rail network is one contiguous, connected network it is impractical to maintain specific identification records for these assets. For track assets (e.g., rail, ties, and ballast), CSX utilizes a first-in, first-out approach to asset retirements. Equipment assets (e.g., locomotives and freight cars) are specifically identified at retirement. When an equipment asset is retired that has been depreciated using the group-life method, the cost is reduced from the cost base and recorded in accumulated depreciation.\nFor sales or retirements of assets depreciated under the group-life method that occur in the ordinary course of business, the asset cost (net of salvage value or sales proceeds) is charged to accumulated depreciation and no gain or loss is immediately recognized. This practice is consistent with accounting treatment prescribed under the group-life method. As part of the depreciation study, an assessment of the recorded amount of accumulated depreciation is made to determine if it is deficient (or in excess) of the appropriate amount indicated by the study. Any such deficiency (or excess), including any deferred gains or losses, is amortized as a component of depreciation expense over the remaining service life of the asset group until the next required depreciation study. Since the overall assumption with the group-life method is that the assets within the group on average have the same service life and characteristics, it is therefore concluded that the deferred gains and losses offset over time.\nFor sales or retirements of assets depreciated under the group-life method that do not occur in the ordinary course of business, a gain or loss may be recognized if the sale or retirement meets each of the following three criteria: (i) it is unusual, (ii) it is material in amount, and (iii) it varies significantly from the retirement profile identified through our depreciation studies. No material gains or losses were recognized on the sale of assets depreciated using the group-life method in 2020, 2019, or 2018 as no sales met the criteria described above.\nLand and Straight-line Assets Sales and Retirements\nWhen the Company sells or retires land, land-related easements or assets depreciated under the straight-line method, a gain or loss is recognized in materials, supplies and other on the consolidated statements of income. Primarily as a result of its initiative to monetize non-core properties, the Company recognized gains on the sale of properties of $35 million, $151 million and $154 million in 2020, 2019 and 2018, respectively.\nImpairment Review\nProperties and other long-lived assets are reviewed for impairment whenever events or business conditions indicate the carrying amount of such assets may not be fully recoverable. Initial assessments of recoverability are based on estimates of undiscounted future net cash flows associated with an asset or a group of assets in accordance with the Property, Plant, and Equipment Topic in the ASC. Where impairment is indicated, the assets are evaluated and their carrying amount is reduced to fair value based on discounted net cash flows or other estimates of fair value. Impairment expense of $8 million in 2020 and $24 million in 2018 was primarily due to the discontinuation of certain in-progress projects. In 2019, impairment expense of $22 million was related to an intermodal terminal sale agreement. Impairment expense is recorded in materials, supplies and other expense on the consolidated income statement.\nCSX 2020 Form 10-K p.73\nCSX CORPORATION\nPART II\nItem 8. Financial Statements and Supplementary Data\nNOTE 7. Leases\nAt inception, the Company determines if an arrangement contains a lease and whether that lease meets the classification criteria of a finance or operating lease. Some of the Company’s lease arrangements contain lease components (e.g., minimum rent payments) and non-lease components (e.g., maintenance, labor charges, etc.). The Company generally accounts for each component separately based on the estimated standalone price of each component. For certain equipment leases, such as freight car, vehicles and work equipment, the Company accounts for the lease and non-lease components as a single lease component.\nCertain of the Company’s lease agreements include rental payments that are adjusted periodically for an index or rate. The leases are initially measured using the projected payments adjusted for the index or rate in effect at the commencement date. The Company’s lease agreements do not contain any material residual value guarantees or material restrictive covenants.\nOperating Leases\nOperating leases are included in right-of-use lease assets, other current liabilities and long-term lease liabilities on the consolidated balance sheets. These assets and liabilities are recognized at the commencement date based on the present value of remaining lease payments over the lease term using the Company’s secured incremental borrowing rates or implicit rates, when readily determinable. Short-term operating leases, which have an initial term of 12 months or less, are not recorded on the balance sheet.\nThe Company has various lease agreements with other parties with terms up to 50 years. Non-cancelable, long-term leases may include provisions for maintenance, options to purchase and options to extend the terms. These options are included in the lease term when it is reasonably certain that the option will be exercised. Lease expense for operating leases, including leases with escalations over their terms, is recognized on a straight-line basis over the lease term. Variable lease expense is recognized in the period in which the obligation for those payments is incurred. Lease expense is included in equipment and other rents on the consolidated income statements and is reported net of lease income. Lease income was not material to the results of operations for 2020, 2019 or 2018.\nCSX 2020 Form 10-K p.74\nCSX CORPORATION\nPART II\nItem 8. Financial Statements and Supplementary Data\nNOTE 7. Leases, continued\nCSX has a significant operating lease with the State of Georgia for approximately 137 miles of right-of-way with integral equipment for a term of 50 years with an annual 2.5% increase. The following table presents information about the amount, timing and uncertainty of cash flows arising from all of the Company’s operating leases as of December 31, 2020.\n(Dollars in Millions) December 2020\nMaturity of Lease Liabilities Lease Payments\n2021 47\n2022 43\n2023 36\n2024 36\n2025 35\nThereafter 1,172\nTotal undiscounted operating lease payments $ 1,369\nLess: Imputed interest (869)\nPresent value of operating lease liabilities $ 500\n(Dollars in Millions) 2020 2019\nBalance Sheet Classification\nRight of use asset $ 472 $ 532\nCurrent lease liabilities (recorded in other current liabilities) $ 45 $ 57\nLong-term lease liabilities 455 493\nTotal operating lease liabilities $ 500 $ 550\nOther Information\nWeighted-average remaining lease term for operating leases 35 years 33 years\nWeighted-average discount rate for operating leases 5.0 % 5.0 %\nCash Flows\nAs of December 2020 and 2019, the Company's right-of-use asset was valued at $472 million and $532 million, respectively. An initial asset of $534 million was recognized as a non-cash asset addition upon adoption of the new lease accounting standard effective January 1, 2019. Additional right-of-use assets of $11 million and $51 million were recognized as non-cash asset additions that resulted from new operating lease liabilities during the years ended 2020 and 2019, respectively. Cash paid for amounts included in the present value of operating lease liabilities was $59 million and $60 million during the years ended 2020 and 2019, respectively, and is included in operating cash flows.\nOperating Lease Costs\nThese costs are primarily related to long-term operating leases, but also include immaterial amounts for variable leases and short-term leases with terms greater than 30 days. These amounts are shown in the table below.\nFiscal Years\n(Dollars in Millions) 2020 2019 2018\nRent Expense on Operating Leases $ 82 $ 84 $ 66\nCSX 2020 Form 10-K p.75\nCSX CORPORATION\nPART II\nItem 8. Financial Statements and Supplementary Data\nNOTE 7. Leases, continued\nFinance Leases\nFinance leases are included in properties - net and long-term debt on the consolidated balance sheets and were not material as of December 2020 or December 2019. The associated amortization expense and interest expense are included in depreciation and interest expense, respectively, on the consolidated income statements and were not material to the results of operations for 2020, 2019 or 2018.\nNOTE 8. Commitments and Contingencies\nPurchase Commitments\nCSXT's long-term locomotive maintenance program agreement with a third party contains commitments related to specific locomotive rebuilds and a long-term maintenance program that covers a portion of CSXT’s fleet of locomotives. The maintenance program costs are based on the maintenance cycle for each covered locomotive, which is determined by the asset's age and type. Expected future costs may change as required maintenance schedules are revised and locomotives are placed into or removed from service. Under CSXT’s current obligations, the agreement will expire no earlier than 2035.\nThe following table summarizes the number of locomotives covered and CSXT’s payments under the long-term maintenance program.\nFiscal Years\n(Dollars in Millions) 2020 2019 2018\nAmounts Paid $ 158 $ 139 $ 170\nNumber of Locomotives 1,874 1,897 1,910\nThe total of annual payments under the agreement, including those related to locomotive rebuilds and the long-term locomotive maintenance program, are estimated in the table below.\nAdditionally, the Company has various other commitments to purchase technology, communications, railcar maintenance and other services from various suppliers. Total annual payments under all of these purchase commitments are also estimated in the table below.\n(Dollars in Millions) Locomotive Maintenance & Rebuild Payments Other\nCommitments Total\n2021 $ 195 $ 39 $ 234\n2022 204 22 226\n2023 228 20 248\n2024 270 14 284\n2025 284 14 298\nThereafter 1,892 93 1,985\nTotal $ 3,073 $ 202 $ 3,275\nCSX 2020 Form 10-K p.76\nCSX CORPORATION\nPART II\nItem 8. Financial Statements and Supplementary Data\nNOTE 8. Commitments and Contingencies, continued\nInsurance\nThe Company maintains insurance programs with substantial limits for property damage, including resulting business interruption, and third-party liability. A certain amount of risk is retained by the Company on each insurance program. During 2020, the Company restructured its property insurance program to increase the level at which the Company retains all risk from $50 million to $100 million per occurrence for losses from floods and named windstorms from $25 million to $75 million per occurrence for other property losses. For third-party liability claims, the Company retains all risk up to $75 million per occurrence. As CSX negotiates insurance coverage above its full self-retention amounts, it retains a percentage of risk at various layers of coverage. While the Company believes its insurance coverage is adequate, future claims could exceed existing insurance coverage or insurance may not continue to be available at commercially reasonable rates.\nLegal\nThe Company is involved in litigation incidental to its business and is a party to a number of legal actions and claims, various governmental proceedings and private civil lawsuits, including, but not limited to, those related to fuel surcharge practices, tax matters, environmental and hazardous material exposure matters, FELA and labor claims by current or former employees, other personal injury or property claims and disputes and complaints involving certain transportation rates and charges. Some of the legal proceedings include claims for compensatory as well as punitive damages and others are, or are purported to be, class actions. While the final outcome of these matters cannot be predicted with certainty, considering, among other things, the legal defenses available and liabilities that have been recorded along with applicable insurance, it is currently the opinion of management that none of these pending items will have a material adverse effect on the Company's financial condition, results of operations or liquidity. An unexpected adverse resolution of one or more of these items, however, could have a material adverse effect on the Company's financial condition, results of operations or liquidity in that particular period.\nThe Company is able to estimate a range of possible loss for certain legal proceedings for which a loss is reasonably possible in excess of reserves established. The Company has estimated this range to be $1 million to $24 million in aggregate as of December 31, 2020. This estimated aggregate range is based upon currently available information and is subject to significant judgment and a variety of assumptions. Accordingly, the Company's estimate will change from time to time, and actual losses may vary significantly from the current estimate.\nFuel Surcharge Antitrust Litigation\nIn May 2007, class action lawsuits were filed against CSXT and three other U.S.-based Class I railroads alleging that the defendants' fuel surcharge practices relating to contract and unregulated traffic resulted from an illegal conspiracy in violation of antitrust laws. The class action lawsuits were consolidated into one case in federal court in the District of Columbia. In 2017, the District Court issued its decision denying class certification. On August 16, 2019, the U.S. Court of Appeals for the D.C. Circuit affirmed the District Court’s ruling.\nThe consolidated case is now moving forward without class certification. Although a class was not certified, shippers other than those who brought the original lawsuit in 2007 must decide whether to bring their own individual claim against one or more railroads. Individual shipper claims filed to date have been consolidated into a separate case.\nCSX 2020 Form 10-K p.77\nCSX CORPORATION\nPART II\nItem 8. Financial Statements and Supplementary Data\nNOTE 8. Commitments and Contingencies, continued\nCSXT believes that its fuel surcharge practices were arrived at and applied lawfully and that the case is without merit. Accordingly, the Company intends to defend itself vigorously. However, penalties for violating antitrust laws can be severe, and resolution of these matters individually or when aggregated could have a material adverse effect on the Company's financial condition, results of operations or liquidity in that particular period.\nEnvironmental\nCSXT is indemnifying Pharmacia LLC, formerly known as Monsanto Company, (\"Pharmacia\") for certain liabilities associated with real estate located in Kearny, New Jersey along the Lower Passaic River (the “Property”). The Property, which was formerly owned by Pharmacia, is now owned by CSXT. CSXT's indemnification and defense duties arise with respect to several matters. The U.S. Environmental Protection Agency (\"EPA\"), using its CERCLA authority, seeks the investigation and cleanup of hazardous substances in the 17-mile Lower Passaic River Study Area (the \"Study Area”). CSXT, on behalf of Pharmacia, and a significant number of other potentially responsible parties are together conducting a Remedial Investigation and Feasibility Study of the Study Area pursuant to an Administrative Settlement Agreement and Order on Consent with the EPA. Pharmacia’s share of responsibility, indemnified by CSXT, for the investigation and cleanup costs of the Study Area may be determined through various mechanisms including (a) an allocation and settlement with EPA; (b) litigation brought by EPA against non-settling parties; or (c) litigation among the responsible parties.\nIn March 2016, EPA issued its Record of Decision detailing the agency’s mandated remedial process for the lower 8 miles of the Study Area. Approximately 80 parties, including Pharmacia, are participating in an EPA-directed allocation and settlement process to assign responsibility for the remedy selected for the lower 8 miles of the Study Area. CSXT is participating in the EPA-directed allocation and settlement process on behalf of Pharmacia. At a later date, EPA will select a remedy for the remainder of the Study Area and is expected to again seek the participation of private parties to implement the selected remedy using EPA’s CERCLA authority to compel such participation, if necessary.\nCSXT is also defending and indemnifying Pharmacia with regard to the Property in litigation filed by Occidental Chemical Corporation, which is seeking to recover various costs. These costs include costs for the remedial design of the lower 8 miles of the Study Area, as well as anticipated costs associated with the future remediation of the lower 8 miles of the Study Area and potentially the entire Study Area. Alternatively, Occidental seeks to compel some, or all of the defendants to participate in the remediation of the Study Area. Pharmacia is one of approximately 110 defendants in this federal lawsuit filed by Occidental on June 30, 2018.\nCSXT is also defending and indemnifying Pharmacia in a cooperative natural resource damages assessment process related to the Property. Based on currently available information, the Company does not believe any indemnification or remediation costs potentially allocable to CSXT with respect to the Property and the Study Area would be material to the Company's financial condition, results of operations or liquidity.\nCSX 2020 Form 10-K p.78\nCSX CORPORATION\nPART II\nItem 8. Financial Statements and Supplementary Data\nNOTE 9. Employee Benefit Plans\nThe Company sponsors defined benefit pension plans principally for salaried, management personnel. For employees hired prior to 2003, the plans provide eligible employees with retirement benefits based predominantly on years of service and compensation rates near retirement. For employees hired between 2003 and 2019, benefits are determined based on a cash balance formula, which provides benefits by utilizing interest and pay credits based upon age, service and compensation. Beginning in 2020, the CSX Pension Plan was closed to new participants.\nIn addition to these plans, the Company sponsors a post-retirement medical plan and a life insurance plan that provide certain benefits to full-time, salaried, management employees hired prior to 2003 upon their retirement if certain eligibility requirements are met. Changes to the post-retirement medical and life insurance plans were communicated to participants in October 2018. Beginning in 2019, both the life insurance benefit for eligible active employees and health savings account contributions made by the Company to eligible retirees younger than 65 were eliminated. Beginning in 2020, the employer-funded health reimbursement arrangements for eligible retirees 65 years or older were eliminated. As a result of these plan amendments, the Company recognized a decrease of $102 million in the post-retirement benefit liability and a corresponding gain in other comprehensive income in 2018. These changes did not result in a curtailment loss as there was no material impact to service costs for active plan participants.\nThe Company engages independent actuaries to compute the amounts of liabilities and expenses relating to these plans subject to the assumptions that the Company determines are appropriate based on historical trends, current market rates and future projections. These amounts are reviewed by management. In order to perform this valuation, the actuaries are provided with the details of the population covered at the beginning of the year, summarized in the table below, and projects that population forward to the end of the year.\nSummary of Participants as of\nJanuary 1, 2020\nPension Plans Post-retirement Medical Plan\nActive Employees 3,373 779\nRetirees and Beneficiaries 11,841 2,282\nOther(a)\n3,854 -\nTotal 19,068 3,061\n(a) For pension plans, the other category consists mostly of terminated but vested former employees.\nCSX 2020 Form 10-K p.79\nCSX CORPORATION\nPART II\nItem 8. Financial Statements and Supplementary Data\nNOTE 9. Employee Benefit Plans, continued\nThe benefit obligation for these plans represents the liability of the Company for current and retired employees and is affected primarily by the following:\n•service cost (benefits attributed to employee service during the period);\n•interest cost (interest on the liability due to the passage of time);\n•actuarial gains/losses (experience during the year different from that assumed and changes in plan assumptions); and\n•benefits paid to participants.\nCash Flows\nPlan assets are amounts that have been segregated and restricted to provide qualified pension plan benefits and include amounts contributed by the Company and amounts earned from invested contributions, net of benefits paid. Qualified pension plan obligations are funded in accordance with regulatory requirements and with an objective of meeting or exceeding minimum funding requirements necessary to avoid restrictions on flexibility of plan operation and benefit payments. The Company funds the cost of the post-retirement medical and life insurance benefits as well as nonqualified pension benefits on a pay-as-you-go basis. No qualified pension plan contributions were made during 2020, 2019 and 2018. No contributions to the Company's qualified pension plans are expected in 2021.\nFuture expected benefit payments are as follows:\nExpected Cash Flows\n(Dollars in Millions) Pension Benefits Post-retirement Benefits\n2021 $ 196 $ 17\n2022 188 10\n2023 187 9\n2024 186 8\n2025 185 8\n2026-2030 898 28\nTotal $ 1,840 $ 80\nPlan Assets\nDuring 2020, the Company migrated to an outsourced investment management strategy to manage the pension plan assets. The CSX Investment Committee (the “Investment Committee”), whose members are selected by the Executive Vice President and Chief Financial Officer, is responsible for setting policy and oversight of investment management. The Investment Committee and investment manager utilize an investment asset allocation strategy that is monitored on an ongoing basis and updated periodically in consideration of plan or employee changes, or changing market conditions. Periodic studies provide an extensive modeling of asset investment return in conjunction with projected plan liabilities and seek to evaluate how to maximize return within the constraints of acceptable risk.\nCSX 2020 Form 10-K p.80\nCSX CORPORATION\nPART II\nItem 8. Financial Statements and Supplementary Data\nNOTE 9. Employee Benefit Plans, continued\nThe current asset allocation targets 60% growth-oriented investments and 40% immunizing investments. The growth-oriented portfolio consists of return-seeking investments that are diversified across geography, market capitalization, and asset class. The immunizing portfolio is comprised of a customized mix of fixed income and cash investments designed to reduce liability risk. Allocations are evaluated for levels within 5% of targeted allocations and are adjusted quarterly as necessary.\nThe distribution of pension plan assets as of the measurement date is shown in the table below, and these assets are reported net of pension liabilities on the balance sheet.\nDecember 2020 December 2019\nPercent of Percent of\n(Dollars in Millions) Amount Total Assets Amount Total Assets\nGrowth-Oriented $ 1,816 61 % $ 2,027 72 %\nEquity 1,324 44 1,772 63\nFixed Income 271 9 229 8\nCash and Cash Equivalents 221 8 26 1\nImmunizing 1,184 39 798 28\nFixed Income 1,018 34 595 21\nCash and Cash Equivalents 166 5 203 7\nTotal $ 3,000 100 % $ 2,825 100 %\nUnder the supervision of the Investment Committee, the investment manager selects investments or fund managers in accordance with standards of prudence applicable to asset diversification and investment suitability. The Company also selects fund managers with differing investment styles and benchmarks their investment returns against appropriate indices. Fund investment performance is continuously monitored. Acceptable performance is determined in the context of the long-term return objectives of the fund and appropriate asset class benchmarks.\nWithin the Company's equity funds, domestic stock is diversified among large and small capitalization stocks. International stock is diversified in a similar manner as well as in developed versus emerging markets stocks. Guidelines established with individual managers limit investment by industry sectors, individual stock issuer concentration and the use of derivatives and CSX securities.\nFixed income securities guidelines established with individual managers specify the types of allowable investments, such as government, corporate and asset-backed bonds, target certain allocation ranges for domestic and foreign investments and limit the use of certain derivatives. Additionally, guidelines stipulate minimum credit quality constraints and any prohibited securities. For detailed information regarding the fair value of pension assets, see Note 13, Fair Value Measurements.\nCSX 2020 Form 10-K p.81\nCSX CORPORATION\nPART II\nItem 8. Financial Statements and Supplementary Data\nNOTE 9. Employee Benefit Plans, continued\nBenefit Obligation, Plan Assets and Funded Status\nChanges in benefit obligation and the fair value of plan assets for the 2020 and 2019 calendar plan years are as follows:\nPension Benefits Post-retirement Benefits\nPlan Year Plan Year Plan Year Plan Year\n(Dollars in Millions) 2020 2019 2020 2019\nActuarial Present Value of Benefit Obligation\nAccumulated Benefit Obligation $ 3,134 $ 2,963 N/A N/A\nProjected Benefit Obligation 3,257 3,122 $ 96 $ 117\nChange in Projected Benefit Obligation:\nProjected Benefit Obligation at Beginning of Plan Year\n$ 3,122 $ 2,758 $ 117 $ 118\nService Cost (a)\n46 34 1 1\nInterest Cost 82 103 5 2\nPlan Participants' Contributions - - 6 7\nActuarial Loss (Gain) 197 418 (11) 22\nBenefits Paid (190) (191) (22) (33)\nBenefit Obligation at End of Plan Year $ 3,257 $ 3,122 $ 96 $ 117\nChange in Plan Assets:\nFair Value of Plan Assets at Beginning of Plan Year $ 2,825 $ 2,431 $ - $ -\nActual Return on Plan Assets 345 568 - -\nNon-qualified Employer Contributions 20 17 16 26\nPlan Participants' Contributions - - 6 7\nBenefits Paid (190) (191) (22) (33)\nFair Value of Plan Assets at End of Plan Year 3,000 2,825 - -\nFunded Status at End of Plan Year $ (257) $ (297) $ (96) $ (117)\n(a)Service cost for each 2020 and 2019 includes capitalized service costs of $3 million.\nThe $197 million net actuarial loss for pension benefits in 2020 was driven by a 70 bps decrease in the weighted average discount rate, partially offset by changes to assumptions based on census data. The $11 million net actuarial gain for post-retirement benefits in 2020 was driven by favorable participant experience and changes to assumptions based on census data. In 2019, the $418 million net actuarial loss for pension benefits and the $22 million net actuarial loss for post-retirement benefits were driven by a 111 bps decrease in the weighted average discount rate.\nCSX 2020 Form 10-K p.82\nCSX CORPORATION\nPART II\nItem 8. Financial Statements and Supplementary Data\nNOTE 9. Employee Benefit Plans, continued\nFor qualified plan funding purposes, assets and discounted liabilities are measured in accordance with the Employee Retirement Income Security Act (\"ERISA\"), as well as other related provisions of the Internal Revenue Code and related regulations. Under these funding provisions and the alternative measurements available thereunder, the Company estimates its unfunded obligation for qualified plans on an annual basis.\nIn accordance with Compensation-Retirement Benefits Topic in the ASC, an employer must recognize the funded status of a pension or other post-retirement benefit plan by recording a liability (underfunded plan) or asset (overfunded plan) for the difference between the projected benefit obligation (or the accumulated post-retirement benefit obligation for a post-retirement benefit plan) and the fair value of plan assets at the plan measurement date. Amounts related to pension and post-retirement benefits recorded in other long-term assets, labor and fringe benefits payable and other long-term liabilities on the balance sheet are as follows:\nPension Benefits Post-retirement Benefits\nDecember December December December\n(Dollars in Millions) 2020 2019 2020 2019\nAmounts Recorded in Consolidated\nBalance Sheets:\nLong-term Assets (a)\n$ 29 $ 25 $ - $ -\nCurrent Liabilities (16) (17) (17) (20)\nLong-term Liabilities (270) (305) (79) (97)\nNet Amount Recognized in\nConsolidated Balance Sheets $ (257) $ (297) $ (96) $ (117)\n(a)Long-term assets as of December 2020 and 2019 relate to qualified pension plans where assets exceed projected benefit obligations.\nThe funded status, or amount by which the benefit obligation exceeds the fair value of plan assets, represents a liability. At December 2020, the status of CSX plans with a net liability only is disclosed below. The total fair value of all plan assets as of December 2020 was $3.0 billion, which includes the qualified pension plans with net assets.\nAggregate\n(Dollars in Millions) Fair Value Aggregate\nBenefit Obligations in Excess of Plan Assets of Plan Assets Benefit Obligation\nProjected Benefit Obligation $ 2,884 $ (3,170)\nAccumulated Benefit Obligation 2,884 (264)\nCSX 2020 Form 10-K p.83\nCSX CORPORATION\nPART II\nItem 8. Financial Statements and Supplementary Data\nNOTE 9. Employee Benefit Plans, continued\nNet Benefit Expense\nOnly the service cost component of net periodic benefit costs is included in labor and fringe expense on the consolidated income statement. All other components of net periodic benefit cost are included in other income - net. The following table describes the components of expense/(income) related to net benefit expense recorded on the income statement.\nPension Benefits\nFiscal Years Post-retirement Benefits\nFiscal Years\n(Dollars in Millions) 2020 2019 2018 2020 2019 2018\nService Cost Included in Labor and Fringe $ 43 $ 31 $ 32 $ 1 $ 1 $ 2\nInterest Cost 82 103 92 5 2 7\nExpected Return on Plan Assets (176) (171) (176) - - -\nAmortization of Net Loss 54 30 41 1 - -\nAmortization of Prior Service Cost - - - (7) (7) (2)\nTotal (Income)/ Expense Included in Other Income - Net (40) (38) (43) (1) (5) 5\nNet Periodic Benefit Cost/(Credit) $ 3 $ (7) $ (11) $ - $ (4) $ 7\nSettlement Gain (1) - (1) - - -\nTotal Periodic Benefit Cost/(Credit) $ 2 $ (7) $ (12) $ - $ (4) $ 7\nPension and Other Post-retirement Benefits Adjustments\nThe following table shows the pre-tax change in other comprehensive loss (income) attributable to certain components of net benefit expense and the change in benefit obligation for CSX for pension and other post-employment benefits.\n(Dollars in Millions) Pension Benefits Post-retirement Benefits\nComponents of Other Comprehensive December December December December\nLoss (Income) 2020 2019 2020 2019\nRecognized in the Balance Sheet\nLosses (Gains) $ 28 $ 21 $ (11) $ 22\nExpense (Income) Recognized in the Income Statement\nAmortization of Net Losses $ 54 $ 30 $ 1 $ -\nSettlement Gain (1) - - -\nAmortization of Prior Service Costs\n- - (7) (7)\nAs of December 2020, the balances to be amortized related to the Company's pension obligations is a pre-tax loss of $854 million and related to post-retirement obligations is a pre-tax gain of $78 million. These amounts are included in accumulated other comprehensive loss, a component of shareholders’ equity.\nCSX 2020 Form 10-K p.84\nCSX CORPORATION\nPART II\nItem 8. Financial Statements and Supplementary Data\nNOTE 9. Employee Benefit Plans, continued\nAssumptions\nThe expected long-term average rate of return on plan assets reflects the average rate of earnings expected on the funds invested, or to be invested, to provide for benefits included in the projected benefit obligation. In estimating that rate, the Company gives appropriate consideration to the returns being earned by the plan assets in the funds and the rates of return expected to be available for reinvestment as well as the current and projected asset mix of the funds. Management, with the assistance of the outsourced investment manager, balances market expectations obtained from various investment managers with both market and actual plan historical returns to develop a reasonable estimate of the expected long-term rate of return on assets. This assumption is reviewed annually and adjusted as deemed appropriate.\nThe Company measures the service cost and interest cost components of the net pension and post-retirement benefits expense by using individual spot rates matched with separate cash flows for each future year. The weighted averages of assumptions used by the Company to value its pension and post-retirement obligations were as follows:\nPension Benefits Post-retirement Benefits\n2020 2019 2020 2019\nExpected Long-term Return on Plan Assets:\nBenefit Cost for Current Plan Year 6.75 % 6.75 % N/A N/A\nBenefit Cost for Subsequent Plan Year 6.75 % 6.75 % N/A N/A\nDiscount Rates:\nBenefit Cost for Plan Year\nService Cost for Plan Year 3.32 % 4.40 % 2.93 % 4.14 %\nInterest Cost for Plan Year 2.69 % 3.87 % 2.43 % 3.51 %\nBenefit Obligation at End of Plan Year 2.43 % 3.13 % 2.07 % 2.87 %\nSalary Scale Inflation 4.60 % 4.60 % N/A N/A\nCash Balance Plan Interest Credit Rate 3.75 % 3.75 % N/A N/A\nOther Plans\nUnder collective bargaining agreements, the Company participates in a multi-employer benefit plan, which provides certain post-retirement health care and life insurance benefits to eligible contract employees. Premiums under this plan are expensed as incurred and amounted to $20 million, $26 million and $30 million in 2020, 2019 and 2018, respectively.\nThe Company maintains savings plans for virtually all full-time salaried employees and certain employees covered by collective bargaining agreements. Expense associated with these plans was $39 million, $41 million and $41 million for 2020, 2019 and 2018, respectively, and is included in labor and fringe expense on the consolidated income statement.\nCSX 2020 Form 10-K p.85\nCSX CORPORATION\nPART II\nItem 8. Financial Statements and Supplementary Data\nNOTE 10. Debt and Credit Agreements\nDebt at December 2020 and December 2019 is shown in the table below. For information regarding the fair value of debt, see Note 13, Fair Value Measurements.\nMaturity at\nDecember Average\nInterest\nRates at\nDecember December December\n(Dollars in Millions) 2020 2020 2020 2019\nNotes 2021-2068 4.0% $ 16,542 $ 16,056\nEquipment Obligations(a)\n2021-2023 6.3% 160 178\nFinance Leases 2020-2026 14.5% 3 4\nSubtotal Long-term Debt (including current portion) $ 16,705 $ 16,238\nLess Debt Due within One Year (401) (245)\nLong-term Debt (excluding current portion) $ 16,304 $ 15,993\n(a) Equipment obligations are secured by an interest in certain railroad equipment.\nDebt Issuance & Early Redemption of Long-term Debt\nCSX issued the following notes, which are included in the consolidated balance sheets under long-term debt and may be redeemed by the Company at any time, subject to payment of certain make-whole premiums:\n•On December 1, 2020, issued $500 million of 2.50% notes due 2051. On December 30, 2020, the proceeds of the offering were used to fully redeem CSX’s outstanding $500 million of 3.70% notes that otherwise would have matured on November 1, 2023.\n•On March 30, 2020, issued $500 million of 3.8% notes due 2050.\n•On September 12, 2019, issued $400 million of 2.40% notes due 2030 and $600 million of 3.35% notes due 2049. On October 15, 2019, a portion of the net proceeds was used to fully redeem CSX’s outstanding $500 million of 3.70% notes that otherwise would have matured on October 30, 2020.\n•On February 28, 2019, issued $600 million of 4.25% notes due 2029, which was a reopening of existing notes originally issued in November 2018, and $400 million of 4.50% notes due 2049.\nThe net proceeds from debt issuances will be used for general corporate purposes, which may include debt repayments, repurchases of CSX's common stock, capital investment, working capital requirements, improvements in productivity and other cost reductions. For more information regarding a non-cash debt transaction with a related party, see Note 15, Investment in Affiliates and Related-Party Transactions.\nCSX 2020 Form 10-K p.86\nCSX CORPORATION\nPART II\nItem 8. Financial Statements and Supplementary Data\nNOTE 10. Debt and Credit Agreements, continued\nLong-term Debt Maturities (Net of Discounts, Premiums and Issuance Costs)\n(Dollars in Millions) Maturities at\nFiscal Years Ending December 2020\n2021 $ 401\n2022 162\n2023 139\n2024 551\n2025 601\nThereafter 14,851\nTotal Long-term Debt Maturities, including current portion $ 16,705\nInterest Rate Derivatives\nOn both April 29, 2020, and July 9, 2020, the Company executed a forward starting interest rate swap with a notional value of $250 million for an aggregate notional value of $500 million. These swaps were effected to hedge the benchmark interest rate associated with future interest payments related to the anticipated refinancing of $850 million of 3.25% notes due in 2027. In accordance with the Derivatives and Hedging Topic in the ASC, the Company has designated these swaps as cash flow hedges. As of December 31, 2020, the asset value of the forward starting interest rate swaps was $80 million and was recorded in other long-term assets on the consolidated balance sheet.\nUnrealized gains or losses associated with changes in the fair value of the hedge are recorded net of tax in accumulated other comprehensive income (“AOCI”) on the consolidated balance sheet. Unless settled early, the swaps will expire in 2027 and the unrealized gain or loss in AOCI will be recognized in earnings as an adjustment to interest expense over the same period during which the hedged transaction affects earnings. Unrealized gains, recorded net of tax in other comprehensive income, related to the hedges were $62 million for the year ended December 31, 2020.\nCredit Facilities\nCSX has a $1.2 billion unsecured, revolving credit facility backed by a diverse syndicate of banks. This facility allows same-day borrowings at floating interest rates, based on LIBOR or an agreed-upon replacement, plus a spread that depends upon CSX's senior unsecured debt ratings. LIBOR is the London Interbank Offered Rate, which is a daily reference rate based on the interest rates at which banks offer to lend unsecured funds. This facility expires in March 2024, and as of December 31, 2020, the Company had no outstanding balances under this facility.\nCommitment fees and interest rates payable under the facility were similar to fees and rates available to comparably rated investment-grade borrowers. As of December 31, 2020, CSX was in compliance with all covenant requirements under the facility.\nCommercial Paper\nUnder its commercial paper program, which is backed by the revolving credit facility, the Company may issue unsecured commercial paper notes up to a maximum aggregate principal amount of $1.0 billion. Proceeds from issuances of the notes are expected to be used for general corporate purposes. At December 31, 2020, the Company had no commercial paper outstanding.\nCSX 2020 Form 10-K p.87\nCSX CORPORATION\nPART II\nItem 8. Financial Statements and Supplementary Data\nNOTE 11. Revenues\nThe Company’s revenues are primarily derived from the transportation of freight as performance obligations that arise from its contracts with customers are satisfied. The following table presents the Company’s revenues disaggregated by market as this best depicts how the nature, amount, timing and uncertainty of revenue and cash flows are affected by economic factors.\nFiscal Years\n(Dollars in millions) 2020 2019 2018\nChemicals(a)\n$ 2,309 $ 2,349 $ 2,344\nAgricultural and Food Products 1,386 1,410 1,306\nAutomotive 920 1,236 1,267\nForest Products(a)\n824 862 834\nMetals and Equipment(a)\n675 742 771\nMinerals(a)\n538 559 527\nFertilizers 424 431 442\nTotal Merchandise 7,076 7,589 7,491\nIntermodal 1,702 1,760 1,931\nCoal 1,397 2,070 2,246\nOther 408 518 582\nTotal $ 10,583 $ 11,937 $ 12,250\n(a) In first quarter 2020, changes were made in the categorization of certain lines of business, impacting Chemicals, Forest Products, Metals and Equipment, and Minerals. The impacts were not material and prior periods have been reclassified to conform to the current presentation.\nRevenue Recognition\nThe Company generates revenue from freight billings under contracts with customers generally on a rate per carload, container or ton-basis based on length of haul and commodities carried. The Company’s performance obligation arises when it receives a bill of lading (“BOL”) to transport a customer's commodities at a negotiated price contained in a transportation services agreement or a publicly disclosed tariff rate. Once a BOL is received, a contract is formed whereby the parties are committed to perform, collectability of consideration is probable and the rights of the parties, shipping terms and conditions, and payment terms are identified. A customer may submit several BOLs for transportation services at various times throughout a service agreement term, but each shipment represents a distinct service that is a separately identified performance obligation.\nCSX 2020 Form 10-K p.88\nCSX CORPORATION\nPART II\nItem 8. Financial Statements and Supplementary Data\nNOTE 11. Revenues, continued\nThe average transit time to complete a shipment is between 2 to 7 days depending on market. Payments for transportation services are normally billed once a BOL is received and are generally due within 15 days after the invoice date. The Company recognizes revenue over transit time of freight as it moves from origin to destination. Revenue for services started but not completed at the reporting date is allocated based on the relative transit time in each reporting period, with the portion allocated for services subsequent to the reporting date considered remaining performance obligations.\nThe certain key estimates included in the recognition and measurement of revenue and related accounts receivable are as follows:\n•Revenue associated with shipments in transit is recognized ratably over transit time and is based on average cycle times to move commodities and products from their origin to their final destination or interchange;\n•Adjustments to revenue for billing corrections and billing discounts;\n•Adjustments to revenue for overcharge claims filed by customers, which are based on historical payments to customers for rate overcharges as a percentage of total billing; and\n•Incentive-based refunds to customers, which are primarily volume-related, are recorded as a reduction to revenue on the basis of the projected liability (this estimate is based on historical activity, current volume levels and forecasted future volume).\nRevenue related to interline transportation services that involve the services of another party, such as another railroad, is reported on a net basis. The portion of the gross amount billed to customers that is remitted by the Company to another party is not reflected as revenue.\nOther revenue is comprised of revenue from regional subsidiary railroads and incidental charges, including demurrage and switching. It is recorded upon completion of the service and accounts for an immaterial percentage of the Company’s total revenue. Revenue from regional subsidiary railroads includes shipments by railroads that the Company does not directly operate. Demurrage represents charges assessed when freight cars are held by a customer beyond a specified period of time. Switching represents charges assessed when a railroad switches cars for a customer or another railroad.\nDuring 2020, 2019 and 2018, revenue recognized from performance obligations related to prior periods (for example, due to changes in transaction price) was not material.\nRemaining Performance Obligations\nRemaining performance obligations represent the transaction price allocated to future reporting periods for freight services started but not completed at the reporting date. This includes the unearned portion of billed and unbilled amounts for cancellable freight shipments in transit. The Company expects to recognize the unearned portion of revenue for freight services in transit within one week of the reporting date. As of December 31, 2020, remaining performance obligations were not material.\nCSX 2020 Form 10-K p.89\nCSX CORPORATION\nPART II\nItem 8. Financial Statements and Supplementary Data\nNOTE 11. Revenues, continued\nContract Balances and Accounts Receivable\nThe timing of revenue recognition, billings and cash collections results in accounts receivable and customer advances and deposits (contract liabilities) on the consolidated balance sheets. Contract assets, contract liabilities and deferred contract costs recorded on the consolidated balance sheet as of December 31, 2020 were not material.\nThe Company’s accounts receivable - net consists of freight and non-freight receivables, reduced by an allowance for credit losses.\n(Dollars in millions) December 31,\n2020 December 31,\nFreight Receivables $ 716 $ 790\nFreight Allowance for Credit Losses (16) (21)\nFreight Receivables, net 700 769\nNon-Freight Receivables 224 226\nNon-Freight Allowance for Credit Losses (12) (9)\nNon-Freight Receivables, net 212 217\nTotal Accounts Receivable, net $ 912 $ 986\nFreight receivables include amounts earned, billed and unbilled, and currently due from customers for transportation-related services. Non-freight receivables include amounts billed and unbilled and currently due related to government reimbursement receivables and other non-revenue receivables. The Company maintains an allowance for credit losses to provide for the estimated amount of receivables that will not be collected. The allowance is based upon an assessment of risk characteristics, historical payment experience, and the age of outstanding receivables adjusted for forward-looking economic conditions as necessary. Credit losses recognized on the Company’s accounts receivable were not material in 2020 and 2019.\nCSX 2020 Form 10-K p.90\nCSX CORPORATION\nPART II\nItem 8. Financial Statements and Supplementary Data\nNOTE 12. Income Taxes\nEarnings before income taxes of $3.6 billion, $4.3 billion and $4.3 billion for fiscal years 2020, 2019 and 2018, respectively, represent earnings from domestic operations. The breakdown of income tax expense between current and deferred is as follows:\nFiscal Years\n(Dollars in Millions) 2020 2019 2018\nCurrent:\nFederal $ 559 $ 608 $ 572\nState 123 104 144\nSubtotal Current 682 712 716\nDeferred:\nFederal 149 235 275\nState 31 38 4\nSubtotal Deferred 180 273 279\nTotal Income Tax Expense $ 862 $ 985 $ 995\nThe Company recorded a 2020 income tax benefit of $30 million primarily as a result of the additional tax benefit associated with vesting of share-based awards and the resolution of certain tax matters. In 2019, the Company recorded an income tax benefit of $77 million primarily as a result of the additional tax benefit associated with vesting of share-based awards, the settlement of certain state tax matters, federal and state legislative changes, and a change in the valuation of deferred taxes as a result of filing the 2018 tax returns. The Company recorded a 2018 income tax benefit of $62 million primarily as a result of the additional tax benefit associated with vesting of share-based awards, state legislative changes, the settlement of certain state tax matters and a change in the valuation of deferred taxes as a result of filing the 2017 tax returns.\nIncome tax expense reconciled to the tax computed at statutory rates is presented in the following table.\nFiscal Years\n(Dollars In Millions) 2020 2019 2018\nFederal Income Taxes $ 762 21.0 % $ 906 21.0 % $ 904 21.0 %\nState Income Taxes 117 3.2 % 108 2.5 % 112 2.6 %\nOther (17) (0.4) % (29) (0.7) % (21) (0.5) %\nIncome Tax Expense/ Rate $ 862 23.8 % $ 985 22.8 % $ 995 23.1 %\nCSX 2020 Form 10-K p.91\nCSX CORPORATION\nPART II\nItem 8. Financial Statements and Supplementary Data\nNOTE 12. Income Taxes, continued\nThe primary factors in the change in year-end net deferred income tax liability balances include the annual provision for deferred income tax expense and accumulated other comprehensive income/loss. The significant components of deferred income tax assets and liabilities include:\n2020 2019\n(Dollars in Millions) Assets Liabilities Assets Liabilities\nPension Plans $ 62 $ - $ 71 $ -\nOther Employee Benefit Plans 96 - 127 -\nAccelerated Depreciation - 7,195 - 7,020\nOther 320 451 426 565\nTotal $ 478 $ 7,646 $ 624 $ 7,585\nNet Deferred Income Tax Liabilities $ 7,168 $ 6,961\nThe Company files a consolidated federal income tax return, which includes its principal domestic subsidiaries. CSX and its subsidiaries are subject to U.S. federal income tax as well as income tax of multiple state jurisdictions. CSX participated in a contemporaneous IRS audit of tax years 2020 and 2019. Federal examinations of original federal income tax returns for all years through 2018 are resolved.\nAs of December 2020, 2019 and 2018, the Company had approximately $16 million, $13 million and $12 million, respectively, of total unrecognized tax benefits as a result of uncertain tax positions. These tax benefits that were $13 million, $10 million and $9 million net of tax in 2020, 2019 and 2018, respectively, could favorably impact the effective income tax rate in each year. The Company does not expect that unrecognized tax benefits as of December 2020 for various state and federal income tax matters will significantly change over the next 12 months. The final outcome of these uncertain tax positions is not yet determinable. There were no material changes to the total gross unrecognized tax benefits and prior year audit resolutions of the Company during the fiscal year ended December 2020.\nCSX’s continuing practice is to recognize net interest and penalties related to income tax matters in income tax expense. Accrued interest and penalties were not material as of December 2020 or 2019. Additionally, expenses from changes to the reserves for interest and penalties were not material in 2020, 2019 or 2018.\nCSX 2020 Form 10-K p.92\nCSX CORPORATION\nPART II\nItem 8. Financial Statements and Supplementary Data\nNOTE 13. Fair Value Measurements\nThe Financial Instruments Topic in the ASC requires disclosures about fair value of financial instruments in annual reports as well as in quarterly reports. For CSX, this statement applies to certain investments, pension plan assets, long-term debt and interest rate derivatives. Also, the Fair Value Measurements and Disclosures Topic in the ASC clarifies the definition of fair value for financial reporting, establishes a framework for measuring fair value and requires additional disclosures about the use of fair value measurements.\nVarious inputs are considered when determining the value of the Company's investments, pension plan assets, long-term debt and interest rate derivatives. The inputs or methodologies used for valuing securities are not necessarily an indication of the risk associated with investing in these securities. These inputs are summarized in the three broad levels listed below:\n•Level 1 - observable market inputs that are unadjusted quoted prices for identical assets or liabilities in active markets;\n•Level 2 - other significant observable inputs (including quoted prices for similar securities, interest rates, credit risk, etc.); and\n•Level 3 - significant unobservable inputs (including the Company’s own assumptions about the assumptions market participants would use in determining the fair value of investments).\nThe valuation methods described below may produce a fair value calculation that may not be indicative of net realizable value or reflective of future fair values. Furthermore, while the Company believes its valuation methods are appropriate and consistent with other market participants, the use of different methodologies or assumptions to determine the fair value of certain financial instruments could result in a different fair value measurement at the reporting date.\nInvestments\nThe Company's investment assets, valued with assistance from a third-party trustee, consist of certificates of deposits, commercial paper, corporate bonds and government securities and are carried at fair value on the consolidated balance sheet per the Fair Value Measurements and Disclosures Topic in the ASC. There are several valuation methodologies used for those assets as described below:\n•Commercial Paper and Certificates of Deposit (Level 2): Valued at amortized cost, which approximates fair value; and\n•Corporate Bonds and Government Securities (Level 2): Valued using broker quotes that utilize observable market inputs.\nCSX 2020 Form 10-K p.93\nCSX CORPORATION\nPART II\nItem 8. Financial Statements and Supplementary Data\nNOTE 13. Fair Value Measurements, continued\nThe Company's investment assets are carried at fair value on the consolidated balance sheets as summarized in the following table. All of the inputs used to determine the fair value of the Company's investments are Level 2 inputs.\nFiscal Years\n2020 2019\n(Dollars in Millions) Level 2 Level 2\nCorporate Bonds $ 68 $ 59\nGovernment Securities 33 36\nCommercial Paper and Certificates of Deposit - 989\nTotal investments at fair value $ 101 $ 1,084\nTotal investments at amortized cost $ 89 $ 1,076\nThese investments have the following maturities and are represented on the consolidated balance sheet within short-term investments for investments with maturities of less than one year, and other long-term assets for investments with maturities of one year and greater.\n(Dollars in Millions) December 2020 December 2019\nLess than 1 year $ 2 $ 996\n1 - 5 years 22 10\n5 - 10 years 23 25\nGreater than 10 years 54 53\nTotal investments at fair value $ 101 $ 1,084\nLong-term Debt\nLong-term debt, which includes finance leases, is reported at carrying amount on the consolidated balance sheets and is the Company's only financial instrument with fair values significantly different from their carrying amounts. The majority of the Company's long-term debt is valued with assistance from a third party that utilizes closing transactions, market quotes or market values of comparable debt. For those instruments not valued by the third party, the fair value has been estimated by applying market rates of similar instruments to the scheduled contractual debt payments and maturities. These market rates are provided by the same third party. All of the inputs used to determine the fair value of the Company's long-term debt are Level 2 inputs.\nThe fair value of outstanding debt fluctuates with changes in a number of factors. Such factors include, but are not limited to, interest rates, market conditions, credit ratings, values of similar financial instruments, size of the transaction, cash flow projections and comparable trades. Fair value will exceed carrying value when the current market interest rate is lower than the interest rate at which the debt was originally issued. The fair value of a company's debt is a measure of its current value under present market conditions. It does not impact the financial statements under current accounting rules.\nCSX 2020 Form 10-K p.94\nCSX CORPORATION\nPART II\nItem 8. Financial Statements and Supplementary Data\nNOTE 13. Fair Value Measurements, continued\nThe fair value and carrying value of the Company's long-term debt is as follows:\n(Dollars in Millions) December 2020 December 2019\nLong-term Debt (Including Current Maturities):\nFair Value $ 21,076 $ 18,503\nCarrying Value 16,705 16,238\nInterest Rate Derivatives\nThe Company’s forward starting interest rate swaps are carried at fair value and valued with assistance from a third party based upon pricing models using inputs observed from actively quoted markets. All of the inputs used to determine the fair value of the swaps are Level 2 inputs. The fair value of the Company’s forward starting interest rate swaps asset was $80 million at December 31, 2020. See Note 10, Debt and Credit Agreements for further information.\nPension Plan Assets\nPension plan assets are reported at fair value, net of pension liabilities, on the consolidated balance sheet. The Investment Committee targets an allocation of pension assets to be generally 60% growth-oriented and 40% immunizing. See Note 9, Employee Benefit Plans for further information. There are several valuation methodologies used for those assets as described below.\nInvestments in the Fair Value Hierarchy\n•Common stock (Level 1): Valued at the closing price reported on the active market on which the individual securities are traded on the last day of the year and classified in Level 1 of the fair value hierarchy.\n•Mutual funds (Level 1): Valued at the net asset value of shares held at year end based on quoted market prices determined in an active market. These assets are classified in Level 1 of the fair value hierarchy.\n•Cash and cash equivalents (Level 1): Includes cash and short term investments with an original maturity of three months or less. The carrying value of cash and cash equivalents at year end approximates fair value. These assets are classified in Level 1 of the fair value hierarchy.\n•Corporate bonds, government securities, asset-backed securities and derivatives (Level 2): Valued using price evaluations reflecting the bid and/or ask sides of the market for a similar investment at year end. Asset-backed securities include commercial mortgage-backed securities and collateralized mortgage obligations. These assets are classified in Level 2 of the fair value hierarchy.\nInvestments Measured at Net Asset Value\n•Partnerships: Net asset value of private equity is based on the fair market values associated with the underlying investments at year end. These funds have redemption restrictions that require advanced notice of 15 business days.\n•Commingled and common collective trust funds: This class consists of private funds that invest in corporate equity and debt securities, government securities and various short-term debt instruments and are measured at net asset value to estimate the fair value of the investments. The net asset value of the investments is determined by reference to the fair value of the underlying securities, which are valued primarily through the use of directly or indirectly observable inputs. These funds have redemption restrictions that require advanced notice of up to 15 business days.\nCSX 2020 Form 10-K p.95\nCSX CORPORATION\nPART II\nItem 8. Financial Statements and Supplementary Data\nNOTE 13. Fair Value Measurements, continued\nThe pension plan assets at fair value by level, within the fair value hierarchy, as of calendar plan years 2020 and 2019 are shown in the table below. For additional information related to pension assets, see Note 9, Employee Benefit Plans.\nFiscal Years\n2020 2019\n(Dollars in Millions) Level 1 Level 2 Total Level 1 Level 2 Total\nCommon Stock $ 337 $ - $ 337 $ 823 $ - $ 823\nMutual funds 21 - 21 78 - 78\nCash and cash equivalents 387 - 387 229 - 229\nCorporate bonds - 1,026 1,026 - 588 588\nGovernment securities - 164 164 - 217 217\nAsset-backed securities, derivatives and other - 85 85 - 17 17\nTotal investments in the fair value hierarchy $ 745 $ 1,275 $ 2,020 $ 1,130 $ 822 $ 1,952\nInvestments measured at net asset value (a)\nn/a n/a $ 980 n/a n/a $ 873\nInvestments at fair value $ 745 $ 1,275 $ 3,000 $ 1,130 $ 822 $ 2,825\n(a) Investments measured at net asset value represent certain investments that have been measured at net asset value per share (or its equivalent) and thus are not classified in the fair value hierarchy. In accordance with ASC 820, Fair Value Measurements, the fair value amounts presented in this table are intended to permit reconciliation of the fair value hierarchy to the pension assets disclosed in Note 9, Employee Benefit Plans.\nNOTE 14. Other Income - Net\nThe Company derives income from items that are not considered operating activities. Income from these items is reported net of related expense. All components of net periodic pension and post-retirement benefit costs, excluding service cost, are included in other income - net on the consolidated income statement. Miscellaneous income (expense) may fluctuate due to timing and includes investment gains, losses and interest income as well as other non-operating activities.\nInterest income decreased from 2019 to 2020 primarily as a result of lower interest rates, partially offset by higher average investment balances. Interest income increased from 2018 to 2019 primarily as a result of higher average cash and short-term investment balances. Debt repurchase expense increased from 2019 to 2020 primarily as a result of long-term debt being redeemed earlier relative to maturity date. Other income - net consisted of the following:\nFiscal Years\n(Dollars in Millions) 2020 2019 2018\nNet Periodic Pension and Post-retirement Benefit Credit (a)\n$ 42 $ 43 $ 38\nInterest Income 17 48 32\nDebt Repurchase Expense (48) (10) -\nMiscellaneous Income 8 7 4\nTotal Other Income - Net $ 19 $ 88 $ 74\n(a) Excludes the service cost component of net periodic benefit cost.\nCSX 2020 Form 10-K p.96\nCSX CORPORATION\nPART II\nItem 8. Financial Statements and Supplementary Data\nNOTE 15. Investment in Affiliates and Related-Party Transactions\nCSX's investments in affiliates are included on the consolidated balance sheet as investments in affiliates and other companies.\nDecember December\n(Dollars in Millions) 2020 2019\nEquity-method investments:\nConrail $ 1,025 $ 982\nTTX 796 743\nOther 164 154\nTotal $ 1,985 $ 1,879\nConrail\nThrough a limited liability company, CSX and Norfolk Southern Corporation (“NS”) jointly own Conrail. CSX has a 42% economic interest and 50% voting interest in the jointly-owned entity, and NS has the remainder of the economic and voting interests. Pursuant to the Investments-Equity Method and Joint Venture Topic in the ASC, CSX applies the equity method of accounting to its investment in Conrail.\nConrail owns rail infrastructure and operates for the joint benefit of CSX and NS. This is known as the shared asset area. Conrail charges fees for right-of-way usage, equipment rentals and transportation, switching and terminal service charges in the shared asset area. These expenses are included in materials, supplies and other on the consolidated income statements. Future payments due to Conrail under the shared asset area agreements are shown in the table below.\n(Dollars in Millions) Conrail Shared\nYears Asset Agreement\n2021 $ 30\n2022 30\n2023 30\n2024 22\n2025 -\nThereafter -\nTotal $ 112\nAlso, included in equity earnings of affiliates are CSX’s 42 percent share of Conrail’s income and its amortization of the fair value write-up arising from the acquisition of Conrail and certain other adjustments. The amortization primarily represents the additional after-tax depreciation expense related to the write-up of Conrail’s fixed assets when the original purchase price, from the 1997 acquisition of Conrail, was allocated based on fair value. This write-up of fixed assets resulted in a difference between CSX's investment in Conrail and its share of Conrail's underlying net equity, which is $335 million as of December 2020.\nCSX 2020 Form 10-K p.97\nCSX CORPORATION\nPART II\nItem 8. Financial Statements and Supplementary Data\nNOTE 15. Investment in Affiliates and Related-Party Transactions, continued\nThe following table discloses amounts related to Conrail. All amounts in the table below are included in materials, supplies and other expenses on the Company’s consolidated income statements.\nFiscal Years\n(Dollars in Millions) 2020 2019 2018\nRents, fees and services $ 126 $ 119 $ 117\nPurchase price amortization and other 4 4 4\nEquity earnings of Conrail (49) (42) (43)\nTotal Conrail Expense $ 81 $ 81 $ 78\nAs required by the Related Party Disclosures Topic in the ASC, the Company has identified amounts below owed to Conrail, or its subsidiaries, representing liabilities under the operating, equipment and shared area agreements with Conrail. In 2014, the Company executed two promissory notes with a subsidiary of Conrail which were included in long-term debt on the consolidated balance sheets. Interest expense from these promissory notes was $6 million in each 2020, 2019 and 2018.\nDecember December\n(Dollars in Millions) 2020 2019\nBalance Sheet Information:\nCSX accounts payable to Conrail $ 50 $ 213\nPromissory notes payable to Conrail subsidiary\n1.31% CSX Promissory Note due December 2050\n73 -\n1.31% CSXT Promissory Note due December 2050\n368 -\n2.89% CSX Promissory Note due October 2044\n- 73\n2.89% CSXT Promissory Note due October 2044\n- 151\nIn December 2020, the Company completed a non-cash conversion of its existing payable balance of approximately $217 million and $224 million, 2.89% notes due 2044 into new notes. The new notes for operation of the shared asset area are $441 million, 1.31% notes due 2050.\nTTX Company\nTTX Company (\"TTX\") is a privately-held corporation engaged in the business of providing its owner-railroads with standardized fleets of intermodal, automotive and general use railcars at time and mileage rates. CSX owns about 20 percent of TTX's common stock, and the remaining is owned by the other leading North American railroads and their affiliates. Pursuant to the Investments-Equity Method topic in the ASC, CSX applies the equity method of accounting to its investment in TTX.\nCSX 2020 Form 10-K p.98\nCSX CORPORATION\nPART II\nItem 8. Financial Statements and Supplementary Data\nNOTE 15. Investment in Affiliates and Related-Party Transactions, continued\nAs required by the Related Party Disclosures Topic in the ASC, the following table discloses amounts related to TTX. Car hire rents and equity earnings are included in equipment and other rents expense on the Company’s consolidated income statement.\nFiscal Years\n(Dollars in Millions) 2020 2019 2018\nIncome statement information:\nCar hire rents $ 219 $ 223 $ 223\nEquity earnings of TTX (51) (56) (60)\nTotal TTX expense $ 168 $ 167 $ 163\nAlso included below is balance sheet information related to CSX's payable to TTX, which represents car rental liabilities.\nDecember December\nBalance sheet information: 2020 2019\nCSX payable to TTX $ 40 $ 34\nOther Related Party Transactions\nOn October 17, 2019, the Company repurchased 4.7 million shares for $319 million from MR Argent Advisor LLC, a CSX shareholder on behalf of certain limited partners of its affiliated funds. See additional discussion in Note 2, Earnings Per Share.\nNOTE 16. Other Comprehensive Income / (Loss)\nCSX reports comprehensive earnings or loss in accordance with the Comprehensive Income Topic in the ASC in the consolidated comprehensive income statement. Total comprehensive earnings are defined as all changes in shareholders' equity during a period, other than those resulting from investments by and distributions to shareholders (e.g., issuance of equity securities and dividends). Generally, for CSX, total comprehensive earnings equal net earnings plus or minus adjustments for pension and other post-retirement liabilities as well as other adjustments. Total comprehensive earnings represent the activity for a period net of tax and were $2.8 billion, $3.3 billion and $3.1 billion for 2020, 2019 and 2018, respectively.\nWhile total comprehensive earnings is the activity in a period and is largely driven by net earnings in that period, accumulated other comprehensive income or loss (“AOCI”) represents the cumulative balance of other comprehensive income, net of tax, as of the balance sheet date. For CSX, AOCI is primarily the cumulative balance related to pension and other post-retirement benefit adjustments, interest rate derivatives and CSX's share of AOCI of equity method investees.\nCSX 2020 Form 10-K p.99\nCSX CORPORATION\nPART II\nItem 8. Financial Statements and Supplementary Data\nNOTE 16. Other Comprehensive Income / (Loss), continued\nChanges in the AOCI balance by component are shown in the following table. Amounts reclassified in pension and other post-employment benefits to net earnings relate to the amortization of actuarial losses and are included in other income-net on the consolidated income statements. See Note 9. Employee Benefit Plans for further information. Interest rate derivatives consist of forward starting interest rate swaps classified as cash flow hedges. See Note 10, Debt and Credit Agreements for further information. Other primarily represents CSX's share of AOCI of equity method investees. Amounts reclassified in other to net earnings are included in materials, supplies, and other or equipment and other rents on the consolidated income statements.\nPension and Other Post-Employment Benefits Interest Rate Derivatives Other Accumulated Other Comprehensive Income (Loss)\n(Dollars in millions)\nBalance December 31, 2017 - Net of Tax $ (440) $ - $ (46) $ (486)\nOther Comprehensive Income (Loss)\nReclassification of Stranded Tax Effects (a)\n(108) - 1 (107)\nLoss Before Reclassifications (111) - (8) (119)\nAmounts Reclassified to Net Earnings 38 - (6) 32\nTax Benefit 17 - 2 19\nTotal Other Comprehensive Loss (164) - (11) (175)\nBalance December 31, 2018 - Net of Tax (604) - (57) (661)\nOther Comprehensive Income (Loss)\nLoss Before Reclassifications (43) - (5) (48)\nAmounts Reclassified to Net Earnings 23 - 8 31\nTax Benefit (Expense) 5 - (2) 3\nTotal Other Comprehensive (Loss) Income (15) - 1 (14)\nBalance December 31, 2019 - Net of Tax (619) - (56) (675)\nOther Comprehensive Income (Loss)\n(Loss) Income Before Reclassifications (17) 80 (10) 53\nAmounts Reclassified to Net Earnings 47 - 5 52\nTax Expense (9) (18) (1) (28)\nTotal Other Comprehensive Income (Loss) 21 62 (6) 77\nBalance December 31, 2020 - Net of Tax $ (598) $ 62 $ (62) $ (598)\n(a) As the result of a standard update adopted in 2018, certain tax effects stranded in accumulated other comprehensive income as a result of tax reform were reclassified to retained earnings.\nCSX 2020 Form 10-K p.100\nCSX CORPORATION\nPART II",
    "item_9": "Item 9. Changes in and Disagreements with Accountants on Accounting and Financial Disclosure\nNone",
    "item_9A": "Item 9A. Controls and Procedures\nEvaluation of Disclosure Controls and Procedures\nAs of December 31, 2020, under the supervision and with the participation of CSX's Chief Executive Officer (“CEO”) and Chief Financial Officer (“CFO”), management has evaluated the effectiveness of the design and operation of the Company's disclosure controls and procedures. Based on that evaluation, the CEO and CFO concluded that, as of December 31, 2020, the Company's disclosure controls and procedures were effective at the reasonable assurance level in timely alerting them to material information required to be included in CSX’s periodic SEC reports.\nManagement's Report on Internal Control over Financial Reporting\nCSX’s management is responsible for establishing and maintaining adequate internal control over financial reporting, as such term is defined in Exchange Act Rules 13a-15(f) and 15d-15(f). Under the supervision and with the participation of the management of CSX, including CSX’s CEO and CFO, CSX conducted an evaluation of the effectiveness of the Company’s internal control over financial reporting as of December 31, 2020 based on the 2013 framework in Internal Control - Integrated Framework issued by the Committee of Sponsoring Organizations of the Treadway Commission, which is also referred to as COSO. Based on that evaluation, management of CSX concluded that the Company’s internal control over financial reporting was effective as of December 31, 2020. Management's assessment of the effectiveness of internal control over financial reporting is expressed at the level of reasonable assurance because a control system, no matter how well designed and operated, can provide only reasonable, but not absolute, assurance that the control system's objectives will be met.\nThe Company’s internal control over financial reporting as of December 31, 2020 has been audited by Ernst & Young LLP, an independent registered public accounting firm, as stated in their report which is included elsewhere herein.\nCSX 2020 Form 10-K p.101\nCSX CORPORATION\nPART II\nREPORT OF INDEPENDENT REGISTERED PUBLIC ACCOUNTING FIRM\nTo the Shareholders and the Board of Directors of CSX Corporation\nOpinion on Internal Control Over Financial Reporting\nWe have audited CSX Corporation’s internal control over financial reporting as of December 31, 2020, based on criteria established in Internal Control-Integrated Framework issued by the Committee of Sponsoring Organizations of the Treadway Commission (2013 framework) (the COSO criteria). In our opinion, CSX Corporation (the Company) maintained, in all material respects, effective internal control over financial reporting as of December 31, 2020, based on the COSO criteria.\nWe also have audited, in accordance with the standards of the Public Company Accounting Oversight Board (United States) (PCAOB), the consolidated balance sheets of CSX Corporation as of December 31, 2020 and 2019, and the related consolidated statements of income, comprehensive income, cash flows, and changes in shareholders’ equity for each of the three years in the period ended December 31, 2020, and the related notes of the Company and our report dated February 10, 2021 expressed an unqualified opinion thereon.\nBasis for Opinion\nThe Company’s management is responsible for maintaining effective internal control over financial reporting and for its assessment of the effectiveness of internal control over financial reporting included in the accompanying Management’s Report on Internal Control over Financial Reporting. Our responsibility is to express an opinion on the Company’s internal control over financial reporting based on our audit. We are a public accounting firm registered with the PCAOB and are required to be independent with respect to the Company in accordance with the U.S. federal securities laws and the applicable rules and regulations of the Securities and Exchange Commission and the PCAOB.\nWe conducted our audit in accordance with the standards of the PCAOB. Those standards require that we plan and perform the audit to obtain reasonable assurance about whether effective internal control over financial reporting was maintained in all material respects.\nOur audit included obtaining an understanding of internal control over financial reporting, assessing the risk that a material weakness exists, testing and evaluating the design and operating effectiveness of internal control based on the assessed risk, and performing such other procedures as we considered necessary in the circumstances. We believe that our audit provides a reasonable basis for our opinion.\nCSX 2020 Form 10-K p.102\nCSX CORPORATION\nPART II\nREPORT OF INDEPENDENT REGISTERED PUBLIC ACCOUNTING FIRM, continued\nDefinition and Limitations of Internal Control over Financial Reporting\nA company’s internal control over financial reporting is a process designed to provide reasonable assurance regarding the reliability of financial reporting and the preparation of financial statements for external purposes in accordance with generally accepted accounting principles. A company’s internal control over financial reporting includes those policies and procedures that (1) pertain to the maintenance of records that, in reasonable detail, accurately and fairly reflect the transactions and dispositions of the assets of the company; (2) provide reasonable assurance that transactions are recorded as necessary to permit preparation of financial statements in accordance with generally accepted accounting principles, and that receipts and expenditures of the company are being made only in accordance with authorizations of management and directors of the company; and (3) provide reasonable assurance regarding prevention or timely detection of unauthorized acquisition, use, or disposition of the company’s assets that could have a material effect on the financial statements.\nBecause of its inherent limitations, internal control over financial reporting may not prevent or detect misstatements. Also, projections of any evaluation of effectiveness to future periods are subject to the risk that controls may become inadequate because of changes in conditions, or that the degree of compliance with the policies or procedures may deteriorate.\n/s/ Ernst & Young LLP\nJacksonville, Florida\nFebruary 10, 2021\nCSX 2020 Form 10-K p.103\nCSX CORPORATION\nPART II\nChanges in Internal Control over Financial Reporting\nThere were no material changes in the Company’s internal control over financial reporting.",
    "item_9B": "Item 9B. Other Information\nNone\nPART III",
    "item_9C": "",
    "item_10": "Item 10. Directors, Executive Officers of the Registrant and Corporate Governance\nIn accordance with Instruction G(3) of Form 10-K, the information required by this item is incorporated herein by reference to the Proxy Statement. The Proxy Statement will be filed no later than April 30, 2021 with respect to the 2021 annual meeting of shareholders, except for the information regarding the executive officers of the Company. Information regarding executive officers is included in Part I of this report under the caption \"Executive Officers of the Registrant.\"",
    "item_11": "Item 11. Executive Compensation\nIn accordance with Instruction G(3) of Form 10-K, the information required by this Item is incorporated herein by reference to the Proxy Statement (see Item 10 above).",
    "item_12": "Item 12. Security Ownership of Certain Beneficial Owners and Management and Related Stockholder Matters\nIn accordance with Instruction G(3) of Form 10-K, the information required by this Item is incorporated herein by reference to the Proxy Statement (see Item 10 above).",
    "item_13": "Item 13. Certain Relationships and Related Transactions, and Director Independence\nIn accordance with Instruction G(3) of Form 10-K, the information required by this Item is incorporated herein by reference to the Proxy Statement (see Item 10 above).",
    "item_14": "Item 14. Principal Accounting Fees and Services\nIn accordance with Instruction G(3) of Form 10-K, the information required by this Item is incorporated herein by reference to the Proxy Statement (see Item 10 above).\nPART IV",
    "item_15": "Item 15. Exhibits, Financial Statement Schedules\n(a)(1) Financial Statements\nSee Index to Consolidated Financial Statements on page 46.\n(2) Financial Statement Schedules\nThe information required by Schedule II, Valuation and Qualifying Accounts, is included in Note 5 to the Consolidated Financial Statements, Casualty, Environmental and Other Reserves. All other financial statement schedules are not applicable.\n(3) Exhibits\nThe documents listed below are being filed or have previously been filed on behalf of CSX and are incorporated herein by reference from the documents indicated and made a part hereof. Exhibits not previously filed are filed herewith.\nPursuant to Regulation S-K, Item 601(b)(4)(iii), instruments that define the rights of holders of the Registrant's long-term debt securities, where the long-term debt securities authorized under each such instrument do not exceed 10% of the Registrant's total assets, have been omitted and will be furnished to the Commission upon request.\nCSX 2020 Form 10-K p.104\nCSX CORPORATION\nExhibit designation Nature of exhibit Previously filed\nas exhibit to\n2.1 Distribution Agreement, dated as of July 26, 2004, by and among CSX Corporation, CSX Transportation, Inc., CSX Rail Holding Corporation, CSX Northeast Holding Corporation, Norfolk Southern Corporation, Norfolk Southern Railway Company, CRR Holdings LLC, Green Acquisition Corp., Conrail Inc., Consolidated Rail Corporation, New York Central Lines LLC, Pennsylvania Lines LLC, NYC Newco, Inc. and PRR Newco, Inc.\nSeptember 2, 2004,\nExhibit 2.1, Form 8-K\n3.1 Amended and Restated Articles of Incorporation of CSX Corporation, effective as of December 16, 2014\nFebruary 11, 2015,\nExhibit 3.1, Form 10-K\n3.2 Amended and Restated Bylaws of CSX Corporation, effective as of October 7, 2020\nOctober 13, 2020\nExhibit 3.1, Form 8-K\nInstruments Defining the Rights of Security Holders, Including Debentures:\n4.1(a)(P) Indenture, dated August 1, 1990, between the Registrant and The Chase Manhattan Bank, as Trustee September 7, 1990,\nForm SE\n4.1(b)(P) First Supplemental Indenture, dated as of June 15, 1991, between the Registrant and The Chase Manhattan Bank, as Trustee May 28, 1992,\nExhibit 4(c), Form SE\n4.1(c) Second Supplemental Indenture, dated as of May 6, 1997, between the Registrant and The Chase Manhattan Bank, as Trustee\nJune 5, 1997,\nExhibit 4.3, Form S-4\n(Registration No. 333-28523)\n4.1(d) Third Supplemental Indenture, dated as of April 22, 1998, between the Registrant and The Chase Manhattan Bank, as Trustee\nMay 12, 1998,\nExhibit 4.2, Form 8-K\n4.1(e) Fourth Supplemental Indenture, dated as of October 30, 2001, between the Registrant and The Chase Manhattan Bank, as Trustee\nNovember 7, 2001,\nExhibit 4.1, Form 10-Q\n4.1(f) Fifth Supplemental Indenture, dated as of October 27, 2003 between the Registrant and The Chase Manhattan Bank, as Trustee\nOctober 27, 2003,\nExhibit 4.1, Form 8-K\n4.1(g) Sixth Supplemental Indenture, dated as of September 23, 2004 between the Registrant and JP Morgan Chase Bank, formerly The Chase Manhattan Bank, as Trustee\nNovember 3, 2004,\nExhibit 4.1, Form 10-Q\n4.1(h) Seventh Supplemental Indenture, dated as of April 25, 2007, between the Registrant and The Bank of New York (as successor to JP Morgan Chase Bank), as Trustee\nApril 26, 2007,\nExhibit 4.4, Form 8-K\n4.1(i) Eighth Supplemental Indenture, dated as of March 24, 2010, between the Registrant and The Bank of New York Mellon (as successor to JP Morgan Chase Bank), as Trustee\nApril 19, 2010,\nExhibit 4.1, Form 10-Q\n4.1(j) Ninth Supplemental Indenture, dated as of February 12, 2019, between CSX and The Bank of New York Mellon Trust Company, N.A. (as successor to JPMorgan Chase Bank, N.A., formerly The Chase Manhattan Bank), as Trustee (b)\nFebruary 12, 2019,\nExhibit 4.1.10, Form S-3ASR\n4.1(k) Tenth Supplemental Indenture, dated as of December 10, 2020, between the Registrant and The Bank of New York Mellon Trust Company, N.A. (as successor to JPMorgan Chase Bank, N.A., formerly The Chase Manhattan Bank), as Trustee\nDecember 10, 2020\nExhibit 4.3, Form 8-K\n4.2 Description of Common Stock\nJuly 19, 2018\nForm 8-K\nCSX 2020 Form 10-K p.105\nCSX CORPORATION\nExhibit designation Nature of exhibit Previously filed\nas exhibit to\nMaterial Contracts:\n10.1** CSX Directors’ Pre-2005 Deferred Compensation Plan (as amended through January 8, 2008)\nFebruary 22, 2008,\nExhibit 10.2, Form 10-K\n10.2** CSX Directors’ Deferred Compensation Plan effective January 1, 2005\nFebruary 22, 2008,\nExhibit 10.3, Form 10-K\n10.3** CSX Directors' Charitable Gift Plan, as amended\nMarch 4, 1994,\nExhibit 10.4, Form 10-K\n10.4** CSX Directors' Matching Gift Plan (as amended through February 9, 2011)\nMarch 4, 1994,\nExhibit 10.5, Form 10-K\n10.5** Special Retirement Plan of CSX Corporation and Affiliated Companies (as amended through February 14, 2001)\nMarch 4, 2002,\nExhibit 10.23, Form 10-K\n10.6** Supplemental Retirement Benefit Plan of CSX Corporation and Affiliated Companies (as amended through February 14, 2001)\nMarch 4, 2002,\nExhibit 10.24, Form 10-K\n10.7 Transaction Agreement, dated as of June 10, 1997, by and among CSX Corporation, CSX Transportation, Inc., Norfolk Southern Corporation, Norfolk Southern Railway Company, Conrail Inc., Consolidated Rail Corporation and CRR Holdings LLC, with certain schedules thereto\nJuly 8, 1997,\nExhibit 10, Form 8-K\n10.8 Amendment No. 1, dated as of August 22, 1998, to the Transaction Agreement, dated as of June 10, 1997, by and among CSX Corporation, CSX Transportation, Inc., Norfolk Southern Corporation, Norfolk Southern Railway Company, Conrail Inc., Consolidated Rail Corporation and CRR Holdings, LLC\nJune 11, 1999,\nExhibit 10.1, Form 8-K\n10.9 Amendment No. 2, dated as of June 1, 1999, to the Transaction Agreement, dated as of June 10, 1997, by and among CSX Corporation, CSX Transportation, Inc., Norfolk Southern Corporation, Norfolk Southern Railway Company, Conrail Inc., Consolidated Rail Corporation and CRR Holdings, LLC\nJune 11, 1999,\nExhibit 10.2, Form 8-K\n10.10 Amendment No. 3, dated as of August 1, 2000, to the Transaction Agreement by and among CSX Corporation, CSX Transportation, Inc., Norfolk Southern Corporation, Norfolk Southern Railway Company, Conrail Inc., Consolidated Rail Corporation, and CRR Holdings, LLC.\nMarch 1, 2001,\nExhibit 10.34, Form 10-K\n10.11 Amendment No. 4, dated and effective as of June 1, 1999, and executed in April 2004, to the Transaction Agreement, dated as of June 10, 1997, by and among CSX Corporation, CSX Transportation, Inc., Norfolk Southern Corporation, Norfolk Southern Railway Company, Conrail Inc., Consolidated Rail Corporation and CRR Holdings, LLC\nAugust 6, 2004,\nExhibit 99.1, Form 8-K\n10.12 Amendment No. 5, dated as of August 27, 2004, to the Transaction Agreement, dated as of June 10, 1997, by and among CSX Corporation, CSX Transportation, Inc., Norfolk Southern Corporation, Norfolk Southern Railway Company, Conrail Inc., Consolidated Rail Corporation and CRR Holdings LLC\nSeptember 2, 2004,\nExhibit 10.1, Form 8-K\n10.13 Shared Assets Area Operating Agreement for Detroit, dated as of June 1, 1999, by and among Consolidated Rail Corporation, CSX Transportation, Inc. and Norfolk Southern Railway Corporation, with exhibit thereto\nJune 11, 1999,\nExhibit 10.6, Form 8-K,\nCSX 2020 Form 10-K p.106\nCSX CORPORATION\nExhibit designation Nature of exhibit Previously filed\nas exhibit to\n10.14 Shared Assets Area Operating Agreement for North Jersey, dated as of June 1, 1999, by and among Consolidated Rail Corporation, CSX Transportation, Inc. and Norfolk Southern Railway Company, with exhibit thereto\nJune 11, 1999,\nExhibit 10.4, Form 8-K\n10.15 Shared Assets Area Operating Agreement for South Jersey/Philadelphia, dated as of June 1, 1999, by and among Consolidated Rail Corporation, CSX Transportation, Inc. and Norfolk Southern Railway Company, with exhibit thereto\nJune 11, 1999,\nExhibit 10.5, Form 8-K\n10.16 Monongahela Usage Agreement, dated as of June 1, 1999, by and among CSX Transportation, Inc., Norfolk Southern Railway Company, Pennsylvania Lines LLC and New York Central Lines LLC, with exhibit thereto\nJune 11, 1999,\nExhibit 10.7, Form 8-K\n10.17 Tax Allocation Agreement, dated as of August 27, 2004, by and among CSX Corporation, Norfolk Southern Corporation, Green Acquisition Corp., Conrail Inc., Consolidated Rail Corporation, New York Central Lines LLC and Pennsylvania Lines LLC\nSeptember 2, 2004,\nExhibit 10.2, Form 8-K\n10.18** CSX Stock and Incentive Award Plan\nMay 7, 2010,\nExhibit 10.1, Form 8-K\n10.19** CSX Executives' Deferred Compensation Plan (as amended and restated effective January 1, 2021)\nDecember 21, 2020,\nExhibit 99.1, Form S-8\n10.20** Employment Agreement, effective as of March 29, 2017, between CSX Corporation and Mark K. Wallace\nFebruary 7, 2018\nExhibit 10.41, Form 10-K\n10.21** Employment Agreement, effective as of December 22, 2017, between CSX Corporation and James M. Foote\nFebruary 7, 2018\nExhibit 10.42, Form 10-K\n10.22** Form of Change of Control Agreement, effective February 7, 2018\nFebruary 7, 2018\nExhibit 10.43, Form 10-K\n10.23** CSX 2018-2020 Long-Term Incentive Plan\nFebruary 12, 2018\nExhibit 10.1, Form 8-K\n10.24** CSX 2019-2021 Long-Term Incentive Plan\nFebruary 12, 2019\nExhibit 10.1, Form 8-K\n10.25 $1,200,000,000 Five-Year Revolving Credit Agreement, dated as of March 29, 2019, among CSX Corporation, as borrower, the lenders party thereto, and JPMorgan Chase Bank, N.A., as administrative agent\nApril 3, 2019\nExhibit 10.1, Form 8-K\n10.26** CSX 2019 Stock and Incentive Award Plan (incorporated by reference to Appendix A to the registrant’s Definitive Proxy Statement on Schedule 14A filed March 22, 2019)\nMay 8, 2019\nExhibit 10.1, Form 8-K\n10.27** Form of 2020-2022 LTIP Performance Unit Award Agreement\nFebruary 21, 2020\nExhibit 10.1, Form 8-K\n10.28** Form of 2020 Stock Option Agreement\nFebruary 21, 2020\nExhibit 10.2, Form 8-K\n10.29** Amendment to Form of Change of Control Agreement\nMay 8, 2020\nExhibit 10.1, Form 8-K\nCSX 2020 Form 10-K p.107\nCSX CORPORATION\nExhibit designation Nature of exhibit Previously filed\nas exhibit to\nOfficer certifications:\n31* Rule 13a-14(a) Certifications\n32* Section 1350 Certifications\nInteractive data files:\n101* The following financial information from CSX Corporation’s Annual Report on Form 10-K for the year ended December 31, 2020 filed with the SEC on February 10, 2021, formatted in XBRL includes: (i) Consolidated Income Statements for the fiscal periods ended December 31, 2020, December 31, 2019, and December 31, 2018, (ii) Consolidated Comprehensive Income Statements for the fiscal periods ended December 31, 2020, December 31, 2019, and December 31, 2018, (iii) Consolidated Balance Sheets at December 31, 2020 and December 31, 2019, (iv) Consolidated Cash Flow Statements for the fiscal periods ended December 31, 2020, December 31, 2019 and December 31, 2018, (v) Consolidated Statements of Changes in Shareholders' Equity for the fiscal periods ended December 31, 2020, December 31, 2019 and December 31, 2018, and (vi) the Notes to Consolidated Financial Statements.\nOther exhibits:\n21* Subsidiaries of the Registrant\n22.1* List of Subsidiary Issuers and Guarantors\n23* Consent of Independent Registered Public Accounting Firm\n24* Powers of Attorney\n* Filed herewith\n** Management Contract or Compensatory Plan or Arrangement\n(P) This Exhibit has been paper filed and is not subject to Item 601 of Reg S-K for hyperlinks.\nNote: Items not filed herewith have been submitted in previous SEC filings.\nCSX 2020 Form 10-K p.108",
    "item_16": "",
    "stock_ticker": "CSX"
}