{
    "cik": "745732",
    "company": "ROSS STORES, INC.",
    "filing_type": "10-K",
    "filing_date": "2021-03-30",
    "period_of_report": "2021-01-30",
    "sic": "5651",
    "state_of_inc": "DE",
    "state_location": "CA",
    "fiscal_year_end": "0130",
    "filing_html_index": "https://www.sec.gov/Archives/edgar/data/745732/0000745732-21-000017-index.html",
    "htm_filing_link": "https://www.sec.gov/Archives/edgar/data/745732/000074573221000017/rost-20210130.htm",
    "complete_text_filing_link": "https://www.sec.gov/Archives/edgar/data/745732/0000745732-21-000017.txt",
    "filename": "745732_10K_2021_0000745732-21-000017.htm",
    "item_1": "ITEM 1. BUSINESS\nRoss Stores, Inc. and its subsidiaries (“we” or the “Company”) operate two brands of off-price retail apparel and home fashion stores-Ross Dress for Less® (“Ross”) and dd’s DISCOUNTS®.\nRoss is the largest off-price apparel and home fashion chain in the United States, with 1,585 locations in 40 states, the District of Columbia, and Guam, as of January 30, 2021. Ross offers first-quality, in-season, name brand and designer apparel, accessories, footwear, and home fashions for the entire family at savings of 20% to 60% off department and specialty store regular prices every day. Ross’ target customers are primarily from middle income households.\nWe also operate 274 dd’s DISCOUNTS stores in 21 states as of January 30, 2021. dd’s DISCOUNTS features more moderately-priced first-quality, in-season, name brand apparel, accessories, footwear, and home fashions for the entire family at savings of 20% to 70% off moderate department and discount store regular prices every day. The typical dd’s DISCOUNTS store is located in an established shopping center in a densely populated urban or suburban neighborhood and its target customers typically come from households with more moderate incomes than Ross customers.\nThe merchant, store field, and distribution operations for Ross and dd’s DISCOUNTS are separate. The two chains share certain corporate and support services.\nBoth our Ross and dd’s DISCOUNTS brands target value-conscious women and men between the ages of 18 and 54. The decisions we make, from merchandising, purchasing, and pricing, to the locations of our stores, are based on these customer profiles. We believe that both brands derive a competitive advantage by offering a wide assortment of product within each of our merchandise categories in organized and easy-to-shop store environments.\nOur mission is to offer competitive values to our target customers by focusing on the following key strategic objectives:\n•Maintain an appropriate level of recognizable brands, labels, and fashions at strong discounts throughout the store.\n•Meet customer needs on a local basis.\n•Deliver an in-store shopping experience that reflects the expectations of the off-price customer.\n•Manage real estate growth to compete effectively across all our markets.\nWe refer to our fiscal years ended January 30, 2021, February 1, 2020, and February 2, 2019 as fiscal 2020, fiscal 2019, and fiscal 2018, respectively, all of which were 52-week years.\nMerchandising, Purchasing, and Pricing\nWe seek to provide our customers with a wide assortment of first-quality, in-season, brand name and designer apparel, accessories, footwear, and home merchandise for the entire family at savings of 20% to 60% below department and specialty store regular prices every day at Ross, and 20% to 70% below moderate department and discount store regular prices at dd’s DISCOUNTS. We sell recognizable brand name merchandise that is current and fashionable in each category. New merchandise typically is received from three to six times per week at both Ross and dd’s DISCOUNTS stores. Our buyers review their merchandise assortments on a weekly basis, enabling them to respond to selling trends and purchasing opportunities in the market. Our merchandising strategy is reflected in our advertising, which emphasizes a strong value message. Our stores offer a treasure-hunt shopping experience where customers can find great savings every day on a broad assortment of brand name bargains for the family and the home.\nMerchandising. Our merchandising strategy incorporates a combination of off-price buying techniques to purchase advance-of-season, in-season, and past-season merchandise for both Ross and dd’s DISCOUNTS. We believe nationally recognized name brands sold at compelling discounts will continue to be an important determinant of our success. We generally leave the brand name label on the merchandise we sell.\nWe have established merchandise assortments that we believe are attractive to our target customers. Although we offer fewer classifications of merchandise than most department stores, we generally offer a large selection within each classification with a wide assortment of vendors, labels, prices, colors, styles, and fabrics within each size or item. Our merchandise offerings include, but are not limited to, apparel (including footwear and accessories), small furniture, home accents, bed and bath, beauty, toys, luggage, gourmet food, cookware, jewelry and watches.\nPurchasing. We have a large network of merchandise vendors and manufacturers for both Ross and dd’s DISCOUNTS and believe we have adequate sources of first-quality merchandise to meet our requirements. We purchase the vast majority of our merchandise directly from manufacturers, and we have not experienced difficulty in sourcing sufficient merchandise inventory.\nWe believe our ability to effectively execute certain off-price buying strategies is a key factor in our success. Our buyers use a number of methods that enable us to offer our customers brand name and designer merchandise at strong discounts every day relative to department and specialty stores for Ross, and moderate department and discount stores for dd’s DISCOUNTS. By purchasing later in the merchandise buying cycle than department, specialty, and discount stores, we are able to take advantage of imbalances between retailers’ demand for products and manufacturers’ supply of those products.\nUnlike most department and specialty stores, we typically do not require that manufacturers provide promotional allowances, co-op advertising allowances, return privileges, split shipments, drop shipments to stores, or delayed deliveries of merchandise. For most orders, delivery is made to one of our distribution centers. These flexible requirements further enable our buyers to obtain significant discounts on purchases.\nThe majority of the apparel and apparel-related merchandise that we offer in all of our stores is acquired through opportunistic purchases created by manufacturer overruns and canceled orders both during and at the end of a season. These buys are referred to as “close-out” purchases. Close-outs can be shipped to stores in-season, allowing us to get in-season goods into our stores at great values, or can be stored as packaway merchandise.\nPackaway merchandise is purchased with the intent that it will be stored in our warehouses until a later date, which may even be the beginning of the same selling season in the following year. Packaway purchases are an effective method of increasing the percentage of prestige and national brands at competitive savings within our merchandise assortments. Packaway merchandise is mainly fashion basics and, therefore, not usually affected by shifts in fashion trends.\nIn fiscal 2020, we continued our emphasis on this important sourcing strategy in response to compelling opportunities available in the marketplace. Packaway accounted for approximately 38% and 46% of total inventories as of January 30, 2021 and February 1, 2020, respectively. We believe the strong discounts we offer on packaway merchandise are one of the key drivers of our business results.\nOur primary buying offices are located in New York City and Los Angeles, the nation’s two largest apparel markets. We also operate a smaller buying office located in Boston. These strategic locations allow our buyers to be in the market frequently, sourcing opportunities and negotiating purchases with vendors and manufacturers. These locations also enable our buyers to strengthen vendor relationships-a key element to the success of our off-price buying strategies.\nAt the end of fiscal 2020, we had over 900 merchants for Ross and dd’s DISCOUNTS combined. The Ross and dd’s DISCOUNTS buying organizations are separate and distinct, and each includes merchandise management, buyers, and assistant buyers. Ross and dd’s DISCOUNTS buyers have on average eight years of experience, including merchandising positions with other retailers. We expect to continue to make additional targeted investments in our merchant organization to further develop our relationships with our manufacturers and vendors. Our ongoing objective is to strengthen our ability to procure the most desirable brands and fashions at competitive discounts.\nThe off-price buying strategies utilized by our experienced team of merchants enable us to purchase Ross merchandise at net prices that are lower than prices paid by department and specialty stores, and to purchase dd’s DISCOUNTS merchandise at net prices that are lower than prices paid by moderate department and discount stores.\nPricing. We sell brand name merchandise at Ross that is priced 20% to 60% below most department and specialty store regular prices. At dd’s DISCOUNTS, we sell more moderate brand name merchandise that is priced 20% to 70% below most moderate department and discount store regular prices. Our pricing is reflected on most of our price tags which display our selling price as well as the comparable value for that item in department and specialty stores for Ross merchandise, or in more moderate department and discount stores for dd’s DISCOUNTS merchandise.\nOur pricing strategy at Ross differs from that of a department or specialty store. We purchase our merchandise at lower prices and mark it up less than a department or specialty store. This strategy enables us to offer customers consistently low prices and compelling value. On a weekly basis our buyers review specified departments in our stores for possible markdowns based on the rate of sale, as well as at the end of fashion seasons, to promote faster turnover of merchandise inventory and to accelerate the flow of fresh product. A similar pricing strategy is in place at dd’s DISCOUNTS where prices are compared to those in moderate department and discount stores.\nStores\nAs of January 30, 2021, we operated a total of 1,859 stores comprised of 1,585 Ross stores and 274 dd’s DISCOUNTS stores. Our stores are located predominantly in community and neighborhood shopping centers in heavily populated urban and suburban areas. Where the size of the market and real estate opportunities permit, we cluster Ross stores to benefit from economies of scale in advertising, distribution, and field management. We do the same for dd’s DISCOUNTS stores.\nWe believe a key element of our success at both Ross and dd’s DISCOUNTS is our organized, attractive, and easy-to-shop in-store environments which allow customers to shop at their own pace. While our stores promote a self-service, treasure-hunt shopping experience, the layouts are designed to enhance customer convenience in their merchandise presentation, dressing rooms, checkout, and merchandise return areas. Our store’s sales area is based on a prototype single floor design with a racetrack aisle layout. A customer can locate desired departments by signs displayed just below the ceiling of each department. We enable our customers to select among sizes and prices through prominent category and sizing markers. Our stores have shopping carts and/or baskets available at the entrance for customer convenience. Cash registers are primarily located at store exits for customer ease and efficient staffing. In response to the health pandemic from the novel coronavirus (COVID-19), we implemented enhanced safety protocols for our customers and associates, including social distancing measures and capacity restrictions.\nWe accept a variety of payment methods. We provide refunds or store credit on all merchandise (not used, worn, or altered) returned with a receipt within 30 days. Merchandise returns having a receipt older than 30 days are exchanged or refunded with store credit.\nOperating Costs\nConsistent with the other aspects of our business strategy, we strive to keep operating costs as low as possible. Among the factors which have enabled us to do this are: labor costs that are generally lower than full-price department and specialty stores due to a store design that creates a self-service retail format and due to the utilization of labor saving technologies; economies of scale with respect to general and administrative costs resulting from centralized merchandising, marketing, and purchasing decisions; and flexible store layout criteria which facilitate conversion of existing buildings to our formats.\nIn response to COVID-19, we implemented additional processes and procedures to facilitate social distancing, to enhance cleaning and sanitation activities, and to provide personal protective equipment to our associates, which has increased our operating costs. We expect to incur higher operating costs during the COVID-19 pandemic.\nInformation Systems\nWe continue to invest in new information systems and technology to provide a platform for growth over the next several years. Recent initiatives include continued enhancements to our collaboration, cybersecurity, merchandise planning, distribution, store, and human resource systems. These initiatives support future growth, the execution and achievement of our plans, ongoing stability and compliance, as well as our ability to work remotely during the COVID-19 pandemic.\nDistribution\nWe operate distribution processing facilities where we receive and ship all of our merchandise to our stores. These distribution centers are large, highly automated, and built to suit our specific off-price business model. An additional distribution center in Brookshire, Texas is currently under construction and expected to open in 2022. We also operate warehouse facilities for packaway storage.\nWe utilize a combination of our own, and third-party, cross dock facilities to distribute merchandise to stores on a regional basis. Shipments are made by contract carriers to the stores three to six times per week depending on location.\nWe believe that our distribution centers and warehouses with their current expansion capabilities will provide adequate processing and storage capacity to support our current store growth. Information on the size and locations of our distribution centers and warehouse facilities is found under “Properties” in Item 2.\nAdvertising\nAdvertising for Ross Dress for Less relies primarily on television to communicate the Ross value proposition-savings off the same brands carried at leading department or specialty stores every day. This strategy reflects our belief that television is the most efficient and cost effective medium for communicating our brand position. While television is our primary advertising medium, we continue to grow additional channels, including social and digital media, to communicate our brand position. Advertising for dd’s DISCOUNTS is primarily focused on radio, both broadcast and digital, social media, and new store grand openings.\nTrademarks\nThe trademarks for ROSS®, Ross Dress For Less®, and dd’s DISCOUNTS® have been registered with the United States Patent and Trademark Office.\nHuman Capital\nAs of January 30, 2021, we had approximately 93,700 total associates, which includes both full- and part-time associates. Additionally, we hire temporary associates, especially during the peak seasons. Our associates are non-union. Management considers the relationship between the Company and our associates to be good.\nOur associates play essential roles in delivering great value to our customers. Throughout our organization, we recognize and appreciate the importance of attracting, retaining, and developing our associates and we have a number of key programs to do so.\nTalent development. The professional growth of our associates is important to our success as a business. We identify and enumerate key competencies we believe are critical to our ability to execute our business model and deliver the values our customers expect. We utilize these competencies in the hiring, development, evaluation, and future planning of our teams. We provide training opportunities to help associates grow and build their careers. Our associates, managers, and executives may participate in technical and leadership development activities. We support associates interested in leadership roles by offering opportunities to gain experience and build the skills necessary to advance within the Company. We are proud that many store leaders started their careers with us as retail associates.\nDiversity, equality, and inclusion. We care about our associates and the communities we serve. We are committed to building diverse teams and an inclusive culture that respects, values, and celebrates the diversity of\nbackgrounds, identities, and ideas of those who work and shop with us. We are focused on executing strategies to support our commitment to diversity, equality, and inclusion.\nCommunity and social impact. We provide our associates the opportunity to give back to their communities and make a social impact through various programs such as our matching gift program, volunteer time off for eligible associates, and a scholarship program for our associates and their dependents.\nCompetition\nWe believe the principal competitive factors in the off-price retail apparel and home fashion industry are offering significant discounts on brand name merchandise, offering a well-balanced assortment that appeals to our target customers, and consistently providing store environments that are convenient and easy to shop. To execute this concept, we continue to make strategic investments in our merchandising organization. We also continue to make improvements to our merchandising systems to strengthen our ability to plan, buy, and allocate product based on more local versus regional trends. We operate in an attractive sector of retail that will be facing much less brick and mortar competition given the significant number of retail closures and bankruptcies. We believe that we remain well-positioned within the off-price retail apparel and home fashion industry to compete based on these factors.\nNevertheless, the retail apparel market is highly fragmented and competitive. We face a challenging macro-economic and retail environment that creates intense competition for business from online retailers, department stores, specialty stores, discount stores, warehouse stores, other off-price retailers, and manufacturer-owned outlet stores, many of which are units of large national or regional chains that have substantially greater resources. The retail apparel and home-related businesses may become even more competitive in the future.\nAvailable Information\nThe internet address for our corporate website is www.rossstores.com. Our Annual Reports on Form 10-K, quarterly reports on Form 10-Q, current reports on Form 8-K, Proxy Statements, and any amendments to those reports are made available free of charge on or through the Investors section of our corporate website, promptly after being electronically filed with the Securities and Exchange Commission. The information found on our corporate website is not part of this report, or any other report or regulatory filing we file with or furnish to the Securities and Exchange Commission.",
    "item_1A": "ITEM 1A. RISK FACTORS\nOur Annual Report on Form 10-K for fiscal 2020, and information we provide in our Annual Report to Stockholders, press releases, and other investor communications, including those on our corporate website, may contain forward-looking statements with respect to anticipated future events, including the rapidly developing challenges with and our plans and responses to the COVID-19 pandemic and related economic disruptions, our future financial performance, operations, competitive position, and our projected growth, that are all subject to risks and uncertainties that could cause our actual results to differ materially from those forward-looking statements and from our prior expectations and projections. Refer to Management’s Discussion and Analysis for a more complete identification and discussion of “Forward-Looking Statements.”\nOur financial condition, results of operations, cash flows, and the performance of our common stock may be adversely affected by a number of risk factors. Risks and uncertainties that apply to both Ross and dd’s DISCOUNTS include, without limitation, the following:\nThe COVID-19 pandemic continues to severely and adversely affect our sales and our operations, and we expect it to continue to have serious adverse effects on our business and our financial performance.\nThe United States and other countries are experiencing a major, prolonged global COVID-19 pandemic, with related, significant disruptions and restrictions to retail operations and supply chains and to general economic activities, as the affected regions have taken dramatic actions, sometimes including mandatory capacity restrictions, reduced operating hours, and closure of retail operations, in an effort to slow down the spread of the disease.\nAs the COVID-19 pandemic continues, many of our customers and associates are being impacted by recommendations and/or mandates from federal, state, and local authorities to stay home (“shelter in place” or “safer at home”), to avoid non-essential social contact and gatherings of people, and to self-quarantine. Following a chain-wide closure from late March 2020 to mid-May 2020, all of our distribution centers and substantially all of our\nstore locations have been operating since the end of June 2020. While vaccines have become available and a steadily increasing portion of the population is being vaccinated, it will take time for those efforts to reach levels that permit a relaxation in the social restrictions. Additional outbreaks and spreading of the disease have been occurring in many places across the United States, and while levels of spread have gone up and down in different regions, health officials continue to warn of further potential disruptions and quarantine responses. State and local “work from home” recommendations and mandates have been in effect for many of our corporate offices, and may continue for some time. Store closures and distribution center closures may be required again nationally, regionally, or in specific locations.\nThe situation continues to be unprecedented and rapidly changing, and has unknown duration and severity. We have a concentration of store locations in the States of California, Texas, and Florida; together those states include almost fifty percent of our stores, and they have each reported regional “hot spots” and increasing numbers of cases in recent months, which have already resulted in strict customer capacity limits, limits to our hours of operations and curfews, and in mandatory store closures, in certain areas. “Stay at home” measures continue to discourage in-person shopping and to reduce traffic in our stores. More than half of our distribution centers and warehouses are located in California. A required closure of these facilities would be very disruptive to our ability to supply merchandise to our stores. The temporary closure of our stores and distribution centers early in 2020 resulted in a significant loss of sales and profits and had material adverse effects on our financial condition. In addition, the COVID-19 pandemic may potentially adversely affect our ability to adequately staff our distribution centers, our stores, and our merchant and other support operations. Further, the COVID-19 pandemic has severely impacted multiple countries, which may also adversely affect our ability to access and ship products from the affected regions.\nThe prolonged, widespread pandemic has adversely impacted global economies, which has resulted in an economic downturn that may reduce consumer demand for our products. The extent and duration of the impact from the COVID-19 pandemic on our business and financial results will depend largely on future developments, including the duration and spread of the outbreak within the U.S., regional surges in infection, the effectiveness of vaccines in controlling the virus or current or future variants of the virus, the response by all levels of government in their efforts to contain the outbreak and to mitigate the economic disruptions, and the related impact on consumer confidence and spending, all of which are highly uncertain and cannot be predicted. Such impacts have and are expected to adversely affect our profitability, cash flows, financial results, and our capital resources.\nWe are subject to impacts from the macro-economic environment, financial and credit markets, and geopolitical conditions that affect consumer confidence and consumer disposable income. The COVID-19 pandemic may have prolonged and significant negative effects on consumer confidence, shopping behavior, and spending, which may adversely affect our sales and gross margins.\nConsumer spending habits for the merchandise we sell are affected by many factors. Currently, the repercussions from the COVID-19 pandemic are unknown and present significant risks and uncertainty. There is significant uncertainty over potential changes in consumer behavior and shopping patterns as the pandemic continues and as different regions experience surges. Other factors include levels of unemployment, the size and timing of federal stimulus programs, salaries and wage rates, prevailing economic conditions, recession and fears of recession, housing costs, energy and fuel costs, income tax rates and the timing of tax refunds, inflation, consumer confidence in future economic conditions, consumer perceptions of personal well-being and security, availability of consumer credit, consumer debt levels, and consumers’ disposable income. The COVID-19 pandemic, and other potential, adverse developments in any of these areas could reduce demand for our merchandise, decrease our inventory turnover, cause greater markdowns, and negatively affect our sales and margins. All of our stores are located in the United States and its territories, so we are especially susceptible to changes in the U.S. economy.\nWe need to successfully operate under the health and safety measures implemented in our stores and distribution centers, and across all our operations, to comply with regulatory requirements and with the goal of keeping our customers and associates safe from the spread of the COVID-19 virus without disruptions to our operations.\nWe have implemented a variety of measures in our stores locations, distribution centers, and other facilities, with the goal of keeping our associates, customers, and the communities we serve safe from spreading the COVID-19 virus. These measures include additional cleaning and sanitation of stores and workspaces, return merchandise quarantining, providing associates with personal protective equipment based on CDC or other federal, state, or local health guidelines, and implementing physical distancing practices, in our stores, distribution centers, and in our other operations. This is very challenging to do, and there is significant risk, incremental costs, and uncertainty regarding requirements and their implementation. Not only are these measures new and evolving, but they often require change to established habits and patterns of behavior by large groups of people, who may not fully\nunderstand or agree with the requested changes. Whatever measures we adopt, there will also be challenges in effecting consistent compliance by our customers and our associates. We will need to adapt and change these measures over time and as we learn from experience. And despite our efforts and best intentions, incidents of infection will occur at our stores, distribution centers, and/or in our other facilities, potentially resulting in serious illness for those affected, including our associates. This may result in required temporary closure of specific stores, distribution centers, or other facilities, and in temporary or longer term loss of key personnel during illness, and potential supply chain disruptions. We may also face claims (with or without merit) that our retail stores or our other facilities and workplaces are operating in an unsafe manner or are not in compliance with applicable laws and regulations. Any such incidents may adversely affect our operating results, increase our costs, and damage our reputation and competitive position.\nCompetitive pressures in the apparel and home-related merchandise retailing industry are high.\nThe retail industry is highly competitive and the marketplace is highly fragmented, as many different retailers compete for market share by utilizing a variety of store and on-line formats and merchandising strategies. We expect competition to increase in the future. There are no significant economic barriers for others to enter our retail sector. We compete for customers, associates, store locations, and merchandise with many other local, regional, and national retailers, traditional department stores, upscale mass merchandisers, other off-price retailers, specialty stores, internet and catalog businesses, and other forms of retail commerce. Our retail competitors constantly adjust their pricing, business strategies and promotional activity (particularly during holiday periods) in response to changing market conditions or their own financial condition. The substantial sales growth in e-commerce within the last decade has also encouraged the entry of many new competitors, new business models, and an increase in competition from established companies looking for ways to create successful on-line shopping alternatives. Intense pressures from our competitors, our inability to adapt effectively and quickly to a changing competitive landscape, or a failure to effectively execute our off-price model, could reduce demand for our merchandise, decrease our inventory turnover, cause us to take greater markdowns, and negatively affect our sales and margins.\nUnexpected changes in the level of consumer spending on or preferences for apparel and home-related merchandise could adversely affect us.\nOur success depends on our ability to effectively buy and resell merchandise that meets customer demand. We work on an ongoing basis to identify customer trends and preferences, and to obtain merchandise inventory to meet anticipated customer needs. It is very challenging to successfully do this well and consistently across our diverse merchandise categories and in the multiple markets in which we operate throughout the United States and its territories. Although our off-price business model provides us certain advantages and may allow us greater flexibility than traditional retailers have in adjusting our merchandise mix to ever-changing consumer tastes, our merchandising decisions may still fail to correctly anticipate and match consumer trends and preferences, particularly in our newer geographic markets. Failure to correctly anticipate and match the trends, preferences, and demands of our customers could adversely affect our business, financial condition, and operating results.\nAdverse and/or unseasonable weather may affect shopping patterns and consumer demand for seasonal apparel and other merchandise, and may result in temporary store closures and disruptions in deliveries of merchandise to our stores.\nUnseasonable weather and prolonged, extreme temperatures, as well as events such as storms, affect consumers’ buying patterns and willingness to shop, and may adversely affect the demand for merchandise in our stores, particularly in apparel and seasonal merchandise. Among other things, weather conditions may also affect our ability to deliver our products to our stores or require us to close certain stores temporarily, thereby reducing store traffic. Even if stores are not closed, many customers may be unable to go, or may decide to avoid going to stores in bad weather. As a result, adverse or unseasonable weather in any of our markets could lead to disappointing sales and cause us to increase our markdowns, which may negatively affect our sales and margins.\nIn order to achieve our planned gross margins, we must effectively manage our inventories, markdowns, and inventory shortage. As a result of potential changes in shopping behaviors due to the COVID-19 pandemic and potential disruptions to supply chains and store operations, we are at risk for inventory imbalances and the potential for higher than normal levels of markdowns to sell through our inventory, which would negatively affect our gross margins and our operating results.\nWe purchase the majority of our inventory based on our sales plans. If our actual demand is lower than our sales plans, we may experience excess inventory levels and need to take markdowns on excess or slow-moving inventory, resulting in decreased profit margins. We also may have insufficient inventory to meet customer demand, leading to lost sales opportunities. The COVID-19 pandemic may cause changes in shopping behavior and restrictions on our operations, so that our predictions and sales plans are less accurate, and that may lead us to\nhave higher than usual levels of slow-moving or non-salable inventory at our prior planned price levels. We would need to aggressively and progressively reduce our selling prices in order to clear out that inventory, which would result in decreased profit margins or losses on sales of that inventory, and adversely affect our results of operations in future periods.\nAs a regular part of our business, we purchase “packaway” inventory with the intent that it will be stored in our warehouses until a later date. The timing of the release of packaway inventory to our stores varies by merchandise category and by season, but it typically remains in storage less than six months. Packaway inventory is frequently a significant portion of our overall inventory. If we make packaway purchases that do not align with consumer preferences at the later time of release to our stores, we could have significant inventory markdowns. Changes in packaway inventory levels could impact our operating cash flow. Although we have various systems to help protect against loss or theft of our inventory, both when in storage and once distributed to our stores, we may have damaged, lost, or stolen inventory (called “shortage”) in higher amounts than we forecast, which would result in write-offs, lost sales, and reduced margins.\nWe depend on the market availability, quantity, and quality of attractive brand name merchandise at desirable discounts, and on the ability of our buyers to purchase merchandise to enable us to offer customers a wide assortment of merchandise at competitive prices.\nOpportunistic buying, lean inventory levels, and frequent inventory turns are critical elements of our off-price business strategy. Maintaining an overall pricing differential to department and specialty stores is also key to our ability to attract customers and sustain our sales and gross margins. Our opportunistic buying places considerable discretion with our merchants, who are in the marketplace continually and who are generally purchasing merchandise for the current or upcoming season. Our ability to meet or exceed our operating performance targets depends upon the continuous, sufficient availability of high quality merchandise that we can acquire at prices sufficiently below those paid by conventional retailers and that represent a value to our customers. To the extent that certain of our vendors are better able to manage their inventory levels and reduce the amount of their excess inventory, the amount of high quality merchandise available to us could be materially reduced. To the extent that certain of our vendors decide not to sell to us or go out of business, the amount of high quality merchandise available to us could also be materially reduced. Because a significant portion of the apparel and other goods we sell is originally manufactured in other countries, constraints on the availability of shipping capacity, changes in transportation costs or in U.S. tariffs, trade relationships, or tax policies, and natural disasters, or public health issues such as the current COVID-19 pandemic (or other, future pandemics), that reduce the supply or increase the relative cost of imported goods, could also result in disruptions to our existing supply relationships. Shortages, delays, or disruptions in the availability to us of high quality, value-priced merchandise would likely have a material adverse effect on our sales and margins.\nInformation or data security breaches, including cyber-attacks on our transaction processing and computer information systems, could result in theft or unauthorized disclosure of customer, credit card, employee, or other private and valuable information that we handle in the ordinary course of our business, disrupt our operations, damage our reputation, and increase our costs.\nLike other large retailers, we rely on commercially available computer and telecommunications systems to process, transmit, and store payment card and other personal and confidential information, and to provide information or data security for those transactions. Some of the key information systems and processes we use to handle payment card transactions and check approvals, and the levels of security technology utilized in payment cards, are controlled by the banking and payment card industry, not by us. Cybercriminals may attempt to penetrate our point of sale and other information systems to misappropriate customer or business information, including but not limited to credit/debit card, personnel, or trade information. Despite security measures we have in place, and our efforts to prevent, monitor, and mitigate attacks and errors, our facilities and systems (or those of third-party service providers we utilize or connect to) may be vulnerable to security breaches, acts of vandalism, computer viruses, misplaced or lost data, programming and/or human errors, phishing and similar fraudulent attacks, or other similar events. It is also possible that an associate within our Company, or a third party we do business with, may purposefully or inadvertently cause a security breach involving such information. The increasing sophistication of cybercriminals and advances in computer capabilities and remote access increases these risks. A breach of our information or data security, a system shut down or other response we may take, or our failure or delay in detecting and mitigating a loss of personal or business information, could result in damage to our reputation, loss of customer confidence, violation (or alleged violation) of applicable laws (including laws relating to consumer data protection and privacy, and required notifications of data security breaches), and expose us to civil claims, litigation, and regulatory action, and to unanticipated costs and disruption of our operations.\nDisruptions in our supply chain or in our information systems could impact our ability to process sales and to deliver product to our stores in a timely and cost-effective manner.\nVarious information systems are critical to our ability to operate and to manage key aspects of our business. We depend on the integrity, continuous availability, and consistent operations of these systems to process transactions in our stores, track inventory flow, manage merchandise allocation and distribution logistics, generate performance and financial reports, and support merchandising decisions.\nWe are currently making, and will continue to make, significant technology investments to improve or replace information processes and systems that are key to managing our business. We must monitor and choose sound investments and implement them at the right pace. The risk of system disruption is increased whenever significant system changes are undertaken. An excessive rate of technological change could detract from the effectiveness of adoption, and could make it more difficult for us to realize benefits from new technology. Poorly targeting opportunities, failing to make good investments, or making an investment commitment significantly above or below our needs could damage our competitive position and adversely impact our business and results of operations. Additionally, the potential problems and interruptions associated with implementing technology system changes could disrupt or reduce the efficiency of our operations in the short term. These initiatives might not provide us with the anticipated benefits, or may provide them on a delayed schedule or at a higher cost.\nOur information systems, including our back-up systems, are subject to damage or interruption from power outages, computer and telecommunications failures, computer viruses, internal or external security breaches, catastrophic events such as severe storms, fires, earthquakes, floods, acts of terrorism, and design or usage errors by our employees or by third parties. If our information systems or our back-up systems are damaged or cease to function properly, we may have to make significant investments to fix or replace them, and we may suffer interruptions in our operations in the interim. Any material interruption in our computer systems could have a material adverse effect on our business and results of operations.\nA disruption within our logistics or supply chain network could adversely affect our ability to timely and efficiently transport merchandise to our stores or our distribution centers, which could impair our ability to meet customer demand for products and result in lost sales or increased supply chain costs. Such disruptions may result from: public health issues such as the current COVID-19 pandemic (or other, future pandemics), damage or destruction to our distribution centers, weather-related events, natural disasters, trade restrictions, tariffs, third-party strikes or ineffective cross dock operations, work stoppages or slowdowns, shipping capacity constraints, supply or shipping interruptions, or other factors beyond our control. Any such disruptions could negatively impact our financial performance or financial condition.\nWe need to obtain acceptable new store sites with favorable consumer demographics to achieve our planned growth.\nSuccessful growth requires us to find appropriate real estate sites in our targeted market areas. We compete with other retailers and businesses for acceptable store locations. For the purpose of identifying locations we rely, in part, on consumer demographics. While we believe consumer demographics are helpful indicators of acceptable store locations, we recognize that this information cannot predict future consumer preferences and buying trends with complete accuracy. Time frames for negotiations and store development vary from location to location and can be subject to unforeseen delays or unexpected cancellations. We may not be able to open new stores or, if opened, operate those new stores profitably. Construction and other delays in store openings could have a negative impact on our business and operating results. Additionally, we may not be able to renegotiate our current lease terms which could negatively impact our operating results. New stores may not achieve the same sales or profit levels as our existing stores, and adding stores to existing markets may adversely affect the sales and profitability of other existing stores. If we cannot acquire sites on attractive terms, it could limit our ability to grow or adversely affect the economics of our new stores in various markets.\nTo achieve growth, we need to expand in existing markets and enter new geographic markets.\nOur growth strategy is based on successfully expanding our off-price model in current markets and in new geographic regions. There are significant risks associated with our ability to continue to expand our current business and to enter new markets. Stores we open in new markets may take longer to reach expected sales and profit levels on a consistent basis and may have higher construction, occupancy, advertising, or operating costs than stores we open in existing markets, thereby affecting our overall profitability. New markets may have competitive conditions, consumer tastes, and discretionary spending patterns that are more difficult to predict or satisfy than our existing markets. Our limited operating experience and limited brand recognition in new markets may require us to build\nbrand awareness in that market through greater investments in advertising and promotional activity than we originally planned. We may find it more difficult in new markets to hire, motivate, and retain qualified associates.\nConsumer problems or legal issues involving the quality, safety, or authenticity of products we sell could harm our reputation, result in lost sales, and/or increase our costs.\nVarious governmental authorities regulate the quality and safety of merchandise we sell. These regulations and related laws frequently change, and the ultimate cost of compliance cannot be precisely estimated. Because of our opportunistic buying strategy, we sometimes obtain merchandise in new categories or from new vendors that we have not dealt with before. Although our vendor arrangements typically place contractual responsibility on the vendor for resulting liability and we generally rely on our vendors to provide authentic merchandise that matches the stated quality attributes and complies with applicable product safety and other laws, vendor non-compliance with consumer product safety laws may subject us to product recalls, make certain products unsalable, or require us to incur significant compliance costs.\nRegardless of fault, any real or perceived issues with the quality and safety of merchandise we offer, particularly products such as food and children’s items, issues with the authenticity of merchandise, or our inability, or that of our vendors, to comply on a timely basis with laws and regulatory requirements, could adversely affect our reputation, result in lost sales, inventory write-offs, uninsured product liability or other legal claims, penalties or losses, merchandise recalls, and increased costs.\nAn adverse outcome in various legal, regulatory, or tax matters could damage our reputation or brand and increase our costs.\nAs an ordinary part of our business, we are involved in various legal proceedings, regulatory reviews, tax audits, and/or other legal matters. These may include lawsuits, inquiries, demands, or other claims or proceedings by governmental entities and private plaintiffs, including those relating to employment and employee benefits (including classification, employment rights, discrimination, harassment, wage and hour, and retaliation), securities, real estate, tort, commercial, consumer protection, privacy, product compliance and safety, advertising, comparative pricing, product labeling, intellectual property, tax, escheat, and whistle-blower claims. We continue to be involved in a number of employment-related lawsuits, including class/representative actions which are primarily in California.\nWe are subject to federal, state, and local rules and regulations in the United States, and to various international laws, which change from time to time. These legal requirements collectively affect multiple aspects of our business, including the cost of health care, workforce management and employee benefits, minimum wages, advertising, comparative pricing, import/export, sourcing and manufacturing, data protection (including customer and associate data privacy, choice and notification rights), intellectual property, and others. If we fail to comply (or are alleged not to comply) with any of these requirements, we may be subject to fines, settlements, penalties, or other costs. In addition, an adverse outcome (or the adverse publicity from the claims) in any of these matters may damage our reputation or brand. We are also subject to the continuous examination of our tax returns and reports by federal, state, and local tax authorities, and these examining authorities may challenge positions we take.\nSignificant judgment is required in evaluating and estimating our tax provisions and reserves for legal claims. Actual results may differ and our costs may exceed the reserves we establish in estimating the probable outcomes. In addition, applicable accounting principles and interpretations may change from time to time, and those changes could have material effects on our reported operating results and financial condition.\nDamage to our corporate reputation or brands could adversely affect our sales and operating results.\nOur reputation is partially based on perceptions of various subjective qualities and overall integrity. Any incident that erodes the trust or confidence of our customers or the general public could adversely affect our reputation and business, particularly if the incident results in significant adverse publicity or governmental inquiry. Such an incident could also include alleged acts or omissions by or situations involving our suppliers (or their contractors or subcontractors), the landlord for our stores, or our associates outside of work, and may pertain to social or political issues or protests largely unrelated to our business. The use of social media platforms, including blogs, social media websites, and other forms of internet-based communications which allow individuals access to a broad audience of consumers and other interested persons, continues to increase. The availability of information (whether correct or erroneous) on social media platforms is virtually immediate, as is its impact. Many social media platforms immediately publish the content their subscribers and participants post, often without filters or checks on accuracy of the content. The opportunity for dissemination of information, including inaccurate information, is seemingly limitless and readily available. Information concerning our Company may be posted on such platforms at any time. Information posted may be adverse to our interests or may be inaccurate, which could negatively affect our sales,\ndiminish customer trust, reduce employee morale and productivity, and lead to difficulties in recruiting and retaining qualified associates. The harm may be immediate, without affording us an opportunity for redress or correction.\nOur inability to continually attract, train, and retain associates with the retail talent necessary to execute our off-price retail strategies along with labor shortages, increased turnover, or increased labor costs could adversely affect our operating results.\nLike other retailers, we face challenges in recruiting and retaining sufficient talent in our buying organization, management, stores, distribution centers, and other key areas. Many of our retail store associates are in entry level or part-time positions with historically high rates of turnover. Our ability to control labor costs is subject to numerous external factors, including prevailing wage rates and health and other insurance costs, as well as the impact of legislation or regulations governing minimum wage or healthcare benefits.\nAny increase in labor costs may adversely impact our profitability or, if we fail to pay such higher wages, may result in increased turnover. Excessive turnover may result in higher costs associated with finding, hiring, and training new associates. If we cannot hire enough qualified associates, or if there is a disruption in the supply of personnel we hire from third-party providers, especially during our peak seasons, our operations could be negatively impacted.\nBecause of the distinctive nature of our off-price model, we must also attract, train, and retain our key associates across the Company, especially within our buying organization. The loss of one or more of our key personnel, or the inability to effectively identify a suitable successor for a key role could have a material adverse effect on our business. There is no assurance that we will be able to attract or retain highly qualified associates in the future, and any failure to do so could have a material adverse effect on our growth, operations, or financial position.\nWe must effectively advertise and market our business.\nCustomer traffic and demand for our merchandise is influenced by our advertising and marketing activities, the name recognition and reputation of our brands, and the location of our stores. Although we use marketing and advertising programs to attract customers to our stores, particularly through television and social media, our competitors may spend more or use different approaches, which could provide them with a competitive advantage. Our advertising and other promotional programs may not be effective or may be perceived negatively, or could require increased expenditures, any of which could adversely affect sales or increase costs.\nWe are subject to risks associated with selling and importing merchandise produced in other countries.\nRisks in importing and selling such merchandise include import duties and quotas, compliance with anti-dumping regulations, economic uncertainties and adverse economic conditions (including inflation, recession, and exchange rate fluctuations), foreign government regulations, employment and labor matters, concerns relating to human rights, working conditions, and other issues in factories or countries where merchandise is produced, transparency of sourcing and supply chains, exposure on product warranty and intellectual property issues, consumer perceptions of the safety of imported merchandise, wars and fears of war, political unrest, natural disasters, regulations to address climate change, and trade restrictions.\nA predominant portion of the apparel and other goods we sell (even when we purchase it domestically, often as excess inventory sold to us by a domestic vendor) is originally manufactured in other countries. In addition, we directly source a portion of the products sold in our stores from foreign vendors predominantly in Asia (including China). We also buy products that originate from foreign sources indirectly through domestic vendors and manufacturers’ representatives. Although our foreign purchases of merchandise are negotiated and paid for in U.S. dollars, decreases in the value of the U.S. dollar relative to foreign currencies could increase the cost of products we purchase from overseas vendors. When we are the importer of record, we may be subject to regulatory or other requirements similar to those applicable to a manufacturer.\nTo the extent that our vendors are located overseas or rely on overseas sources for a large portion of their products, any event causing a disruption, delay, or increase in the cost of imports, including the imposition of import or other restrictions, war, acts of terrorism, natural disasters, or public health issues such as the current COVID-19 pandemic (or other, future pandemics) could adversely affect our business. The flow of merchandise from our vendors could also be adversely affected by global shipping capacity limitations, or by financial or political instability in any of the countries in which the goods we purchase are manufactured. Trade restrictions in the form of tariffs or quotas, or both, applicable to the products we sell could also affect the importation of those products and could increase the cost and reduce the supply of products available to us. We cannot predict whether any of the countries from which our products are sourced, or in which our products are currently manufactured or may be manufactured in the\nfuture, will be subject to trade restrictions imposed by the U.S. or foreign governments or the likelihood, type or effect of any such restrictions.\nWe require our vendors (for both import and domestic purchasing) to contractually confirm that they adhere to various conduct, compliance, and other requirements, including those relating to environmental, employment and labor (including wages and working conditions), health, safety, and anti-bribery standards. From time to time, our vendors, their contractors, or their subcontractors may be alleged to not be in compliance with these standards or with applicable local laws. Although we have implemented policies and procedures to facilitate compliance with laws and regulations relating to doing business in foreign markets and importing merchandise, and to monitor the compliance of our suppliers, this does not guarantee that suppliers and other third parties with whom we do business will not violate such laws and regulations or our policies. Significant or continuing noncompliance with such standards and laws by one or more vendors could have a negative impact on our reputation, could subject us to claims and liability, and could have an adverse effect on our results of operations.\nChanges in U.S. tax or trade policy regarding apparel and home-related merchandise produced in other countries could adversely affect our business.\nA predominant portion of the apparel and other goods we sell is originally manufactured in other countries. The U.S. government has at times indicated a willingness to significantly change existing trade policies, including those with China. This exposes us to risks of disruption and cost increases in our established patterns for sourcing our merchandise, and creates increased uncertainties in planning our sourcing strategies and forecasting our margins. Changes in U.S. tariffs, quotas, trade relationships, or tax provisions that reduce the supply or increase the relative cost of goods produced in other countries could increase our cost of goods and/or increase our effective tax rate. Although such changes would have implications across the entire industry, we may fail to effectively adapt and to manage the adjustments in strategy that would be necessary in response to those changes. In addition to the general uncertainty and overall risk from potential changes in U.S. laws and policies, as we make business decisions in the face of uncertainty as to potential changes, we may incorrectly anticipate the outcomes, miss out on business opportunities, or fail to effectively adapt our business strategies and manage the adjustments that are necessary in response to those changes. These risks could adversely affect our revenues and expenses, increase our effective tax rates, and reduce our profitability.\nWe may experience volatility in revenues and earnings.\nOur business has slower and busier periods based on holiday and back-to-school seasons, weather, and other factors. Although our off-price business is historically subject to less seasonality than traditional retailers, we may still experience unexpected decreases in sales from time to time, which could result in increased markdowns and reduced margins. Significant operating expenses, such as rent expense and associate salaries, do not adjust proportionately with our sales. If sales in a certain period are lower than our plans, we may not be able to adjust these operating expenses concurrently, which could adversely affect our operating results.\nA pandemic, natural or man-made disaster in California or in another region where we have a concentration of stores, offices, or a distribution center could harm our business.\nOur corporate headquarters, Los Angeles buying office, nine distribution centers/warehouses, and approximately 23% of our stores are located in California. Natural or other disasters, such as the current COVID-19 pandemic (or other, future pandemics), wildfires, earthquakes, hurricanes, tornadoes, floods, or other extreme weather and climate conditions, or fires, explosions, and acts of war or terrorism, or public health issues, in any of our markets could disrupt our operations or our supply chain, or could shut down, damage, or destroy our stores or distribution facilities.\nTo support our continuing operations, our new store and distribution center growth plans, our quarterly dividends, and any resumption of our stock repurchase program, we must maintain sufficient liquidity; the COVID-19 pandemic and related economic disruption are adding significant uncertainty and challenges.\nWe depend upon our operations to generate strong cash flows to support our general operating activities, and to supply capital to finance our operations, make capital expenditures and acquisitions, manage our debt levels, and return value to our stockholders through dividends and stock repurchases. The COVID-19 pandemic resulted in a prolonged period during the first half of 2020 in which we temporarily closed all store locations and distribution centers. Although our store and distribution center operations have remained substantially open since June of 2020, there have been ongoing regional restrictions on store operating capacity, ongoing adversity in general economic conditions, and adverse impact on consumer confidence and shopping behavior. While the pandemic continues, further closures or disruptions to our operations may be required nationally, regionally, or in specific\nlocations. The situation is unprecedented and rapidly changing, and has unknown duration and severity. If we are unable to generate sufficient cash flows from operations to support our activities, our growth plans and our financial performance would be adversely affected.\nWe have borrowed on occasion to finance some of our activities. In March 2020, we borrowed $800 million from our revolving credit facility (subsequently repaid in the third quarter of 2020). In April 2020, we completed a $2.0 billion senior notes offering (subsequently we refinanced $775 million in aggregate principal amount of those senior notes with the issuance of $1.0 billion in aggregate principal amount of lower interest rate senior notes). These actions were taken to add to our cash balances in order to provide enhanced financial flexibility due to uncertain market conditions arising from the impact of the COVID-19 pandemic. If our access to capital is restricted or our borrowing costs increase, our operations and financial condition could be adversely impacted. In addition, if we do not properly allocate our capital to maximize returns, our operations, cash flows, and returns to stockholders could be adversely affected.\nWe are subject to impacts from instances of damage to our stores and losses of merchandise accompanying protests or demonstrations, which may result in temporary store closures.\nThere have been recent demonstrations and protests in cities throughout the United States. While they have generally been peaceful, in some locations they have been accompanied by violence, damage to retail stores, and the loss of merchandise. While generally subject to coverage by insurance, the repair of damage to our stores and replacement of lost merchandise may also increase our costs and temporarily disrupt store operations, and we may incur increased operating costs for additional security. Governmental authorities in affected cities and regions may take actions in an effort to protect people and property while permitting lawful and non-violent protests, including curfews and restrictions on business operations, which may be disruptive to our operations. These activities, governmental responses, and resulting media coverage may also harm consumer confidence and perceptions of personal well-being and security, which may negatively affect shopping behavior and our sales.",
    "item_1B": "ITEM 1B. UNRESOLVED STAFF COMMENTS\nNot applicable.",
    "item_1C": "",
    "item_2": "ITEM 2. PROPERTIES\nAt January 30, 2021, we operated a total of 1,859 stores, of which 1,585 were Ross stores in 40 states, the District of Columbia, and Guam, and 274 were dd’s DISCOUNTS stores in 21 states. All stores are leased, with the exception of two locations which we own.\nDuring fiscal 2020, we opened 50 new Ross stores and closed 11 existing stores. The average approximate Ross store size is 28,000 square feet.\nDuring fiscal 2020, we opened 16 new dd’s DISCOUNTS stores, including reopening one store previously temporarily closed due to a weather event, and closed one existing store. The average approximate dd’s DISCOUNTS store size is 23,000 square feet.\nDuring fiscal 2020, no one store accounted for more than 1% of our sales.\nWe carry fire, flood, wind, and earthquake insurance to help mitigate the risk of financial loss that may result from such events.\nOur real estate strategy in 2021 is to primarily open stores in states where we currently operate, to increase our market penetration and leverage overhead and advertising expenses as a percentage of sales in each market. We also expect to continue our store expansion in newer markets in 2021. Important considerations in evaluating a new store location in both newer and more established markets are the availability and quality of potential sites, demographic characteristics, competition, and population density of the local trade area. In addition, we continue to consider opportunistic real estate acquisitions.\nThe following table summarizes the locations of our stores by state/territory as of January 30, 2021 and February 1, 2020.\nWhere possible, we obtain sites in buildings requiring minimal alterations, allowing us to establish stores in new locations in a relatively short period of time at reasonable costs in a given market. At January 30, 2021, the majority of our stores had unexpired original lease terms ranging from three to ten years, with three to four renewal options of five years each. The average unexpired original lease term of our leased stores is approximately six years, or approximately 20 years if renewal options are included. See Note E of Notes to Consolidated Financial Statements.\nSee additional discussion under “Stores” in Item 1.\nThe following table summarizes the location and approximate sizes of our distribution/warehouse facilities and office locations as of January 30, 2021. Square footage information for the distribution and warehouse facilities represents total ground floor area of the facility. Square footage information for office space represents total space owned and leased. See additional discussion in Management’s Discussion and Analysis.\nSee additional discussion under “Distribution” in Item 1.",
    "item_3": "ITEM 3. LEGAL PROCEEDINGS\nWe have been named in class/representative action lawsuits, primarily in California, alleging violation of wage and hour laws and consumer protection laws. Class/representative action litigation remains pending as of January 30, 2021.\nWe are also party to various other legal and regulatory proceedings arising in the normal course of business. Actions filed against us may include commercial, product and product safety, consumer, intellectual property, environmental, and labor and employment-related claims, including lawsuits in which private plaintiffs or governmental agencies allege that we violated federal, state, and/or local laws. Actions against us are in various procedural stages. Many of these proceedings raise factual and legal issues and are subject to uncertainties.\nLike many retailers and other businesses, we have filed a lawsuit as plaintiff against the insurance companies with respect to our claims for insurance coverage for business interruption, property damage, and other losses that we have experienced as a result of the COVID-19 pandemic. Our suit was filed in Alameda County, California in December 2020. The proceedings remain at an early procedural stage, and are subject to significant uncertainties.\nWe believe that the resolution of our pending class/representative action litigation and other currently pending legal and regulatory proceedings will not have a material adverse effect on our financial condition, results of operations, or cash flows.",
    "item_4": "ITEM 4. MINE SAFETY DISCLOSURES\nNot applicable.\nExecutive Officers of the Registrant\nThe following sets forth the names and ages of our executive officers, indicating each person’s principal occupation or employment during at least the past five years. The term of office is at the discretion of our Board of Directors.\nMr. Balmuth has served as Chairman of the Board and Senior Advisor since November 2019. From 2014 to November 2019, Mr. Balmuth was Executive Chairman of the Board of Directors and from 1996 to 2014, he was Vice Chairman of the Board of Directors and Chief Executive Officer. He also served as President from 2005 to 2009. Previously, Mr. Balmuth was Executive Vice President, Merchandising from 1993 to 1996 and Senior Vice President and General Merchandise Manager from 1989 to 1993. Before joining Ross, he was Senior Vice President and General Merchandising Manager at Bon Marché in Seattle from 1988 to 1989 and Executive Vice President and General Merchandising Manager for Karen Austin Petites from 1986 to 1988.\nMs. Rentler has served as Chief Executive Officer and a member of the Board of Directors since 2014. From 2009 to 2014, she was President and Chief Merchandising Officer, Ross Dress for Less and Executive Vice President, Merchandising, from 2006 to 2009. She also served at dd’s DISCOUNTS as Executive Vice President and Chief Merchandising Officer from 2005 to 2006, and Senior Vice President and Chief Merchandising Officer from 2004 to 2005. Prior to that, she held various merchandising positions since joining the Company in 1986.\nMr. Hartshorn has served as Group President and Chief Operating Officer since August 2019 and a member of the Board of Directors since March 2021. Previously, he was Group Executive Vice President, Finance and Legal, Chief Financial Officer in 2019; Executive Vice President, Chief Financial Officer from 2018 to 2019; Group Senior Vice President, Chief Financial Officer from 2015 to 2018; Senior Vice President and Chief Financial Officer from 2014 to 2015; and Senior Vice President and Deputy Chief Financial Officer from 2012 to 2014. He was also Group Vice President, Finance and Treasurer from 2011 to 2012, and Vice President, Finance and Treasurer from 2006 to 2011. From 2002 to 2006, he held a number of management roles in the Ross IT and supply chain organizations. He initially joined the Company in 2000 as Director and Assistant Controller. For seven years prior to joining Ross, Mr. Hartshorn held various financial roles at The May Department Stores Company.\nMr. Kobayashi has served as President, Operations and Technology since August 2019. Prior to that, he served as Group Executive Vice President, Supply Chain, Merchant Operations, and Technology since 2014. Previously, he was Executive Vice President, Supply Chain, Allocation, and Chief Information Officer from 2010 to 2014; Group Senior Vice President, Supply Chain and Chief Information Officer from 2008 to 2010; and Senior Vice President and Chief Information Officer from 2004 to 2008. Before joining Ross in 2004, Mr. Kobayashi was a Partner with Accenture in their Retail and Consumer Goods practice where he spent 18 years in a variety of management consulting roles.\nMr. Morrow has served as President and Chief Merchandising Officer, dd’s DISCOUNTS since December 2015. Prior to joining Ross, Mr. Morrow served as President, Chief Merchandising Officer of Stein Mart from 2014 to 2015 and Executive Vice President and Chief Merchandising Officer from 2010 to 2014. From 2008 to 2009, he served as Executive Vice President, General Merchandise Manager at Macy’s West. He also held roles as Senior Vice President, General Merchandise Manager at Mervyn’s in 2008 and Macy’s North/Marshall Field’s from 2006 to 2008. For approximately 20 years prior to this, Mr. Morrow held various merchandising roles at The May Department Stores Company.\nMr. Marquette has served as Executive Vice President and Chief Financial Officer since March 2021. Prior to that, he was Group Senior Vice President and Chief Financial Officer from 2019 to 2021, Group Senior Vice President and Deputy Chief Financial Officer from 2018 to 2019, and Senior Vice President, Finance from 2017 to 2018. He was also Senior Vice President, Store Operations from 2015 to 2017, Group Vice President, Store Operations from 2013 to 2015, and Vice President, Store Operations Finance from 2009 to 2013. Prior to joining Ross in 2008 as Director, Strategic Planning, Mr. Marquette held various consulting and management roles over a 12-year period with Bain & Company, Carter’s Inc., and PricewaterhouseCoopers.\nPART II",
    "item_5": "ITEM 5. MARKET FOR REGISTRANT’S COMMON EQUITY, RELATED STOCKHOLDER MATTERS AND ISSUER PURCHASES OF EQUITY SECURITIES\nGeneral information. See the information set forth under the caption “Quarterly Financial Data (Unaudited)” under Note K of Notes to Consolidated Financial Statements in Item 8 of this Annual Report on Form 10-K, which is incorporated herein by reference. Our stock is traded on The NASDAQ Global Select Market® under the symbol ROST. There were 1,014 stockholders of record as of March 8, 2021 and the closing stock price on that date was $120.37 per share.\nCash dividends. On March 2, 2021, our Board of Directors declared a quarterly cash dividend of $0.285 per common share, payable on March 31, 2021. Our Board of Directors declared a cash dividend of $0.285 per common share in March 2020. In May 2020, we temporarily suspended our quarterly dividends, due to the economic uncertainty stemming from the COVID-19 pandemic. Our Board of Directors declared cash dividends of $0.255 per common share in March, May, August, and November 2019, and cash dividends of $0.225 per common share in March, May, August, and November 2018.\nIssuer purchases of equity securities. Information regarding shares of common stock we repurchased during the fourth quarter of fiscal 2020 is as follows:\n¹ We acquired 1,381 shares of treasury stock during the quarter ended January 30, 2021, which relates to shares acquired from employees for tax withholding purposes related to vesting of restricted stock grants. No shares were repurchased under our publicly announced stock repurchase program.\nIn March 2019, our Board of Directors approved a two-year $2.55 billion stock repurchase program through fiscal 2020. Due to the economic uncertainty stemming from the COVID-19 pandemic and to manage liquidity, we suspended our stock repurchase program as of March 2020. We did not purchase any additional shares for the remainder of the fiscal year.\nSee Note H of Notes to Consolidated Financial Statements for equity compensation plan information. The information under Item 12 of this Annual Report on Form 10-K under the caption “Equity compensation plan information” is incorporated herein by reference.\nStockholder Return Performance Graph\nThe following information in this Item 5 shall not be deemed filed for purposes of Section 18 of the Securities Act of 1934, nor shall it be deemed incorporated by reference in any filing under the Securities Act of 1933.\nThe graph below compares total stockholder returns over the last five years for our common stock to the Standard & Poor’s 500 Index (“S&P Index”) and the Dow Jones Apparel Retailers Index.\nWe use the Dow Jones Apparel Retailers Index in our performance graph because we believe the retail companies comprising that index are aligned with the segment of the retail industry in which we operate, and it provides a relevant comparison against which to measure our stock performance.\nThe cumulative total return listed below assumed an initial investment of $100 and reinvestment of dividends at each fiscal year-end, and measures the performance of this investment as of the last trading day in the month of January for each of the following five years. These measurement dates are based on the historical month-end data available and vary slightly from our actual fiscal year-end date for each period. Data with respect to returns for the S&P Index and the Dow Jones Apparel Retailers Index is not readily available for periods shorter than one month. The graph is a historical representation of past performance only and is not necessarily indicative of future performance.\nCOMPARISON OF 5 YEAR CUMULATIVE TOTAL RETURN\nAmong Ross Stores, Inc., the S&P 500 Index, and Dow Jones Apparel Retailers",
    "item_6": "ITEM 6. SELECTED FINANCIAL DATA\nThe following selected financial data is derived from our consolidated financial statements. The data set forth below should be read in conjunction with “Management’s Discussion and Analysis of Financial Condition and Results of Operations,” the section “Forward-Looking Statements” in this Annual Report on Form 10-K and our consolidated financial statements and notes thereto.\nSelected Financial Data",
    "item_7": "ITEM 7. MANAGEMENT’S DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION AND RESULTS OF OPERATIONS\nOverview\nRoss Stores, Inc. operates two brands of off-price retail apparel and home fashion stores-Ross Dress for Less® (“Ross”) and dd’s DISCOUNTS®. Ross is the largest off-price apparel and home fashion chain in the United States with 1,585 locations in 40 states, the District of Columbia, and Guam, as of January 30, 2021. Ross offers first-quality, in-season, name brand and designer apparel, accessories, footwear, and home fashions for the entire family at savings of 20% to 60% off department and specialty store regular prices every day. We also operate 274 dd’s DISCOUNTS stores in 21 states as of January 30, 2021 that feature a more moderately-priced assortment of first-quality, in-season, name brand apparel, accessories, footwear, and home fashions for the entire family at savings of 20% to 70% off moderate department and discount store regular prices every day.\nOur primary objective is to pursue and refine our existing off-price strategies to maintain and improve both profitability and financial returns over the long term. In establishing appropriate growth targets for our business, and considering the pace and magnitude of the economic recovery post the COVID-19 pandemic, we are closely monitoring market share trends for the off-price industry and believe our share gains will continue to be driven mainly by continued focus on value and convenience by consumers. Our merchandise and operational strategies are designed to take advantage of the expanding market share of the off-price industry as well as the ongoing customer demand for name brand fashions for the family and home at compelling discounts every day.\nWe refer to our fiscal years ended January 30, 2021, February 1, 2020, and February 2, 2019 as fiscal 2020, fiscal 2019, and fiscal 2018, respectively.\nEffects of the COVID-19 Pandemic on Our Business\nThe United States and other countries are experiencing an ongoing, major global health pandemic related to the outbreak of a novel strain of coronavirus, COVID-19, that started at the beginning of 2020. Governmental authorities in affected regions have taken, and continue to take, dramatic actions in an effort to slow down the spread of the disease. Like other retailers across the country, we temporarily closed all our store locations, our distribution centers, and our buying and corporate offices for a significant part of our first and second fiscal quarters. We also instituted “work from home” measures for many of our associates. Our closures took effect March 20, 2020.\nAll our distribution centers were reopened by the end of May 2020. The vast majority of our store locations were open and operating by the end of June 2020, and remained open throughout the remainder of fiscal 2020. While open, many of our stores were operating on shorter hours and under mandated occupancy restrictions for periods of time as compared to the prior year.\nThe COVID-19 pandemic and the related economic disruption had a material adverse impact on our results of operations, financial position, and cash flows for fiscal 2020. The consolidated results presented in this report reflect the significant revenue decline and other impacts from our temporary store closures (for approximately half of the first quarter and 25 percent of the second quarter), mandated occupancy restrictions, and reduced operating hours. Our core business results improved during the second half of fiscal 2020; however, upsurges of COVID-19 in the fourth quarter, especially in California, our largest state, resulted in reduced customer traffic and slowed the pace of recovery. While vaccines have become available and a steadily increasing portion of the U.S. population is being vaccinated, it will take time for those efforts to reach levels that permit a relaxation of the social distancing restrictions. We expect the material adverse effects from the pandemic to continue through fiscal 2021 and potentially beyond.\nThe temporary closure of all our stores during much of the first two fiscal quarters significantly impacted our ability to sell the seasonal inventory then on hand in a timely manner. As we reopened our stores and resumed operations in the middle of the second quarter, a significant portion of the merchandise in our stores was aged and out of season. We took deep markdowns to sell through this inventory. During the initial reopenings, sales were ahead of our conservative plans, as we benefited from pent-up consumer demand and aggressive markdowns. In the weeks after reopening, sales trends were negatively affected by depleted store inventory levels while we were ramping up our buying and distribution capabilities. During the third quarter, sales improved substantially compared to the second quarter. This was driven by several factors, including an improvement in our merchandise assortments, a\nlater back-to-school season, stronger performance in our larger markets, and our return to more normal store hours. Our fourth quarter sales remained suppressed due to the negative impact from the upsurge in the virus that resulted in reduced customer traffic and more stringent occupancy and store operating hours restrictions.\nThe ongoing effect of the COVID-19 pandemic on consumer behavior and spending patterns remains highly uncertain. Despite the initial surge in customer demand as our stores first reopened, we expect customer demand to be generally suppressed for an extended period of time. In addition, there have been recent resurgences in the spread of COVID-19 and new virus variants throughout the United States, which may also recur in the future, in one or more regions, and which have and could require our stores and distribution centers to temporarily close again nationally, regionally, or in specific locations. These closures would negatively impact our future revenue and operations.\nIn response to the COVID-19 pandemic, we incurred various costs to reopen our stores and distribution centers, and we incurred additional operating costs for processes and procedures to facilitate social distancing, to enhance cleaning and sanitation activities, and to provide personal protective equipment to our associates. These actions, combined with various other actions taken to reduce costs, resulted in approximately $130 million of additional net costs in fiscal 2020. We expect our operating costs to remain elevated related to our continuing response to the COVID-19 pandemic.\nTo preserve our financial liquidity and enhance our financial flexibility, we borrowed $800 million from our revolving credit facility in March 2020, completed a $2.0 billion senior notes offering in April 2020, and entered into a new $500 million 364-day senior revolving credit facility in May 2020. In the third quarter of fiscal 2020, we refinanced $775 million in aggregate principal amount of higher interest senior notes with the issuance of $1.0 billion in aggregate principal amount of lower interest rate senior notes. This action resulted in a refinancing charge of approximately $240 million in the third quarter, but will significantly reduce our annual interest expense and total cash outlays over the life of the debt. In addition to refinancing the senior notes, we took several other actions during the third quarter, to reduce our ongoing debt costs, including repayment of the $800 million revolving credit facility and termination of the undrawn $500 million 364-day senior revolving credit facility.\nWe suspended our stock repurchase program in March 2020 and temporarily suspended quarterly dividends in May 2020, and we took measures to reduce our expenses, inventory receipts, and capital expenditures. Beginning April 5, 2020, we implemented temporary furloughs for a large portion of our hourly store and distribution center and other associates in our buying and corporate offices who could not work productively while our stores and distribution centers were closed. Employee health benefits for eligible associates continued during the temporary furlough at no cost to the impacted associates. We also reduced payroll expenses through temporary salary reductions for senior executives and other personnel, which remained in effect until May 24, 2020, when more than half of our stores had reopened. In conjunction with these payroll expense reduction measures, effective April 1, 2020, the non-employee members of our Board of Directors suspended the cash elements of their director compensation, which remained in effect until August 2020.\nIn May 2020, in connection with the phased reopening of our store and distribution center locations, we began recalling many of our furloughed associates, as they were able to resume productive work. As of our third quarter, the majority of these associates had returned to work.\nAlso in May 2020, we suspended rent payments associated with the leases for our temporarily closed stores. During fiscal 2020, we negotiated rent deferrals and/or rent abatements for a significant number of our stores. The repayment of the deferrals will be at later dates, primarily in fiscal 2021. We have recorded accruals for rent payment deferrals and have recorded rent abatements as a reduction of variable lease costs.\nGiven the unprecedented impact the COVID-19 pandemic has had on our business, and the continued uncertainty surrounding the COVID-19 pandemic, including its unknown duration and future severity, the potential for resurgences and new virus variants, and the unknown overall impact on consumer demand and store productivity, we expect that impacts from the COVID-19 pandemic and the related cost increases and economic disruption may have a material adverse impact on our consolidated results of operations, financial condition, and cash flows in fiscal 2021 and potentially beyond.\nResults of Operations\nThe following table summarizes the financial results for fiscal 2020, 2019, and 2018:\nStores. Total stores open at the end of fiscal 2020, 2019, and 2018 were 1,859, 1,805, and 1,717, respectively. The number of stores at the end of fiscal 2020, 2019, and 2018 increased by 3%, 5%, and 6% from the respective prior years. In response to the impacts from the COVID-19 pandemic, we reduced our pace of new store openings for fiscal 2020. Our longer term strategy is to open additional stores based on market penetration, local demographic characteristics, competition, expected store profitability, and the ability to leverage overhead expenses. We continually evaluate opportunistic real estate acquisitions and opportunities for potential new store locations. We also evaluate our current store locations and determine store closures based on similar criteria.\nSales. Sales for fiscal 2020 decreased $3.5 billion, or 21.9%, compared to the prior year. This was primarily due to the negative impact from store closures during the March 2020 to June 2020 period, the negative impact on customer demand from the COVID-19 pandemic, mandated occupancy restrictions, and reduced store operating hours during the remainder of fiscal 2020. We opened 54 net new stores during 2020. The sales from these new stores partially offset the overall sales decline.\nSales for fiscal 2019 increased $1.1 billion, or 7.0%, compared to the prior year due to the opening of 88 net new stores during 2019 and a 3% increase in sales from comparable stores.\nOur sales mix is shown below for fiscal 2020, 2019, and 2018:\nWe intend to address the competitive climate for off-price apparel and home goods by pursuing and refining our existing strategies and by continuing to strengthen our merchant organization, diversify our merchandise mix, and more fully develop our systems to improve our merchandise offerings.\nOur historic strategies and store expansion program have contributed to our sales gains in the past. However, given the impacts from the COVID-19 pandemic on our results for fiscal 2020, and the significant ongoing impacts and uncertainties, including the unknown overall impact on consumer demand and shopping behavior, the unknown duration of the pandemic, and potential responses to it (which may require stores and distribution centers to close again nationally, regionally, or in specific locations), we cannot be sure that our strategies and resumption of our store expansion program will result in a continuation of our historical sales growth or in a recovery of, or an increase in, net earnings.\nCost of goods sold. Cost of goods sold in fiscal 2020 decreased $1.7 billion compared to the prior year mainly due to the lower sales from the temporary closure of all store locations (starting on March 20, 2020 through a portion of the second quarter of fiscal 2020), and ensuing negative impact on customer demand from the COVID-19 pandemic after our store reopenings, as well as lower costs from the temporary furlough of most hourly associates in our distribution centers and some associates in our buying offices. These decreases were partially offset by higher markdowns used to clear aged and seasonal inventory, higher distribution costs primarily due to increased wages and higher freight costs due to industry-wide supply chain congestion, added expenditures for COVID-19 related measures, and higher occupancy costs from the opening of 54 net new stores during 2020. As we enter 2021, we expect higher supply chain costs from the industry-wide congestion to continue through fiscal 2021, along with higher costs from increases in wages we implemented in the second half of 2020.\nCost of goods sold in fiscal 2019 increased $809.9 million compared to the prior year, mainly due to increased sales from the opening of 88 net new stores during the year and a 3% increase in sales from comparable stores.\nCost of goods sold as a percentage of sales for fiscal 2019 increased approximately 35 basis points from the prior year, primarily due to a 35 basis point increase in distribution expenses and a 15 basis point increase in freight costs. These increases were partially offset by a 10 basis point improvement in merchandise gross margin and a five basis point reduction in buying costs.\nSelling, general and administrative expenses. For fiscal 2020, selling, general and administrative expenses (“SG&A”) increased $146.6 million compared to the prior year, primarily due to approximately $240 million in long-term debt refinancing costs, COVID-related expenses (including for supplies, cleaning, and payroll related to additional safety protocols), and payments to associates while our stores were closed (net of employee retention credits under the Coronavirus Aid, Relief, and Economic Security Act (the “CARES Act”)), partially offset by payroll-related cost reduction measures in response to the COVID-19 pandemic (including the temporary furlough of most hourly associates in our stores during closure periods, and some associates in our corporate offices), reductions in non-business critical operating expenses, and lower store operating expenses on lower sales. As we enter 2021, we expect our operating costs to continue to reflect ongoing COVID-related expenses and also higher wages.\nFor fiscal 2019, SG&A increased $140.2 million compared to the prior year, mainly due to increased store operating costs reflecting the opening of 88 net new stores during the year. SG&A as a percentage of sales for fiscal 2019 decreased by approximately 10 basis points compared to the prior year primarily due to leverage on higher sales.\nInterest expense (income), net. In fiscal 2020, net interest expense increased by $101.5 million compared to 2019 primarily due to higher interest expense on long-term debt due to the issuance of Senior Notes in April 2020 and October 2020 (net of repurchase of Senior Notes), lower interest income due to lower interest rates, and higher interest expense on short-term debt due to the draw down on our $800 million revolving credit facility in March 2020 (which was subsequently repaid in October 2020), partially offset by higher capitalized interest primarily related to the construction of our Brookshire, Texas distribution center.\nIn fiscal 2019, net interest income improved by $7.9 million compared to 2018 primarily due to lower interest expense on long-term debt due to the repayment of the Series A 6.38% unsecured Senior Notes in December 2018 and higher capitalized interest primarily related to the construction of our Brookshire, Texas distribution center.\nThe table below shows the components of interest expense and income for fiscal 2020, 2019, and 2018:\nTaxes on earnings. Our effective tax rates for fiscal 2020, 2019, and 2018 were approximately 20%, 23%, and 23%, respectively. The effective tax rate represents the applicable combined federal and state statutory rates reduced by the federal benefit of state taxes deductible on federal returns. The effective rate is impacted by changes in tax law and accounting guidance, location of new stores, level of earnings, tax effects associated with share-based compensation, and the resolution of tax positions with various tax authorities.\nIn fiscal 2019, we resolved uncertain tax positions with a state tax authority. As a result, we recognized a tax benefit of approximately $10.0 million in the Consolidated Statement of Earnings. In fiscal 2018, we resolved uncertain tax positions related to fiscal 2015 with the Internal Revenue Service. As a result, we recognized a tax benefit of approximately $26.0 million in the Consolidated Statement of Earnings.\nOn March 27, 2020, the CARES Act was signed into law. The CARES Act made several significant changes to business tax provisions including modifications for net operating losses, employee retention credits, and deferral of employer payroll tax payments. On December 27, 2020, the Consolidated Appropriations Act of 2021 (“CAA”) was signed into law. The CAA made several changes to business tax provisions including increasing and extending the employee retention credits through June 30, 2021 and extending certain employment-related tax credits through December 31, 2025.\nNet earnings. Net earnings as a percentage of sales for fiscal 2020 were lower than in fiscal 2019, primarily due to higher cost of goods sold, higher SG&A expenses, and higher interest expense. Net earnings as a percentage of sales for fiscal 2019 were lower compared to fiscal 2018, primarily due to higher cost of goods sold, partially offset by lower SG&A expenses and higher interest income.\nEarnings per share. Diluted earnings per share in fiscal 2020 was $0.24, compared to $4.60 in the prior year. The lower diluted earnings per share in fiscal 2020 was primarily attributable to lower sales due to the closing of all our store locations starting on March 20, 2020 through a portion the second quarter of fiscal 2020 and the negative impact on customer demand from the COVID-19 pandemic, higher markdowns to clear aged and seasonal inventory, long-term debt refinancing costs, payments to associates while our stores were closed (net of employee retention credits under the CARES Act), and higher expenditures for COVID-19 related measures.\nDiluted earnings per share in fiscal 2019 was $4.60, which included a per share benefit of approximately $0.02 primarily related to the favorable resolution of a tax matter, compared to $4.26 in the prior year, which included a per share benefit of approximately $0.07 from the favorable resolution of a tax matter.\nFinancial Condition\nLiquidity and Capital Resources\nAs previously noted, the United States and other countries are experiencing a major global health pandemic related to the outbreak of a novel strain of coronavirus, COVID-19 that started at the beginning of 2020. Governmental authorities in affected regions have taken, and continue to take, dramatic actions in an effort to slow down the spread of the disease. Similar to other retailers across the country, we temporarily closed all store locations, our distribution centers, and our buying and corporate offices, effective March 20, 2020 through May 14, 2020, when we began a phased process of resuming operations. All our distribution centers were reopened by the end of May 2020. The vast majority of our store locations were open and operating by the end of June 2020, and remained open throughout the remainder of fiscal 2020, though many of our stores were operating on shorter hours and under mandated occupancy restrictions for periods of time, compared to the prior year.\nTo preserve our financial liquidity and enhance our financial flexibility, we borrowed $800 million from our revolving credit facility in March 2020, completed a $2.0 billion senior notes offering in April 2020, and entered into a new $500 million 364-day senior revolving credit facility in May 2020. In the third quarter of fiscal 2020, we refinanced $775 million in aggregate principal amount of higher interest senior notes with the issuance of $1.0 billion in aggregate principal amount of lower interest rate senior notes. This action resulted in a refinancing charge of approximately $240 million in the third quarter, but will significantly reduce our annual interest expense and total cash outlays over the life of the debt. In addition to refinancing the senior notes refinancing, we took several other actions during the third quarter, to reduce our ongoing debt costs, including repayment of the $800 million revolving credit facility and termination of the undrawn $500 million 364-day senior revolving credit facility.\nWe suspended our stock repurchase program in March 2020 and temporarily suspended quarterly dividends in May 2020, and we took measures to reduce our expenses, inventory receipts, and capital expenditures. Beginning April 5, 2020, we implemented temporary furloughs for a large portion of our hourly store and distribution center and other associates in our buying and corporate offices who could not work productively while our stores and distribution centers were closed. Employee health benefits for eligible associates continued during the temporary furlough at no cost to the impacted associates. We also reduced payroll expenses through temporary salary reductions for senior executives and other personnel, which remained in effect until May 24, 2020, when more than half of our stores had reopened. In conjunction with these payroll expense reduction measures, effective April 1, 2020, the non-employee members of our Board of Directors suspended the cash elements of their director compensation, which remained in effect until August 2020.\nAlso in May 2020, we suspended rent payments associated with the leases for our temporarily closed stores. During fiscal 2020, we negotiated rent deferrals and/or rent abatements for a significant number of our stores. The repayment of the deferrals will be at later dates, primarily in fiscal 2021. We recorded accruals for rent payment deferrals and recorded rent abatements as a reduction of variable lease costs.\nWe ended fiscal 2020 with over $5.6 billion in liquidity, which consists of $4.8 billion unrestricted cash balances and the $800 million available under our revolving credit facility.\nHistorically, our primary sources of funds for our business activities have been cash flows from operations and short-term trade credit. Our primary ongoing cash requirements are for merchandise inventory purchases, payroll, operating and variable lease costs, taxes, and for capital expenditures in connection with new and existing stores, and investments in distribution centers, information systems, and buying and corporate offices. We also use cash to pay dividends, to repay debt as it becomes due, and to repurchase stock under active stock repurchase programs.\nDue to the COVID-19 pandemic and related economic disruptions, and with the possibility that some of our stores, distribution centers, and other facilities may need to temporarily close again, or continue on reduced operating hours and/or capacity restrictions, as a result of government mandates, we anticipate potential interruptions to our cash flows from operations. We anticipate that we will be required to rely more on our cash reserves and we expect to carefully monitor and manage our cash position in light of ongoing conditions and levels of operations.\nOperating Activities\nNet cash provided by operating activities was $2.2 billion in fiscal 2020. This was primarily driven by higher accounts payable due to extended payment terms, lower merchandise receipts as we closely managed inventory levels and used packaway inventory to replenish our stores, and net earnings excluding non-cash expenses for depreciation and amortization. This was partially offset by the lower net earnings due to lower sales from the temporary closing of all store locations starting on March 20, 2020 through a portion of the second quarter, and the negative impact on customer demand from the COVID-19 pandemic. Net cash provided by operating activities was $2.2 billion and $2.1 billion in fiscal 2019 and 2018, respectively, and was primarily driven by net earnings excluding non-cash expenses for depreciation and amortization and for deferred taxes.\nThe increase in cash flow from operating activities in fiscal 2020 compared to fiscal 2019 was primarily driven by higher accounts payable leverage. The increase in cash flow from operating activities in fiscal 2019 compared to fiscal 2018 was primarily driven by higher earnings and the timing of merchandise receipts and related payments versus the prior year. Accounts payable leverage (defined as accounts payable divided by merchandise inventory) was 150%, 71%, and 67% as of January 30, 2021, February 1, 2020, and February 2, 2019, respectively. The increase in accounts payable leverage in fiscal 2020 compared to fiscal 2019 was primarily driven by lower packaway and in-store inventory and extended payment terms. The increase in accounts payable leverage in fiscal 2019 compared to fiscal 2018 was primarily driven by timing of merchandise receipts and related payments versus the prior year.\nAs a regular part of our business, packaway inventory levels will vary over time based on availability of compelling merchandise purchase opportunities in the marketplace and our decisions on the timing for release of that inventory. Packaway merchandise is purchased with the intent that it will be stored in our warehouses until a later date. The timing of the release of packaway inventory to our stores is principally driven by the product mix and seasonality of the merchandise, and its relation to our store merchandise assortment plans. As such, the aging of packaway varies by merchandise category and seasonality of purchase, but in normal times and historically, packaway remains in storage less than six months. We expect to continue to take advantage of packaway inventory opportunities to maximize our ability to deliver bargains to our customers.\nChanges in packaway inventory levels impact our operating cash flow. At the end of fiscal 2020, packaway inventory was 38% of total inventory compared to 46% at the end of both fiscal 2019 and 2018.\nInvesting Activities\nNet cash used in investing activities was $405.4 million, $555.0 million, and $410.4 million in fiscal 2020, 2019, and 2018, respectively. The decrease in cash used for investing activities in fiscal 2020 compared to fiscal 2019 was primarily due to a reduction in our capital expenditures. The increase in cash used for investing activities in fiscal 2019 compared to fiscal 2018 was primarily due to an increase in our capital expenditures.\nThe decrease in capital expenditures in fiscal 2020 compared to fiscal 2019 was primarily due to our actions to preserve our financial liquidity in response to the COVID-19 pandemic and related economic disruptions. The increase in capital expenditures in fiscal 2019 compared to fiscal 2018 was primarily due to investments in our distribution centers, and information technology infrastructure investments for our stores, buying, corporate offices, and transportation. We opened 66, 98, and 99 new stores in fiscal 2020, 2019, and 2018, respectively.\nIn fiscal 2020, 2019, and 2018, our capital expenditures were $405.4 million, $555.5 million, and $413.9 million, respectively. Our capital expenditures included costs to build, expand, and improve distribution centers (primarily related to the ongoing construction of our Brookshire, Texas distribution center); open new stores and improve\nexisting stores; and for various other expenditures related to our information technology systems, buying, and corporate offices.\nOur capital expenditures over the last three years are set forth in the table below:\nCapital expenditures for fiscal 2021 are projected to be approximately $700 million. Our planned capital expenditures for fiscal 2021 are expected to be used for continued construction of our Brookshire, Texas distribution center, costs for fixtures and leasehold improvements to open planned new Ross and dd’s DISCOUNTS stores, investments in certain information technology systems, and for various other needed expenditures related to our stores, distribution centers, buying, and corporate offices. We expect to fund capital expenditures with available cash. The increase in our planned capital expenditures from fiscal 2020 are primarily driven by the continued construction of our Brookshire, Texas distribution center and the resumption of certain projects that were deferred from fiscal 2020.\nFinancing Activities\nNet cash provided by financing activities was $1.7 billion in fiscal 2020. Net cash used in financing activities was $1.7 billion and $1.5 billion in fiscal 2019 and 2018, respectively. The increase in cash provided by financing activities for fiscal 2020, compared to fiscal 2019, was primarily due to the completion of our public debt offerings, net of repurchase and refinancing costs, and the suspension of our share repurchases and dividends in the second quarter of 2020.\nIn July 2019, we entered into a new $800 million unsecured revolving credit facility, which replaced our previous $600 million unsecured revolving credit facility. This current credit facility expires in July 2024, and contains a $300 million sublimit for issuance of standby letters of credit. The facility also contains an option allowing us to increase the size of our revolving credit facility by up to an additional $300 million, with the agreement of the lenders. Interest on borrowings under this facility is based on LIBOR (or an alternate benchmark rate, if LIBOR is no longer available) plus an applicable margin and is payable quarterly and upon maturity. The revolving credit facility may be extended, at our option, for up to two additional one-year periods, subject to customary conditions.\nIn March 2020, we borrowed $800 million under our revolving credit facility. Interest on the loan was based on LIBOR plus 0.875% (or 1.76%).\nIn May 2020, we amended the $800 million revolving credit facility (the “Amended Credit Facility”) to temporarily suspend for the second and third quarters of fiscal 2020 the Consolidated Adjusted Debt to EBITDAR ratio financial covenant, and to apply a transitional modification to that ratio effective in the fourth quarter of fiscal 2020. The Amended Credit Facility also established a new temporary minimum liquidity requirement effective for the first quarter of fiscal 2020 and through the end of April 2021. As of January 30, 2021, we were in compliance with these amended covenants.\nIn October 2020, we repaid in full the $800 million we borrowed under the unsecured revolving credit facility. As a result, we currently have no borrowings or standby letters of credit outstanding under this facility, and the $800 million credit facility remains in place and available.\nIn May 2020, we also entered into an additional $500 million 364-day senior revolving credit facility which was scheduled to expire in April 2021. In October 2020, we terminated this senior revolving credit facility. We had no borrowings under that credit facility at any time.\nIn April 2020, we issued an aggregate of $2.0 billion in unsecured senior notes in four tenors as follows: $700 million of 4.600% Senior Notes due April 2025, $400 million of 4.700% Senior Notes due April 2027, $400 million of 4.800% Senior Notes due April 2030, and $500 million of 5.450% Senior Notes due April 2050.\nIn October 2020, we accepted for purchase approximately $775 million in aggregate principal amount of senior notes pursuant to cash tender offers as follows: $351 million of the 2050 Notes, $266 million of the 2030 Notes, and $158 million of the 2027 Notes. We paid approximately $1.003 billion in aggregate consideration (including transaction costs, and accrued and unpaid interest) and recorded an approximately $240 million loss on the early extinguishment for the accepted notes.\nIn October 2020, we also issued an aggregate of $1.0 billion in unsecured senior notes in two tenors as follows: 0.875% Senior Notes due April 2026 (the “2026 Notes”) with an aggregate principal amount of $500 million and 1.875% Senior Notes due April 2031 (the “2031 Notes”) with an aggregate principal amount of $500 million. Cash proceeds, net of discounts and other issuance costs, were approximately $987.2 million. We used the net proceeds from the offering of the 2026 and 2031 Notes to fund the purchase of the accepted notes from our tender offers.\nIn June 2020, we amended the covenants associated with the $65 million outstanding Series B unsecured senior notes. The amended covenants are consistent with the corresponding covenants in our existing revolving credit facility. As of January 30, 2021, we were in compliance with these covenants.\nOn December 13, 2018, we repaid at maturity the $85 million principal amount of the Series A 6.38% unsecured Senior Notes.\nIn March 2019, our Board of Directors approved a two-year $2.55 billion stock repurchase program through fiscal 2020. Due to the economic uncertainty stemming from the severe impact of the COVID-19 pandemic, we suspended our stock repurchase program in March 2020, at which time we had repurchased $1.407 billion under the $2.55 billion stock repurchase program. We do not plan on making additional purchases until further notice.\nIn February 2017, our Board of Directors approved a two-year $1.75 billion stock repurchase program through fiscal 2018. In March 2018, our Board of Directors approved an increase in the stock repurchase authorization for fiscal 2018 by $200 million to $1.075 billion, up from the previously available $875 million.\nWe repurchased 1.2 million, 12.3 million, and 12.5 million shares of common stock for aggregate purchase prices of approximately $132 million, $1,275 million, and $1,075 million in fiscal 2020, 2019, and 2018, respectively. We also acquired 0.5 million, 0.6 million, and 0.7 million shares in fiscal 2020, 2019, and 2018, respectively, of treasury stock from our employee stock equity compensation programs, for aggregate purchase prices of approximately $45.2 million, $60.7 million, and $54.4 million during fiscal 2020, 2019, and 2018, respectively.\nOn March 2, 2021, our Board of Directors declared a quarterly cash dividend of $0.285 per common share, payable on March 31, 2021, resuming our payment of quarterly dividends. Our most recent prior quarterly dividend was a cash dividend of $0.285 per common share declared by our Board of Directors in March 2020. In May 2020, we temporarily suspended our quarterly dividends, due to the economic uncertainty stemming from the COVID-19 pandemic. Our Board of Directors declared cash dividends of $0.255 per common share in March, May, August, and November 2019, and cash dividends of $0.225 per common share in March, May, August, and November 2018.\nDuring fiscal 2020, 2019, and 2018, we paid dividends of $101.4 million, $369.8 million, and $337.2 million, respectively.\nShort-term trade credit represents a significant source of financing for our merchandise inventory. Trade credit arises from customary payment terms and trade practices with our vendors. We regularly review the adequacy of credit available to us from all sources. Due to the COVID-19 pandemic and related economic disruptions, we face added uncertainty about the levels of trade credit we can maintain and liquidity available from sales of merchandise.\nDuring fiscal 2020, our liquidity and capital requirements were provided by available cash and cash flows from operations, and our long-term debt financing. During fiscal 2019 and 2018, our liquidity and capital requirements were provided by available cash and cash flows from operations.\nThe COVID-19 pandemic and related economic disruptions, including the temporary closure of all of our store locations effective March 20, 2020 through a portion of the second quarter, continue to create significant uncertainty and challenges. We believe that existing cash balances, our bank credit facility, and trade credit are adequate to meet our operating, investing, and financing needs for at least the next 12 months.\nContractual Obligations and Off-Balance Sheet Arrangements\nThe table below presents our significant contractual obligations as of January 30, 2021:\nOther than the unrecorded contractual obligations noted above, we do not have any material off-balance sheet arrangements as of January 30, 2021.\nStandby letters of credit and collateral trust. We use standby letters of credit outside of our revolving credit facility in addition to a funded trust to collateralize some of our insurance obligations. We also use standby letters of credit outside of our revolving credit facility to collateralize some of our trade payable obligations. As of January 30, 2021 and February 1, 2020, we had $15.3 million and $4.2 million, respectively, in standby letters of credit outstanding, and $56.1 million and $56.0 million, respectively, in a collateral trust. The standby letters of credit are collateralized by restricted cash and the collateral trust consists of restricted cash, cash equivalents, and investments.\nTrade letters of credit. We had $16.3 million and $11.2 million in trade letters of credit outstanding at January 30, 2021 and February 1, 2020, respectively.\nEffects of inflation or deflation. We do not consider the effects of inflation or deflation to be material to our financial position and results of operations.\nOther\nCritical Accounting Policies\nThe preparation of our consolidated financial statements requires our management to make estimates and assumptions that affect the reported amounts. These estimates and assumptions are evaluated on an ongoing basis and are based on historical experience and on various other factors that management believes to be reasonable. We believe the following critical accounting policies describe the more significant judgments and estimates used in the preparation of our consolidated financial statements and are not intended to be a comprehensive list of all of our accounting policies.\nIn many cases, the accounting treatment of a particular transaction is specifically dictated by Generally Accepted Accounting Principles (“GAAP”), with no need for management’s judgment in their application. There are also areas in which management’s judgment in selecting one alternative accounting principle over another would not produce a materially different result. See our audited consolidated financial statements and notes thereto under Item 8 in this Annual Report on Form 10-K, which contain descriptions of our accounting policies and other disclosures required by GAAP.\nMerchandise inventory. Our merchandise inventory is stated at the lower of cost (determined using a weighted-average basis) or net realizable value. We purchase inventory that can either be shipped to stores or processed as packaway merchandise with the intent that it will be warehoused and released to stores at a later date. The timing of the release of packaway inventory to our stores is principally driven by the product mix and seasonality of the merchandise, and its relation to the Company’s store merchandise assortment plans. As such, the aging of packaway varies by merchandise category and seasonality of purchase, but typically packaway remains in storage less than six months. Packaway inventory accounted for approximately 38%, 46%, and 46% of total inventories as of January 30, 2021, February 1, 2020, and February 2, 2019, respectively. Merchandise inventory includes acquisition, processing, and storage costs related to packaway inventory.\nIncluded in the carrying value of our merchandise inventory is a provision for shortage. The shortage reserve is based on historical shortage rates as evaluated through our annual physical merchandise inventory counts and cycle counts. If actual market conditions, markdowns, or shortage are less favorable than those projected by us, or if sales of the merchandise inventory are more difficult than anticipated, additional merchandise inventory write-downs may be required.\nLease accounting. As our leases generally do not provide an implicit discount rate; we use the estimated collateralized incremental borrowing rate based on information available at the lease commencement date in determining the present value of lease payments for use in the calculation of the operating lease liabilities and right-of-use assets. This rate is determined using a portfolio approach based on the risk-adjusted rate of interest and requires estimates and assumptions including credit rating, credit spread, and adjustments for the impact of collateral. We believe that this is the rate we would have to pay to borrow an amount equal to the lease payments on a collateralized basis over a similar lease term. Operating lease liabilities and corresponding right-of-use assets include options to extend lease terms that are reasonably certain of being exercised. We do not record a lease liability and corresponding right-of-use asset for leases with terms of 12 months or less, and account for lease and non-lease components as a single lease component. Our lease portfolio is comprised of operating leases with the lease cost recorded on a straight-line basis over the lease term.\nPrior to our adoption of Accounting Standards Codification (“ASC”) 842 in the beginning of fiscal 2019, when a lease contained “rent holidays” or required fixed escalations of the minimum lease payments, we recorded rental expense on a straight-line basis over the term of the lease and the difference between the average rental amount was charged to expense and the amount payable under the lease was recorded as deferred rent. We began recording rent expense on the lease possession date. Tenant improvement allowances were amortized over the lease term. Changes in deferred rent and tenant improvement allowances were included as a component of operating activities in the Consolidated Statements of Cash Flows.\nInsurance obligations. We use a combination of insurance and self-insurance for a number of risk management activities, including workers’ compensation, general liability, and employee-related health care benefits. Our self-insurance and deductible liability is determined actuarially, based on claims filed and an estimate of claims incurred but not reported. Should a greater amount of claims occur compared to what is estimated or the costs of medical care increase beyond what was anticipated, our recorded reserves may not be sufficient and additional charges could be required.\nRecent Accounting Pronouncements\nSee Note A to the Consolidated Financial Statements - Summary of Significant Accounting Policies (Recently issued accounting standards and Recently adopted accounting standards) for a discussion of recent accounting pronouncements and their impact to our Consolidated Financial Statements.\nForward-Looking Statements\nOur Annual Report on Form 10-K for fiscal 2020, and information we provide in our Annual Report to Stockholders, press releases, and other investor communications including those on our corporate website, may contain a number of forward-looking statements regarding, without limitation, the rapidly developing challenges and our plans and responses to the COVID-19 pandemic and related economic disruptions, including adjustments to our operations, planned new store growth, new markets, expected sales, projected earnings levels, capital expenditures, and other matters. These forward-looking statements reflect our then current beliefs, plans, and estimates with respect to future events and our projected financial performance, operations, and competitive position. The words “plan,” “expect,” “target,” “anticipate,” “estimate,” “believe,” “forecast,” “projected,” “guidance,” “looking ahead,” and similar expressions identify forward-looking statements.\nFuture impact from the ongoing COVID-19 pandemic, and other economic and industry trends that could potentially impact revenue, profitability, operating conditions, and growth remain difficult to predict. Our forward-looking statements are subject to risks and uncertainties which could cause our actual results to differ materially from those forward-looking statements and our previous expectations, plans, and projections. Refer to Item 1A in this Annual Report on Form 10-K for a more complete discussion of risk factors for Ross and dd’s DISCOUNTS. The factors underlying our forecasts are dynamic and subject to change. As a result, any forecasts or forward-looking statements speak only as of the date they are given and do not necessarily reflect our outlook at any other point in time. We disclaim any obligation to update or revise these forward-looking statements.",
    "item_7A": "ITEM 7A. QUANTITATIVE AND QUALITATIVE DISCLOSURES ABOUT MARKET RISK\nWe are exposed to market risks, which primarily include changes in interest rates. We do not engage in financial transactions for trading or speculative purposes.\nWe occasionally use forward contracts to hedge against fluctuations in foreign currency prices. We had no outstanding forward contracts as of January 30, 2021.\nInterest that is payable on our revolving credit facility is based on variable interest rates and is, therefore, affected by changes in market interest rates. As of January 30, 2021, we had no borrowings outstanding under our revolving credit facility.\nAs of January 30, 2021, we have outstanding eight series of unsecured Senior Notes. Interest that is payable on all series of our Senior Notes is based on fixed interest rates, and is therefore unaffected by changes in market interest rates.\nWe receive interest on our short- and long-term investments. Changes in interest rates may impact interest income recognized in the future, or the fair value of our investment portfolio.\nA hypothetical 100 basis point increase or decrease in prevailing market interest rates would not have a material negative impact on our consolidated financial position, results of operations, cash flows, or the fair values of our short- and long-term investments as of and for the year ended January 30, 2021. We do not consider the potential losses in future earnings and cash flows from reasonably possible, near-term changes in interest rates to be material.",
    "item_8": "ITEM 8. FINANCIAL STATEMENTS AND SUPPLEMENTARY DATA\nConsolidated Statements of Earnings\nConsolidated Statements of Comprehensive Income\nConsolidated Balance Sheets\nConsolidated Statements of Stockholders’ Equity\nConsolidated Statements of Cash Flows\nNotes to Consolidated Financial Statements\nNote A: Summary of Significant Accounting Policies\nBusiness. Ross Stores, Inc. and its subsidiaries (the “Company”) is an off-price retailer of first-quality, in-season, name brand and designer apparel, accessories, footwear, and home fashions for the entire family. At the end of fiscal 2020, the Company operated 1,585 Ross Dress for Less® (“Ross”) locations in 40 states, the District of Columbia, and Guam, and 274 dd’s DISCOUNTS® stores in 21 states. The Ross and dd’s DISCOUNTS stores are supported by the Company’s headquarters, buying offices, and its network of distribution centers/warehouses.\nSegment reporting. The Company has one reportable segment. The Company’s operations include only activities related to off-price retailing in stores throughout the United States.\nBasis of presentation and fiscal year. The consolidated financial statements include the accounts of the Company and its subsidiaries, all of which are wholly-owned. Intercompany transactions and accounts have been eliminated. The Company follows the National Retail Federation fiscal calendar and utilizes a 52-53 week fiscal year whereby the fiscal year ends on the Saturday nearest to January 31. The fiscal years ended January 30, 2021, February 1, 2020 and February 2, 2019 are referred to as fiscal 2020, fiscal 2019, and fiscal 2018, respectively, and were 52-week years.\nUse of accounting estimates. The preparation of consolidated financial statements in conformity with Generally Accepted Accounting Principles in the United States of America (“GAAP”) requires the Company to make estimates and assumptions that affect the reported amounts of assets, liabilities, and disclosures of contingent assets and liabilities at the date of the consolidated financial statements and the reported amounts of revenue and expenses during the reporting period. The Company’s significant accounting estimates include valuation reserves for inventory, packaway inventory costs, useful lives of fixed assets, insurance reserves, reserves for uncertain tax positions, employee retention credits under the Coronavirus Aid, Relief, and Economic Security Act (the “CARES Act”), and legal claims. Given the global economic climate and additional, or unforeseen effects, from the COVID-19 pandemic, these estimates are more challenging, and actual results could differ materially from the Company’s estimates.\nPurchase obligations. As of January 30, 2021, the Company had purchase obligations of approximately $3.1 billion. These purchase obligations primarily consist of merchandise inventory purchase orders, commitments related to construction projects, store fixtures and supplies, and information technology services, transportation, and maintenance contracts.\nCash and cash equivalents. Cash equivalents consist of highly liquid, fixed income instruments purchased with an original maturity of three months or less.\nRestricted cash, cash equivalents, and investments. Restricted cash, cash equivalents, and investments serve as collateral for certain insurance and trade payable obligations of the Company. These restricted funds are invested in bank deposits, money market mutual funds, U.S. Government and agency securities, and corporate securities and cannot be withdrawn from the Company’s account without the prior written consent of the secured parties. The classification between current and long-term is based on the timing of expected payments of the obligations.\nThe following table provides a reconciliation of cash, cash equivalents, restricted cash and cash equivalents in the Consolidated Balance Sheets that reconcile to the amounts shown on the Consolidated Statements of Cash Flows:\nIn addition to the restricted cash and cash equivalents in the table above, the Company had restricted investments of $0.4 million as of February 2, 2019 included in Prepaid expenses and other in the Consolidated Balance Sheets. The Company had no restricted investments as of January 30, 2021 and February 1, 2020.\nEstimated fair value of financial instruments. The carrying value of cash and cash equivalents, short- and long-term investments, restricted cash and cash equivalents, restricted investments, accounts receivable, other long-term assets, accounts payable, and other long-term liabilities approximates their estimated fair value. See Note B and Note D for additional fair value information.\nCash and cash equivalents were $4,819.3 million and $1,351.2 million, at January 30, 2021 and February 1, 2020, respectively, and include bank deposits and money market funds for which the fair value was determined using quoted prices for identical assets in active markets, which are considered to be Level 1 inputs under the fair value measurements and disclosures guidance.\nInvestments. The Company’s investments are comprised of various debt securities. At January 30, 2021 and February 1, 2020, these investments were classified as available-for-sale and are stated at fair value. Investments are classified as either short- or long-term based on their maturity dates and the Company’s intent. Investments with a maturity of less than one year are classified as short-term. See Note B for additional information.\nMerchandise inventory. Merchandise inventory is stated at the lower of cost (determined using a weighted-average basis) or net realizable value. The Company purchases inventory that can either be shipped to stores or processed as packaway merchandise with the intent that it will be warehoused and released to stores at a later date. The timing of the release of packaway inventory to the stores is principally driven by the product mix and seasonality of the merchandise, and its relation to the Company’s store merchandise assortment plans. As such, the aging of packaway varies by merchandise category and seasonality of purchase, but typically packaway remains in storage less than six months. Merchandise inventory includes acquisition, processing, and storage costs related to packaway inventory. The cost of the Company’s merchandise inventory is reduced by valuation reserves for shortage based on historical shortage experience from the Company’s physical merchandise inventory counts and cycle counts.\nCost of goods sold. In addition to product costs, the Company includes in cost of goods sold its buying, distribution, and freight expenses as well as occupancy costs, and depreciation and amortization related to the Company’s retail stores, buying, and distribution facilities. Buying expenses include costs to procure merchandise inventories. Distribution expenses include the cost of operating the Company’s distribution centers, warehouses, and cross-dock facilities.\nProperty and equipment. Property and equipment are stated at cost, less accumulated depreciation and amortization. Depreciation is calculated using the straight-line method over the estimated useful life of the asset, typically ranging from three to 12 years for equipment, 20 to 40 years for land improvements and buildings, and three to seven years for computer software costs incurred in developing or obtaining software for internal use. The cost of leasehold improvements is amortized over the useful life of the asset or the applicable lease term, whichever is less. Depreciation and amortization expense on property and equipment was $364.2 million, $350.9 million, and $330.4 million for fiscal 2020, 2019, and 2018, respectively. The Company capitalizes interest during the construction period of facilities and during the development and implementation phase of software projects. Interest capitalized was $12.3 million, $4.4 million, and $2.5 million in fiscal 2020, 2019, and 2018, respectively. As of\nJanuary 30, 2021, February 1, 2020, and February 2, 2019 the Company had $56.2 million, $40.3 million, and $33.7 million, respectively, of property and equipment purchased but not yet paid. These purchases are included in Property and Equipment and in Accounts payable and Accrued expenses and other in the accompanying Consolidated Balance Sheets.\nOther long-term assets. Other long-term assets as of January 30, 2021 and February 1, 2020 consisted of the following:\nImpairment of long-lived assets. Property and other long-term assets that are subject to depreciation and amortization are reviewed for impairment whenever events or changes in circumstances indicate that the carrying amount of an asset may not be recoverable based on estimated undiscounted future cash flows. For stores that are closed, the Company records an impairment charge, if appropriate, or accelerates depreciation over the revised useful life of the asset. Intangible assets that are not subject to amortization, including goodwill, are tested for impairment annually or more frequently if events or changes in circumstances indicate that the asset may be impaired. Based on the Company’s evaluation during fiscal 2020, 2019, and 2018, no impairment charges were recorded.\nAccounts payable. Accounts payable represents amounts owed to third parties at the end of the period. Accounts payable includes book cash overdrafts (checks issued under zero balance accounts not yet presented for payment) in excess of cash balances in such accounts of approximately $63.5 million and $138.8 million at January 30, 2021 and February 1, 2020, respectively. The Company includes the change in book cash overdrafts in operating cash flows.\nInsurance obligations. The Company uses a combination of insurance and self-insurance for a number of risk management activities, including workers’ compensation, general liability, and employee-related health care benefits. The self-insurance and deductible liability is determined actuarially, based on claims filed and an estimate of claims incurred but not yet reported. Self-insurance and deductible reserves as of January 30, 2021 and February 1, 2020 consisted of the following:\nWorkers’ compensation and self-insured medical plan liabilities are included in Accrued payroll and benefits, and accruals for general liability are included in Accrued expenses and other in the accompanying Consolidated Balance Sheets.\nOther long-term liabilities. Other long-term liabilities as of January 30, 2021 and February 1, 2020 consisted of the following:\nLease accounting. As the Company’s leases generally do not provide an implicit discount rate, the Company uses the estimated collateralized incremental borrowing rate based on information available at the lease commencement date in determining the present value of lease payments for use in the calculation of the operating lease liabilities and right-of-use assets. This rate is determined using a portfolio approach based on the risk-adjusted rate of interest and requires estimates and assumptions including credit rating, credit spread, and adjustments for the impact of collateral. The Company believes that this is the rate it would have to pay to borrow an amount equal to the lease payments on a collateralized basis over a similar lease term. Operating lease liabilities and corresponding right-of-use assets include options to extend lease terms that are reasonably certain of being exercised. The Company does not record a lease liability and corresponding right-of-use asset for leases with terms of 12 months or less, and accounts for lease and non-lease components as a single lease component. The Company’s lease portfolio is comprised of operating leases with the lease cost recorded on a straight-line basis over the lease term.\nIn response to the COVID-19 pandemic, the Financial Accounting Standards Board (“FASB”) provided relief under Accounting Standards Update (“ASU”) 2016-02, Leases (Accounting Standards Codification “ASC” 842). Under this relief, companies can make a policy election on how to treat lease concessions resulting directly from the COVID-19\npandemic, provided that the modified contracts result in total cash flows that are substantially the same or less than the cash flows in the original contract.\nThe Company made the policy election to account for lease concessions that result from the COVID-19 pandemic as if they were made under enforceable rights in the original contract. Additionally, the Company made the policy election to account for these concessions outside of the lease modification framework described under ASC 842. The Company recorded accruals for deferred rental payments and recognized rent abatements or concessions as variable lease costs in the periods incurred. Accruals for rent payment deferrals are included in Accrued expenses and other in the accompanying Consolidated Balance Sheets.\nPrior to the adoption of Accounting Standards Codification “ASC” 842 in the beginning of fiscal 2019, when a lease contained “rent holidays” or required fixed escalations of the minimum lease payments, the Company recorded rental expense on a straight-line basis over the term of the lease and the difference between the average rental amount was charged to expense and the amount payable under the lease was recorded as deferred rent. The Company began recording rent expense on the lease possession date. Tenant improvement allowances were amortized over the lease term. Changes in deferred rent and tenant improvement allowances were included as a component of operating activities in the Consolidated Statements of Cash Flows.\nRevenue recognition. The Company recognizes revenue at the point of sale, net of sales taxes collected and an allowance for estimated future returns as required by ASU No. 2014-09, Revenue from Contracts with Customers (ASC 606). The Company recognizes allowances for estimated sales returns on a gross basis as a reduction to sales. The asset recorded for the expected recovery of merchandise inventory was $10.7 million, $10.7 million, and $10.2 million and the liability recorded for the refund due to the customer was $21.2 million, $20.9 million, and $19.8 million as of January 30, 2021, February 1, 2020, and February 2, 2019, respectively. Sales taxes collected that are outstanding and the allowance for estimated future returns are included in Accrued expenses and other and the asset for expected recovery of merchandise is included in Prepaid expenses and other in the Consolidated Balance Sheets.\nSales of stored value cards are deferred until they are redeemed for the purchase of Company merchandise. The Company’s stored value cards do not have expiration dates. Based upon historical redemption rates, a small percentage of stored value cards will never be redeemed, which represents breakage. As a result of adopting ASC 606, breakage is estimated and recognized as revenue based upon the historical pattern of customer redemptions. Breakage was not material to the consolidated financial statements in fiscal 2020, 2019, and 2018.\nThe following sales mix table disaggregates revenue by merchandise category for fiscal 2020, 2019, and 2018:\nStore pre-opening. Store pre-opening costs are expensed in the period incurred.\nAdvertising. Advertising costs are expensed in the period incurred and are included in Selling, general and administrative expenses. Advertising costs for fiscal 2020, 2019, and 2018 were $42.5 million, $74.0 million, and $79.9 million, respectively.\nStock-based compensation. The Company recognizes compensation expense based upon the grant date fair value of all stock-based awards, typically over the vesting period. See Note C for more information on the Company’s stock-based compensation plans.\nTaxes on earnings. The Company accounts for income taxes in accordance with ASC 740, “Accounting for Income Taxes,” which requires the recognition of deferred tax assets and liabilities for the expected future tax consequences of events that have been recognized in the Company’s consolidated financial statements or tax returns. In estimating future tax consequences, the Company generally considers all expected future events other than changes in the tax law or tax rates. ASC 740 clarifies the criteria that an individual tax position must satisfy for some or all of the benefits of that position to be recognized in a company’s consolidated financial statements. ASC 740 prescribes a recognition threshold of more-likely-than-not, and a measurement standard for all tax positions taken or expected to be taken on a tax return, in order for those tax positions to be recognized in the consolidated financial statements. See Note F.\nTreasury stock. The Company records treasury stock at cost. Treasury stock includes shares purchased from employees for tax withholding purposes related to vesting of restricted stock grants.\nEarnings per share (“EPS”). The Company computes and reports both basic EPS and diluted EPS. Basic EPS is computed by dividing net earnings by the weighted-average number of common shares outstanding for the period. Diluted EPS is computed by dividing net earnings by the sum of the weighted-average number of common shares and dilutive common stock equivalents outstanding during the period. Diluted EPS reflects the total potential dilution that could occur from outstanding equity plan awards and unvested shares of both performance and non-performance based awards of restricted stock. For periods of net loss, basic and diluted EPS are the same as the effect of the assumed vesting of restricted stock and performance share awards are anti-dilutive.\nIn fiscal 2020, 2019, and 2018 there were 79,500, 27,400, and 23,700 weighted-average shares, respectively, that were excluded from the calculation of diluted EPS because their effect would have been anti-dilutive for those years.\nThe following is a reconciliation of the number of shares (denominator) used in the basic and diluted EPS computations:\nComprehensive income. Comprehensive income includes net earnings and components of other comprehensive income (loss), net of tax, consisting of unrealized investment gains or losses.\nRecently issued accounting standards. The Company considers the applicability and impact of all Accounting Standards Updates (“ASU”) issued by the FASB. ASUs not listed below were assessed and determined to be either not applicable or are expected to have minimal impact on the Company’s consolidated financial results.\nRecently adopted accounting standards. In December 2019, the FASB issued ASU 2019-12, Simplifying the Accounting for Income Taxes (ASC 740). ASU 2019-12 eliminates certain exceptions in ASC 740 related to the methodology for calculating income taxes in an interim period. It also clarifies and simplifies other aspects of the accounting for income taxes. The amendments in ASU 2019-12 are effective for fiscal years, and interim periods within those fiscal years, beginning after December 15, 2020. Early adoption is permitted, including adoption in any interim period. The Company adopted ASU 2019-12 on a prospective basis in the first quarter of fiscal 2020. The most significant impact to the Company is the removal of a limit on the tax benefit recognized on pre-tax losses in interim periods. The adoption of this standard did not have a material impact on the Company’s fiscal 2020 results.\nIn February 2016, the FASB issued ASU 2016-02, Leases (ASC 842), which along with subsequent amendments, supersedes the lease accounting requirements in ASC 840, Leases. The updated guidance requires balance sheet recognition for all leases with lease terms greater than one year including a lease liability, which is a lessee’s obligation to make lease payments arising from a lease, measured on a discounted basis; and a right-of-use asset, which is an asset that represents the lessee’s right to use, or control the use of, a specified asset for the lease term.\nThe Company adopted ASC 842 as of February 3, 2019 (the “effective date”), using the optional transition method on a modified retrospective basis. The Company did not elect the transitional package of practical expedients or the use of hindsight upon adoption of the ASC. The Company elected to not record a lease liability and corresponding right-of-use asset for leases with terms of 12 months or less, and to account for lease and non-lease components as a single lease component. Upon adoption, the Company recorded lease liabilities based on the present value of the remaining minimum rental payments, using incremental borrowing rates as of the effective date, of $2.9 billion, and the corresponding right-of-use assets of $2.9 billion. The Company also recorded a cumulative-effect adjustment to decrease beginning retained earnings of $19.6 million, primarily related to the write-off of previously capitalized initial direct costs that are no longer capitalized under ASC 842, partially offset by the write-off of the deferred gain on a previous sale-leaseback transaction that meets the sale definition under ASC 842. Reporting periods beginning on or after February 3, 2019 are presented under ASC 842, while prior period amounts and disclosures were not adjusted and continue to be reported under ASC 840. Adoption of ASC 842 did not have a significant impact to the Company’s consolidated statements of earnings or to the consolidated statements of cash flows.\nIn May 2014, the FASB issued ASU No. 2014-09, Revenue from Contracts with Customers (ASC 606) which, along with subsequent amendments, supersedes the revenue recognition requirements in “Revenue Recognition (ASC\n605).” This guidance provides a five-step analysis of transactions to determine when and how revenue is recognized and requires entities to recognize revenue when the customer obtains control of promised goods or services in an amount that reflects the consideration the entity expects to receive in exchange for those goods or services. The Company adopted ASC 606 as of February 4, 2018, using the modified retrospective method. Results for reporting periods beginning on or after February 4, 2018 are presented under ASC 606, while prior period amounts were not adjusted and continue to be reported in accordance with ASC 605. Upon adoption of ASC 606, the Company recorded a cumulative-effect adjustment to increase beginning retained earnings by $20 million as of February 4, 2018, primarily due to the change in the timing of the recognition of stored value card breakage. The impact of applying ASC 606 was not material to the Company’s consolidated financial statements for the year ended February 2, 2019.\nIn November 2016, the FASB issued ASU 2016-18, Statement of Cash Flows (Topic 230): Restricted Cash. ASU 2016-18 requires restricted cash and restricted cash equivalents be included with cash and cash equivalents when reconciling the total beginning and ending amounts on the statement of cash flows. The standard also requires companies who report cash and restricted cash separately on the balance sheet to reconcile those amounts to the statement of cash flows. The Company adopted ASU 2016-18 as of February 4, 2018, using the retrospective method.\nNote B: Investments and Restricted Investments\nAccounting standards pertaining to fair value measurements establish a three-tier fair value hierarchy which prioritizes the inputs used in measuring fair value. The inputs used to measure fair value include: Level 1, observable inputs such as quoted prices in active markets; Level 2, inputs other than quoted prices in active markets that are either directly or indirectly observable; and Level 3, unobservable inputs in which little or no market data exists. This fair value hierarchy requires the Company to develop its own assumptions and maximize the use of observable inputs and minimize the use of unobservable inputs when measuring fair value. Corporate, U.S. government and agency, and mortgage-backed securities are classified within Level 1 or Level 2 because these securities are valued using quoted market prices or alternative pricing sources and models utilizing market observable inputs.\nThe fair value of the Company’s financial instruments as of January 30, 2021 and February 1, 2020 are as follows:\nThe underlying assets in the Company’s non-qualified deferred compensation program as of January 30, 2021 and February 1, 2020 (included in Other long-term assets and in Other long-term liabilities) primarily consist of participant-directed money market, stable value, stock, and bond funds. The fair value measurement for funds with quoted market prices in active markets (Level 1) and for funds without quoted market prices in active markets (Level 2) are as follows:\nNote C: Management Incentive Plan and Stock-Based Compensation\nThe Company also has an Incentive Compensation Plan which provides cash and performance share awards to key management and employees based on Company and individual performance.\nManagement incentive plan and performance share award modifications. In August 2020, the Compensation Committee of the Board of Directors approved modifications to the performance measurement goals for the management incentive plan and the performance share award program for fiscal 2020, to be based on the attainment of specific management priorities related to their response to business challenges from COVID-19, as measured and approved by the Compensation Committee, as an alternative to the previously established profitability-based performance goals. As of January 30, 2021, the Company has established an accrual for this incentive compensation based on the Compensation Committee’s assessment of progress towards achievement of these specific priorities.\nFor fiscal 2020, 2019, and 2018, the Company recognized stock-based compensation expense as follows:\nCapitalized stock-based compensation cost was not significant in any year.\nAt January 30, 2021, the Company had one active stock-based compensation plan, which is further described in Note H. The Company recognizes expense for ESPP purchase rights equal to the value of the 15% discount given on the purchase date.\nTotal stock-based compensation recognized in the Company’s Consolidated Statements of Earnings for fiscal 2020, 2019, and 2018 is as follows:\nThe tax benefits related to stock-based compensation expense for fiscal 2020, 2019, and 2018 were $20.6 million, $18.5 million, and $19.6 million, respectively.\nNote D: Debt\nLong-term debt. Unsecured senior debt, net of unamortized discounts and debt issuance costs, as of January 30, 2021 and February 1, 2020 consisted of the following:\nAs of January 30, 2021, the Company had outstanding Series B unsecured Senior Notes in the aggregate principal amount of $65 million, held by various institutional investors. The Series B notes are due in December 2021 and bear interest at a rate of 6.530%. Borrowings under these Senior Notes are subject to certain financial covenants that were amended in June 2020, and are consistent with the corresponding covenants in the Company’s existing revolving credit facility. As of January 30, 2021, the Company was in compliance with these covenants.\nAs of January 30, 2021, the Company also had outstanding unsecured 3.375% Senior Notes due September 2024 (the “2024 Notes”) with an aggregate principal amount of $250 million. Interest on the 2024 Notes is payable semi-annually.\nIn April 2020, the Company issued an aggregate of $2.0 billion in unsecured senior notes in four tenors as follows: 4.600% Senior Notes due April 2025 (the “2025 Notes”) with an aggregate principal amount of $700 million, 4.700% Senior Notes due April 2027 (the “2027 Notes”) with an aggregate principal amount of $400 million, 4.800% Senior Notes due April 2030 (the “2030 Notes”) with an aggregate principal amount of $400 million, and 5.450% Senior Notes due April 2050 (the “2050 Notes”) with an aggregate principal amount of $500 million. Cash proceeds, net of discounts and other issuance costs, were approximately $1.973 billion. Interest on the 2025, 2027, 2030, and 2050 Notes is payable semi-annually beginning October 2020.\nIn October 2020, the Company accepted for purchase approximately $775 million in aggregate principal amount of senior notes pursuant to cash tender offers as follows: $351 million of the 2050 Notes, $266 million of the 2030 Notes, and $158 million of the 2027 Notes. The Company paid approximately $1.003 billion in aggregate consideration (including transaction costs, and accrued and unpaid interest) and recorded an approximately $240 million loss on the early extinguishment for the accepted notes.\nIn October 2020, the Company issued an aggregate of $1.0 billion in unsecured senior notes in two tenors as follows: 0.875% Senior Notes due April 2026 (the “2026 Notes”) with an aggregate principal amount of $500 million and 1.875% Senior Notes due April 2031 (the “2031 Notes”) with an aggregate principal amount of $500 million. Cash proceeds, net of discounts and other issuance costs, were approximately $987.2 million. Interest on the 2026 and 2031 Notes is payable semi-annually beginning April 2021. The Company used the net proceeds from the offering of the 2026 and 2031 Notes to fund the purchase of the accepted notes from its tender offers.\nAs of January 30, 2021 and February 1, 2020, total unamortized discount and debt issuance costs were $26.9 million and $2.1 million, respectively, and were classified as a reduction of long-term debt.\nThe Series B and all of the Senior Notes are subject to prepayment penalties for early payment of principal.\nAs of January 30, 2021, the aggregate fair value of the eight outstanding series of Senior Notes was approximately $2.8 billion. As of February 1, 2020, the aggregate fair value of the two then outstanding series of Senior Notes was approximately $335 million. The fair value is estimated by obtaining comparable market quotes which are considered to be Level 1 inputs under the fair value measurements and disclosures guidance.\nOn December 13, 2018, the Company repaid at maturity the $85 million principal amount of the Series A 6.38% unsecured Senior Notes.\nThe following table shows scheduled annual principal payments on long-term debt:\nThe table below shows the components of interest expense and income for fiscal 2020, 2019, and 2018:\nRevolving credit facilities. In July 2019, the Company entered into a new $800 million unsecured revolving credit facility, which replaced the Company’s previous $600 million unsecured revolving credit facility. This new credit facility expires in July 2024, and contains a $300 million sublimit for issuance of standby letters of credit. The facility also contains an option allowing the Company to increase the size of its credit facility by up to an additional $300 million, with the agreement of the lenders. Interest on borrowings under this facility is based on LIBOR (or an alternate benchmark rate, if LIBOR is no longer available) plus an applicable margin and is payable quarterly and upon maturity. The revolving credit facility may be extended, at the Company's option, for up to two additional one year periods, subject to customary conditions.\nIn March 2020, the Company borrowed $800 million available under its revolving credit facility. Interest on the loan was based on LIBOR plus 0.875% (or 1.76%).\nIn May 2020, the Company amended its $800 million unsecured revolving credit facility (the “Amended Credit Facility”) to temporarily suspend, for the second and third quarters of fiscal 2020, the Consolidated Adjusted Debt to EBITDAR ratio financial covenant, and to apply a transitional modification to that ratio effective in the fourth quarter of fiscal 2020. The Amended Credit Facility also established a new temporary minimum liquidity requirement, effective for the first quarter of fiscal 2020 and through the end of April 2021. As of January 30, 2021, the Company was in compliance with these amended covenants.\nIn October 2020, the Company repaid in full the $800 million it borrowed under the unsecured revolving credit facility. As a result, the Company currently has no borrowings or standby letters of credit outstanding under this facility as of January 30, 2021, and the $800 million credit facility remains in place and available.\nIn May 2020, the Company also entered into an additional $500 million 364-day senior revolving credit facility which was scheduled to expire in April 2021. In October 2020, the Company terminated this senior revolving credit facility. The Company had no borrowings under that credit facility at any time.\nStandby letters of credit and collateral trust. The Company uses standby letters of credit outside of its revolving credit facility in addition to a funded trust to collateralize some of its insurance obligations. The Company also uses standby letters of credit outside of its revolving credit facility to collateralize some of its trade payable obligations. As of January 30, 2021 and February 1, 2020, the Company had $15.3 million and $4.2 million, respectively, in standby letters of credit and $56.1 million and $56.0 million, respectively, in a collateral trust. The standby letters of credit are collateralized by restricted cash and the collateral trust consists of restricted cash, cash equivalents, and investments.\nTrade letters of credit. The Company had $16.3 million and $11.2 million in trade letters of credit outstanding at January 30, 2021 and February 1, 2020, respectively.\nNote E: Leases\nThe Company currently leases all but two of its store locations with original, non-cancelable terms that in general range from three to ten years. Store leases typically contain provisions for three to four renewal options of five years each. The exercise of lease renewal options is at the sole discretion of the Company. Most store leases also provide for minimum annual rentals and for payment of variable lease costs. In addition, some store leases also have provisions for additional rent based on a percentage of sales (“percentage rent”) and others include rental payments adjusted periodically for inflation. The Company’s lease agreements do not contain any material residual guarantees or material restrictive covenants. The Company does not have any financing leases.\nThe Company leases ten distribution/warehouse facilities. All of these contain renewal provisions, except for the third-party warehouse in Shafter, California. The following table summarizes the location and expiration date of the Company’s leased warehouses:\nThe Company leases approximately 120,000 and 5,000 square feet of office space for its Los Angeles and Boston buying offices, respectively. The lease term for both of these facilities expire in 2022, and contain renewal provisions. In addition, the Company has a ground lease related to its New York buying office.\nThe following table presents net operating lease costs included in the Consolidated Statement of Earnings for fiscal 2020 and 2019:\nThe maturity of operating lease liabilities, including the ground lease related to the New York buying office as of January 30, 2021, are as follows:\nThe weighted-average remaining lease term and the weighted-average discount rate for operating leases as of January 30, 2021 and February 1, 2020 are as follows:\nThe following table presents cash paid for amounts included in the measurement of operating lease liabilities and operating lease assets obtained in exchange for new operating lease liabilities (includes new leases and remeasurements or modifications of existing leases) for fiscal 2020 and 2019:\nRent expense under ASC 840, including contingent rent and net of sublease income, was $569.8 million in fiscal 2018. Contingent rent and sublease income was not significant in fiscal 2018.\nNote F: Taxes on Earnings\nThe provision for income taxes consisted of the following:\nThe provision for taxes for financial reporting purposes is different from the tax provision computed by applying the statutory federal income tax rate. The differences are reconciled below:\nIn fiscal 2019, the Company resolved uncertain tax positions with a state tax authority. As a result, the Company recognized a tax benefit of approximately $10.0 million in the Consolidated Statement of Earnings. In fiscal 2018, the Company resolved uncertain tax positions related to fiscal 2015 with the Internal Revenue Service. As a result, the Company recognized a tax benefit of approximately $26.0 million in the Consolidated Statement of Earnings.\nThe components of deferred taxes at January 30, 2021 and February 1, 2020 are as follows:\nAt the end of fiscal 2020 and 2019, the Company’s state tax credit carryforwards for income tax purposes were approximately $13.7 million and $12.8 million, respectively. The state tax credit carryforwards will begin to expire in fiscal 2021. The Company has provided a valuation allowance of $4.1 million as of the end of fiscal 2020 for deferred tax assets related to state tax credits that are not expected to be realized.\nThe changes in amounts of unrecognized tax benefits (gross of federal tax benefits and excluding interest and penalties) at fiscal 2020, 2019, and 2018 are as follows:\nAt the end of fiscal 2020, 2019, and 2018, the reserves for unrecognized tax benefits were $67.9 million, $67.1 million, and $78.8 million inclusive of $7.7 million, $7.2 million, and $13.0 million of related reserves for interest and penalties, respectively. In fiscal 2019, the Company resolved uncertain tax positions with a state tax authority. As a result, the Company recognized a decrease in reserves for tax positions in prior periods of $16.2 million, inclusive of $6.6 million of related reserves for interest and penalties. In fiscal 2018, the Company resolved uncertain tax positions related to fiscal 2015 with the Internal Revenue Service. As a result, the Company recognized a decrease in reserves for tax positions in prior periods of $52.4 million, inclusive of $12.6 million of related reserves for interest\nand penalties. The Company accounts for interest and penalties related to unrecognized tax benefits as a part of its provision for taxes on earnings. If recognized, $54.2 million would impact the Company’s effective tax rate. The difference between the total amount of unrecognized tax benefits and the amounts that would impact the effective tax rate relates to amounts attributable to deferred tax assets and liabilities. These amounts are net of federal and state income taxes.\nIt is reasonably possible that certain federal and state tax matters may be concluded or statutes of limitations may lapse during the next twelve months. Accordingly, the total amount of unrecognized tax benefits may decrease by up to $10.6 million.\nThe Company is open to audit by the Internal Revenue Service under the statute of limitations for fiscal years 2017 through 2020. The Company’s state income tax returns are generally open to audit under the various statutes of limitations for fiscal years 2016 through 2020. Certain state tax returns are currently under audit by various tax authorities. The Company does not expect the results of these audits to have a material impact on the consolidated financial statements.\nNote G: Employee Benefit Plans\nThe Company has a defined contribution plan that is available to certain employees. Under the plan, employee and Company contributions and accumulated plan earnings qualify for favorable tax treatment under Section 401(k) of the Internal Revenue Code. This plan permits employees to make contributions up to the maximum limits allowable under the Internal Revenue Code. The Company matches up to 4% of the employee’s salary up to the plan limits. Company matching contributions to the 401(k) plan were $20.8 million, $19.2 million, and $17.1 million in fiscal 2020, 2019, and 2018, respectively.\nThe Company also makes available to management a Non-qualified Deferred Compensation Plan which allows management to make payroll contributions on a pre-tax basis in addition to the 401(k) plan. Other long-term assets include $159.1 million and $141.4 million at January 30, 2021 and February 1, 2020, respectively, of long-term plan investments, at market value, set aside or designated for the Non-qualified Deferred Compensation Plan (See Note B). Plan investments are designated by the participants, and investment returns are not guaranteed by the Company. The Company has a corresponding liability to participants of $159.1 million and $141.4 million at January 30, 2021 and February 1, 2020, respectively, included in Other long-term liabilities in the Consolidated Balance Sheets.\nIn addition, the Company has certain individuals who receive or will receive post-employment medical benefits. The estimated liability for these benefits of $8.9 million and $8.2 million is included in Accrued expenses and other in the accompanying Consolidated Balance Sheets as of January 30, 2021 and February 1, 2020, respectively.\nNote H: Stockholders’ Equity\nCommon stock. In March 2019, the Company’s Board of Directors approved a two-year $2.55 billion stock repurchase program through fiscal 2020. Due to the economic uncertainty stemming from the severe impact of the COVID-19 pandemic, the Company suspended its stock repurchase program as of March 2020, at which time the Company had repurchased $1.407 billion under the $2.55 billion stock repurchase program. In February 2017, the Company’s Board of Directors approved a two-year $1.75 billion stock repurchase program through fiscal 2018. In March 2018, the Company’s Board of Directors approved an increase in the stock repurchase authorization for fiscal 2018 by $200 million to $1.075 billion, up from the previously available $875 million.\nThe following table summarizes the Company’s stock repurchase activity in fiscal 2020, 2019, and 2018:\nPreferred stock. The Company has 4.0 million shares of preferred stock authorized, with a par value of $.01 per share. No preferred stock is issued or outstanding.\nDividends. On March 2, 2021, the Company’s Board of Directors declared a quarterly cash dividend of $0.285 per common share, payable on March 31, 2021, resuming the payment of quarterly dividends. The Company’s Board of Directors declared a cash dividend of $0.285 per common share in March 2020. In May 2020, the Company temporarily suspended its quarterly dividends, due to the economic uncertainty stemming from the COVID-19 pandemic. The Company’s Board of Directors declared cash dividends of $0.255 per common share in March, May, August, and November 2019, and cash dividends of $0.225 per common share in March, May, August, and November 2018.\n2017 Equity Incentive Plan. On May 17, 2017, the Company’s stockholders approved the Ross Stores, Inc. 2017 Equity Incentive Plan (the “2017 Plan”) which replaced the Company’s 2008 Equity Incentive Plan (“Predecessor Plan”). The 2017 Plan, which was authorized to issue a maximum of 12.0 million shares, was immediately effective upon approval and no further awards were granted under the Predecessor Plan, which was terminated.\nThe 2017 Plan has an initial share reserve of 12.0 million shares of the Company’s common stock which can be increased by a maximum of 5.5 million shares from certain expired, withheld, or forfeited shares from the 2017 Plan or the Predecessor Plan. The 2017 Plan provides for various types of incentive awards, which may potentially include the grant of stock options, stock appreciation rights, restricted stock purchase rights, restricted stock bonuses, restricted stock units, performance shares, performance units, and deferred compensation awards. As of January 30, 2021, there were 10.2 million shares available for grant under the 2017 Plan.\nA summary of restricted stock and performance share award activity for fiscal 2020 is presented below:\nThe market value of shares of restricted stock and performance shares at the date of grant is amortized to expense over the vesting period of generally three to five years. The unamortized compensation expense at January 30, 2021 and February 1, 2020 was $161.3 million and $158.4 million, respectively, which is expected to be recognized over a weighted-average remaining period of 1.9 years. Intrinsic value for restricted stock, defined as the closing market value on the last business day of fiscal year 2020 (or $111.29), was $470.8 million. A total of 10.2 million, 10.7 million, and 11.2 million shares were available for new restricted stock awards at the end of fiscal 2020, 2019, and 2018, respectively. During fiscal 2020, 2019, and 2018, shares purchased by the Company for tax withholding totaled 0.5 million, 0.6 million, and 0.7 million shares, respectively, and are considered treasury shares which are available for reissuance. As of January 30, 2021 and February 1, 2020, the Company held 14.3 million and 13.8 million shares of treasury stock, respectively.\nPerformance share awards. The Company has a performance share award program for senior executives. A performance share award represents a right to receive shares of restricted stock on a specified settlement date based on the Company’s attainment of a performance goal during the performance period, which is the Company’s fiscal year. If attained, the restricted stock then vests over a service period, generally two to three years from the date the performance award was granted. The Company issued approximately 380,000, 414,000, and 556,000 shares in settlement of the fiscal 2020, 2019, and 2018 awards.\nEmployee Stock Purchase Plan. Under the Employee Stock Purchase Plan (“ESPP”), eligible employees participating in the quarterly offering period can choose to have up to the lesser of 10% of their annual base earnings or the IRS annual share purchase limit of $25,000 in aggregate market value to purchase the Company’s common stock. The purchase price of the stock is 85% of the closing market price on the date of purchase. Purchases occur on a quarterly basis (on the last trading day of each calendar quarter). The Company recognizes expense for ESPP purchase rights equal to the value of the 15% discount given on the purchase date.\nDuring fiscal 2020, 2019, and 2018, employees purchased approximately 0.3 million, 0.3 million, and 0.3 million shares, respectively, of the Company’s common stock under the plan at weighted-average per share prices of $81.45, $88.45, and $72.89, respectively. Through January 30, 2021, approximately 40.5 million shares had been issued under this plan and 4.5 million shares remained available for future issuance.\nNote I: Related Party Transactions\nThe Company has a consulting agreement with Norman Ferber, its Chairman Emeritus of the Board of Directors, under which the Company paid him $2.1 million, $2.1 million, and $1.9 million in fiscal 2020, 2019, and 2018, respectively. In addition, the agreement provides for administrative support and health and other benefits for him and his dependents, which totaled approximately $0.4 million, $0.4 million, and $0.4 million in fiscal 2020, 2019, and 2018, respectively, along with amounts to cover premiums through May 2022 on a life insurance policy with a death benefit of $2.0 million. Mr. Ferber’s current consulting agreement pays him an annual consulting fee of $2.3 million through May 2021 and $1.6 million through May 2022. On termination of Mr. Ferber’s consultancy with the Company, the Company will pay Mr. Ferber $75,000 per year for a period of 10 years.\nRobert Ferber, the son of Norman Ferber, is a Vice President, Divisional Merchandise Manager with the Company. The Company paid Robert Ferber compensation including salary and bonus of approximately $248,000, $209,000, and $180,000 in fiscal 2020, 2019, and 2018, respectively.\nNote J: Litigation, Claims, and Assessments\nLike many retailers, the Company has been named in class/representative action lawsuits, primarily in California, alleging violation of wage and hour laws and consumer protection laws. Class/representative action litigation remains pending as of January 30, 2021.\nThe Company is also party to various other legal and regulatory proceedings arising in the normal course of business. Actions filed against the Company may include commercial, product and product safety, consumer, intellectual property, environmental, and labor and employment-related claims, including lawsuits in which private plaintiffs or governmental agencies allege that the Company violated federal, state, and/or local laws. Actions against the Company are in various procedural stages. Many of these proceedings raise factual and legal issues and are subject to uncertainties.\nIn the opinion of management, the resolution of pending class/representative action litigation and other currently pending legal and regulatory proceedings will not have a material adverse effect on the Company’s financial condition, results of operations, or cash flows.\nNote K: Quarterly Financial Data (Unaudited)\nSummarized quarterly financial information for fiscal 2020 and 2019 is presented in the tables below.\nYear ended January 30, 2021:\n¹ EPS is computed independently for each of the quarters presented. The sum of the quarters may not equal the total year amount due to the impact of changes in average quarterly shares outstanding.\nIn May 2020, the Company temporarily suspended its quarterly dividends, due to the economic uncertainty stemming from the COVID-19 pandemic.\nIncludes a per share charge of approximately $0.65 primarily related to the long-term debt refinancing.\nYear ended February 1, 2020:\n¹ EPS is computed independently for each of the quarters presented. The sum of the quarters may not equal the total year amount due to the impact of changes in average quarterly shares outstanding.\n² Includes a per share benefit of approximately $0.02 from the favorable resolution of a tax matter.\nREPORT OF INDEPENDENT REGISTERED PUBLIC ACCOUNTING FIRM\nTo the Stockholders and the Board of Directors of Ross Stores, Inc.:\nOpinions on the Financial Statements and Internal Control over Financial Reporting\nWe have audited the accompanying consolidated balance sheets of Ross Stores, Inc. and subsidiaries (the “Company”) as of January 30, 2021 and February 1, 2020, and the related consolidated statements of earnings, comprehensive income, stockholders’ equity, and cash flows for each of the fiscal years ended January 30, 2021, February 1, 2020, and February 2, 2019 and the related notes (collectively referred to as the “financial statements”). We also have audited the Company’s internal control over financial reporting as of January 30, 2021, based on criteria established in Internal Control - Integrated Framework (2013) issued by the Committee of Sponsoring Organizations of the Treadway Commission (COSO).\nIn our opinion, the financial statements referred to above present fairly, in all material respects, the financial position of the Company as of January 30, 2021 and February 1, 2020, and the results of its operations and its cash flows for each of the fiscal years ended January 30, 2021, February 1, 2020, and February 2, 2019, in conformity with accounting principles generally accepted in the United States of America. Also, in our opinion, the Company maintained, in all material respects, effective internal control over financial reporting as of January 30, 2021, based on the criteria established in Internal Control - Integrated Framework (2013) issued by COSO.\nChange in Accounting Principle\nAs discussed in Note A to the financial statements, effective February 3, 2019, the Company adopted FASB ASC 842, Leases, using the modified retrospective basis.\nBasis for Opinions\nThe Company’s management is responsible for these financial statements, for maintaining effective internal control over financial reporting, and for its assessment of the effectiveness of internal control over financial reporting, included in the accompanying “Management’s Annual Report on Internal Control over Financial Reporting.” Our responsibility is to express an opinion on the Company’s financial statements and an opinion on the Company’s internal control over financial reporting based on our audits. We are a public accounting firm registered with the Public Company Accounting Oversight Board (United States) (PCAOB) and are required to be independent with respect to the Company in accordance with the U.S. federal securities laws and the applicable rules and regulations of the Securities and Exchange Commission and the PCAOB.\nWe conducted our audits in accordance with the standards of the PCAOB. Those standards require that we plan and perform the audit to obtain reasonable assurance about whether the financial statements are free of material misstatement, whether due to error or fraud, and whether effective internal control over financial reporting was maintained in all material respects.\nOur audits of the financial statements included performing procedures to assess the risks of material misstatement of the financial statements, whether due to error or fraud, and performing procedures that respond to those risks. Such procedures included examining, on a test basis, evidence regarding the amounts and disclosures in the financial statements. Our audits also included evaluating the accounting principles used and significant estimates made by management, as well as evaluating the overall presentation of the financial statements. Our audit of internal control over financial reporting included obtaining an understanding of internal control over financial reporting, assessing the risk that a material weakness exists, and testing and evaluating the design and operating effectiveness of internal control based on the assessed risk. Our audits also included performing such other procedures as we considered necessary in the circumstances. We believe that our audits provide a reasonable basis for our opinions.\nDefinition and Limitations of Internal Control over Financial Reporting\nA company’s internal control over financial reporting is a process designed to provide reasonable assurance regarding the reliability of financial reporting and the preparation of financial statements for external purposes in accordance with generally accepted accounting principles. A company’s internal control over financial reporting includes those policies and procedures that (1) pertain to the maintenance of records that, in reasonable detail,\naccurately and fairly reflect the transactions and dispositions of the assets of the company; (2) provide reasonable assurance that transactions are recorded as necessary to permit preparation of financial statements in accordance with generally accepted accounting principles, and that receipts and expenditures of the company are being made only in accordance with authorizations of management and directors of the company; and (3) provide reasonable assurance regarding prevention or timely detection of unauthorized acquisition, use, or disposition of the company’s assets that could have material effect on the financial statements.\nBecause of its inherent limitations, internal control over financial reporting may not prevent or detect misstatements. Also, projections of any evaluation of the effectiveness to future periods are subject to the risk that the controls may become inadequate because of changes in conditions, or that the degree of compliance with the policies or procedures may deteriorate.\nCritical Audit Matter\nCritical audit matters are matters arising from the current-period audit of the financial statements that were communicated or required to be communicated to the audit committee and that (1) relate to accounts or disclosures that are material to the financial statements and (2) involved our especially challenging, subjective, or complex judgments. We determined that there are no critical audit matters.\n/s/DELOITTE & TOUCHE LLP\nSan Francisco, California\nMarch 30, 2021\nWe have served as the Company’s auditor since 1982.",
    "item_9": "ITEM 9. CHANGES IN AND DISAGREEMENTS WITH ACCOUNTANTS ON ACCOUNTING AND FINANCIAL DISCLOSURE\nNone",
    "item_9A": "ITEM 9A. CONTROLS AND PROCEDURES\nDisclosure Controls and Procedures\nOur management, with the participation of our Chief Executive Officer and Chief Financial Officer, conducted an evaluation of the effectiveness of our “disclosure controls and procedures,” (as defined in Exchange Act Rule 13a-15(e)), as of the end of the period covered by this report. Our disclosure controls and procedures are designed to provide reasonable assurance of achieving their objectives. Based on that evaluation, our Chief Executive Officer and Chief Financial Officer concluded that our disclosure controls and procedures were effective at that reasonable assurance level as of the end of the period covered by this report.\nIt should be noted that any system of controls, however well designed and operated, can provide only reasonable, and not absolute, assurance that the objectives of the system will be met. In addition, the design of any control system is based in part upon certain assumptions about the likelihood of future events.\nManagement’s Annual Report on Internal Control Over Financial Reporting\nOur management is responsible for establishing and maintaining adequate internal control over financial reporting, as defined in Exchange Act Rule 13a-15(f). Our internal control over financial reporting is designed to provide reasonable assurance regarding the reliability of financial reporting and the preparation of consolidated financial statements for external purposes in accordance with generally accepted accounting principles.\nUnder the supervision and with the participation of our management, including our Chief Executive Officer and Chief Financial Officer, we conducted an evaluation of the effectiveness of our internal control over financial reporting based on the framework established by the Committee of Sponsoring Organizations of the Treadway Commission (COSO) as set forth in Internal Control - Integrated Framework (2013). Based on our evaluation under the framework in Internal Control - Integrated Framework (2013), our management concluded that our internal control over financial reporting was effective as of January 30, 2021.\nOur internal control over financial reporting as of January 30, 2021 has also been audited by Deloitte & Touche LLP, an independent registered public accounting firm, and their opinion as to the effectiveness of our internal control over financial reporting is stated in their report, dated March 30, 2021, which is included in Item 8 in this Annual Report on Form 10-K.\nBecause of its inherent limitations, internal control over financial reporting may not prevent or detect misstatements. It should be noted that any system of controls, however well designed and operated, can provide only reasonable, and not absolute, assurance that the objectives of the system will be met. In addition, the design of any control system is based in part upon certain assumptions about the likelihood of future events. Also, projections of any evaluation of effectiveness to future periods are subject to the risk that controls may become inadequate because of changes in conditions, or that the degree of compliance with the policies or procedures may deteriorate.\nQuarterly Evaluation of Changes in Internal Control Over Financial Reporting\nOur management, with the participation of our Chief Executive Officer and Chief Financial Officer, also conducted an evaluation of our internal control over financial reporting to determine whether any change occurred during the fourth fiscal quarter of 2020 that has materially affected, or is reasonably likely to materially affect, our internal control over financial reporting. Based on that evaluation, our management concluded that there was no such change during the fourth fiscal quarter.",
    "item_9B": "ITEM 9B. OTHER INFORMATION\nNone\nPART III",
    "item_9C": "",
    "item_10": "ITEM 10. DIRECTORS, EXECUTIVE OFFICERS AND CORPORATE GOVERNANCE\nInformation required by Item 401 of Regulation S-K is incorporated herein by reference to the sections entitled “Executive Officers of the Registrant” at the end of Part I of this report; and to the sections of the Ross Stores, Inc. Proxy Statement for the Annual Meeting of Stockholders to be held on Wednesday, May 19, 2021 (the “Proxy Statement”) entitled “Information Regarding Nominees and Incumbent Directors.” Information required by Item 405 of Regulation S-K is incorporated by reference to the Proxy Statement under the section titled “Section 16(a) Beneficial Ownership Reporting Compliance.” Since our last Annual Report on Form 10-K, we have not made any material changes to the procedures by which our stockholders may recommend nominees to the Board of Directors. Information required by Item 407(d)(4) and (d)(5) of Regulation S-K is incorporated by reference to the Proxy Statement under the section entitled “Information Regarding Nominees and Incumbent Directors” under the caption “Audit Committee.”\nOur Board of Directors has adopted a Code of Ethics for Senior Financial Officers that applies to our Chief Executive Officer and our Chief Financial Officer (who is also our principal accounting officer), along with other of our senior operating and financial executives. This Code of Ethics is posted on our corporate website (www.rossstores.com) under Corporate Governance in the Investors Section. We intend to satisfy the disclosure requirements of Item 5.05 of Form 8-K regarding any future amendments to, or waivers from, our Code of Ethics for Senior Financial Officers by posting any changed version on the same corporate website.",
    "item_11": "ITEM 11. EXECUTIVE COMPENSATION\nThe information required by Item 402 of Regulation S-K is incorporated herein by reference to the sections of the Proxy Statement entitled “Compensation of Directors” and “Executive Compensation” under the captions “Compensation Discussion and Analysis,” “Summary Compensation Table,” “All Other Compensation,” “Perquisites,” “Discussion of Summary Compensation,” “Grants of Plan-Based Awards During Fiscal Year,” “Outstanding Equity Awards at Fiscal Year-End,” “Option Exercises and Stock Vested,” “Non-Qualified Deferred Compensation,” and “Potential Payments Upon Termination or Change in Control.”\nThe information required by Items 407(e)(4) and (e)(5) of Regulation S-K are incorporated herein by reference to the sections of the Proxy Statement entitled “Compensation Committee Interlocks and Insider Participation” and “Compensation Committee Report.”",
    "item_12": "ITEM 12. SECURITY OWNERSHIP OF CERTAIN BENEFICIAL OWNERS AND MANAGEMENT AND RELATED STOCKHOLDER MATTERS\nEquity compensation plan information. The following table summarizes the equity compensation plans under which the Company’s common stock may be issued as of January 30, 2021:\nThe information required by Item 403 of Regulation S-K is incorporated herein by reference to the section of the Proxy Statement entitled “Stock Ownership of Certain Beneficial Owners and Management.”",
    "item_13": "ITEM 13. CERTAIN RELATIONSHIPS AND RELATED TRANSACTIONS, AND DIRECTOR INDEPENDENCE\nThe information required by Items 404 and 407(a) of Regulation S-K is incorporated herein by reference to the section of the Proxy Statement entitled “Information Regarding Nominees and Incumbent Directors” including the captions “Audit Committee,” “Compensation Committee,” and “Nominating and Corporate Governance Committee,” and the section of the Proxy Statement entitled “Certain Transactions.”",
    "item_14": "ITEM 14. PRINCIPAL ACCOUNTANT FEES AND SERVICES\nInformation concerning principal accountant fees and services will appear in the Proxy Statement in the Ross Stores, Inc. Board of Directors Audit Committee Report under the caption “Summary of Audit, Audit-Related, Tax and All Other Fees.” Such information is incorporated herein by reference.\nPART IV",
    "item_15": "ITEM 15. EXHIBITS, FINANCIAL STATEMENT SCHEDULES\n(a) The following consolidated financial statements, schedules, and exhibits are filed as part of this report or are incorporated herein as indicated:\n1. List of Consolidated Financial Statements.\nThe following consolidated financial statements are included herein under Item 8:\nConsolidated Statements of Earnings for the years ended January 30, 2021, February 1, 2020, and February 2, 2019.\nConsolidated Statements of Comprehensive Income for the years ended January 30, 2021, February 1, 2020, and February 2, 2019.\nConsolidated Balance Sheets at January 30, 2021 and February 1, 2020.\nConsolidated Statements of Stockholders’ Equity for the years ended January 30, 2021, February 1, 2020, and February 2, 2019.\nConsolidated Statements of Cash Flows for the years ended January 30, 2021, February 1, 2020, and February 2, 2019.\nNotes to Consolidated Financial Statements.\nReport of Independent Registered Public Accounting Firm.\n2. List of Consolidated Financial Statement Schedules.\nSchedules are omitted because they are not required, not applicable, or such information is included in the consolidated financial statements or notes thereto which are included in this Report.\n3. List of Exhibits (in accordance with Item 601 of Regulation S-K).\nIncorporated herein by reference to the list of Exhibits contained in the Exhibit Index within this Report.",
    "item_16": "",
    "stock_ticker": "ROST"
}