{
    "cik": "773840",
    "company": "HONEYWELL INTERNATIONAL INC",
    "filing_type": "10-K",
    "filing_date": "2020-02-14",
    "period_of_report": "2019-12-31",
    "sic": "3724",
    "state_of_inc": "DE",
    "state_location": "NC",
    "fiscal_year_end": "1231",
    "filing_html_index": "https://www.sec.gov/Archives/edgar/data/773840/0000773840-20-000009-index.html",
    "htm_filing_link": "https://www.sec.gov/Archives/edgar/data/773840/000077384020000009/hon1231201910k.htm",
    "complete_text_filing_link": "https://www.sec.gov/Archives/edgar/data/773840/0000773840-20-000009.txt",
    "filename": "773840_10K_2019_0000773840-20-000009.htm",
    "item_1": "Item 1. Business\nHoneywell International Inc. (“Honeywell” or “the Company”) invents and commercializes technologies that address some of the world’s most critical challenges around energy, safety, security, air travel, productivity and global urbanization. As a diversified technology and manufacturing company, we are uniquely positioned to blend physical products with software to serve customers worldwide with aerospace products and services, energy efficient products and solutions for businesses, specialty chemicals, electronic and advanced materials, process technology for refining and petrochemicals, and productivity, sensing, safety and security technologies for buildings and industries. Our products and solutions enable a safer, more comfortable and more productive world, enhancing the quality of life of people around the globe. Honeywell was incorporated in Delaware in 1985.\nOur Annual Report on Form 10-K, Quarterly Reports on Form 10-Q, Current Reports on Form 8-K and any amendments to those reports, are available free of charge on our website (www.honeywell.com) under the heading Investors (see SEC Filings and Reports) immediately after they are filed with, or furnished to, the Securities and Exchange Commission (SEC). In addition, in this Annual Report on Form 10-K, the Company incorporates by reference certain information from parts of its Proxy Statement for the 2020 Annual Meeting of Stockholders, which we expect to file with the SEC on or about March 12, 2020, and which will also be available free of charge on our website.\nMajor Businesses\nWe globally manage our business operations through four segments: Aerospace, Honeywell Building Technologies, Performance Materials and Technologies, and Safety and Productivity Solutions. Financial information related to our segments is included in Note 22 Segment Financial Data of Notes to Consolidated Financial Statements. The major products/services, including Honeywell Forge solutions supported by Honeywell Connected Enterprise (\"HCE\"), customers/uses and key competitors of each of our segments are:\nAerospace\nAerospace is a leading global supplier of products, software and services for aircrafts that it sells to original equipment manufacturers (OEM) and other customers in a variety of end markets including: air transport, regional, business and general aviation aircraft, airlines, aircraft operators and defense and space contractors. Aerospace products and services include auxiliary power units, propulsion engines, environmental control systems, integrated avionics, wireless connectivity services, electric power systems, engine controls, flight safety, communications, navigation hardware, data and software applications, radar and surveillance systems, aircraft lighting, management and technical services, advanced systems and instruments, satellite and space components, aircraft wheels and brakes, repair and overhaul services and thermal systems. Aerospace also provides spare parts, repair, overhaul and maintenance services (principally to aircraft operators) for the aftermarket. Honeywell Forge solutions are designed to identify and resolve problems faster, making fleet management and flight operations more efficient.\nHoneywell Building Technologies\nHoneywell Building Technologies is a leading global provider of products, software, solutions and technologies that enable building owners and occupants to ensure their facilities are safe, energy efficient, sustainable and productive. Honeywell Building Technologies products and services include advanced software applications for building control and optimization; sensors, switches, control systems and instruments for energy management; access control; video surveillance; fire products; remote patient monitoring systems; and installation, maintenance and upgrades of systems. Honeywell Forge solutions are designed to digitally manage buildings to use space intelligently, cut operating expenses and reduce maintenance.\nPerformance Materials and Technologies\nPerformance Materials and Technologies is a global leader in developing and manufacturing high-quality performance chemicals and materials, process technologies and automation solutions, including Honeywell Forge connected solutions. The segment comprises Process Solutions, UOP and Advanced Materials. Process Solutions provides automation control, instrumentation, advanced software and related services for the oil and gas, refining, pulp and paper, industrial power generation, chemicals and petrochemicals, biofuels, life sciences, and metals, minerals and mining industries. Through its smart energy products, Process Solutions enables utilities and distribution companies to deploy advanced capabilities to improve operations, reliability and environmental sustainability. UOP provides process technology, products, including catalysts and adsorbents, equipment, and consulting services that enable customers to efficiently produce gasoline, diesel, jet fuel, petrochemicals and renewable fuels for the petroleum refining, gas processing, petrochemical, and other industries. Advanced Materials manufactures a wide variety of high-performance products, including materials used to manufacture end products such as bullet-resistant armor, nylon, computer chips and pharmaceutical packaging, and provides reduced and low global-warming-potential (GWP) materials based on hydrofluoro-olefin technology. In the industrial environment, Honeywell Forge solutions enable integration and connectivity to provide a holistic view of operations and turn data into clear actions to maximize productivity and efficiency. Honeywell Forge's cybersecurity capabilities help identify risks and act on cyber-related incidents, together enabling improved operations and protecting processes, people and assets.\nSafety and Productivity Solutions\nSafety and Productivity Solutions is a leading global provider of products and software that improve productivity, workplace safety and asset performance to customers around the globe. Safety products include personal protection equipment, apparel, gear, and footwear designed for work, play and outdoor activities; gas detection technology; and cloud-based notification and emergency messaging. Productivity Solutions products and services include mobile devices and software for computing, data collection and thermal printing; supply chain and warehouse automation equipment, software and solutions; custom-engineered sensors, switches and controls for sensing and productivity solutions; and software-based data and asset management productivity solutions. Honeywell Forge solutions digitally automate processes to improve efficiency while reducing downtime and safety costs.\nCompetition\nWe are subject to competition in substantially all product and service areas. Some of our key competitors are:\n•\nAerospace: Garmin, Safran, Thales, and United Technologies\n•\nHoneywell Building Technologies: Johnson Controls, Schneider Electric, Siemens and United Technologies\n•\nPerformance Materials and Technologies: Albemarle, BASF, Dupont, Emerson Electric, Schneider Electric, Siemens, Sinopec and Yokogawa\n•\nSafety and Productivity Solutions: 3M, Kion Group, Mine Safety Appliances (MSA), TE Connectivity, and Zebra Technologies\nOur businesses compete on a variety of factors such as price, quality, reliability, delivery, customer service, performance, applied technology, product innovation and product recognition. Brand identity, service to customers and quality are important competitive factors for our products and services, and there is considerable price competition. Other competitive factors include breadth of product line, research and development efforts and technical and managerial capability. While our competitive position varies among our products and services, we believe we are a significant competitor in each of our major product and service classes. Many of our competitors have substantial financial resources and significant technological capabilities. In addition, some of our products compete with the captive component divisions of OEMs.\nU.S. Government Sales\nSales to the U.S. Government (principally by Aerospace), acting through its various departments and agencies and through prime contractors, amounted to $4,057 million, $3,403 million and $3,203 million in 2019, 2018 and 2017, which included sales to the U.S. Department of Defense, as a prime contractor and subcontractor, of $3,491 million, $2,832 million and $2,546 million in 2019, 2018 and 2017. We do not expect our overall operating results to be significantly affected by any proposed changes in 2020 federal defense spending due principally to the varied mix of the government programs which impact us (OEMs’ production, engineering development programs, aftermarket spares and repairs and overhaul programs), as well as our diversified commercial businesses.\nInternational Operations\nWe engage in manufacturing, sales, service and research and development (R&D) globally. U.S. exports and non-U.S. manufactured products are significant to our operations. U.S. exports comprised 15% of our total sales in 2019, 13% in 2018 and 12% in 2017. Non-U.S. manufactured products and services, mainly in Europe and Asia, were 40% of our total sales in 2019, 43% in 2018 and 44% in 2017.\nInformation related to risks attendant to our foreign operations is included in Item 1A. Risk Factors under the caption “Macroeconomic and Industry Risks.”\nBacklog\nOur backlog represents the estimated remaining value of work to be performed under firm contracts. Backlog is equal to our remaining performance obligations under the contracts that meet the guidance on revenue from contracts with customers as discussed in Note 7 to the Consolidated Financial Statements. Backlog was $25,612 million and $24,850 million at December 31, 2019 and 2018. We expect to recognize approximately 57% of our remaining performance obligations as revenue in 2020, and the remaining balance thereafter.\nRaw Materials\nThe principal raw materials used in our operations are readily available. Although we occasionally experience disruption in raw materials supply, we experienced no significant problems in the purchase of key raw materials or commodities in 2019. We are not dependent on any one supplier for a material amount of our raw materials.\nPrices of certain key raw materials, including copper, fluorspar, tungsten salts, ethylene, aluminum, and molybdenum in Performance Materials and Technologies and nickel, steel, titanium and other metals in Aerospace, are expected to fluctuate. We offset raw material cost increases with formula or long-term supply agreements, price increases and hedging activities where feasible. We do not presently anticipate that a shortage of raw materials will cause any material adverse impacts during 2020.\nPatents, Trademarks, Licenses and Distribution Rights\nOur segments are not dependent upon any single patent or related group of patents, or any licenses or distribution rights. In our judgment, our intellectual property rights are adequate for the conduct of our business. We believe that, in the aggregate, the rights under our patents, trademarks and licenses are generally important to our operations, but we do not consider any individual patent, trademark or any licensing or distribution rights related to a specific process or product to be of material importance in relation to our total business.\nEnvironment\nWe are subject to various federal, state, local and foreign government requirements regarding protection of human health and the environment. Our policies, practices and procedures are designed to prevent unreasonable risk of environmental damage, and of resulting financial liability, in connection with our business. Some risk of environmental damage is, however, inherent in some of our operations and products, as it is with other companies engaged in similar businesses.\nWe engage in the handling, manufacturing, use and disposal of many substances classified as hazardous by one or more regulatory agencies. Our policies, practices and procedures are designed to prevent unreasonable risk of environmental damage and personal injury, and that our handling, manufacture, use and disposal of these substances meet or exceed environmental and safety laws and regulations. It is possible that future knowledge or other developments, such as improved capability to detect substances in the environment or increasingly strict environmental laws and standards and enforcement policies, could bring into question our current or past handling, manufacture, use or disposal of these substances.\nAmong other environmental requirements, we are subject to the federal Superfund and similar state and foreign laws and regulations, under which we have been designated as a potentially responsible party that may be liable for cleanup costs associated with current and former operating sites and various hazardous waste sites, some of which are on the U.S. Environmental Protection Agency’s National Priority List. While there is a possibility that a responsible party might be unable to obtain appropriate contribution from other responsible parties, we do not anticipate having to bear significantly more than our proportional share in multi-party situations taken as a whole.\nWe do not believe that Federal, State and local provisions regulating the discharge of materials into the environment, or otherwise relating to the protection of the environment, or any existing or pending climate change legislation, regulation, or international treaties or accords are reasonably likely to have a material effect in the foreseeable future on the Company’s business. We will continue to monitor emerging developments in this area.\nEmployees\nWe have approximately 113,000 employees at December 31, 2019, of whom approximately 44,000 are located in the United States.\nInformation About our Executive Officers\nThe executive officers of Honeywell, listed as follows, are elected annually by the Board of Directors. There are no family relationships among them.\nName, Age,\nDate First\nElected an\nExecutive Officer\nBusiness Experience\nDarius Adamczyk, 54\n2017(a)\nChairman of the Board and Chief Executive Officer since April 2018. President and Chief Executive Officer from April 2017 to April 2018. Chief Operating Officer from April 2016 to March 2017. President and Chief Executive Officer Performance Materials and Technologies from April 2014 to April 2016. President of Honeywell Process Solutions from April 2012 to April 2014.\nQue Thanh Dallara, 46\nPresident and Chief Executive Officer Connected Enterprise since October 2018. Vice President and Chief Commercial Officer from January 2017 to October 2018. From 2007 to 2016, Ms. Dallara served in multiple leadership positions at TE Connectivity Ltd., most recently as Senior Vice President, Corporate Strategy and Analytics.\nRajeev Gautam, 67\nPresident and Chief Executive Officer Performance Materials and Technologies since April 2016. President of Honeywell UOP from January 2009 to April 2016.\nMark R. James, 58\nSenior Vice President Human Resources, Security and Communications since November 2007.\nVimal Kapur, 54\nPresident and Chief Executive Officer Honeywell Building Technologies since May 2018. President of Honeywell Process Solutions from 2014 to May 2018.\nGregory P. Lewis, 52\nSenior Vice President and Chief Financial Officer since August 2018. Vice President of Enterprise Information Management from October 2016 to April 2018, prior to being named Vice President, Corporate Finance in May 2018. Chief Financial Officer of Automation and Control Solutions from April 2013 to September 2016.\nAnne T. Madden, 55\nSenior Vice President and General Counsel since October 2017. Corporate Secretary from February 2018 to September 2019. Vice President of Corporate Development and Global Head of M&A from January 2002 to October 2017.\nMichael R. Madsen, 56\nPresident and Chief Executive Officer Aerospace since October 2019. Vice President, Integrated Supply Chain of Aerospace from May 2015 to October 2019. President, Aerospace Defense and Space from October 2010 to May 2015\nJohn F. Waldron, 44\nPresident and Chief Executive Officer, Safety and Productivity Solutions since July 2016. President of Sensing and Productivity Solutions from July 2015 to July 2016. President of Scanning and Mobility from April 2012 to July 2015.\n(a)\nAlso a Director.",
    "item_1A": "Item 1A. Risk Factors\nCautionary Statement About Forward-Looking Statements\nWe describe many of the trends and other factors that drive our business and future results in Item 7. Management’s Discussion and Analysis of Financial Condition and Results of Operations and in other parts of this report (including this Item 1A). Such discussions contain forward-looking statements within the meaning of Section 21E of the Securities Exchange Act of 1934. Forward-looking statements are those that address activities, events or developments that management intends, expects, projects, believes or anticipates will or may occur in the future. They are based on management’s assumptions and assessments in light of past experience and trends, current economic and industry conditions, expected future developments and other relevant factors. They are not guarantees of future performance, and actual results, developments and business decisions may differ significantly from those envisaged by our forward-looking statements. We do not undertake to update or revise any of our forward-looking statements. Our forward-looking statements are also subject to risks and uncertainties that can affect our performance in both the near- and long-term. These forward-looking statements should be considered in light of the information included in this Form 10-K, including, in particular, the factors discussed below. These factors may be revised or supplemented in subsequent reports on Forms 10-Q and 8-K.\nRisk Factors\nOur business, operating results, cash flows and financial condition are subject to the principal risks and uncertainties set forth below, any one of which could cause our actual results to vary materially from recent results or from our anticipated future results.\nMacroeconomic and Industry Risks\nEach of our businesses is subject to unique industry and economic conditions that may adversely affect the markets and operating conditions of our customers, which in turn can affect demand for our products and services and our results of operations.\n•\nAerospace-Our Aerospace business is impacted by customer buying patterns of aftermarket parts, supplier stability, factory transitions and global supply chain capacity constraints that may lead to shortages of crucial components. Operating results may be adversely affected by downturns in the global demand for air travel which impacts new aircraft production or the delay or cancellation of new aircraft orders, delays in launch schedules for new aircraft, the retirement of aircraft and global flying hours, which impact air transport, regional, business and general aviation aircraft utilization rates. Operating results may be adversely affected by the decrease in air travel demand due to regional restrictions or suspension of service for public health, safety, or environmental events. Operating results could also be impacted by changes in overall trends related to end market demand for the product portfolio, as well as, new entrants and non-traditional players entering the market. Operating results in our Defense and Space business unit may be affected by the mix of U.S. and foreign government appropriations for defense and space programs and by compliance risks. Results may also be impacted by the potential introduction of counterfeit parts into our global supply chain.\n•\nHoneywell Building Technologies-Operating results may be adversely impacted by downturns in the level of global commercial construction activity (including retrofits and upgrades), lower capital spending and operating expenditures on building projects, less industrial plant expansion, changes in the competitive landscape including new market entrants and new technologies, and fluctuations in inventory levels in distribution channels.\n•\nPerformance Materials and Technologies-Operating results may be adversely impacted by downturns in capacity utilization for chemical, industrial, refining, petrochemical and semiconductor plants, our customers’ availability of capital for refinery construction and expansion, raw material demand and supply volatility, product commoditization, continued illegal imports of hydrofluorocarbons into Europe and our ability to maximize our facilities’ production capacity and minimize downtime. In particular, the volatility in oil and natural gas prices have and will continue to impact our customers’ operating levels and capital spending and thus demand for our products and services.\n•\nSafety and Productivity Solutions-Operating results may be adversely impacted by reduced investments in process automation, safety monitoring, and plant capacity utilization initiatives, fluctuations in retail markets, lower customer demand due to the failure to anticipate and respond to overall trends related to end market demand, changes in the competitive landscape including new market entrants and technology that may lead to product commoditization, and adverse industry economic conditions, all of which could result in lower market share, reduced selling prices and lower margins.\nAn increasing percentage of our sales and operations is in non-U.S. jurisdictions and is subject to the economic, political, regulatory, foreign exchange and other risks of international operations.\nOur international operations, including U.S. exports, represent more than half of the Company’s sales. Risks related to international operations include exchange control regulations, wage and price controls, antitrust regulations, employment regulations, foreign investment laws, import, export and other trade restrictions (such as sanctions and embargoes), differing levels of protection of intellectual property, acts of industrial espionage, violations by our employees of anti-corruption laws (despite our efforts to mitigate these risks), changes in regulations regarding transactions with state-owned enterprises, nationalization of private enterprises, acts of terrorism, and our ability to hire and maintain qualified staff and maintain the safety of our employees in these regions. Instability and uncertainties arising from the global geopolitical environment, and the evolving international and domestic political, regulatory and economic landscape, the potential for changes in global trade policies including sanctions and trade barriers, trends such as populism, economic nationalism and negative sentiment toward multinational companies, and the cost of compliance with increasingly complex and often conflicting regulations worldwide can impair our flexibility in modifying product, marketing, pricing or other strategies for growing our businesses, as well as our ability to improve productivity and maintain acceptable operating margins.\nWhile there is uncertainty regarding the final outcome and full terms of the United Kingdom’s future relationship with the European Union, it is possible that there will be greater restrictions on imports and exports between the United Kingdom and other countries, including the United States, increased tariffs on U.K. imports and exports, and increased regulatory complexities. The Company has developed plans to mitigate the potential impact of these possible restrictions, but the implications of these uncertainties could affect the Company's business, financial position and results of operations.\nExisting free trade laws and regulations provide certain beneficial duties and tariffs for qualifying imports and exports. Changes in laws or policies governing the terms of foreign trade, and in particular increased trade restrictions, tariffs or taxes on imports from countries where we manufacture products or from where we import products or raw materials, either directly or through our suppliers, could have an impact on our competitive position and financial results.\nThe United States has commenced certain trade actions, including imposing tariffs on certain goods imported from China and other countries, which has resulted in retaliatory tariffs by China and other countries. Additional tariffs imposed by the United States on a broader range of imports, or further retaliatory trade measures taken by China or other countries in response, could increase the cost of our products.\nOperating outside of the United States also exposes us to foreign exchange risk, which we monitor and seek to reduce through hedging activities. However, foreign exchange hedging activities bear a financial cost and may not always be available to us or be successful in eliminating such volatility. Finally, we generate significant amounts of cash outside of the United States that is invested with financial and non-financial counterparties. While we employ comprehensive controls regarding global cash management to guard against cash or investment loss and to ensure our ability to fund our operations and commitments, a material disruption to the counterparties with whom we transact business could expose Honeywell to financial loss.\nOperating outside the United States also exposes us to additional intellectual property risk. The laws and enforcement practices of certain jurisdictions in which we operate may not protect our intellectual property rights to the same extent as in the U.S. and may impose joint venture, technology transfer, local service or other foreign investment requirements and restrictions that potentially compromise control over our technology and proprietary information. Failure of foreign jurisdictions to protect our intellectual property rights, an inability to effectively enforce such rights in foreign jurisdictions, or the imposition of foreign jurisdiction investment or sourcing restrictions or requirements could result in loss of valuable proprietary information and could impact our competitive position and financial results.\nRisks related to our defined benefit pension plans may adversely impact our results of operations and cash flow.\nSignificant changes in actual investment return on pension assets, discount rates, and other factors could adversely affect our results of operations and require cash pension contributions in future periods. Changes in discount rates and actual asset returns different than our anticipated asset returns can result in significant non-cash actuarial gains or losses which we record in the fourth quarter of each fiscal year, and, if applicable, in any quarter in which an interim re-measurement is triggered. With regard to cash pension contributions, funding requirements for our pension plans are largely dependent upon interest rates, actual investment returns on pension assets and the impact of legislative or regulatory changes related to pension funding obligations.\nWe may be required to transition from the use of the LIBOR interest rate index in the future.\nWe have certain contracts indexed to LIBOR to calculate the interest rate. The continued availability of the LIBOR index is not guaranteed after 2021. We cannot predict whether and to what extent banks will continue to provide LIBOR submissions to the administrator of LIBOR or whether any additional reforms to LIBOR may be enacted. The language in certain of our LIBOR-based contracts identify various events that trigger when a successor rate to the designated rate would be selected. If a trigger is satisfied, such contracts may give the calculation agent discretion over the substitute index or indices for the calculation of interest rates to be selected. The implementation of a substitute index or indices for the calculation of interest rates under our contracts may result in our incurring significant expenses in effecting the transition and may result in disputes or litigation over the appropriateness or comparability to LIBOR of the substitute index or indices, which could have an adverse effect on our results of operations.\nOperational Risks\nRaw material price fluctuations, the ability of key suppliers to meet quality and delivery requirements, or catastrophic events can increase the cost of our products and services, impact our ability to meet commitments to customers and cause us to incur significant liabilities.\nThe cost of raw materials is a key element in the cost of our products, particularly in Performance Materials and Technologies (copper, fluorspar, tungsten salts, ethylene, aluminum, and molybdenum) and in Aerospace (nickel, steel, titanium and other metals). Our inability to offset material price inflation through increased prices to customers, formula or long-term fixed price contracts with suppliers, productivity actions or through commodity hedges could adversely affect our results of operations.\nMany major components, product equipment items and raw materials, particularly in Aerospace, are procured or subcontracted on a single or sole-source basis. Although we maintain a qualification and performance surveillance process and we believe that sources of supply for raw materials and components are generally adequate, it is difficult to predict what effects shortages or price increases may have in the future. Our ability to manage inventory and meet delivery requirements may be constrained by our suppliers’ inability to scale production and adjust delivery of long-lead time products during times of volatile demand. Our inability to fill our supply needs would jeopardize our ability to fulfill obligations under commercial and government contracts, which could, in turn, result in reduced sales and profits, contract penalties or terminations, and damage to customer relationships.\nWe may be unable to successfully execute or effectively integrate acquisitions, and divestitures may not occur as planned.\nWe regularly review our portfolio of businesses and pursue growth through acquisitions and seek to divest non-core businesses. We may not be able to complete transactions on favorable terms, on a timely basis, or at all. In addition, our results of operations and cash flows may be adversely impacted by (i) the failure of acquired businesses to meet or exceed expected returns, including risk of impairment; (ii) the failure to integrate multiple acquired businesses into Honeywell simultaneously and on schedule and/or to achieve expected synergies; (iii) the inability to dispose of non-core assets and businesses on satisfactory terms and conditions; and (iv) the discovery of unanticipated liabilities, labor relations difficulties, cybersecurity concerns, compliance issues or other problems in acquired businesses for which we lack contractual protections, insurance or indemnities, or with regard to divested businesses, claims by purchasers to whom we have provided contractual indemnification.\nOur future growth is largely dependent upon our ability to develop new technologies and introduce new products that achieve market acceptance in increasingly competitive markets with acceptable margins.\nOur future growth rate depends upon a number of factors, including our ability to (i) identify and evolve with emerging technological and broader industry trends in our target end-markets; (ii) develop and maintain competitive products; (iii) defend our market share against an ever-expanding number of competitors including many new and non-traditional competitors; (iv) enhance our products by adding innovative features that differentiate our products from those of our competitors and prevent commoditization of our products; (v) develop, manufacture and bring compelling new products to market quickly and cost-effectively; (vi) monitor disruptive technologies and business models; (vii) achieve sufficient return on investment for new products introduced based on capital expenditures and research and development spending; (viii) respond to changes in overall trends related to end-market demand; and (ix) attract, develop and retain individuals with the requisite technical expertise and understanding of customers’ needs to develop new technologies and introduce new products. Competitors may also develop after-market services and parts for our products which attract customers and adversely affect our return on investment for new products. The failure of our technologies or products to gain market acceptance due to more attractive offerings by our competitors or the failure to address any of the above factors could significantly reduce our revenues and adversely affect our competitive standing and prospects.\nFailure to increase productivity through sustainable operational improvements, as well as an inability to successfully execute repositioning projects or to effectively manage our workforce, may reduce our profitability or adversely impact our businesses.\nOur profitability and margin growth are dependent upon our ability to drive sustainable improvements. In addition, we seek productivity and cost savings benefits through repositioning actions and projects, such as consolidation of manufacturing facilities, transitions to cost-competitive regions and product line rationalizations. Risks associated with these actions include delays in execution, additional unexpected costs, realization of fewer than estimated productivity improvements and adverse effects on employee morale. We may not realize the full operational or financial benefits we expect, the recognition of these benefits may be delayed and these actions may potentially disrupt our operations. In addition, organizational changes, increased attrition, failure to create and implement a succession plan for key Company positions, not retaining key talent, inability to attract new employees with unique skills, labor relations difficulties, or workforce stoppage could have a material adverse effect on our business, reputation, financial position and results of operations.\nAs a supplier to the U.S. Government, we are subject to unique risks, such as the right of the U.S. Government to terminate contracts for convenience and to conduct audits and investigations of our operations and performance.\nU.S. Government contracts are subject to termination by the government, either for the convenience of the government or for our failure to perform consistent with the terms of the applicable contract. Our contracts with the U.S. Government are also subject to government audits that may recommend downward price adjustments and other changes. When appropriate and prudent, we made adjustments and paid voluntary refunds in the past and may do so in the future.\nWe are also subject to government investigations of business practices and compliance with government procurement regulations. If, as a result of any such investigation or other government investigations (including investigation of violations of certain environmental, employment or export laws), Honeywell or one of its businesses were found to have violated applicable law, then it could be suspended from bidding on or receiving awards of new government contracts, suspended from contract performance pending the completion of legal proceedings and/or have its export privileges suspended.\nOur operations and the prior operations of predecessor companies expose us to the risk of material environmental liabilities.\nMainly because of past operations and operations of predecessor companies, we are subject to potentially material liabilities related to the remediation of environmental hazards and to claims of personal injuries or property damages that may be caused by hazardous substance releases and exposures. We continue to incur remedial response and voluntary clean-up costs for site contamination and are a party to lawsuits and claims associated with environmental and safety matters, including past production of products containing hazardous substances. Additional lawsuits, claims and costs involving environmental matters are likely to continue to arise in the future. Various federal, state, local and foreign governments regulate the discharge of materials into the environment, or the use of or communications respecting certain materials in our products, and can impose substantial fines and criminal sanctions for violations, and require injunctive relief measures, including installation of costly equipment or operational changes to limit emissions and/or decrease the likelihood of accidental hazardous substance releases, or limiting access of our products to markets, among others. In addition, changes in laws, regulations and enforcement of policies, the discovery of previously unknown contamination or new technology or information related to individual sites, the establishment of stricter toxicity standards with respect to certain contaminants, or the imposition of new clean-up requirements or remedial techniques could require us to incur additional costs in the future that would have a negative effect on our financial condition or results of operations.\nCybersecurity incidents could disrupt business operations, result in the loss of critical and confidential information, and adversely impact our reputation and results of operations.\nGlobal cybersecurity threats and incidents can range from uncoordinated individual attempts to gain unauthorized access to information technology (IT) systems to sophisticated and targeted measures known as advanced persistent threats, directed at the Company, its products, its customers and/or its third party service providers, including cloud providers. Our customers, including the U.S. government, are increasingly requiring cybersecurity protections and mandating cybersecurity standards in our products, and we may incur additional costs to comply with such demands. While we have experienced, and expect to continue to experience, these types of threats and incidents, none of them to date have been material to the Company. We seek to deploy comprehensive measures to deter, prevent, detect, respond to and mitigate these threats, including identity and access controls, data protection, vulnerability assessments, continuous monitoring of our IT networks and systems and maintenance of backup and protective systems. Despite these efforts, cybersecurity incidents, depending on their nature and scope, could potentially result in the misappropriation, destruction, corruption or unavailability of critical data and confidential or proprietary information (our own or that of third parties) and the disruption of business operations. The potential consequences of a material cybersecurity incident include financial loss, reputational damage, litigation with third parties, theft of intellectual property, fines levied by the Federal Trade Commission, diminution in the value of our investment in research, development and engineering, and increased cybersecurity protection and remediation costs due to the increasing sophistication and proliferation of threats, which in turn could adversely affect our competitiveness and results of operations.\nThe development of technology products and services presents security and safety risks.\nAn increasing number of our products, services and technologies are delivered with Internet of Things (IoT) capabilities and the accompanying interconnected device networks which include sensors, data and advanced computing capabilities. We have developed product software designs which we believe are less susceptible to cyber-attacks, but despite these efforts, if our products and services that include IoT solutions do not work as intended or are compromised, the possible consequences include financial loss, reputational damage, exposure to legal claims or enforcement actions, theft of intellectual property, and diminution in the value of our investment in research, development and engineering, which in turn could adversely affect our competitiveness and results of operations.\nData privacy, data protection, and information security may require significant resources and presents certain risks.\nWe collect, store, have access to and otherwise process certain confidential or sensitive data, including proprietary business information, personal data or other information that is subject to privacy and security laws, regulations and/or customer-imposed controls. Despite our efforts to protect such data, we may be vulnerable to material security breaches, theft, misplaced or lost data, programming errors, or employee errors that could potentially lead to the compromising of such data, improper use of our systems, software solutions or networks, unauthorized access, use, disclosure, modification or destruction of information, defective products, production downtimes and operational disruptions. In addition, we operate in an environment in which there are different and potentially conflicting data privacy laws in effect in the various U.S. states and foreign jurisdictions in which we operate and we must understand and comply with each law and standard in each of these jurisdictions while ensuring the data is secure. For example, the State of California recently passed legislation granting residents certain new data privacy rights and regulating the security of IoT devices, effective in January 2020; European laws require us to have an approved legal mechanism to transfer personal data out of Europe; the European Union General Data Protection Regulation, which became enforceable in May 2018, superseded prior European Union data protection legislation and imposes more stringent requirements in how we collect and process personal data and provides for significantly greater penalties for noncompliance; and several other countries have passed laws that require personal data relating to their citizens to be maintained on local servers and impose additional data transfer restrictions. Government enforcement actions can be costly and interrupt the regular operation of our business, and violations of data privacy laws can result in fines, reputational damage and civil lawsuits, any of which may adversely affect our business, reputation and financial statements.\nA material disruption of our operations, particularly at our manufacturing facilities or within our information technology infrastructure, could adversely affect our business.\nOur facilities, supply chains, distribution systems and information technology systems are subject to catastrophic loss due to natural disasters, including hurricanes and floods, power outages, fires, explosions, terrorism, equipment failures, sabotage, cyber incidents, adverse weather conditions, labor disputes, critical supply failure, inaccurate downtime forecast, political disruption, and other reasons, which can result in undesirable consequences, including financial losses and damaged relationships with customers. Public health crises, like a regional or global pandemic, could disrupt our supply chain, distribution channels, production facilities, operations and customer demand, which could negatively impact our operations and adversely affect our business. We employ information technology systems and networks to support the business and rely on them to process, transmit and store electronic information, and to manage or support a variety of business processes and activities. Disruptions to our information technology infrastructure from system failures, shutdowns, power outages, telecommunication or utility failures, cybersecurity incidents, and other events, including disruptions at our cloud computing, server, systems and other third party IT service providers, could interfere with our operations, interrupt production and shipments, damage customer and business partner relationships, and negatively impact our reputation.\nConcentrations of credit and market risk may adversely affect our results of operations.\nWe maintain long-term contract relationships with many of our customers, suppliers, and other counterparties. While we monitor the financial health of these counterparties, we are exposed to credit and market risks to the extent that customers, suppliers, and other counterparties are concentrated in similar industries and geographic regions. Changes in economic conditions in these industries or geographic regions could result in the credit deterioration or insolvency of a significant counterparty, which may lead to concerns about the creditworthiness of other counterparties in the same industry or geography, impacting our ability to renew our long-term contract arrangements or collect amounts due under these arrangements.\nLegal and Regulatory Risks\nOur U.S. and non-U.S. tax liabilities are dependent, in part, upon the distribution of income among various jurisdictions in which we operate.\nOur future results of operations could be adversely affected by changes in the effective tax rate as a result of a change in the mix of earnings in countries with differing statutory tax rates, changes in tax laws, regulations and judicial rulings (or changes in the interpretation thereof), potential taxation of digital services, changes in generally accepted accounting principles, changes in the valuation of deferred tax assets and liabilities, changes in the amount of earnings permanently reinvested offshore, the results of audits and examinations of previously filed tax returns and continuing assessments of our tax exposures and various other governmental enforcement initiatives. Our tax expense includes estimates of tax reserves and reflects other estimates and assumptions, including assessments of future earnings of the Company which could impact the valuation of our deferred tax assets. Changes in tax laws or regulations, including further regulatory developments arising from U.S. tax reform legislation as well as multi-jurisdictional changes enacted in response to the action items provided by the Organization for Economic Co-operation and Development (OECD), will increase tax uncertainty and impact our provision for income taxes.\nChanges in legislation or government regulations or policies can have a significant impact on our results of operations.\nThe sales and margins of each of our segments are directly impacted by government regulations including safety, performance and product certification regulations. Within Aerospace, the operating results of Commercial Original Equipment and Commercial Aftermarket may be impacted by, among other things, mandates of the Federal Aviation Administration and other similar international regulatory bodies requiring the installation of equipment on aircraft. Our Defense and Space business unit may be affected by changes in government procurement regulations. Within Honeywell Building Technologies and Safety and Productivity Solutions, the demand for and cost of providing products, services and solutions can be impacted by fire, security, safety, health care, environmental and energy efficiency standards and regulations. Performance Materials and Technologies’ results of operations can be impacted by environmental standards, regulations, and judicial determinations. Growth in all our businesses within emerging markets may be adversely impacted by the inability to acquire and retain qualified employees where local employment law mandates may be restrictive. Noncompliance with legislation and regulations can result in fines and penalties.\nIncreased public awareness and concern regarding global climate change may result in more international, regional and/or federal or other stakeholder requirements or expectations that could mandate more restrictive or expansive standards, such as stricter limits on greenhouse gas emissions or more prescriptive reporting of environmental, social, and governance metrics, than the voluntary commitments, that the Company has adopted or require such changes on a more accelerated time frame. There continues to be a lack of consistent climate legislation, which creates economic and regulatory uncertainty. If environmental laws or regulations are either changed or adopted and impose significant operational restrictions and compliance requirements upon the Company or its products, they could negatively impact the Company’s business, capital expenditures, results of operations, financial condition and competitive position.\nWe cannot predict with certainty the outcome of litigation matters, government proceedings and other contingencies and uncertainties.\nWe are subject to a number of lawsuits, investigations and disputes (some of which involve substantial amounts claimed) arising out of the conduct of our business, including matters relating to commercial transactions, government contracts, product liability (including asbestos), prior acquisitions and divestitures, employment, employee benefits plans, intellectual property, antitrust, accounting, import and export, and environmental, health and safety matters. Our potential liabilities are subject to change over time due to new developments, changes in settlement strategy or the impact of evidentiary requirements, and we may become subject to or be required to pay damage awards or settlements that could have a material adverse effect on our results of operations, cash flows and financial condition. While we maintain insurance for certain risks, the amount of our insurance coverage may not be adequate to cover the total amount of all insured claims and liabilities. The incurrence of significant liabilities for which there is no or insufficient insurance coverage could adversely affect our results of operations, cash flows, liquidity and financial condition.",
    "item_1B": "Item 1B. Unresolved Staff Comments\nNone.",
    "item_1C": "",
    "item_2": "Item 2. Properties\nWe have approximately 932 locations, of which 242 are manufacturing sites. Our properties and equipment are in good operating condition and are adequate for our present needs. We do not anticipate difficulty in renewing existing leases as they expire or in finding alternative facilities.",
    "item_3": "Item 3. Legal Proceedings\nWe are subject to a number of lawsuits, investigations and claims (some of which involve substantial amounts) arising out of the conduct of our business. See a discussion of environmental, asbestos and other litigation matters in Note 20 Commitments and Contingencies of Notes to Consolidated Financial Statements.\nThe following matter is disclosed solely pursuant to the requirement to disclose certain environmental matters involving potential monetary sanctions in excess of $100,000: In January 2020, Honeywell reached agreement with the Texas Commission on Environmental Quality (TCEQ) to settle allegations that its Orange, Texas facility had exceeded certain emissions limits in its air permit. When Honeywell discovered these emissions, it took immediate corrective measures to address the issue, and self-reported the emissions to the TCEQ. Under the terms of the settlement, Honeywell will pay a penalty of $152,415 to resolve the matter.",
    "item_4": "Item 4. Mine Safety Disclosures\nOne of our wholly-owned subsidiaries has a placer claim for and operates a chabazite ore surface mine in Arizona. Information concerning mine safety and other regulatory matters associated with this mine is required by Section 1503(a) of the Dodd-Frank Wall Street Reform and Consumer Protection Act and Item 104 of Regulation S-K and is included in Exhibit 95 to this annual report.\nPart II.",
    "item_5": "Item 5. Market for Registrant’s Common Equity, Related Stockholder Matters and Issuer Purchases of Equity Securities\nOur common stock is listed on the New York Stock Exchange under the ticker symbol “HON”. Dividend information for Honeywell’s common stock is included in Note 25 Unaudited Quarterly Financial Information of Notes to Consolidated Financial Statements.\nThe number of record holders of our common stock at December 31, 2019 was 43,552.\nInformation regarding securities authorized for issuance under equity compensation plans is included in Item 12. Security Ownership of Certain Beneficial Owners and Management and Related Stockholder Matters under the caption “Equity Compensation Plans.”\nWe purchased 4,325,518 shares of our common stock, par value $1 per share, in the quarter ending December 31, 2019. On April 29, 2019, the Board of Directors authorized the repurchase of up to a total of $10 billion of Honeywell common stock, which included amounts remaining under, and replaced, the previously approved share repurchase program. As of December 31, 2019, $7.0 billion remained available for additional share repurchases. We expect to repurchase outstanding shares from time to time to generally offset the dilutive impact of employee stock based compensation plans, including option exercises, restricted unit vesting and matching contributions under our savings plans. Additionally, we seek to reduce share count via share repurchases as and when attractive opportunities arise. The amount and timing of future repurchases may vary depending on market conditions and the level of our operating, financing and other investing activities.\nThe following table summarizes our purchases of Honeywell's common stock for the three months ended December 31, 2019:\nPerformance Graph\nThe following graph compares the five-year cumulative total return on our common stock to the total returns on the Standard & Poor’s (S&P) 500 Stock Index and a composite of S&P’s Industrial Conglomerates and Aerospace and Defense indices, on a 55%/45% weighted basis (the Composite Index). The weighting of the components of the Composite Index are based on our segments’ relative contribution to total segment profit. The selection of the Industrial Conglomerates component of the Composite Index reflects the diverse and distinct range of non-aerospace businesses conducted by Honeywell. The annual changes for the five-year period shown in the graph are based on the assumption that $100 had been invested in Honeywell stock and each index on December 31, 2014 and that all dividends were reinvested.\nDec 2014\nDec 2015\nDec 2016\nDec 2017\nDec 2018\nDec 2019\nHoneywell\n105.80\n121.65\n164.35\n150.84\n206.19\nS&P Index\n101.38\n113.51\n138.29\n132.23\n173.86\nComposite Index\n111.71\n126.60\n144.27\n117.70\n150.03\nHONEYWELL INTERNATIONAL INC.\nThis selected financial data should be read in conjunction with Honeywell’s Consolidated Financial Statements and related Notes included elsewhere in this Annual Report as well as the section of this Annual Report titled Item 7. Management’s Discussion and Analysis of Financial Condition and Results of Operations.",
    "item_6": "Item 6. Selected Financial Data\n(1)\n2018 and 2017 Net Income attributable to Honeywell and Earnings Per Common Share were impacted by U.S. Tax Reform; see Note 5 Income Taxes of Notes to Consolidated Financial Statements for further details.\n(2)\nThe results of operations for Transportation Systems business and Homes and Global Distribution business are included in the Consolidated Statement of Operations through the effective dates of the respective spin-offs, which occurred in 2018.",
    "item_7": "Item 7. Management’s Discussion and Analysis of Financial Condition and Results of Operations\n(Dollars in millions, except per share amounts)\nThe following Management’s Discussion and Analysis of Financial Condition and Results of Operations is intended to help the reader understand the results of operations and financial condition of Honeywell International Inc. and its consolidated subsidiaries (“Honeywell” or “the Company”) for the three years ended December 31, 2019. All references to Notes relate to Notes to Consolidated Financial Statements in Item 8. Financial Statements and Supplementary Data.\nOn October 1, 2018, we completed the tax-free spin-off to Honeywell shareowners of our Transportation Systems business, previously part of Aerospace, into a standalone publicly-traded company, Garrett Motion Inc. (“Garrett”).\nOn October 29, 2018, we completed the tax-free spin-off to Honeywell shareowners of our Homes and Global Distribution business, previously part of Home and Building Technologies (renamed Honeywell Building Technologies following the spin-off), into a standalone publicly-traded company, Resideo Technologies, Inc. (“Resideo”).\nWe removed the assets and liabilities associated with Garrett and Resideo from our Consolidated Balance Sheet as of the effective dates of the respective spin-offs. We included the results of operations for Garrett and Resideo in our Consolidated Statement of Operations through the effective dates of the respective spin-offs. Total sales and total cost of products and services sold attributable to these spin-offs, impacting segment profit, were $6.6 billion and $4.8 billion for the year ended December 31, 2018.\nA detailed discussion of the prior year 2018 to 2017 year-over-year changes are not included herein and can be found in the Management's Discussion and Analysis section in the 2018 Annual Report on Form 10-K filed February 8, 2019.\nEXECUTIVE SUMMARY\nDuring 2019, we continued to deliver on our financial commitments and to create long-term shareowner value. Income before taxes grew 1% to $7.6 billion despite the spin-offs. The improvement in year over year Income before taxes was attributable to both sales growth as well as operational improvements that increased operating margins. We believe our ability to drive continuous earnings growth over a long history results from consistently identifying and investing in productivity initiatives. We continue to focus on commercial excellence and improvements in our manufacturing and operational processes, including our Integrated Supply Chain and Honeywell Digital transformations, to drive higher sales at better margins.\nWe are careful not to allow the attainment of short-term financial results to imperil the creation of long-term, sustainable shareowner value. We are committed to a strategy to become one of the world’s leading software industrial companies. Our technology investments allow us to introduce new technology solutions in high growth businesses in broad-based, attractive industrial end markets. Each of these end markets is characterized by favorable global mega-trends including energy efficiency, infrastructure investment, urbanization and safety.\nIn 2019 we deployed capital of $7.8 billion, including capital expenditures, dividends, share repurchases, mergers and acquisitions, and venture investments.\nBUSINESS OBJECTIVES\nOur businesses are focused on the following objectives:\n•\nDriving profitable growth through delivering innovative products through research and development and technological excellence, and through continued enhancement of our footprint in high growth regions;\n•\nContinuing to execute on our strategy to become the premier software-industrial, including the ongoing expansion of Honeywell Forge connected solutions for aircraft, buildings, cybersecurity, plants, and workers and driving a recurring revenue model across the Company;\n•\nExpanding margins by optimizing the Company’s cost structure through Supply Chain and Honeywell Digital transformation initiatives, commercial excellence, repositioning, and other manufacturing and operational process improvements;\n•\nExecuting disciplined, rigorous M&A and integration processes to deliver growth through acquisitions;\n•\nControlling corporate costs, including costs incurred for asbestos and environmental matters, pension and other post-retirement benefits; and\n•\nIncreasing availability of capital through strong cash flow generation and conversion from effective working capital management and proactively managing debt to enable the Company to smartly deploy capital for strategic acquisitions, dividends, share repurchases and capital expenditures.\nCONSOLIDATED RESULTS OF OPERATIONS\nNet Sales\nNet sales decreased in 2019 compared to 2018 due to the spin-offs. Our 2018 results included $6,550 million of sales related to the Transportation Systems and Homes and Global Distribution businesses. Absent the impact of the spin-offs during 2018, sales grew 4% from $35,252 in 2018 to $36,709 in 2019.\nThe change in net sales is attributable to the following:\nA discussion of net sales by segment can be found in the Review of Business Segments section of this Management’s Discussion and Analysis.\nThe unfavorable impact of foreign currency translation in 2019 compared with 2018 was principally driven by the strengthening of the U.S. Dollar against the currencies of the majority of our international markets, primarily the Euro, British Pound and Chinese Renminbi.\nCost of Products and Services Sold\nCost of products and services sold decreased in 2019 compared to 2018 due to lower direct and indirect material costs of approximately $3,920 million, lower labor costs of approximately $160 million (both driven by the spin-offs of the Transportation Systems and Homes and Global Distribution businesses), and lower repositioning and other charges of approximately $530 million, largely due to lower asbestos and environmental related charges net of the reimbursements. Absent the impact of these items during 2018, cost of products and services sold increased approximately 3%.\nGross margin percentage increased in 2019 compared with 2018 primarily due to higher gross margin in the segments (approximately 1.4 percentage points), with higher Aerospace, Honeywell Building Technologies and Performance Materials and Technologies gross margins, including the favorable impact following the spin-offs, partially offset by lower Safety and Productivity Solutions gross margin. Additionally, gross margin percentage increased due to the lower costs within cost of products and services sold for repositioning and other charges (approximately 1.5 percentage point impact) and pension service costs (approximately 0.2 percentage point impact).\nSelling, General and Administrative Expenses\nSelling, general and administrative expenses decreased in 2019 compared with 2018 primarily due to the impact of the spin-offs. In addition, selling, general and administrative expenses decreased due to productivity and the favorable impact of foreign currency translation, partially offset by labor inflation.\nOther (Income) Expense\nOther (income) expense decreased in 2019 compared with 2018 primarily due to lower pension non-service income, partially offset by lower separation costs.\nTax Expense\nThe effective tax rate for 2019 was lower than the U.S. federal statutory rate of 21% primarily resulting from the impacts of revised guidance related to U.S. Tax Reform and internal restructuring initiatives that resulted in a $281 million reduction of accrued withholding taxes related to unremitted foreign earnings.\nThe effective tax rate for 2018 was lower than the U.S. federal statutory rate of 21% primarily attributable to internal restructuring initiatives that resulted in a reduction of accrued withholding taxes of approximately $1.1 billion related to unremitted foreign earnings. In addition, we recorded a tax benefit of approximately $440 million as a reduction to our 2017 provisional estimate of impacts from what is commonly referred to as the U.S. Tax Cuts and Jobs Act (“U.S. Tax Reform”), which was partially offset by $411 million of tax costs associated with the internal restructuring of the Homes and Global Distribution business and the Transportation Systems business in advance of their spin-offs.\nFor further discussion of changes in the effective tax rate, see Note 5 Income Taxes of Notes to Consolidated Financial Statements.\nNet Income Attributable to Honeywell\nEarnings per share of common stock-assuming dilution decreased in 2019 compared with 2018 primarily driven by the absence of profit attributable to the spin-offs, higher income tax expense (attributable to a lower income tax benefit related to U.S. Tax Reform and internal restructuring initiatives when compared to the prior year), partially offset by increased operational segment profit and lower repositioning and other charges.\nReview of Business Segments\nWe globally manage our business operations through four segments: Aerospace, Honeywell Building Technologies, Performance Materials and Technologies, and Safety and Productivity Solutions.\nAerospace\n2019 compared with 2018\nAerospace sales decreased due to the impact of the spin-off of the Transportation Systems business. Our 2018 results included $2,622 million of sales related to the spin-off. Absent the impact of the spin-off during 2018, sales grew approximately 9% from $12,871 million to $14,054 million due to growth in organic sales.\n•\nCommercial Aviation Original Equipment sales increased 6% (increased 6% organic) primarily due to increased demand from business aviation original equipment manufacturers (OEM).\n•\nCommercial Aviation Aftermarket sales increased 7% (increased 7% organic) primarily due to growth in air transport and regional and business aviation.\n•\nDefense and Space sales increased 14% (increased 14% organic) primarily driven by growth in U.S. and international defense.\nAerospace segment profit increased primarily due to organic sales volume, price, and productivity, net of inflation, partially offset by the divestiture impacts following the spin-off of the Transportation Systems business. Cost of products and services sold decreased primarily due to the spin-off of the Transportation Systems business and productivity, net of inflation, partially offset by higher sales volume.\nHoneywell Building Technologies\n2019 compared with 2018\nHoneywell Building Technologies sales decreased due to the impact of the spin-off of the Homes and Global Distribution business. Our 2018 results included $3,928 million of sales related to the spin-off. Absent the impact of the spin-off during 2018, sales grew approximately 6% from $5,370 million to $5,717 million.\n•\nSales in Building Technologies increased 6% (increased 5% organic) due to the organic growth in both Products and Building Solutions, partially offset by the unfavorable impact of foreign currency translation.\nHoneywell Building Technologies segment profit decreased primarily due to the divestiture impacts following the spin-off of the Homes and Global Distribution business. This was offset by an increase in organic sales volumes and price, partially offset by inflation. Cost of products and services sold decreased due to the spin-off, partially offset by higher sales volumes.\nPerformance Materials and Technologies\n2019 compared with 2018\nPerformance Materials and Technologies sales increased primarily due to organic growth, mainly due to volumes, partially offset by the unfavorable impact of foreign currency translation.\n•\nUOP sales increased 2% (increased 3% organic) driven primarily by increases in catalyst sales, project volumes, and licensing, partially offset by lower gas processing volumes and the unfavorable impact of foreign currency translation.\n•\nProcess Solutions sales increased 3% (increased 6% organic) driven primarily by increases in maintenance and migration services, project volumes, field products, and software sales, partially offset by the unfavorable impact of foreign currency translation.\n•\nAdvanced Materials sales decreased 2% (flat organic) driven primarily by the unfavorable impact of foreign currency translation and decreased volumes in specialty products, partially offset by growth in fluorine products sales.\nPerformance Materials and Technologies segment profit increased primarily due to productivity, net of inflation, and price, partially offset by higher sales of lower margin products and the impact of foreign currency translation. Cost of products and services sold increased primarily due to higher sales volumes, partially offset by the impact of foreign currency translation and productivity, net of inflation.\nSafety and Productivity Solutions\n2019 compared with 2018\nSafety and Productivity Solutions sales decreased primarily due to lower organic sales and the unfavorable impact of foreign currency translation, partially offset by acquisitions.\n•\nSales in Safety decreased 3% (decreased 1% organic) primarily due to the unfavorable impact of foreign currency translation and lower organic sales in Industrial Safety.\n•\nSales in Productivity Solutions decreased 4% (decreased 6% organic) primarily due to lower organic sales in Productivity Products and the unfavorable impact of foreign currency translation, partially offset by acquisitions.\nSafety and Productivity Solutions segment profit decreased as a result of lower sales volumes in Productivity Products, higher sales of lower margin products and the impact of foreign currency translation, partially offset by higher productivity, net of inflation, favorable pricing and acquisitions. Cost of products and services sold decreased primarily due to higher productivity, net of inflation, and the impact of foreign currency translation, partially offset by acquisitions.\nRepositioning Charges\nSee Note 3 Repositioning and Other Charges of Notes to Consolidated Financial Statements for a discussion of our repositioning actions and related charges incurred in 2019, 2018 and 2017. Cash spending related to our repositioning actions was $249 million, $285 million and $177 million in 2019, 2018 and 2017, and was funded through operating cash flows. In 2020, we expect cash spending for repositioning actions to be approximately $300 million and to be funded through operating cash flows.\nLIQUIDITY AND CAPITAL RESOURCES\nWe continue to manage our businesses to maximize operating cash flows as the primary source of liquidity. In addition to our available cash and operating cash flows, we maintain additional sources of liquidity, including committed credit lines, short-term debt from the commercial paper market, long-term borrowings, access to the public debt and equity markets and the ability to access non-U.S. cash as a result of the U.S. Tax Reform. We use cash generated through operations to invest in our existing core businesses, acquisitions, share repurchases and dividends.\nCash Flow Summary\nOur cash flows from operating, investing and financing activities, as reflected in the Consolidated Statement of Cash Flows, are summarized as follows:\n2019 compared with 2018\nCash provided by operating activities increased by $463 million primarily due to $276 million decrease in net payments for repositioning and other charges, largely due to asbestos and environmental related reimbursement receipts, and a $35 million favorable impact from working capital (favorable inventory and accounts receivable partially offset by accounts payable).\nCash used by investing activities increased by $1,560 million primarily due to a net $1,762 million increase in investments, primarily short-term marketable securities.\nCash used for financing activities increased by $1,568 million primarily due to the prior year pre-spin separation funding of $2,622 million net of spin-off cash, an increase in cash dividends paid of $170 million and an increase in net repurchases of common stock of $169 million, partially offset by a decrease in net debt payments of $1,330 million.\nLiquidity\nEach of our businesses is focused on increasing operating cash flows through revenue growth, margin expansion and improved working capital turnover. We believe that cash balances and operating cash flow will continue to be our principal source of liquidity. In addition to the available cash and operating cash flows, additional sources of liquidity include committed credit lines, short-term debt from the commercial paper markets, long-term borrowings, and access to the public debt and equity markets. To date, the Company has not experienced any limitations in our ability to access these sources of liquidity.\nWe monitor the third-party depository institutions that hold our cash and cash equivalents on a daily basis. Our emphasis is primarily safety of principal and secondarily maximizing yield of those funds. We diversify our cash and cash equivalents among counterparties to minimize exposure to any one of these entities.\nA source of liquidity is our ability to access the commercial paper market. Commercial paper notes are sold at a discount or premium and have a maturity of not more than 365 days from date of issuance. Borrowings under the commercial paper program are available for general corporate purposes as well as for financing acquisitions. The weighted average interest rate on short-term borrowings and commercial paper outstanding as of December 31, 2019 was (0.37%) and as of December 31, 2018 was (0.31%).\nOur ability to access the commercial paper market, and the related cost of these borrowings, is affected by the strength of our credit rating and market conditions. Our credit ratings are periodically reviewed by the major independent debt-rating agencies. As of December 31, 2019, Standard and Poor’s (S&P), Fitch, and Moody’s have ratings on our long-term debt of A, A and A2 and short-term debt of A-1, and P1. S&P, Fitch and Moody’s have Honeywell’s rating outlook as “stable.”\nWe also have a current shelf registration statement filed with the Securities and Exchange Commission under which we may issue additional debt securities, common stock and preferred stock that may be offered in one or more offerings on terms to be determined at the time of the offering. Net proceeds of any offering would be used for general corporate purposes, including repayment of existing indebtedness, share repurchases, capital expenditures and acquisitions.\nSee Note 2 Acquisitions and Divestitures and Note 13 Long-term Debt and Credit Agreements of Notes to Consolidated Financial Statements for additional discussion of items impacting our liquidity.\nIn 2019, we repurchased $4,400 million of outstanding shares to offset the dilutive impact of employee stock based compensation plans, including option exercises, restricted unit vesting and matching contributions under our savings plans, and to reduce share count when attractive opportunities arise. On April 29, 2019, the Board of Directors authorized the repurchase of up to a total of $10.0 billion of Honeywell common stock, of which $7.0 billion remained available as of December 31, 2019 for additional share repurchases. This authorization included amounts remaining under and replaced the previously approved share repurchase program. We expect to repurchase outstanding shares from time to time to offset the dilutive impact of employee stock based compensation plans, including option exercises, restricted unit vesting and matching contributions under our savings plans. We will continue to seek to reduce share count via share repurchases when attractive opportunities arise.\nIn addition to our normal operating cash requirements, our principal future cash requirements will be to fund capital expenditures, share repurchases, dividends, strategic acquisitions and debt repayments.\nSpecifically, we expect our primary cash requirements in 2020 to be as follows:\n•\nCapital expenditures-we expect to spend approximately $900 million for capital expenditures in 2020 primarily for growth, production and capacity expansion, cost reduction, maintenance, and replacement.\n•\nShare repurchases-under our share repurchase program, $7.0 billion is available as of December 31, 2019 for additional share repurchases. We expect to repurchase outstanding shares from time to time to offset the dilutive impact of employee stock-based compensation plans, including option exercises, restricted unit vesting and matching contributions under our savings plans. Additionally, we will seek to reduce share count via share repurchases as and when attractive opportunities arise. The amount and timing of future repurchases may vary depending on market conditions and our level of operating, financing and other investing activities.\n•\nDividends-we increased our quarterly dividend rate by 10% to $0.90 per share of common stock effective with the fourth quarter 2019 dividend. We intend to continue to pay quarterly dividends in 2020.\nWe continuously assess the relative strength of each business in our portfolio as to strategic fit, market position, profit and cash flow contribution in order to identify target investment and acquisition opportunities in order to upgrade our combined portfolio. We identify acquisition candidates that will further our strategic plan and strengthen our existing core businesses. We also identify businesses that do not fit into our long-term strategic plan based on their market position, relative profitability or growth potential. These businesses are considered for potential divestiture, restructuring or other repositioning actions subject to regulatory constraints.\nBased on past performance and current expectations, we believe that our operating cash flows will be sufficient to meet our future operating cash needs. Our available cash, committed credit lines and access to the public debt and equity markets, provide additional sources of short-term and long-term liquidity to fund current operations, debt maturities, and future investment opportunities.\nContractual Obligations\nFollowing is a summary of our significant contractual obligations and probable liability payments at December 31, 2019:\n(1)\nAssumes all long-term debt is outstanding until scheduled maturity.\n(2)\nPurchase obligations are entered into with various vendors in the normal course of business and are consistent with our expected requirements.\n(3)\nThe payment amounts in the table only reflect the environmental liabilities which are probable and reasonably estimable as of December 31, 2019.\n(4)\nThese amounts are estimates of asbestos related cash payments for NARCO and Bendix based on our asbestos related liabilities which are probable and reasonably estimable as of December 31, 2019. See Asbestos Matters in Note 20 Commitments and Contingencies of Notes to Consolidated Financial Statements for additional information.\n(5)\nThese amounts represent our insurance recoveries that are deemed probable for asbestos related liabilities as of December 31, 2019. See Asbestos Matters in Note 20 Commitments and Contingencies of Notes to Consolidated Financial Statements for additional information.\n(6)\nThe table excludes tax liability payments, including those for unrecognized tax benefits. See Note 5 Income Taxes of Notes to Consolidated Financial Statements for additional information.\n(7)\nThe table excludes expected proceeds from the indemnification and reimbursement agreements entered into with Garrett and Resideo. See Note 20 Commitments and Contingencies of Notes to Consolidated Financial Statements for additional information.\nAsbestos Matters\nPayments, net of insurance recoveries, related to known asbestos matters was $163 million, $216 million and $239 million in 2019, 2018 and 2017 and is estimated to be approximately $320 million in 2020. We expect to pay these asbestos matters from operating cash flows. The timing of these payments depends on several factors, including the timing of litigation and settlements of liability claims.\nReimbursements from Garrett for payments related to asbestos matters, as defined in the indemnification and reimbursement agreement, was $152 million in 2019 and is expected to be approximately $115 million in 2020. We received approximately $36 million in January 2020.\nSee Note 20 Commitments and Contingencies of Notes to Consolidated Financial Statements for further discussion of our asbestos matters and the indemnification and reimbursement agreement entered into with Garrett.\nEnvironmental Matters\nAccruals for environmental matters deemed probable and reasonably estimable were $213 million, $395 million and $287 million in 2019, 2018 and 2017. In addition, in 2019, 2018 and 2017 we incurred operating costs for ongoing businesses of approximately $99 million, $95 million and $82 million relating to compliance with environmental regulations.\nPayments related to known environmental matters was $256 million, $218 million and $212 million in 2019, 2018 and 2017 and is estimated to be approximately $220 million in 2020. We expect to pay these environmental matters from operating cash flows. The timing of these payments depends on several factors, including the timing of litigation and settlements of remediation liability, personal injury and property damage claims, regulatory approval of cleanup projects, execution timeframe of projects, remedial techniques to be utilized and agreement with other parties.\nReimbursements from Resideo for payments related to environmental matters at certain sites, as defined in the indemnification and reimbursement agreement, was $140 million in 2019 and is expected to be $140 million in 2020. We received approximately $35 million in January 2020.\nSee Note 20 Commitments and Contingencies of Notes to Consolidated Financial Statements for further discussion of our environmental matters and the indemnification and reimbursement agreement entered into with Resideo.\nFinancial Instruments\nThe following table illustrates the potential change in fair value for interest rate sensitive instruments based on a hypothetical immediate one percentage point increase in interest rates across all maturities and the potential change in fair value for foreign exchange rate sensitive instruments based on a 10% weakening of the U.S. Dollar versus local currency exchange rates across all maturities at December 31, 2019 and 2018.\n(1)\nAsset or (liability)\n(2)\nA hypothetical immediate one percentage point decrease in interest rates across all maturities and a potential change in fair value of foreign exchange rate sensitive instruments based on a 10% strengthening of the U.S. dollar versus local currency exchange rates across all maturities will result in a change in fair value approximately equal to the inverse of the amount disclosed in the table.\n(3)\nChanges in the fair value of foreign currency exchange contracts are offset by changes in the fair value, cash flows, or net investments of underlying hedged foreign currency transactions or foreign operations.\nSee Note 15 Financial Instruments and Fair Value Measures of Notes to Consolidated Financial Statements for further discussion on the agreements.\nCRITICAL ACCOUNTING ESTIMATES\nThe preparation of our consolidated financial statements in accordance with generally accepted accounting principles is based on the selection and application of accounting policies that require us to make significant estimates and assumptions about the effects of matters that are inherently uncertain. Many estimates and assumptions involved in the application of accounting principles have a material impact on reported financial condition and operating performance and on the comparability of such reported information over different reporting periods. Critical accounting estimates or assumptions are those where the nature of the estimates or assumptions is material due to the levels of subjectivity and judgment necessary to account for highly uncertain matters or the susceptibility of such matters to change, and the impact of the estimates and assumptions on financial condition or operating performance is material. We consider the estimates and assumptions discussed below to be critical to the understanding of our financial statements. Actual results could differ from our estimates and assumptions, and any such differences could be material to our consolidated financial statements.\nContingent Liabilities-We are subject to a number of lawsuits, investigations and claims (some of which involve substantial dollar amounts) that arise out of the conduct of our global business operations or those of previously owned entities, including matters relating to commercial transactions, government contracts, product liability (including asbestos), prior acquisitions and divestitures, employee benefit plans, intellectual property, legal and environmental, health and safety matters. We continually assess the likelihood of any adverse judgments or outcomes to our contingencies, as well as potential amounts or ranges of probable losses, and recognize a liability, if any, for these contingencies based on a thorough analysis of each matter with the assistance of outside legal counsel and, if applicable, other experts. Such analysis includes making judgments concerning matters such as the costs associated with environmental matters, the outcome of negotiations, the number and cost of pending and future asbestos claims, and the impact of evidentiary requirements. Because most contingencies are resolved over long periods of time, liabilities may change in the future due to new developments (including new discovery of facts, changes in legislation and outcomes of similar cases through the judicial system), changes in assumptions or changes in our settlement strategy. See Note 20 Commitments and Contingencies of Notes to Consolidated Financial Statements for a discussion of management’s judgment applied in the recognition and measurement of our environmental and asbestos liabilities which represent our most significant contingencies.\nAsbestos Related Liabilities and Insurance Recoveries-In connection with the recognition of liabilities for asbestos related matters, we record asbestos related insurance recoveries that are deemed probable. In assessing the probability of insurance recovery, we make judgments concerning insurance coverage that we believe are reasonable and consistent with our historical dealings and our knowledge of any pertinent solvency issues surrounding insurers. While the substantial majority of our insurance carriers are solvent, some of our individual carriers are insolvent, which has been considered in our analysis of probable recoveries. Projecting future events is subject to various uncertainties that could cause the insurance recovery on asbestos related liabilities to be higher or lower than that projected and recorded. Given the inherent uncertainty in making future projections, we reevaluate our projections concerning our probable insurance recoveries considering any changes to the projected liability, our recovery experience or other relevant factors that may impact future insurance recoveries.\nOur involvement in asbestos related personal injury actions relates to two predecessor companies. Regarding North American Refractories Company (“NARCO”) asbestos related claims, we accrue for pending claims based on terms and conditions in agreements with NARCO, its former parent company, and certain asbestos claimants, and an estimate of the unsettled claims pending as of the time NARCO filed for bankruptcy protection. We also accrue for the estimated value of future NARCO asbestos related claims expected to be asserted against the NARCO Trust. The estimate of future NARCO claims was prepared in 2002, in the same year NARCO filed for bankruptcy protection, using NARCO tort system litigation experience based on a commonly accepted methodology used by numerous bankruptcy courts addressing 524(g) trusts. Accordingly, the estimated value of future NARCO asbestos claims was prepared before there was data on claims filings and payment rates in the NARCO Trust under the Trust Distribution Procedures and prepared when the stay of all NARCO asbestos claims was in effect (which remained in effect until NARCO emerged from Bankruptcy protection). Some critical assumptions underlying this commonly accepted methodology included claims filing rates, disease criteria and payment values contained in the Trust Distribution Procedures, estimated approval rates of claims submitted to the NARCO Trust and epidemiological studies estimating disease instances. This estimate resulted in a range of estimated liability of $743 million to $961 million. We believe that no amount within this range is a better estimate than any other amount and accordingly, we have recorded the minimum amount in the range. Given the Trust’s lack of sufficiently reliable claims data since NARCO emerged from bankruptcy protection, it is not yet possible to update our estimated future claim costs based on actual NARCO Trust experience. When sufficiently reliable claims data exists, we will update our estimate of the NARCO Trust Liability and it is possible that a material change may need to be recognized. Regarding Bendix Friction Materials (“Bendix”) asbestos related claims, we accrued for the estimated value of pending claims using average resolution values for the previous\nfive years. We also accrued for the estimated value of future claims related to Bendix over the full term of epidemiological projections through 2059 based on historic and anticipated claims filing experience and dismissal rates, disease classifications, and average resolution values in the tort system for the previous five years.\nSee Note 20 Commitments and Contingencies of Notes to Consolidated Financial Statements for a discussion of management’s judgments applied in the recognition and measurement of our asbestos-related liabilities and related insurance recoveries.\nReimbursement Receivables-In conjunction with the Garrett and Resideo spin-offs, the Company entered into reimbursement agreements under which Honeywell receives cash payments as reimbursement primarily for asbestos related liability payments related to the Bendix business in the U.S. (Garrett) and net spending for environmental matters at certain sites as defined in the agreement (Resideo). Accordingly, the Company has recorded a receivable based on estimates in the underlying reimbursable Honeywell spend, and we monitor the recoverability of such receivable, which is subject to terms of applicable credit agreements and general ability to pay.\nSee Note 20 Commitments and Contingencies of Notes to Consolidated Financial Statements for a discussion of the recognition and measurement of our reimbursement receivables.\nDefined Benefit Pension Plans-We sponsor both funded and unfunded U.S. and non-U.S. defined benefit pension plans. For financial reporting purposes, net periodic pension (income) expense is calculated annually based upon a number of actuarial assumptions, including a discount rate for plan obligations and an expected long-term rate of return on plan assets. Changes in the discount rate and expected long-term rate of return on plan assets could materially affect the annual pension (income) expense amount. Annual pension (income) expense is comprised of service and interest cost, assumed return on plan assets, prior service amortization (Pension Ongoing (Income) Expense) and a potential mark-to-market adjustment (MTM Adjustment).\nThe key assumptions used in developing our 2019, 2018 and 2017 net periodic pension (income) expense for our U.S. plans included the following:\nThe MTM Adjustment represents the recognition of net actuarial gains or losses in excess of 10% of the greater of the fair value of plan assets or the plans’ projected benefit obligation (the corridor). Net actuarial gains and losses occur when the actual experience differs from any of the various assumptions used to value our pension plans or when assumptions change. The primary factors contributing to actuarial gains and losses are changes in the discount rate used to value pension obligations as of the measurement date each year and the difference between expected and actual returns on plan assets. The mark-to-market accounting method results in the potential for volatile and difficult to forecast MTM Adjustments. MTM charges were $123 million, $37 million and $87 million in 2019, 2018 and 2017.\nWe determine the expected long-term rate of return on plan assets utilizing historical plan asset returns over varying long-term periods combined with our expectations of future market conditions and asset mix considerations (see Note 21 Pension and Other Postretirement Benefits of Notes to Consolidated Financial Statements for details on the actual various asset classes and targeted asset allocation percentages for our pension plans). We plan to use an expected rate of return on plan assets of 6.15% for 2020 down from 6.75% for 2019 reflecting a decline in interest rates and additional re-balancing of assets to more fixed income.\nThe discount rate reflects the market rate on December 31 (measurement date) for high-quality fixed-income investments with maturities corresponding to our benefit obligations and is subject to change each year. The discount rate can be volatile from year to year as it is determined based upon prevailing interest rates as of the measurement date. We used a 3.22% discount rate to determine benefit obligations as of December 31, 2019, reflecting a decrease in the market interest rate environment since the prior year-end.\nIn addition to the potential for MTM Adjustments, changes in our expected rate of return on plan assets and discount rate resulting from economic events also affects future pension ongoing (income) expense. The following table highlights the sensitivity of our U.S. pension obligations and ongoing (income) expense to changes in these assumptions, assuming all other assumptions remain constant. These estimates exclude any potential MTM Adjustment:\nPension ongoing income for our world-wide pension plans is expected to be approximately $786 million in 2020 compared with pension ongoing income of $592 million in 2019. The expected increase in pension income is primarily due to lower interest cost from a decrease in discount rates in our U.S. and UK plans, and higher expected return on plan assets (lower rate of return on a higher asset base). Also, if required, an MTM Adjustment will be recorded in the fourth quarter of 2020 in accordance with our pension accounting method as previously described. It is difficult to reliably forecast or predict whether there will be a MTM Adjustment in 2020, and if one is required, what the magnitude of such adjustment will be. MTM Adjustments are primarily driven by events and circumstances beyond the control of the Company such as changes in interest rates and the performance of the financial markets.\nFinite-Lived Intangible Assets-The determination of useful lives (for depreciation/amortization purposes) and whether or not intangible assets are impaired involves the use of accounting estimates and assumptions, changes in which could materially impact our financial condition or operating performance if actual results differ from such estimates and assumptions. We evaluate the recoverability of the carrying amount of our finite-lived intangible assets whenever events or changes in circumstances indicate that the carrying amount of a finite-lived intangible asset group may not be fully recoverable. The principal factors in considering when to perform an impairment review are as follows:\n•\nSignificant under-performance (i.e., declines in sales, earnings or cash flows) of a business or product line in relation to expectations;\n•\nAnnual operating plans or strategic plan outlook that indicate an unfavorable trend in operating performance of a business or product line;\n•\nSignificant negative industry or economic trends; or\n•\nSignificant changes or planned changes in our use of the assets.\nOnce it is determined that an impairment review is necessary, recoverability of assets is measured by comparing the carrying amount of the asset grouping to the estimated future undiscounted cash flows. If the carrying amount exceeds the estimated future undiscounted cash flows, the asset grouping is considered to be impaired. The impairment is then measured as the difference between the carrying amount of the asset grouping and its fair value. We endeavor to utilize the best information available to measure fair value, which is usually either market prices (if available), level 1 or level 2 of the fair value hierarchy, or an estimate of the future discounted cash flow, level 3 of the fair value hierarchy. The key estimates in our discounted cash flow analysis include assumptions as to expected industry and business growth rates, sales volume, selling prices and costs, cash flows, and the discount rate selected. These estimates are subject to changes in the economic environment, including market interest rates and expected volatility. Management believes the estimates of future cash flows and fair values are reasonable; however, changes in estimates due to variance from assumptions could materially affect the valuations.\nGoodwill and Indefinite-Lived Intangible Assets Impairment Testing-Goodwill and intangible assets deemed to have indefinite lives are not amortized, but are subject to annual, or more frequent if necessary, impairment testing. In testing goodwill and indefinite-lived intangible assets, the fair value is estimated utilizing a discounted cash flow approach utilizing cash flow forecasts, including strategic and annual operating plans, adjusted for terminal value assumptions. These impairment tests involve the use of accounting estimates and assumptions, changes in which could materially impact our financial condition or operating performance if actual results differ from such estimates and assumptions. To address this uncertainty, we perform sensitivity analysis on key estimates and assumptions.\nIncome Taxes-On a recurring basis, we assess the need for a valuation allowance against our deferred tax assets by considering all available positive and negative evidence, such as past operating results, projections of future taxable income, enacted tax law changes and the feasibility and impact of tax planning initiatives. Our projections of future taxable income include a number of estimates and assumptions regarding our volume, pricing and costs, as well as the timing and amount of reversals of taxable temporary differences.\nWe recognize tax benefits from uncertain tax positions only if it is more likely than not that the tax position will be sustained on examination by the taxing authorities including resolution of any related appeals and litigation. We assess our income tax positions based upon our evaluation of the facts, circumstances and information available at the reporting date. The tax benefits recognized in the financial statements from such positions are then measured based on the largest benefit that has a greater than 50% likelihood of being realized upon ultimate settlement with a taxing authority that has full knowledge of all relevant information. For those income tax positions where it is not more likely than not that a tax benefit will be sustained, no tax benefit has been recognized in the financial statements.\nFor further discussion of additional income tax policies, see Note 1 Summary of Significant Accounting Policies and Note 5 Income Taxes of Notes to Consolidated Financial Statements.\nSales Recognition on Long-Term Contracts-We recognize sales for long-term contracts with performance obligations satisfied over time using either an input or output method. We recognize revenue over time as we perform on these contracts based on the continuous transfer of control to the customer. With control transferring over time, revenue is recognized based on the extent of progress towards completion of the performance obligation. We generally use the cost-to-cost input method of progress for our contracts because it best depicts the transfer of control to the customer that occurs as we incur costs. Under the cost-to-cost method, the extent of progress towards completion is measured based on the proportion of costs incurred to date to the total estimated costs at completion of the performance obligation. Due to the nature of the work required to be performed on many of our performance obligations, the estimation of total revenue and cost at completion requires judgment. Contract revenues are largely determined by negotiated contract prices and quantities, modified by our assumptions regarding contract options, change orders, incentive and award provisions associated with technical performance and price adjustment clauses (such as inflation or index-based clauses). Cost estimates are largely based on negotiated or estimated purchase contract terms, historical performance trends and other economic projections. Significant factors that influence these estimates include inflationary trends, technical and schedule risk, internal and subcontractor performance trends, business volume assumptions, asset utilization, and anticipated labor agreements. Revenue and cost estimates are regularly monitored and revised based on changes in circumstances. Impacts from changes in estimates of net sales and cost of sales are recognized on a cumulative catch-up basis, which recognizes in the current period the cumulative effect of the changes on current and prior periods based on a performance obligation’s percentage of completion. Anticipated losses on long-term contracts are recognized when such losses become evident. We maintain financial controls over the customer qualification, contract pricing and estimation processes to reduce the risk of contract losses.\nOTHER MATTERS\nLitigation\nSee Note 20 Commitments and Contingencies of Notes to Consolidated Financial Statements for a discussion of environmental, asbestos and other litigation matters.\nRecent Accounting Pronouncements\nSee Note 1 Summary of Significant Accounting Policies of Notes to Consolidated Financial Statements for a discussion of recent accounting pronouncements.",
    "item_7A": "Item 7A. Quantitative and Qualitative Disclosures About Market Risks\nInformation relating to market risks is included in Item 7. Management’s Discussion and Analysis of Financial Condition and Results of Operations under the caption “Financial Instruments”.",
    "item_8": "Item 8. Financial Statements and Supplementary Data\nHONEYWELL INTERNATIONAL INC.\nCONSOLIDATED STATEMENT OF OPERATIONS\nThe Notes to Consolidated Financial Statements are an integral part of this statement.\nHONEYWELL INTERNATIONAL INC.\nCONSOLIDATED STATEMENT OF COMPREHENSIVE INCOME\nThe Notes to Consolidated Financial Statements are an integral part of this statement.\nHONEYWELL INTERNATIONAL INC.\nCONSOLIDATED BALANCE SHEET\nThe Notes to Consolidated Financial Statements are an integral part of this statement.\nHONEYWELL INTERNATIONAL INC.\nCONSOLIDATED STATEMENT OF CASH FLOWS\nThe Notes to Consolidated Financial Statements are an integral part of this statement.\nHONEYWELL INTERNATIONAL INC.\nCONSOLIDATED STATEMENT OF SHAREOWNERS’ EQUITY\nThe Notes to Consolidated Financial Statements are an integral part of this statement.\nHONEYWELL INTERNATIONAL INC.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\n(Dollars in millions, except per share amounts)\nNote 1. Summary of Significant Accounting Policies\nAccounting Principles-The financial statements and accompanying notes are prepared in accordance with accounting principles generally accepted in the United States of America. The following is a description of Honeywell’s significant accounting policies.\nPrinciples of Consolidation-The consolidated financial statements include the accounts of Honeywell International Inc. and all of its subsidiaries and entities in which a controlling interest is maintained. Our consolidation policy requires equity investments that we exercise significant influence over but do not control the investee and are not the primary beneficiary of the investee’s activities to be accounted for using the equity method. Investments through which we are not able to exercise significant influence over the investee and which we do not have readily determinable fair values are accounted for under the cost method. All intercompany transactions and balances are eliminated in consolidation.\nProperty, Plant and Equipment-Property, plant and equipment are recorded at cost, including any asset retirement obligations, less accumulated depreciation. For financial reporting, the straight-line method of depreciation is used over the estimated useful lives of 10 to 50 years for buildings and improvements and 2 to 16 years for machinery and equipment. Recognition of the fair value of obligations associated with the retirement of tangible long-lived assets is required when there is a legal obligation to incur such costs. Upon initial recognition of a liability, the cost is capitalized as part of the related long-lived asset and depreciated over the corresponding asset’s useful life.\nGoodwill and Indefinite-Lived Intangible Assets-Goodwill and indefinite-lived intangible assets are subject to impairment testing annually as of March 31, and whenever events or changes in circumstances indicate that the carrying amount may not be fully recoverable. This testing compares carrying values to fair values and, when appropriate, the carrying value of these assets is reduced to fair value. We completed our annual goodwill impairment test as of March 31, 2019 and determined that there was no impairment as of that date.\nOther Intangible Assets with Determinable Lives-Other intangible assets with determinable lives consist of customer lists, technology, patents and trademarks and other intangibles and are amortized over their estimated useful lives, ranging from 2 to 24 years.\nSales Recognition-Product and service sales are recognized when or as the Company transfers control of the promised products or services to its customers. Revenue is measured as the amount of consideration we expect to receive in exchange for transferring goods or providing services. Service sales, principally representing repair, maintenance and engineering activities are recognized over the contractual period or as services are rendered. Sales under long-term contracts with performance obligations satisfied over time are recognized using either an input or output method. We recognize revenue over time as we perform on these contracts because of the continuous transfer of control to the customer. With control transferring over time, revenue is recognized based on the extent of progress towards completion of the performance obligation. We generally use the cost-to-cost input method of progress for our contracts because it best depicts the transfer of control to the customer that occurs as we incur costs. Under the cost-to-cost method, the extent of progress towards completion is measured based on the proportion of costs incurred to date to the total estimated costs at completion of the performance obligation. We review our cost estimates on significant contracts on a periodic basis, or when circumstances change and warrant a modification to a previous estimate. Cost estimates are largely based on negotiated or estimated purchase contract terms, historical performance trends and other economic projections. Significant factors that influence these estimates include inflationary trends, technical and schedule risk, internal and subcontractor performance trends, business volume assumptions, asset utilization, and anticipated labor agreements. Provisions for anticipated losses on long-term contracts are recorded in full when such losses become evident, to the extent required.\nThe customer funding for costs incurred for nonrecurring engineering and development activities of our products under agreements with commercial customers is deferred and subsequently recognized as revenue as products are delivered to the customers. Additionally, expenses incurred, up to the customer agreed funded amount, are deferred as an asset and recognized as cost of sales when products are delivered to the customer. The deferred customer funding and costs result in recognition of deferred costs (asset) and deferred revenue (liability) on our Consolidated Balance Sheet. Capitalized contract fulfillment costs were approximately $1 billion as of December 31, 2019 and 2018. The amounts recognized as cost of sales were approximately $0.1 billion for the years ended December 31, 2019 and 2018.\nHONEYWELL INTERNATIONAL INC.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS-(Continued)\n(Dollars in millions, except per share amounts)\nRevenues for our mechanical service programs are recognized as performance obligations are satisfied over time, with recognition reflecting a series of distinct services using the output method.\nThe terms of a contract or the historical business practice can give rise to variable consideration due to, but not limited to, cash-based incentives, rebates, performance awards, or credits. We estimate variable consideration at the most likely amount we will receive from customers. We include estimated amounts in the transaction price to the extent it is probable that a significant reversal of cumulative revenue recognized for such transaction will not occur, or when the uncertainty associated with the variable consideration is resolved. Our estimates of variable consideration and determination of whether to include estimated amounts in the transaction price are based largely on an assessment of our anticipated performance and all information (historical, current and forecasted) that is reasonably available to us.\nFor the year ended 2017, prior to the adoption of the revenue recognition standard (see Note 7 Revenue Recognition and Contracts with Customers), product and service sales were recognized when persuasive evidence of an arrangement existed, product delivery had occurred or services had been rendered, pricing was fixed or determinable, and collection was reasonably assured. Service sales, principally representing repair, maintenance and engineering activities were recognized over the contractual period or as services were rendered. Sales under long-term contracts were recorded on a percentage-of-completion method measured on the cost-to-cost basis for engineering-type contracts and the units-of-delivery basis for production-type contracts. Provisions for anticipated losses on long-term contracts were recorded in full when such losses became evident. Revenues from contracts with multiple element arrangements were recognized as each element was earned based on the relative fair value of each element provided the delivered elements had value to customers on a standalone basis. Amounts allocated to each element were based on its objectively determined fair value, such as the sales price for the product or service when it was sold separately or competitor prices for similar products or services.\nEnvironmental-The Company accrues costs related to environmental matters when it is probable that we have incurred a liability related to a contaminated site and the amount can be reasonably estimated. For additional information, see Note 20 Commitments and Contingencies.\nAsbestos Related Liabilities and Insurance Recoveries-The Company recognizes a liability for any asbestos related contingency that is probable of occurrence and reasonably estimable. In connection with the recognition of liabilities for asbestos related matters, we record asbestos related insurance recoveries that are deemed probable. For additional information, see Note 20 Commitments and Contingencies.\nReimbursement Receivables-In conjunction with the Garrett Motion Inc. (“Garrett”) and Resideo Technologies, Inc. (“Resideo”) spin-offs, the Company entered into reimbursement agreements under which Honeywell receives cash payments as reimbursement primarily for asbestos related liability payments related to the Bendix business in the U.S. (Garrett) and net spending for environmental matters at certain sites as defined in the agreement (Resideo). Accordingly, the Company has recorded a receivable based on estimates in the underlying reimbursable Honeywell spend, and we monitor the recoverability of such receivable, which is subject to terms of applicable credit agreements and general ability to pay. For additional information, see Note 20 Commitments and Contingencies.\nAerospace Sales Incentives-The Company provides sales incentives to commercial aircraft manufacturers and airlines in connection with their selection of its aircraft equipment, predominately wheel and braking system hardware, avionics, and auxiliary power units, for installation on commercial aircraft. These incentives consist of free or deeply discounted products, credits for future purchases of product or upfront cash payments. These costs are generally recognized in the period incurred as cost of products sold or as a reduction to relevant sales, as appropriate.\nResearch and Development-Research and development costs for company-sponsored research and development projects are expensed as incurred. Such costs are included in cost of products and services sold and were $1,556 million, $1,809 million and $1,835 million in 2019, 2018 and 2017. Customer-sponsored research and development activities under contracts with customers are included as a contract cost and included in cost of products and services sold when revenue from such contracts is recognized. Such customer-sponsored research and development activities amounted to an additional $1,079 million, $1,069 million and $876 million in 2019, 2018 and 2017.\nHONEYWELL INTERNATIONAL INC.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS-(Continued)\n(Dollars in millions, except per share amounts)\nStock-Based Compensation Plans-The principal awards issued under our stock-based compensation plans, which are described in Note 19 Stock-Based Compensation Plans, are non-qualified stock options and restricted stock units. The cost for such awards is measured at the grant date based on the fair value of the award. The value of the portion of the award that is ultimately expected to vest is recognized as expense over the requisite service periods (generally the vesting period of the equity award) and is included in selling, general and administrative expenses. Forfeitures are estimated at the time of grant to recognize expense for those awards that are expected to vest and are based on our historical forfeiture rates.\nPension Benefits-The Company presents net periodic pensions costs by disaggregating the service cost component of net benefit costs and reports those costs in the same line item or items in the Consolidated Statement of Operations as other compensation costs arising from services rendered by the pertinent employees during the period. The other non-service components of net benefit costs are required to be presented separately from the service cost component.\nThe Company records the service cost component of Pension ongoing (income) expense in Costs of products and services sold and Selling, general and administrative expenses. The remaining components of net benefit costs within Pension ongoing (income) expense, primarily interest costs and assumed return on plan assets, are recorded in Other (income) expense. We recognize net actuarial gains or losses in excess of 10% of the greater of the fair value of plan assets or the plans’ projected benefit obligation (the corridor) annually in the fourth quarter each year (MTM Adjustment). The MTM Adjustment is also reported in Other (income) expense.\nForeign Currency Translation-Assets and liabilities of subsidiaries operating outside the United States with a functional currency other than U.S. Dollars are translated into U.S. Dollars using year-end exchange rates. Sales, costs and expenses are translated at the average exchange rates in effect during the year. Foreign currency translation gains and losses are included as a component of Accumulated other comprehensive income (loss). For subsidiaries operating in highly inflationary environments, inventories and property, plant and equipment, including related expenses, are remeasured at the exchange rate in effect on the date the assets were acquired, while monetary assets and liabilities are remeasured at year-end exchange rates. Remeasurement adjustments for these subsidiaries are included in earnings.\nDerivative Financial Instruments-The Company reduces our risks from interest and foreign currency exchange rate fluctuations through our normal operating and financing activities and, when deemed appropriate through the use of derivative financial instruments. Derivative financial instruments are used to manage risk and are not used for trading or other speculative purposes. We do not use leveraged derivative financial instruments. Derivative financial instruments that qualify for hedge accounting must be designated and effective as a hedge of the identified risk exposure at the inception of the contract. Accordingly, changes in fair value of the derivative contract must be highly correlated with changes in fair value of the underlying hedged item at inception of the hedge and over the life of the hedge contract.\nAll derivatives are recorded on the balance sheet as assets or liabilities and measured at fair value. For derivatives designated as hedges of the fair value of assets or liabilities, the changes in fair values of both the derivatives and the hedged items are recorded in current earnings. For derivatives designated as cash flow hedges, the changes in fair value of the derivatives are recorded in Accumulated other comprehensive income (loss) and subsequently recognized in earnings when the hedged items impact earnings. Cash flows of such derivative financial instruments are classified consistent with the underlying hedged item. We have elected to exclude the time value of the derivatives (i.e., the forward points) from the assessment of hedge effectiveness and recognize the initial value of the excluded component in earnings using the amortization approach. For derivative instruments that are designated and qualify as a net investment hedge, the gain or loss is reported as a component of Other comprehensive income (loss) and recorded in Accumulated other comprehensive income (loss). The gain or loss will be subsequently reclassified into net earnings when the hedged net investment is either sold or substantially liquidated.\nHONEYWELL INTERNATIONAL INC.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS-(Continued)\n(Dollars in millions, except per share amounts)\nIncome Taxes-Significant judgment is required in evaluating tax positions. We establish reserves for income taxes when, despite the belief that tax positions are fully supportable, there remain certain positions that do not meet the minimum recognition threshold. The approach for evaluating certain and uncertain tax positions is defined by the authoritative guidance which determines when a tax position is more likely than not to be sustained upon examination by the applicable taxing authority. In the normal course of business, the Company and its subsidiaries are examined by various federal, state and foreign tax authorities. We regularly assess the potential outcomes of these examinations and any future examinations for the current or prior years in determining the adequacy of our provision for income taxes. We continually assess the likelihood and amount of potential adjustments and adjust the income tax provision, the current tax liability and deferred taxes in the period in which the facts that give rise to a change in estimate become known. For discussion of the impacts from what is commonly referred to as the U.S. Tax Cuts and Jobs Act (“U.S Tax Reform”), see Note 5 Income Taxes.\nCash and cash equivalents-Cash and cash equivalents include cash on hand and highly liquid investments having an original maturity of three months or less.\nEarnings Per Share-Basic earnings per share is based on the weighted average number of common shares outstanding. Diluted earnings per share is based on the weighted average number of common shares outstanding and all dilutive potential common shares outstanding.\nReclassifications-Certain prior year amounts have been reclassified to conform to the current year presentation.\nLeases-At the inception of a contract, the Company assesses whether the contract is, or contains, a lease. The assessment is based on (1) whether the contract involves the use of a distinct identified asset, (2) whether the Company obtains the right to substantially all the economic benefit from the use of the asset throughout the period, and (3) whether the Company has the right to direct the use of the asset.\nAll significant lease arrangements are generally recognized at lease commencement. Operating lease right-of-use (“ROU”) assets and lease liabilities are recognized at commencement. An ROU asset and corresponding lease liability are not recorded for leases with an initial term of 12 months or less (short term leases), and we recognize lease expense for these leases as incurred over the lease term.\nROU assets represent our right to use an underlying asset during the reasonably certain lease term, and lease liabilities represent our obligation to make lease payments arising from the lease. Our lease terms may include options to extend or terminate the lease when it is reasonably certain that we will exercise that option.\nOperating lease ROU assets and liabilities are recognized at commencement date based on the present value of lease payments over the lease term. Lease payments may be fixed or variable, however, only fixed payments or in-substance fixed payments are included in determining the lease liability. Variable lease payments are recognized in operating expenses in the period in which the obligation for those payments are incurred. The operating lease ROU asset also includes any lease payments related to initial direct cost and prepayments and excludes lease incentives. Lease expense is recognized on a straight-line basis over the lease term. We have lease agreements with lease and non-lease components, which are generally accounted for separately.\nThe Company primarily uses our incremental borrowing rate, which is based on the information available at the lease commencement date, in determining the present value of the lease payments. In determining the borrowing rate, we consider the lease term, secured incremental borrowing rate, and for leases denominated in a currency different than U.S. dollar, the collateralized borrowing rate in the foreign currency using the U.S. dollar and foreign currency swap spread, when available.\nRecent Accounting Pronouncements-The Company considers the applicability and impact of all Accounting Standards Updates (ASUs) issued by the Financial Accounting Standards Board (FASB). ASUs not listed below were assessed and determined to be either not applicable or are expected to have minimal impact on our consolidated results of operations, financial position and cash flows (consolidated financial statements).\nIn December 2019, the FASB issued accounting standard update to simplify the accounting for income taxes. The standard’s amendments include changes in various subtopics of accounting for income taxes including, but not limited to, accounting for “hybrid” tax regimes, tax basis step-up in goodwill obtained in a transaction that is not a business combination, intraperiod tax allocation exception to incremental approach, ownership changes in investments, interim-period accounting for enacted changes in tax law, and year-to date loss limitation in interim-period tax accounting. The guidance is effective for fiscal years beginning after December 15, 2020 with early adoption permitted, including the\nHONEYWELL INTERNATIONAL INC.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS-(Continued)\n(Dollars in millions, except per share amounts)\ninterim periods within those years. We are currently evaluating impacts of these amendments on our Consolidated financial position, results of operations, cash flows, and related notes to the Financial Statements.\nIn February 2018, the FASB issued guidance that allows for an entity to elect to reclassify the income tax effects on items resulting from what is commonly referred to as the U.S. Tax Cuts and Jobs Act (\"U.S. Tax Reform\") from accumulated other comprehensive income to retained earnings. The guidance is effective for fiscal years beginning after December 15, 2018 with early adoption permitted, including interim periods within those years. The Company has elected to not reclassify the stranded income tax effects of U.S. Tax Reform from accumulated other comprehensive income to retained earnings.\nIn June 2016, the FASB issued accounting standard that requires companies to utilize an impairment model (current expected credit loss, or CECL) for most financial assets measured at amortized cost and certain other financial instruments, which include, but are not limited to, trade and other receivables. This accounting standard will replace the incurred loss model under current GAAP with a model that reflects expected credit losses and requires consideration of a broader range of reasonable and supportable information to estimate those losses. Effective January 1, 2020, the Company adopted this standard. The adoption of this standard does not have a material impact on our Consolidated Financial Statements.\nNote 2. Acquisitions and Divestitures\nDuring 2019, there were no significant acquisitions individually or in aggregate.\nDuring 2018, the Company acquired businesses for an aggregate cost (net of cash and debt assumed) of approximately $535 million, mainly due to the November 2018 acquisition of Transnorm, a global leader in high-performance conveyor and warehouse solutions, including approximately $380 million allocated to goodwill. Transnorm is part of Safety and Productivity Solutions. The goodwill is non-deductible for tax purposes.\nDuring 2017, there were no significant acquisitions individually or in the aggregate.\nOn October 1, 2018, the Company completed the tax-free spin-off to Honeywell shareowners of its Transportation Systems business, part of Aerospace, into a standalone publicly-traded company, Garrett Motion Inc. (“Garrett”). On October 29, 2018, the Company completed the tax-free spin-off to Honeywell shareowners of its Homes and Global Distribution business, part of Home and Building Technologies (renamed Honeywell Building Technologies following the spin-off), into a standalone publicly-traded company, Resideo Technologies, Inc. (“Resideo”). The assets of approximately $5.5 billion, including approximately $2.8 billion of goodwill and net of recorded receivables, and liabilities of approximately $7.2 billion associated with spin-off entities have been removed through Retained Earnings from the Company’s Consolidated Balance Sheet as of the effective date of the spin-off. The results of operations and cash flows are included in the Consolidated Statement of Operations and Consolidated Statement of Cash Flows through the effective date of the spin-off. The Income before taxes attributable to the spin-off businesses were $0.4 billion and $0.5 billion for 2018 and 2017.\nHoneywell shareowners of record as of the close of business on October 16, 2018 received one share of Resideo common stock for every 6 shares of Honeywell common stock. Immediately prior to the effective date of the spin-off, Resideo incurred debt of $1.2 billion to make a cash distribution to the Company.\nHoneywell shareowners of record as of the close of business on September 18, 2018 received one share of Garrett common stock for every 10 shares of Honeywell common stock. Immediately prior to the effective date of the spin-off, Garrett incurred debt of $1.6 billion to make a cash distribution to the Company.\nIn 2018 in connection with the spin-off, the Company entered into certain agreements with Resideo and Garrett to affect our legal and structural separation, including transition services agreements to provide certain administrative and other services for a limited time, and tax matters and indemnification and reimbursement agreements. As of the end of 2019, most of those agreements are still in effect.\nHONEYWELL INTERNATIONAL INC.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS-(Continued)\n(Dollars in millions, except per share amounts)\nNote 3. Repositioning and Other Charges\nA summary of repositioning and other charges follows:\nThe following table summarizes the pre-tax distribution of total net repositioning and other charges by classification:\nThe following table summarizes the pre-tax impact of total net repositioning and other charges by segment:\nIn 2019, the Company recognized repositioning charges totaling $438 million including severance costs of $260 million related to workforce reductions of 5,336 manufacturing and administrative positions across our segments. The workforce reductions related to costs savings actions taken in connection with our productivity and ongoing functional transformation initiatives and to site transitions, mainly in Honeywell Building Technologies, as we transition manufacturing to more cost-effective locations. The repositioning charge included asset impairments of $95 million largely related to a write down in connection with assets held for sale. The repositioning charge included exit costs of $83 million primarily related to current period exit costs incurred for previously approved repositioning projects, termination fees associated with the early cancellation of supply agreements for certain raw materials in Performance Materials and Technologies and Honeywell Building Technologies and for closure obligations associated with site transitions.\nIn 2018, the Company recognized repositioning charges totaling $530 million including severance costs of $289 million related to workforce reductions of 6,486 manufacturing and administrative positions across our segments. The workforce reductions were primarily related to planned site closures, mainly in Safety and Productivity Solutions, Performance Materials and Technologies and Honeywell Building Technologies, as we transition manufacturing sites to more cost-effective locations. The workforce reductions were also related to our productivity and ongoing functional\nHONEYWELL INTERNATIONAL INC.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS-(Continued)\n(Dollars in millions, except per share amounts)\ntransformation initiatives. The repositioning charge included asset impairments of $162 million mainly related to manufacturing plant and equipment associated with planned site closures. Asset impairments also included the write-down of a legacy property in Corporate in connection with its planned disposition and the write-off of certain capitalized assets in Corporate. The repositioning charge included exit costs of $79 million primarily related to a termination fee associated with the early cancellation of a supply agreement for certain raw materials in Performance Materials and Technologies and for closure obligations associated with planned site closures.\nIn 2017, the Company recognized repositioning charges totaling $507 million including severance costs of $305 million related to workforce reductions of 7,096 manufacturing and administrative positions across its segments. The workforce reductions were primarily related to cost savings actions taken in connection with our productivity and ongoing functional transformation initiatives and with site transitions, in each of our segments, to more cost-effective locations. The repositioning charge included asset impairments of $142 million principally in our Corporate segment related to the write-down of legacy properties and certain equipment in connection with their planned disposition and the write-down of a research and development facility in connection with a planned exit from such facility. The repositioning charge included exit costs of $60 million principally for closure obligations associated with site transitions in each of our segments and for lease exit obligations in our Corporate segment.\nThe following table summarizes the status of the Company's total repositioning reserves:\nCertain repositioning projects will recognize exit costs in future periods when the actual liability is incurred. Such exit costs incurred in 2019, 2018 and 2017 were not significant.\nIn 2018, the other charge of $63 million mainly relates to reserves taken due to the required wind-down of the Company's activities in Iran and the evaluation of potential resolution of a certain legal matter.\nHONEYWELL INTERNATIONAL INC.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS-(Continued)\n(Dollars in millions, except per share amounts)\nNote 4. Other (Income) Expense\nSeparation costs are associated with the spin-offs of the Company's Homes and Global Distribution business and Transportation Systems business, and are primarily associated with third party services.\nFor the year ended December 31, 2018 and 2017, Other (net) includes asset impairments in Corporate related to the write-down of a legacy property in connection with its planned disposition. See Note 3 Repositioning and Other Charges.\nNote 5. Income Taxes\nIncome before taxes\nTax expense (benefit)\nHONEYWELL INTERNATIONAL INC.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS-(Continued)\n(Dollars in millions, except per share amounts)\n(1)\nNet of changes in valuation allowance\n(2)\nIncludes U.S. taxes on non-U.S. earnings\nThe effective tax rate increased by 8.8 percentage points in 2019 compared to 2018. The increase was primarily attributable to a lower income tax benefit resulting from revised guidance related to U.S. Tax Reform and internal restructuring initiatives that resulted in a $281 million reduction of accrued withholding taxes related to unremitted foreign earnings when compared to the prior year. The Company’s non-U.S. effective tax rate was 26.1%, an increase of approximately 22.0 percentage points compared to 2018. The increase in the foreign effective tax rate was primarily attributable to a lower income tax benefit related to the Company’s internal restructuring initiatives when compared to the prior year.\nThe effective tax rate decreased by 68.4 percentage points in 2018 compared to 2017. The decrease was primarily attributable to internal restructuring initiatives that resulted in a reduction of accrued withholding taxes of approximately $1.1 billion related to unremitted foreign earnings. In addition, we recorded a tax benefit of approximately $440 million as a reduction to our 2017 provisional estimate of impacts from U.S. Tax Reform, which was partially offset by $411 million of tax costs associated with the internal restructuring of the Homes and Global Distribution business and Transportation Systems business in advance of their spin-offs. The Company’s non-U.S. effective tax rate was 4.1%, a decrease of approximately 67.3 percentage points compared to 2017. The year over year decrease in the foreign effective tax rate was primarily attributable to the impact of the Company’s internal restructuring initiatives and the reduction of accrued withholding taxes on unremitted foreign earnings, partially offset by the spin-off transactions.\nHONEYWELL INTERNATIONAL INC.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS-(Continued)\n(Dollars in millions, except per share amounts)\nDeferred tax assets (liabilities)\nThe tax effects of temporary differences and tax carryforwards which give rise to future income tax benefits and payables are as follows:\nThe Company's gross deferred tax assets include $767 million related to non-U.S. operations comprised principally of net operating losses, capital loss and tax credit carryforwards (mainly in Canada, France, Germany, Luxembourg and the United Kingdom) and deductible temporary differences. We maintain a valuation allowance of $653 million against a portion of the non-U.S. gross deferred tax assets. The change in the valuation allowance resulted in a decrease of $23 million and increases of $57 million and $4 million to income tax expense in 2019, 2018 and 2017. In the event we determine that we will not be able to realize our net deferred tax assets in the future, we will reduce such amounts through an increase to income tax expense in the period such determination is made. Conversely, if we determine that we will be able to realize net deferred tax assets in excess of the carrying amounts, we will decrease the recorded valuation allowance through a reduction to income tax expense in the period that such determination is made.\nAs of December 31, 2019, the Company recorded a $419 million deferred tax liability on all of our unremitted foreign earnings based on estimated earnings and profits of approximately $16.7 billion as of the balance sheet date.\nAs of December 31, 2019, the Company's net operating loss, capital loss and tax credit carryforwards were as follows:\nHONEYWELL INTERNATIONAL INC.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS-(Continued)\n(Dollars in millions, except per share amounts)\nMany jurisdictions impose limitations on the timing and utilization of net operating loss and tax credit carryforwards. In those instances, whereby there is an expected permanent limitation on the utilization of the net operating loss or tax credit carryforward, the deferred tax asset and amount of the carryforward have been reduced.\nAs of December 31, 2019, 2018, and 2017 there were $1,164 million, $1,089 million, and $947 million of unrecognized tax benefits that if recognized would be recorded as a component of Tax expense.\nThe following table summarizes tax years that remain subject to examination by major tax jurisdictions as of December 31, 2019:\n(1)\nIncludes provincial or similar local jurisdictions, as applicable.\nBased on the outcome of these examinations, or as a result of the expiration of statute of limitations for specific jurisdictions, it is reasonably possible that certain unrecognized tax benefits for tax positions taken on previously filed tax returns will materially change from those recorded as liabilities in our financial statements. In addition, the outcome of these examinations may impact the valuation of certain deferred tax assets (such as net operating losses) in future periods.\nUnrecognized tax benefits for examinations in progress were $413 million, $304 million and $487 million, as of December 31, 2019, 2018, and 2017. Estimated interest and penalties related to the underpayment of income taxes are classified as a component of Tax expense in the Consolidated Statement of Operations and totaled $73 million, $45 million and $28 million for the years ended December 31, 2019, 2018, and 2017. Accrued interest and penalties were $487 million, $426 million and $423 million, as of December 31, 2019, 2018, and 2017.\nHONEYWELL INTERNATIONAL INC.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS-(Continued)\n(Dollars in millions, except per share amounts)\nU.S. Tax Reform\nDuring the quarter ending December 31, 2018, the Company completed the accounting for the tax effects of U.S. Tax Reform which amounted to a total tax charge of approximately $3.5 billion, most of which was recorded as a provisional estimate at the end of 2017. During 2018, we reduced our provisional estimate by approximately $440 million as a reduction to Tax expense.\nCorporate Tax Rate Change-During the years 2018 and 2017, the Company recorded a total tax benefit of approximately $190 million due to the decrease in the corporate statutory tax rate from 35% to 21%. This includes a measurement period adjustment of approximately $90 million recorded during 2018 as a reduction to Tax expense. The change in the provisional estimate primarily relates to information contained in tax returns that were filed during the quarter ending December 31, 2018, some of which require approval from U.S. tax authorities. The tax benefit from the change in tax rates results from the Company’s deferred tax liability position for the excess of its net book value over its tax basis of its U.S. assets and liabilities that will generate future taxable income in excess of book income. This additional taxable income will be subject to tax at a lower corporate tax rate, consequently reducing the Company’s deferred tax liability.\nMandatory Transition Tax-During the years 2018 and 2017, the Company recorded a total tax charge of approximately $1,950 million due to the imposition of the mandatory transition tax (“MTT”) on the deemed repatriation of undistributed foreign earnings. This includes a measurement period adjustment of approximately $50 million recorded during 2018 as an increase to Tax expense. The change in the provisional estimate primarily relates to updated amounts from tax returns that were finalized during 2018, computations based on 2018 testing dates and guidance from the taxing authorities that was received during the year. The Company has elected to pay the MTT liability over a period of eight years.\nUndistributed Foreign Earnings-During the years 2018 and 2017, the Company recorded a total tax charge of approximately $1,700 million due to the Company’s intent to no longer permanently reinvest the historical unremitted earnings of its foreign affiliates that existed as of December 31, 2017. This includes a measurement period adjustment of approximately $400 million recorded during 2018 as a reduction to Tax expense. The change in the provisional estimate primarily relates to updated amounts from tax returns that were finalized during 2018, the application of foreign tax credits based on guidance issued during the year and changes to the applicable withholding tax rates in local jurisdictions. The Company also reduced these taxes on unremitted foreign earnings by $281 million and $1.1 billion in 2019 and 2018, respectively, that were recorded as reductions to Tax expense.\nGlobal Intangible Low Taxed Income-U.S. Tax Reform imposes a U.S. tax on global intangible low taxed income (“GILTI”) that is earned by certain foreign affiliates owned by a U.S. shareholder. GILTI is generally intended to impose tax on the earnings of a foreign corporation that are deemed to exceed a certain threshold return relative to the underlying business investment. The Company has made a policy election to treat future taxes related to GILTI as a current period expense in the reporting period in which the tax is incurred.\nHONEYWELL INTERNATIONAL INC.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS-(Continued)\n(Dollars in millions, except per share amounts)\nNote 6. Earnings Per Share\nThe details of the earnings per share calculations for the years ended December 31, 2019, 2018 and 2017 are as follows:\nThe diluted earnings per share calculations exclude the effect of stock options when the options’ assumed proceeds exceed the average market price of the common shares during the period. In 2019, 2018, and 2017 the weighted number of stock options excluded from the computations were 2.5 million, 2.5 million, and 2.8 million. These stock options were outstanding at the end of each of the respective periods.\nHONEYWELL INTERNATIONAL INC.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS-(Continued)\n(Dollars in millions, except per share amounts)\nNote 7. Revenue Recognition and Contracts with Customers\nThe Company has a comprehensive offering of products and services, including software and technologies, that are sold to a variety of customers in multiple end markets. See the following disaggregated revenue table and related discussions by operating segment for details.\nAerospace - A global supplier of products, software and services for aircraft. Products include aircraft propulsion engines, auxiliary power units, environmental control systems, integrated avionics, electric power systems, hardware for engine controls, flight safety, communications and navigation, satellite and space components, aircraft wheels and brakes, and thermal systems. Software includes engine controls, flight safety, communications, navigation, radar and surveillance systems, internet connectivity and aircraft instrumentation. Services are provided to customers for the repair, overhaul, retrofit and modification of propulsion engines, auxiliary power units, avionics and mechanical systems and aircraft wheels and brakes. Additionally, Aerospace provides Honeywell Forge for aircraft connected solutions, software and data services designed to improve customers’ efficiency and enable improved operations.\nHoneywell Building Technologies - A global provider of products, software, solutions and technologies for buildings. Products include controls and displays for heating, cooling, indoor air quality, ventilation, humidification, combustion, and lighting; sensors, switches, control systems and instruments for measuring pressure, air flow, temperature and electrical current; access control; video surveillance; fire detection; and installation, maintenance and upgrades of systems that keep buildings safe, comfortable and productive. Software includes monitoring and managing heating, cooling, indoor air quality, ventilation, humidification, combustion, and lighting; advanced applications for\nHONEYWELL INTERNATIONAL INC.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS-(Continued)\n(Dollars in millions, except per share amounts)\nbuilding control and optimization; video surveillance; and remote patient monitoring systems. Installation, maintenance and upgrade services of products used in commercial building applications for heating, cooling, maintaining indoor air quality, ventilation, humidification, combustion, lighting, video surveillance and fire safety. These offerings, including Honeywell Forge for buildings connected solutions, address key energy challenges, keep people and places safe, enhance the building occupant experience, and improve critical infrastructure.\nPerformance Materials and Technologies - A global provider of products, software, solutions and technologies. Products include catalysts, adsorbents, equipment and high-performance materials, devices for measurement, regulation, control and metering of gases and electricity, and metering and communications systems for water utilities and industries, including Honeywell Forge connected solutions. Honeywell Forge for plant provides seamless integration and connectivity within plants and facilities to provide a holistic view of operations, turning data into clear actions, and Honeywell Forge for cybersecurity helps identify risks and act on cyber-related incidents, together enabling the best operations and protecting process, people and assets. Software is provided to support process technologies supporting automation and to monitor a variety of industrial processes used in industries such as oil and gas, chemicals, petrochemicals, metals, minerals and mining industries. Services are provided for installation and maintenance of products.\nSafety and Productivity Solutions - A global provider of products, software and Honeywell Forge for workers connected solutions. Products include personal protection equipment and footwear, gas detection devices, mobile computing, data collection and thermal printing devices, automation equipment for supply chain and warehouse automation and custom-engineered sensors, switches and controls. Software and solutions are provided to customers for supply chain and warehouse automation, to manage data and assets to drive productivity and for computing, data collection and thermal printing.\nFor a summary by disaggregated product and services sales for each segment, refer to Note 22 Segment Financial Data.\nThe Company recognizes revenue arising from performance obligations outlined in contracts with its customers that are satisfied at a point in time and over time. The disaggregation of our revenue based off timing of recognition is as follows:\nContract Balances\nProgress on satisfying performance obligations under contracts with customers and the related billings and cash collections are recorded on the Consolidated Balance Sheet in Accounts receivable - net and Other assets (unbilled receivables (contract assets) and billed receivables) and Accrued liabilities and Other liabilities (customer advances and deposits (contract liabilities)). Unbilled receivables (contract assets) arise when the timing of cash collected from customers differs from the timing of revenue recognition, such as when contract provisions require specific milestones to be met before a customer can be billed. Those assets are recognized when the revenue associated with the contract is recognized prior to billing and derecognized when billed in accordance with the terms of the contract. Contract liabilities are recorded when customers remit contractual cash payments in advance of us satisfying performance obligations under contractual arrangements, including those with performance obligations to be satisfied over a period of time. Contract liabilities are derecognized when revenue is recorded, either when a milestone is met triggering the contractual right to bill or when the performance obligation is satisfied.\nHONEYWELL INTERNATIONAL INC.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS-(Continued)\n(Dollars in millions, except per share amounts)\nContract balances are classified as assets or liabilities on a contract-by-contract basis at the end of each reporting period.\nThe following table summarizes the Company's contract assets and liabilities balances:\nThe net change in 2019 was primarily driven by the receipt of advance payments from customers exceeding recognition of revenue as performance obligations were satisfied prior to billing. The net change in 2018 was primarily driven by the receipt of advance payments from customers exceeding reductions from recognition of revenue as performance obligations were satisfied and related billings. For the year ended December 31, 2019 and 2018, we recognized revenue of $1,543 million and $1,166 million that was previously included in the beginning balance of contract liabilities.\nWhen contracts are modified to account for changes in contract specifications and requirements, the Company considers whether the modification either creates new or changes the existing enforceable rights and obligations. Contract modifications for goods or services and not distinct from the existing contract, due to the significant integration with the original good or service provided, are accounted for as if they were part of that existing contract. The effect of a contract modification on the transaction price and our measure of progress for the performance obligation to which it relates, is recognized as an adjustment to revenue (either as an increase in or a reduction of revenue) on a cumulative catch-up basis. When the modifications include additional performance obligations that are distinct and at relative stand-alone selling price, they are accounted for as a new contract and performance obligation, which are recognized prospectively.\nPerformance Obligations\nA performance obligation is a promise in a contract to transfer a distinct good or service to the customer, and is defined as the unit of account. A contract’s transaction price is allocated to each distinct performance obligation and recognized as revenue when, or as, the performance obligation is satisfied. When our contracts with customers require highly complex integration or manufacturing services that are not separately identifiable from other promises in the contracts and, therefore, not distinct, then the entire contract is accounted for as a single performance obligation. In situations when our contract includes distinct goods or services that are substantially the same and have the same pattern of transfer to the customer over time, they are recognized as a series of distinct goods or services. For any contracts with multiple performance obligations, we allocate the contract’s transaction price to each performance obligation based on the estimated relative standalone selling price of each distinct good or service in the contract. For product sales, each product sold to a customer typically represents a distinct performance obligation. In such cases, the observable standalone sales are used to determine the stand alone selling price.\nPerformance obligations are satisfied as of a point in time or over time. Performance obligations are supported by contracts with customers, providing a framework for the nature of the distinct goods, services or bundle of goods and services. The timing of satisfying the performance obligation is typically indicated by the terms of the contract.\nHONEYWELL INTERNATIONAL INC.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS-(Continued)\n(Dollars in millions, except per share amounts)\nThe following table outlines the Company's remaining performance obligations disaggregated by segment:\nPerformance obligations recognized as of December 31, 2019 will be satisfied over the course of future periods. Our disclosure of the timing for satisfying the performance obligation is based on the requirements of contracts with customers. However, from time to time, these contracts may be subject to modifications, impacting the timing of satisfying the performance obligations. Performance obligations expected to be satisfied within one year and greater than one year are 57% and 43%.\nThe timing of satisfaction of the Company's performance obligations does not significantly vary from the typical timing of payment. Typical payment terms of our fixed-price over time contracts include progress payments based on specified events or milestones, or based on project progress. For some contracts we may be entitled to receive an advance payment.\nThe Company has applied the practical expedient for certain revenue streams to exclude the value of remaining performance obligations for (i) contracts with an original expected term of one year or less or (ii) contracts for which we recognize revenue in proportion to the amount we have the right to invoice for services performed.\nNote 8. Accounts Receivable\nTrade Receivables includes $1,586 million and $1,543 million of unbilled balances under long-term contracts as of December 31, 2019 and 2018. These amounts are billed in accordance with the terms of customer contracts to which they relate.\nNote 9. Inventories\nInventories valued at LIFO amounted to $292 million and $294 million at December 31, 2019 and 2018. Had such LIFO inventories been valued at current costs, the carrying values would have been approximately $45 million and $39 million higher at December 31, 2019 and 2018.\nHONEYWELL INTERNATIONAL INC.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS-(Continued)\n(Dollars in millions, except per share amounts)\nNote 10. Property, Plant and Equipment-Net\nDepreciation expense was $673 million, $721 million and $717 million in 2019, 2018 and 2017.\nNote 11. Goodwill and Other Intangible Assets-Net\nThe following table summarizes the change in the carrying amount of goodwill for the years ended December 31, 2019 and 2018 by segment.\nOther intangible assets are comprised of:\nIntangible assets amortization expense was $415 million, $395 million, and $398 million in 2019, 2018, 2017. Estimated intangible asset amortization expense for each of the next five years approximates $355 million in 2020, $317 million in 2021, $293 million in 2022, $256 million in 2023, and $234 million in 2024.\nHONEYWELL INTERNATIONAL INC.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS-(Continued)\n(Dollars in millions, except per share amounts)\nNote 12. Accrued Liabilities\nHONEYWELL INTERNATIONAL INC.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS-(Continued)\n(Dollars in millions, except per share amounts)\nNote 13. Long-term Debt and Credit Agreements\nThe schedule of principal payments on long-term debt is as follows:\nHONEYWELL INTERNATIONAL INC.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS-(Continued)\n(Dollars in millions, except per share amounts)\nOn August 8, 2019, the Company issued $600 million 2.15% Senior Notes due 2022, $600 million Floating Rate Senior Notes due 2022, $750 million 2.30% Senior Notes due 2024 and $750 million 2.70% Senior Notes due 2029 (collectively the \"2019 Notes\"). The 2019 Notes are senior unsecured and unsubordinated obligations of Honeywell and rank equally with all of Honeywell's existing and future senior unsecured debt and senior to all of Honeywell's subordinated debt. The offering resulted in gross proceeds of $2,700 million, offset by $18 million in discount and closing costs related to the offering.\nFor the issuances described above, unless otherwise noted, all debt issuance costs are deferred and recognized as a direct deduction to the related debt liability and are amortized to interest expense over the debt term.\nOn October 30, 2019, the Company paid its 1.40% notes due 2019, Three year floating rate notes due 2019, Two year floating rate notes due 2019 and 1.80% notes due 2019.\nIn connection with the Garrett spin-off, wholly owned subsidiaries of Garrett issued notes and entered new credit facilities, which obligations were retained by Garrett in the spin-off. On September 27, 2018 the Company received net proceeds of $1,604 million from such borrowings.\nIn connection with the Resideo spin-off, wholly owned subsidiaries of Resideo issued notes and entered new credit facilities, which obligations were retained by Resideo in the spin-off. On October 25, 2018 the Company received net proceeds of $1,197 million from such borrowings.\nOn April 26, 2019, the Company entered into a $4.0 billion Amended and Restated Five Year Credit Agreement (the “5-Year Credit Agreement”), with a syndicate of banks. The 5-Year Credit Agreement is maintained for general corporate purposes. Commitments under the 5-Year Credit Agreement can be increased pursuant to the terms of the 5-Year Credit Agreement to an aggregate amount not to exceed $4.5 billion. The 5-Year Credit Agreement amends and restates the previously reported $4.0 billion amended and restated five-year credit agreement dated as of April 27, 2018 (the \"Prior Agreement\"). The 5-Year Credit Agreement has substantially the same material terms and conditions as the Prior Agreement.\nOn April 26, 2019, the Company entered into a $1.5 billion 364-Day Credit Agreement with a syndicate of banks. This 364-Day Credit Agreement is maintained for general corporate purposes.\nThere have been no borrowings under any of the credit agreements previously described.\nNote 14. Leases\nAdoption\nEffective January 1, 2019, the Company adopted the new lease accounting standard using the modified retrospective method of applying the new standard at the adoption date. In addition, we elected the package of practical expedients permitted under the transition guidance within the new standard. This allowed us to carry forward the historical lease classification. Adoption of this standard resulted in the recording of net operating lease right-of-use (ROU) assets and corresponding operating lease liabilities of $0.7 billion. Financial position for reporting periods beginning on or after January 1, 2019 are presented under the new guidance, while prior periods amounts are not adjusted and continue to be reported in accordance with previous guidance.\nA significant portion of the Company's operating and finance lease portfolio includes corporate offices, research and development facilities, manufacturing sites, information technology (IT) equipment, and automobiles. The majority of our leases have remaining lease terms of 1 year to 20 years, some of which include options to extend the leases for 5 years or more. Operating lease ROU assets are presented within Other assets. The current portion of operating lease liabilities are presented within Accrued liabilities, and the non-current portion of operating lease liabilities are presented within Other liabilities on the Consolidated Balance Sheet. Finance lease assets are included in Property, plant and equipment - net, and the finance lease obligations are included in Current maturities of long-term debt, and in Long-term debt on the Consolidated Balance Sheet.\nHONEYWELL INTERNATIONAL INC.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS-(Continued)\n(Dollars in millions, except per share amounts)\nA portion of the Company's real estate leases is generally subject to annual changes in the Consumer Price Index (CPI). The changes to the CPI are treated as variable lease payments and recognized in the period in which the obligation for those payments was incurred. In addition, a subset of our automobile leases is considered variable. The variable lease payments for such automobiles leases are based on actual mileage incurred at the stated contractual rate and recognized in the period in which the obligation for those payments was incurred.\nSupplemental cash flow information related to leases was as follows:\nHONEYWELL INTERNATIONAL INC.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS-(Continued)\n(Dollars in millions, except per share amounts)\nSupplemental balance sheet information related to leases was as follows:\nAs of December 31, 2019, maturities of lease liabilities were as follows:\nAs previously disclosed in our 2018 Annual Report on Form 10-K and under the previous lease accounting standard, future minimum lease payments for operating leases having initial or remaining noncancellable lease terms in excess of one year would have been as follows:\nHONEYWELL INTERNATIONAL INC.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS-(Continued)\n(Dollars in millions, except per share amounts)\nNote 15. Financial Instruments and Fair Value Measures\nCredit and Market Risk-Financial instruments, including derivatives, expose the Company to counterparty credit risk for nonperformance and to market risk related to changes in interest and currency exchange rates. Our counterparties in derivative transactions are substantial investment and commercial banks with significant experience using such derivative instruments.\nThe Company continually monitors the creditworthiness of its customers to which it grants credit terms in the normal course of business. The terms and conditions of our credit sales are designed to mitigate or eliminate concentrations of credit risk with any single customer. Our sales are not materially dependent on a single customer or a small group of customers.\nForeign Currency Risk Management-The Company conducts business on a multinational basis in a wide variety of foreign currencies. Our exposure to market risk for changes in foreign currency exchange rates arises from international financing activities between subsidiaries, foreign currency denominated monetary assets and liabilities and transactions arising from international trade. Our primary objective is to preserve the U.S. Dollar value of foreign currency denominated cash flows and earnings. We monitor our collective foreign currency exposure and enter into foreign currency exchange forward and option contracts (foreign currency exchange contracts) with third parties, when necessary, to minimize the impact of changes in foreign currency exchange rates.\nThe Company has monetary assets and liabilities denominated in non-functional currencies. Prior to conversion into U.S. dollars, these assets and liabilities are remeasured at spot exchange rates in effect on the balance sheet date. The effects of changes in spot rates are recognized in earnings and included in other (income) expense. We may purchase or enter into derivative instruments to hedge our foreign currency exposure. We hedge forecasted sales and purchases, which are denominated in non-functional currencies, with foreign currency exchange contracts. Changes in the forecasted non-functional currency cash flows due to movements in exchange rates are substantially offset by changes in the fair value of these foreign currency exchange contracts designated as hedges. Market value gains and losses on these contracts are recognized in earnings when the hedged transaction is recognized. As of December 31, 2019 and 2018, we had contracts with notional amounts of $12,746 million and $14,995 million to exchange foreign currencies, principally the U.S. Dollar, Euro, Canadian Dollar, British Pound, Mexican Peso, Chinese Renminbi, Indian Rupee, Malaysian Ringgit, and Swiss Franc. As of December 31, 2019, we estimate that approximately $52 million of net derivative gains related to our cash flow hedges included in Accumulated other comprehensive income (loss) will be reclassified into earnings within the next 12 months.\nThe Company has also designated foreign currency debt and certain derivative contracts as hedges against portions of its net investment in foreign operations during the year ended December 31, 2019. Gains or losses of the foreign currency debt and derivative contracts designated as a net investment hedge are recorded in the same manner as foreign currency translation adjustments.\nInterest Rate Risk Management-Financial instruments, including derivatives, expose the Company to market risk related to changes in interest rates. The Company uses a combination of financial instruments, including long-term, medium-term and short-term financing, variable-rate commercial paper, and interest rate swaps to manage the interest rate mix of our total debt portfolio and related overall cost of borrowing. At December 31, 2019 and 2018, interest rate swap agreements designated as fair value hedges effectively changed $3,950 million and $2,600 million of fixed rate debt at 2.87% and 2.93% to LIBOR based floating rate debt. Our interest rate swaps mature at various dates through 2029.\nHONEYWELL INTERNATIONAL INC.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS-(Continued)\n(Dollars in millions, except per share amounts)\nFair Value of Financial Instruments-The accounting guidance for fair value measurements and disclosures establishes a three-level fair value hierarchy.\n•\nLevel 1-Inputs are based on quoted prices in active markets for identical assets and liabilities.\n•\nLevel 2-Inputs are based on observable inputs other than quoted prices in active markets for identical or similar assets and liabilities.\n•\nLevel 3-One or more inputs are unobservable and significant.\nFinancial and nonfinancial assets and liabilities are classified in their entirety based on the lowest level of input that is significant to the fair value measurement.\nThe following table sets forth the Company’s financial assets and liabilities that were accounted for at fair value on a recurring basis as of December 31, 2019 and 2018:\nThe foreign currency exchange contracts, interest rate swap agreements, and cross currency swap agreements are valued using broker quotations, or market transactions in either the listed or over-the-counter markets. As such, these derivative instruments are classified within level 2. The Company also holds investments in commercial paper, certificates of deposits, and time deposits that are designated as available for sale and are valued using published prices based off observable market data. As such, these investments are classified within level 2. The Company also holds available for sale investments in U.S. government and corporate debt securities valued utilizing published prices based on quoted market pricing, which are classified within level 1.\nThe carrying value of cash and cash equivalents, trade accounts and notes receivables, payables, commercial paper (of which $3,513 million and $3,583 million was Euro denominated as of December 31, 2019 and 2018) and short-term borrowings contained in the Consolidated Balance Sheet approximates fair value.\nThe following table sets forth the Company’s financial assets and liabilities that were not carried at fair value:\nThe following table sets forth the amounts recorded on the Consolidated Balance Sheet related to cumulative basis adjustments for fair value hedges:\nHONEYWELL INTERNATIONAL INC.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS-(Continued)\n(Dollars in millions, except per share amounts)\nThe Company determined the fair value of the long-term receivables by utilizing transactions in the listed markets for identical or similar assets. As such, the fair value of these receivables is considered level 2. The Company determined the fair value of the long-term debt and related current maturities utilizing transactions in the listed markets for identical or similar liabilities. As such, the fair value of the long-term debt and related current maturities is considered level 2.\nInterest rate swap agreements are designated as hedge relationships with gains or losses on the derivative recognized in interest and other financial charges offsetting the gains and losses on the underlying debt being hedged. Gains and losses on interest rate swap agreements recognized in earnings were $70 million of income, $37 million of expense and $29 million of expense in the years ended December 31, 2019, 2018 and 2017. Gains and losses are fully offset by losses and gains on the underlying debt being hedged.\nThe Company economically hedges its exposure to changes in foreign exchange rates principally with forward contracts. These contracts are marked-to-market with the resulting gains and losses recognized in earnings offsetting the gains and losses on the non-functional currency denominated monetary assets and liabilities being hedged. We recognized $106 million of income, $394 million of income, and $207 million of expense in Other (income) expense in the years ended December 31, 2019, 2018 and 2017.\nThe following tables summarize the location and impact to the Consolidated Statement of Operations related to fair value and cash flow hedging relationships:\nHONEYWELL INTERNATIONAL INC.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS-(Continued)\n(Dollars in millions, except per share amounts)\nThe following table summarizes the amounts of gain or (loss) on net investment hedges recognized in Accumulated other comprehensive income (loss):\nNote 16. Other Liabilities\nNote 17. Capital Stock\nHoneywell is authorized to issue up to 2,000,000,000 shares of common stock, with a par value of $1. Common shareowners are entitled to receive such dividends as may be declared by the Board of Directors, are entitled to one vote per share, and are entitled, in the event of liquidation, to share ratably in all the assets of Honeywell which are available for distribution to the common shareowners. Common shareowners do not have preemptive or conversion rights. Shares of common stock issued and outstanding or held in the treasury are not liable to further calls or assessments. There are no restrictions on us relative to dividends or the repurchase or redemption of common stock.\nOn April 29, 2019, the Board of Directors authorized the repurchase of up to a total of $10.0 billion of Honeywell common stock, which included amounts remaining under, and replaced, the previously approved share repurchase program. Approximately $7.0 billion and $3.7 billion remained available as of December 31, 2019, and December 31, 2018 for additional share repurchases.\nHoneywell repurchased approximately 26.5 million shares of its common stock in both 2019 and 2018, for $4,400 million and $4,000 million.\nHoneywell is authorized to issue up to 40,000,000 shares of preferred stock, without par value, and can determine the number of shares of each series, and the rights, preferences and limitations of each series. At December 31, 2019, there was no preferred stock outstanding.\nHONEYWELL INTERNATIONAL INC.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS-(Continued)\n(Dollars in millions, except per share amounts)\nNote 18. Accumulated Other Comprehensive Income (Loss)\nThe changes in Accumulated other comprehensive income (loss) are provided in the tables below. Comprehensive income (loss) attributable to noncontrolling interest consists predominantly of net income.\nComponents of Accumulated Other Comprehensive Income (Loss)\nHONEYWELL INTERNATIONAL INC.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS-(Continued)\n(Dollars in millions, except per share amounts)\nChanges in Accumulated Other Comprehensive Income (Loss) by Component\nReclassifications Out of Accumulated Other Comprehensive Income (Loss)\nHONEYWELL INTERNATIONAL INC.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS-(Continued)\n(Dollars in millions, except per share amounts)\nNote 19. Stock-Based Compensation Plans\nThe 2016 Stock Incentive Plan of Honeywell International Inc. and its Affiliates (2016 Plan) and 2016 Stock Plan for Non-Employee Directors of Honeywell International Inc. (2016 Directors Plan) were both approved by the shareowners at the Annual Meeting of Shareowners effective on April 25, 2016. Following approval of both plans, we have not and will not grant any new awards under any previously existing stock-based compensation plans. At December 31, 2019, there were 37,364,854, and 866,273 shares of Honeywell common stock available for future grants under terms of the 2016 Plan and 2016 Directors Plan, respectively.\nStock Options-The exercise price, term and other conditions applicable to each option granted under the Company's stock plans are generally determined by the Management Development and Compensation Committee of the Board. The exercise price of stock options is set on the grant date and may not be less than the fair market value per share of our stock on that date. The fair value is recognized as an expense over the employee’s requisite service period (generally the vesting period of the award). Options generally vest over a four-year period and expire after ten years.\nThe fair value of each option award is estimated on the date of grant using the Black-Scholes option-pricing model. Expected volatility is based on implied volatilities from traded options on our common stock and historical volatility of our common stock. We used a Monte Carlo simulation model to derive an expected term which represents an estimate of the time options are expected to remain outstanding. Such model uses historical data to estimate option exercise activity and post-vest termination behavior. The risk-free rate for periods within the contractual life of the option is based on the U.S. treasury yield curve in effect at the time of grant.\nThe following table summarizes the impact to the Consolidated Statement of Operations from stock options:\nHONEYWELL INTERNATIONAL INC.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS-(Continued)\n(Dollars in millions, except per share amounts)\nThe following table sets forth fair value per share information, including related weighted-average assumptions, used to determine compensation cost.\n(1)\nEstimated on date of grant using Black-Scholes option-pricing model.\nThe following table summarizes information about stock option activity for the three years ended December 31, 2019:\n(1)\nAdditional options granted to offset the dilutive impact of the spin-offs on outstanding options.\n(2)\nRepresents the sum of vested options of 11.6 million and expected to vest options of 6.0 million. Expected to vest options are derived by applying the pre-vesting forfeiture rate assumption to total outstanding unvested options of 7.1 million.\nHONEYWELL INTERNATIONAL INC.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS-(Continued)\n(Dollars in millions, except per share amounts)\nThe following table summarizes information about stock options outstanding and exercisable at December 31, 2019:\n(1)\nAverage remaining contractual life in years.\nThere were 14,073,120 and 12,288,854 options exercisable at weighted average exercise prices of $83.42 and $78.35 at December 31, 2018 and 2017.\nThe following table summarizes the financial statement impact from stock options exercised:\n(1)\nRepresents the amount by which the stock price exceeded the exercise price of the options on the date of exercise.\nAt December 31, 2019 there was $88 million of total unrecognized compensation cost related to non-vested stock option awards which is expected to be recognized over a weighted-average period of 2.47 years. The total fair value of options vested during 2019, 2018 and 2017 was $61 million, $73 million and $87 million.\nRestricted Stock Units-Restricted stock unit (RSU) awards entitle the holder to receive one share of common stock for each unit when the units vest. RSUs are issued to certain key employees and directors as compensation at fair market value at the date of grant. RSUs typically become fully vested over periods ranging from three to six years and are payable in Honeywell common stock upon vesting.\nHONEYWELL INTERNATIONAL INC.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS-(Continued)\n(Dollars in millions, except per share amounts)\nThe following table summarizes information about RSU activity for the three years ended December 31, 2019:\n(1)\nAdditional RSU grants to offset the dilutive impact of the spin-offs on non-vested RSUs.\nAs of December 31, 2019, there was approximately $217 million of total unrecognized compensation cost related to non-vested RSUs granted under our stock plans which is expected to be recognized over a weighted-average period of 2.86 years.\nThe following table summarizes the impact to the Consolidated Statement of Operations from RSUs:\nNote 20. Commitments and Contingencies\nEnvironmental Matters\nThe Company is subject to various federal, state, local and foreign government requirements relating to the protection of the environment. We believe that, as a general matter, our policies, practices and procedures are properly designed to prevent unreasonable risk of environmental damage and personal injury and that our handling, manufacture, use and disposal of hazardous substances are in accordance with environmental and safety laws and regulations. However, mainly because of past operations and operations of predecessor companies, we, like other companies engaged in similar businesses, have incurred remedial response and voluntary cleanup costs for site contamination and are a party to lawsuits and claims associated with environmental and safety matters, including past production of products containing hazardous substances. Additional lawsuits, claims and costs involving environmental matters are likely to continue to arise in the future.\nWith respect to environmental matters involving site contamination, the Company continually conducts studies, individually or jointly with other potentially responsible parties, to determine the feasibility of various remedial techniques. It is our policy to record appropriate liabilities for environmental matters when remedial efforts or damage claim payments are probable and the costs can be reasonably estimated. Such liabilities are based on our best estimate of the undiscounted future costs required to complete the remedial work. The recorded liabilities are adjusted periodically as remediation efforts progress or as additional technical, regulatory or legal information becomes available. Given the uncertainties regarding the status of laws, regulations, enforcement policies, the impact of other potentially responsible\nHONEYWELL INTERNATIONAL INC.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS-(Continued)\n(Dollars in millions, except per share amounts)\nparties, technology and information related to individual sites, we do not believe it is possible to develop an estimate of the range of reasonably possible environmental loss in excess of our recorded liabilities. We expect to fund expenditures for these matters from operating cash flow. The timing of cash expenditures depends on a number of factors, including the timing of remedial investigations and feasibility studies, the timing of litigation and settlements of remediation liability, personal injury and property damage claims, regulatory approval of cleanup projects, remedial techniques to be utilized and agreements with other parties.\nThe following table summarizes information concerning the Company's recorded liabilities for environmental costs:\nEnvironmental liabilities are included in the following balance sheet accounts:\nThe Company does not currently possess sufficient information to reasonably estimate the amounts of environmental liabilities to be recorded upon future completion of studies, litigation or settlements, and neither the timing nor the amount of the ultimate costs associated with environmental matters can be determined although they could be material to our consolidated results of operations and operating cash flows in the periods recognized or paid. However, considering our past experience and existing reserves, we do not expect that environmental matters will have a material adverse effect on our consolidated financial position.\nIn conjunction with the Resideo spin-off, the Company entered into an indemnification and reimbursement agreement with a Resideo subsidiary, pursuant to which Resideo’s subsidiary has an ongoing obligation to make cash payments to Honeywell in amounts equal to 90 percent of Honeywell’s annual net spending for environmental matters at certain sites as defined in the agreement. The amount payable to Honeywell in any given year is subject to a cap of $140 million, and the obligation will continue until the earlier of December 31, 2043, or December 31 of the third consecutive year during which the annual payment obligation has been less than $25 million. Reimbursements associated with this agreement were $140 million and $25 million in 2019 and 2018, respectively and offset operating cash outflows incurred by the Company. As the Company records the accruals for environmental matters deemed probable and reasonably estimable related to the sites covered by the indemnification and reimbursement agreement, a corresponding receivable from Resideo for 90 percent of that accrual is also recorded. This receivable amount recorded in 2019 and 2018, subsequent to the spin-off, was $109 million and $50 million. As of December 31, 2019, Other Current Assets and Other Assets includes $140 million and $445 million representing the short-term and long-term portion of the receivable amount due from Resideo under the indemnification and reimbursement agreement. As of December 31, 2018, Other Current Assets and Other Assets includes $140 million and $476 million representing the short-term and long-term portion of the receivable amount due from Resideo under the indemnification and reimbursement agreement.\nAsbestos Matters\nHoneywell is named in asbestos related personal injury claims related to North American Refractories Company (“NARCO”), which was sold in 1986, and Bendix Friction Materials (“Bendix”) business, which was sold in 2014.\nHONEYWELL INTERNATIONAL INC.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS-(Continued)\n(Dollars in millions, except per share amounts)\nThe following tables summarize information concerning NARCO and Bendix asbestos related balances:\nAsbestos Related Liabilities\nInsurance Recoveries for Asbestos Related Liabilities\nNARCO and Bendix asbestos related balances are included in the following balance sheet accounts:\nNARCO Products-Honeywell’s predecessor, Allied Corporation owned NARCO from 1979 to 1986. When the NARCO business was sold, Honeywell’s predecessor entered into a cross-indemnity agreement with NARCO which included an obligation to indemnify the purchaser for asbestos claims. Such claims arise primarily from alleged occupational exposure to asbestos-containing refractory brick and mortar for high-temperature applications. NARCO ceased manufacturing these products in 1980, and the first asbestos claims were filed in the tort system against NARCO in 1983. Claims filings and related costs increased dramatically in the late 1990s through 2001, which led to NARCO filing for bankruptcy in January 2002. Once NARCO filed for bankruptcy, all then current and future NARCO asbestos claims were stayed against both NARCO and Honeywell pending the reorganization of NARCO.\nHONEYWELL INTERNATIONAL INC.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS-(Continued)\n(Dollars in millions, except per share amounts)\nFollowing the bankruptcy filing, in December 2002 Honeywell recorded a total NARCO asbestos liability of $3.2 billion, which was comprised of three components: (i) the estimated liability to settle pre-bankruptcy petition NARCO claims and certain post-petition settlements ($2.2 billion, referred to as “Pre-bankruptcy NARCO Liability”), (ii) the estimated liability related to then unasserted NARCO claims for the period 2004 through 2018 ($950 million, referred to as “NARCO Trust Liability”), and (iii) other NARCO bankruptcy-related obligations totaling $73 million.\nWhen the NARCO Trust Liability of $950 million was established in 2002, the methodology for estimating the potential liability was based primarily on: (a) epidemiological projections of the future incidence of disease for the period 2004 through 2018, a fifteen-year period; (b) historical claims rates in the tort system for the five-year period prior to the bankruptcy filing date; and (c) anticipated NARCO Trust payment values set forth in the then current draft of the NARCO Trust Distribution Procedures. The methodology required estimating, by disease, three critical inputs: (i) likely number of claims to be asserted against the NARCO Trust in the future, (ii) percentage of those claims likely to receive payment, and (iii) payment values. The Company utilized outside asbestos liability valuation specialists to support our preparation of the NARCO Trust Liability estimate, which was based on a commonly accepted methodology used by numerous bankruptcy courts addressing 524(g) trusts.\nIn 2002, when the Company first established its initial liability, NARCO asbestos claims resolution shifted from the tort system to an anticipated NARCO Trust framework, where claims would be processed in accordance with established NARCO Trust Distribution Procedures, including strict medical and exposure criteria for a plaintiff to receive compensation. We believed at the time that the NARCO Trust’s claims filing and resolution experience after the NARCO Trust became operational would be significantly different from pre-bankruptcy tort system experience in light of these more rigorous claims processing requirements in the NARCO Trust Distribution Procedures and Honeywell’s active oversight of claims processing and approval. Given these anticipated differences, we believed that a 15-year time period was the appropriate horizon for establishing a probable and reasonably estimable liability for then unasserted NARCO claims as it represented our best estimate of the time period it would take for the NARCO Trust to be approved by the Bankruptcy Court, become fully operational and generate sufficiently reliable claims data (i.e., a data set which is statistically representative) to enable us to update our NARCO Trust Liability.\nThe NARCO Trust Distribution Procedures were finalized in 2006, and the Company updated its NARCO Trust Liability to reflect the final terms and payment values. The original 15-year period (from 2004 through 2018) for unasserted claims did not change as asbestos claims filings continued to be stayed against both Honeywell and NARCO. The 2006 update resulted in a range of the estimated liability for unasserted claims of $743 million to $961 million, and we believed that no amount within this range was a better estimate than any other amount. In accordance with ASC 450-Contingencies (“ASC 450”), we recorded the low end of the range of $743 million (the “2006 NARCO Trust Liability Estimate”) which resulted in a reduction of $207 million in our NARCO Trust Liability.\nNARCO emerged from bankruptcy on April 30, 2013, at which time a federally authorized 524(g) trust was established for the evaluation and resolution of all existing and future NARCO asbestos claims. Both Honeywell and NARCO are protected by a permanent channeling injunction barring all present and future individual actions in state or federal courts and requiring all asbestos related claims based on exposure to NARCO asbestos-containing products to be made against the NARCO Trust.\nThe NARCO Trust Agreement and the NARCO Trust Distribution Procedures are the principal documents setting forth the structure of the NARCO Trust. These documents establish Honeywell’s evergreen funding obligations. Honeywell is obligated to fund NARCO asbestos claims submitted to the NARCO Trust which qualify for payment under the Trust Distribution Procedures (Annual Contribution Claims), subject to an annual cap of $145 million. However, the initial $100 million of claims processed through the NARCO Trust (the Initial Claims Amount) will not count against the annual cap and any unused portion of the Initial Claims Amount will roll over to subsequent years until fully utilized. These documents also establish the material operating rules for the NARCO Trust, including Honeywell audit rights and the criteria claimants must meet to have a valid claim paid. These claims payment criteria include providing the NARCO Trust with adequate medical evidence of the claimant’s asbestos-related condition and credible evidence of exposure to a specific NARCO asbestos-containing product. Further, the NARCO Trust is eligible to receive cash dividends from Harbison-Walker International Inc (“HWI”), the reorganized and renamed entity that emerged, fully operational, from the NARCO bankruptcy. The NARCO Trust is required to use any funding received from HWI to pay Annual Contribution Claims until those funds are exhausted. It is only at this point that Honeywell’s funding obligation to the Trust is triggered. Thus, there is an unrelated primary source for funding that affects Honeywell’s funding of the NARCO Trust Liability.\nHONEYWELL INTERNATIONAL INC.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS-(Continued)\n(Dollars in millions, except per share amounts)\nOnce operational, the NARCO Trust began to receive, process and pay claims that had been previously stayed pending the Trust becoming operational. As the NARCO Trust began to pay claims in 2014, we began to assert our on-going audit rights to review and monitor the claims processor’s adherence to the established requirements of the NARCO Trust Distribution Procedures. While doing so, we identified several issues with the way the Trust was implementing the NARCO Trust Distribution Procedures. In 2015, Honeywell filed suit against the NARCO Trust in Bankruptcy Court alleging breach of certain provisions of the NARCO Trust Agreement and NARCO Trust Distribution Procedures. The parties agreed to dismiss the proceeding without prejudice pursuant to an 18-month Standstill Agreement, which expired in October 2017. Notwithstanding its expiration, claims processing continues, and Honeywell continues to negotiate and attempt to resolve remaining disputed issues (that is, instances where Honeywell believes the NARCO Trust is not processing claims in accordance with established NARCO Trust Distribution Procedures). Honeywell reserves the right to seek judicial intervention should negotiations fail.\nAfter the NARCO Trust became effective in 2013, the $743 million NARCO Trust Liability was then comprised of:\n(i) liability for unasserted claims; and\n(ii) liability for claims asserted after the NARCO Trust became operational but not yet paid.\nAlthough the Company knows the number of claims filed with the NARCO Trust each year, it is not able to determine at this time the portion of the NARCO Trust Liability which represents asserted versus unasserted claims due to the lack of sufficiently reliable claims data because of the claims processing issues described previously.\nHoneywell continues to maintain the 2006 NARCO Trust Liability (the $743 million accrual less payments made to the NARCO Trust for Annual Contribution Claims), as there has not been sufficiently reliable claims data history to enable the Company to update that liability.\nAs of December 31, 2019, all cash dividends paid to the NARCO Trust by HWI has been used to pay Annual Contribution Claims. In the fourth quarter of 2019, Honeywell funded $29 million to the NARCO Trust for the payment of Annual Contribution Claims.\nAs of December 31, 2019, the Company's total NARCO asbestos liability of $858 million reflects Pre-bankruptcy NARCO liability of $144 million and NARCO Trust Liability of $714 million (the $743 million accrual for NARCO Trust Liability was reduced by the $29 million payment to the NARCO Trust in the fourth quarter of 2019 for Annual Contribution Claims). Through December 31, 2019, Pre-bankruptcy NARCO Liability has been reduced by approximately $2 billion since first established in 2002, largely related to settlement payments. The remaining Pre-bankruptcy NARCO liability principally represents estimated amounts owed pursuant to settlement agreements reached during the pendency of the NARCO bankruptcy proceedings that provide for the right to submit claims to the NARCO Trust subject to qualification under the terms of the settlement agreements and Trust Distribution Procedures. The other NARCO bankruptcy obligations were paid in 2013 and no further liability is recorded.\nHoneywell continues to evaluate the appropriateness of the 2006 NARCO Trust Liability Estimate. Despite becoming effective in 2013, the NARCO Trust has experienced delays in becoming fully operational. Violations of the Trust Distribution Procedures and the resulting disputes and challenges, a standstill pending dispute resolution, and limited claims payments, have all contributed to the lack of sufficient normalized data based on actual claims processing experience in the Trust since it became operational. As a result, we have not been able to further update the NARCO Trust Liability aside from deducting payments to the NARCO Trust for Annual Contribution Claims. The 2006 million NARCO Trust Liability Estimate continues to be appropriate because of the unresolved pending claims in the Trust, some portion of which will result in payouts in the future, and because new claims continue to be filed with the NARCO Trust. When sufficiently reliable claims data exists, we will update our estimate of the NARCO Trust Liability and it is possible that a material change may need to be recognized.\nThe Company's insurance receivable of $281 million as of December 31, 2019, corresponding to the estimated liability for asserted and unasserted NARCO asbestos claims, reflects coverage which reimburses Honeywell for portions of NARCO-related indemnity and defense costs and is provided by a large number of insurance policies written by dozens of insurance companies in both the domestic insurance market and the London excess market. We conduct analyses to estimate the probable amount of insurance that is recoverable for asbestos claims. While the substantial majority of our insurance carriers are solvent, some of our individual carriers are insolvent, which has been considered in our analysis of probable recoveries. We made judgments concerning insurance coverage that we believe are reasonable and consistent with our historical dealings and our knowledge of any pertinent solvency issues surrounding insurers.\nHONEYWELL INTERNATIONAL INC.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS-(Continued)\n(Dollars in millions, except per share amounts)\nBendix Products-Bendix manufactured automotive brake linings that contained chrysotile asbestos in an encapsulated form. Claimants consist largely of individuals who allege exposure to asbestos from brakes from either performing or being in the vicinity of individuals who performed brake replacements. The following tables present information regarding Bendix related asbestos claims activity:\nHoneywell has experienced average resolution values per claim excluding legal costs as follows:\nIt is not possible to predict whether resolution values for Bendix-related asbestos claims will increase, decrease or stabilize in the future.\nThe Company's consolidated financial statements reflect an estimated liability for resolution of asserted (claims filed as of the financial statement date) and unasserted Bendix-related asbestos claims and excludes the Company’s legal fees to defend such asbestos claims which will continue to be expensed by the Company as they are incurred. We have valued Bendix asserted and unasserted claims using average resolution values for the previous five years. We update the resolution values used to estimate the cost of Bendix asserted and unasserted claims during the fourth quarter each year.\nHoneywell reflects the inclusion of all years of epidemiological disease projection through 2059 when estimating the liability for unasserted Bendix-related asbestos claims. Such liability for unasserted Bendix-related asbestos claims is based on historic and anticipated claims filing experience and dismissal rates, disease classifications, and resolution values in the tort system for the previous five years.\nOur insurance receivable corresponding to the liability for settlement of asserted and unasserted Bendix asbestos claims reflects coverage which is provided by a large number of insurance policies written by dozens of insurance companies in both the domestic insurance market and the London excess market. Based on our ongoing analysis of the probable insurance recovery, insurance receivables are recorded in the financial statements simultaneous with the recording of the estimated liability for the underlying asbestos claims. This determination is based on our analysis of the underlying insurance policies, our historical experience with our insurers, our ongoing review of the solvency of our insurers, judicial determinations relevant to our insurance programs, and our consideration of the impacts of any settlements reached with our insurers.\nIn conjunction with the Garrett spin-off, the Company entered into an indemnification and reimbursement agreement with a Garrett subsidiary, pursuant to which Garrett’s subsidiary will have an obligation to make cash payments to Honeywell in amounts equal to (i) 90% of Honeywell’s asbestos-related liability payments primarily related to the Bendix business in the United States, as well as certain environmental-related liability payments and accounts payable and non-United States asbestos-related liability payments, in each case related to legacy elements of the Garrett business, including the legal costs of defending and resolving such liabilities, less (ii) 90% of Honeywell’s net insurance receipts and, as may be applicable, certain other recoveries associated with such liabilities. The amount payable to Honeywell\nHONEYWELL INTERNATIONAL INC.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS-(Continued)\n(Dollars in millions, except per share amounts)\nin respect of such liabilities arising in any given year will be subject to a cap of approximately Euro 150 million (equivalent to $175 million at the time the indemnification and reimbursement agreement was entered into). The obligation will continue until the earlier of December 31, 2048, or December 31 of the third consecutive year during which the annual obligation has been less than the Euro equivalent, at the fixed exchange rate at time of the indemnification and reimbursement agreement was entered into, of $25 million. Reimbursements associated with this agreement were $152 million and $42 million in 2019 and 2018, respectively, and offset operating cash outflows incurred by the Company. As the Company records the accruals for matters covered by the agreement, a corresponding receivable from Garrett is recorded for 90 percent of that accrual as determined by the terms of the agreement. This receivable amount recorded in 2019 was $16 million. In 2018, subsequent to the spin-off, the Company recorded a reversal to the receivable for $17 million in the fourth quarter of 2018. As of December 31, 2019, Other Current Assets and Other Assets includes $115 million and $947 million representing the short-term and long-term portion of the receivable amount due from Garrett under the indemnification and reimbursement agreement. As of December 31, 2018, Other Current Assets and Other Assets includes $171 million and $1,058 million representing the short-term and long-term portion of the receivable amount due from Garrett under the indemnification and reimbursement agreement.\nOn December 2, 2019, Garrett Motion Inc. and Garrett ASASCO Inc. filed a Summons with Notice and commenced a lawsuit in the Commercial Division of the Supreme Court of the State of New York, County of New York seeking to invalidate the indemnification and reimbursement agreement between Garrett and Honeywell. Garrett seeks damages and a declaratory judgment based on various claims set forth in the Summons with Notice. On January 15, 2020, Garrett filed its complaint in the action, which asserted the same claims. We strongly believe that Garrett's allegations have no merit, nor are they material to Honeywell. We believe we have fully complied with our obligations under the Agreement and that the Agreement is enforceable.\nOn September 13, 2018, following completion of the Securities and Exchange Commission (SEC) Division of Corporation Finance’s review of our prior accounting for liabilities for unasserted Bendix-related asbestos claims, the SEC Division of Enforcement advised that it had opened an investigation related to this matter. On August 28, 2019, the SEC informed the Company that it had concluded its investigation and that it does not intend to recommend any enforcement action against Honeywell.\nOn October 31, 2018, David Kanefsky, a Honeywell shareholder, filed a putative class action complaint in the U.S. District Court for the District of New Jersey alleging violations of the Securities Exchange Act of 1934 and Rule 10b-5 related to the prior accounting for Bendix asbestos claims. On May 15, 2019, Wayne County Employees’ Retirement System, another Honeywell shareholder, filed a putative class action asserting the same claims relating to substantially the same alleged conduct in the same jurisdiction. On December 16, 2019, the court denied Wayne County Employees' Retirement System's motion to be appointed as substitute lead plaintiff in the Kanefsky action. On December 30, 2019, the lead plaintiff filed an amended complaint in the Kanefsky action. We believe the claims related to the prior accounting for Bendix asbestos claims have no merit.\nOther Matters\nThe Company is subject to a number of other lawsuits, investigations and disputes (some of which involve substantial amounts claimed) arising out of the conduct of our business, including matters relating to commercial transactions, government contracts, product liability, prior acquisitions and divestitures, employee benefit plans, intellectual property, and environmental, health and safety matters. We recognize a liability for any contingency that is probable of occurrence and reasonably estimable. We continually assess the likelihood of adverse judgments of outcomes in these matters, as well as potential ranges of possible losses (taking into consideration any insurance recoveries), based on a careful analysis of each matter with the assistance of outside legal counsel and, if applicable, other experts. Included in these other matters are the following:\nHoneywell v. United Auto Workers (UAW) et. al-In September 2011, the UAW and certain Honeywell retirees (Plaintiffs) filed a suit in the Eastern District of Michigan (the District Court) alleging that a series of Master Collective Bargaining Agreements (MCBAs) between Honeywell and the UAW provided the retirees with rights to lifetime, vested healthcare benefits that could never be changed or reduced. Plaintiffs alleged that Honeywell had violated those vested rights by implementing express limitations (CAPS) on the amount Honeywell contributed toward healthcare coverage for the retirees. Honeywell subsequently answered the UAW’s complaint and asserted counterclaims, including for breach of implied warranty.\nBetween 2014 and 2015, Honeywell began enforcing the CAPS against former employees. In response, the UAW and certain of the Plaintiffs filed a motion seeking a ruling that the MCBAs do not limit Honeywell’s obligation to contribute to healthcare coverage for those retirees.\nHONEYWELL INTERNATIONAL INC.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS-(Continued)\n(Dollars in millions, except per share amounts)\nOn March 29, 2018, the District Court issued its opinion resolving all pending summary judgment motions, except for Honeywell’s counterclaim for breach of implied warranty, which has since been dismissed without prejudice.\nIn the opinion, the District Court held that the MCBAs do not promise retirees vested, lifetime benefits that survive expiration of the MCBAs. Based on this ruling, Honeywell terminated the retirees healthcare coverage benefits altogether as of July 31, 2018. In response, the UAW filed a motion to enjoin Honeywell from completely terminating coverage as of July 31, 2018, arguing that the CAPS themselves are vested and that Honeywell must continue to provide retiree medical benefits at the capped level. On July 28, 2018, the District Court denied the UAW’s motion and entered a final judgment consistent with its March 2018 ruling. The UAW has appealed this decision to the Sixth Circuit Court of Appeals. Honeywell believes the District Court’s ruling will be upheld.\nIn the March 2018 opinion, the District Court also held that Honeywell is obligated under the MCBAs to pay the “full premium” for retiree healthcare rather than the capped amount. Based on this ruling, Honeywell would be required to pay monetary damages to retirees for any past years in which Honeywell paid less than the “full premium” of their healthcare coverage. Such damages would be limited, depending on the retiree group, to a two to three-year period ending when the 2017 MCBA expired, and Honeywell would have no ongoing obligation to continue funding healthcare coverage for subsequent periods. Honeywell has appealed the District Court’s ruling on this “full premium” damages issue, and believes that the Sixth Circuit Court of Appeals will reverse the District Court on that issue. In the event the Sixth Circuit were to sustain the District Court’s ruling on this issue, Honeywell would be liable for damages of at least $12 million.\nPetrobras and Unaoil-We are cooperating with certain investigations by the U.S. Department of Justice (DOJ), the SEC and Brazilian authorities relating to our use of third parties who previously worked for our UOP business in Brazil in relation to Petróleo Brasileiro S.A. (Petrobras). The investigations are focused on compliance with the U.S. Foreign Corrupt Practices Act and similar Brazilian laws, and involve, among other things, document production and interviews with former and current management and employees. The DOJ and the SEC are also examining a matter involving a foreign subsidiary’s prior engagement of Unaoil S.A.M. in Algeria. We are cooperating with the authorities in each of the above matters. While we cannot predict the outcome of these matters, based on the facts currently known to us, we do not anticipate that these matters will have a material adverse effect on our financial condition, results of operations, or cash flows.\nIn re Resideo Technologies, Inc. Securities Litigation-On January 7, 2020, The Gabelli Asset Fund and certain related parties filed a putative class action complaint against Resideo and Honeywell in the U.S. District Court for the District of Minnesota alleging violations of the Securities Exchange Act of 1934 and Rule 10b-5 related to Resideo's spinoff from Honeywell in October 2018. On January 27, 2020, this putative class action was consolidated with certain previously-filed actions asserting claims relating to substantially the same matters into a single class action under the title In re Resideo Technologies, Inc. Securities Litigation. We believe the allegations against Honeywell regarding the Resideo spinoff have no merit.\nGiven the uncertainty inherent in litigation and investigations (including the specific matters referenced above), we do not believe it is possible to develop estimates of reasonably possible loss in excess of current accruals for these matters (other than as specifically set forth above). Considering our past experience and existing accruals, we do not expect the outcome of these matters, either individually or in the aggregate, to have a material adverse effect on our consolidated financial position. Because most contingencies are resolved over long periods of time, potential liabilities are subject to change due to new developments, changes in settlement strategy or the impact of evidentiary requirements, which could cause us to pay damage awards or settlements (or become subject to equitable remedies) that could have a material adverse effect on our results of operations or operating cash flows in the periods recognized or paid.\nHONEYWELL INTERNATIONAL INC.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS-(Continued)\n(Dollars in millions, except per share amounts)\nWarranties and Guarantees\nIn the normal course of business, the Company issues product warranties and product performance guarantees. We accrue for the estimated cost of product warranties and performance guarantees based on contract terms and historical experience at the time of sale. Adjustments to initial obligations for warranties and guarantees are made as changes to the obligations become reasonably estimable. The following table summarizes information concerning our recorded obligations for product warranties and product performance guarantees.\nProduct warranties and product performance guarantees are included in the following balance sheet accounts:\nNote 21. Pension and Other Postretirement Benefits\nThe Company sponsors a number of both funded and unfunded U.S. and non-U.S. defined benefit pension plans. Pension benefits for many of our U.S. employees are provided through non-contributory, qualified and non-qualified defined benefit plans. All non-union hourly and salaried employees joining Honeywell for the first time after December 31, 2012, are not eligible to participate in Honeywell’s U.S. defined benefit pension plans. We also sponsor defined benefit pension plans which cover non-U.S. employees who are not U.S. citizens, in certain jurisdictions, principally the UK, Netherlands, Germany, and Canada. Other pension plans outside of the U.S. are not material to the Company either individually or in the aggregate.\nThe Company also sponsors postretirement benefit plans that provide health care benefits and life insurance coverage mainly to U.S. eligible retirees. None of Honeywell’s U.S. employees are eligible for a retiree medical subsidy from the Company. In addition, the vast majority of Honeywell’s U.S. retirees either have no Company subsidy or have a fixed-dollar subsidy amount. This significantly limits our exposure to the impact of future health care cost increases. The retiree medical and life insurance plans are not funded. Claims and expenses are paid from our operating cash flow.\nHONEYWELL INTERNATIONAL INC.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS-(Continued)\n(Dollars in millions, except per share amounts)\nThe following tables summarize the balance sheet impact, including the benefit obligations, assets and funded status associated with the Company's significant pension and other postretirement benefit plans.\n(1)\nIncluded in Other assets on Consolidated Balance Sheet\n(2)\nIncluded in Accrued liabilities on Consolidated Balance Sheet\n(3)\nIncluded in Other liabilities on Consolidated Balance Sheet\nHONEYWELL INTERNATIONAL INC.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS-(Continued)\n(Dollars in millions, except per share amounts)\n(1)\nExcludes non-U.S. plans of $41 million and $42 million in 2019 and 2018.\nAmounts recognized in Accumulated other comprehensive (income) loss associated with the Company's significant pension and other postretirement benefit plans at December 31, 2019 and 2018 are as follows:\nHONEYWELL INTERNATIONAL INC.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS-(Continued)\n(Dollars in millions, except per share amounts)\nThe components of net periodic benefit (income) cost and other amounts recognized in Other comprehensive (income) loss for the Company's significant pension and other postretirement benefit plans include the following components:\nHONEYWELL INTERNATIONAL INC.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS-(Continued)\n(Dollars in millions, except per share amounts)\nThe estimated prior service (credit) for pension benefits that will be amortized from Accumulated other comprehensive (income) loss into net periodic benefit (income) cost in 2020 are expected to be $(42) million and $0 million for U.S. and non-U.S. pension plans.\nThe estimated net (gain) and prior service (credit) for other postretirement benefits that will be amortized from Accumulated other comprehensive (income) loss into net periodic benefit (income) cost in 2020 are expected to be $0 and $(63) million.\nHONEYWELL INTERNATIONAL INC.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS-(Continued)\n(Dollars in millions, except per share amounts)\nMajor actuarial assumptions used in determining the benefit obligations and net periodic benefit (income) cost for our significant benefit plans are presented in the following table as weighted averages.\n(1)\nDiscount rate was 3.65% for 1/1/2017 through 2/28/2017. Rate was changed to 3.60% for the remainder of 2017 due to a Plan remeasurement as of 3/1/2017.\nThe discount rate for the Company's U.S. pension and other postretirement benefits plans reflects the current rate at which the associated liabilities could be settled at the measurement date of December 31. To determine discount rates for our U.S. pension and other postretirement benefit plans, we use a modeling process that involves matching the expected cash outflows of our benefit plans to a yield curve constructed from a portfolio of high quality, fixed-income debt instruments. We use the single weighted-average yield of this hypothetical portfolio as a discount rate benchmark. We utilize a full yield curve approach in the estimation of the service and interest cost components of net periodic pension benefit (income) for our significant pension plans. This approach applies the specific spot rates along the yield curve used in the determination of the pension benefit obligation to their underlying projected cash flows and provides a more precise measurement of service and interest costs by improving the correlation between projected cash flows and their corresponding spot rates. For our U.S. pension plans, the single weighted average spot rates used to determine service and interest costs for 2020 are 3.33% and 2.76%. The discount rate used to determine the other postretirement benefit obligation is lower principally due to a shorter expected duration of other postretirement plan obligations as compared to pension plan obligations.\nHONEYWELL INTERNATIONAL INC.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS-(Continued)\n(Dollars in millions, except per share amounts)\nThe Company plans to use an expected rate of return on U.S. plan assets of 6.15% for 2020 down from 6.75% for 2019 reflecting a decline in interest rates and additional re-balancing of assets to more fixed income. Our asset return assumption is based on historical plan asset returns over varying long-term periods combined with current market conditions and broad asset mix considerations with a focus on long-term trends rather than short-term market conditions. We review the expected rate of return on an annual basis and revise it as appropriate.\nFor non-U.S. benefit plans actuarial assumptions reflect economic and market factors relevant to each country.\nPension Benefits\nThe following amounts relate to the Company's significant pension plans with accumulated benefit obligations exceeding the fair value of plan assets:\nThe accumulated benefit obligation for the Company's U.S. defined benefit pension plans was $17.2 billion and $16.1 billion and for our Non-U.S. defined benefit pension plans was $6.8 billion and $6.1 billion at December 31, 2019 and 2018.\nThe Company's asset investment strategy for our U.S. pension plans focuses on maintaining a diversified portfolio using various asset classes in order to achieve our long-term investment objectives on a risk adjusted basis. During 2019, we continued to employ a de-risking strategy which increases the matching characteristics of our assets relative to our obligation. Our long-term target allocations are as follows: 55%-70% fixed income securities and cash, 25%-40% equity securities, 5%-10% real estate investments, and 10%-20% other types of investments. Equity securities include publicly-traded stock of companies located both inside and outside the United States. Fixed income securities include corporate bonds of companies from diversified industries, mortgage-backed securities, and U.S. Treasuries. Real estate investments include direct investments in commercial properties and investments in real estate funds. Other types of investments include investments in private equity and hedge funds that follow several different strategies. We review our assets on a regular basis to ensure that we are within the targeted asset allocation ranges and, if necessary, asset balances are adjusted back within target allocations.\nThe Company's non-U.S. pension assets are typically managed by decentralized fiduciary committees with the Honeywell Corporate Investments group providing funding and investment guidance. Our non-U.S. investment policies are different for each country as local regulations, funding requirements, and financial and tax considerations are part of the funding and investment allocation process in each country.\nIn accordance with ASU 2015-07, “Fair Value Measurement (Topic 820)”, certain investments that are measured at fair value using the net asset value (NAV) per share (or its equivalent) practical expedient have not been classified in the fair value hierarchy. The fair value amounts presented in the following tables are intended to permit reconciliation of the fair value hierarchy to the amounts presented for the total pension benefits plan assets.\nHONEYWELL INTERNATIONAL INC.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS-(Continued)\n(Dollars in millions, except per share amounts)\nThe fair values of both the Company's U.S. and non-U.S. pension plans assets by asset category are as follows:\nHONEYWELL INTERNATIONAL INC.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS-(Continued)\n(Dollars in millions, except per share amounts)\nHONEYWELL INTERNATIONAL INC.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS-(Continued)\n(Dollars in millions, except per share amounts)\nThe following table summarizes changes in the fair value of Level 3 assets for both U.S. and Non-U.S. plans:\nThe Company enters into futures contracts to gain exposure to certain markets. Sufficient cash or cash equivalents are held by our pension plans to cover the notional value of the futures contracts. At December 31, 2019 and 2018, our U.S. plans had contracts with notional amounts of $4,463 million and $2,808 million. At December 31, 2019 and 2018, our non-U.S. plans had contracts with notional amounts of $479 million and $111 million. In both our U.S. and non-U.S. pension plans, the notional derivative exposure is related to outstanding equity and fixed income futures contracts.\nCommon stocks, preferred stocks, real estate investment trusts, and short-term investments are valued at the closing price reported in the active market in which the individual securities are traded. Corporate bonds, mortgages, asset-backed securities, and government securities are valued either by using pricing models, bids provided by brokers\nHONEYWELL INTERNATIONAL INC.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS-(Continued)\n(Dollars in millions, except per share amounts)\nor dealers, quoted prices of securities with similar characteristics or discounted cash flows and as such include adjustments for certain risks that may not be observable such as credit and liquidity risks. Certain securities are held in collective trust funds which are valued using net asset values provided by the administrators of the funds. Investments in private equity, debt, real estate and hedge funds and direct private investments are valued at estimated fair value based on quarterly financial information received from the investment advisor and/or general partner. Investments in real estate properties are valued on a quarterly basis using the income approach. Valuation estimates are periodically supplemented by third party appraisals.\nThe Company's funding policy for qualified defined benefit pension plans is to contribute amounts at least sufficient to satisfy regulatory funding standards. In 2019, 2018, and 2017, we were not required to make contributions to our U.S. pension plans and no contributions were made. We are not required to make any contributions to our U.S. pension plans in 2020. In 2019, contributions of $43 million were made to our non-U.S. pension plans to satisfy regulatory funding requirements. In 2020, we expect to make contributions of cash and/or marketable securities of approximately $112 million to our non-U.S. pension plans to satisfy regulatory funding standards. Contributions for both our U.S. and non-U.S. pension plans do not reflect benefits paid directly from Company assets.\nBenefit payments, including amounts to be paid from Company assets, and reflecting expected future service, as appropriate, are expected to be paid as follows:\nOther Postretirement Benefits\nThe assumed health care cost trend rate has a significant effect on the amounts reported. A one-percentage-point change in the assumed health care cost trend rate would have the following effects:\nBenefit payments reflecting expected future service, as appropriate, are expected to be paid as follows:\nHONEYWELL INTERNATIONAL INC.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS-(Continued)\n(Dollars in millions, except per share amounts)\nNote 22. Segment Financial Data\nHoneywell globally manages its business operations through four reportable operating segments. Segment information is consistent with how management reviews the businesses, makes investing and resource allocation decisions and assesses operating performance.\nHoneywell’s senior management evaluates segment performance based on segment profit. Each segment’s profit is measured as segment income (loss) before taxes excluding general corporate unallocated expense, interest and other financial charges, stock compensation expense, pension and other postretirement income (expense), repositioning and other charges, and other items within Other (income) expense.\nHONEYWELL INTERNATIONAL INC.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS-(Continued)\n(Dollars in millions, except per share amounts)\nA reconciliation of segment profit to consolidated income from continuing operations before taxes are as follows:\n(1)\nAmounts included in Selling, general and administrative expenses.\n(2)\nAmounts included in Cost of products and services sold and Selling, general and administrative expenses (service costs) and Other income/expense (non-service cost components).\n(3)\nAmounts included in Cost of products and services sold, Selling, general and administrative expenses, and Other income/expense.\n(4)\nAmounts include the other components of Other income/expense not included within other categories in this reconciliation. Equity income/loss of affiliated companies is included in segment profit.\nHONEYWELL INTERNATIONAL INC.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS-(Continued)\n(Dollars in millions, except per share amounts)\nNote 23. Geographic Areas-Financial Data\n(1)\nSales between geographic areas approximate market and are not significant. Net sales are classified according to their country of origin. Included in United States net sales are export sales of $5,415 million, $5,293 million and $4,974 million in 2019, 2018 and 2017.\n(2)\nLong-lived assets are comprised of property, plant and equipment - net.\nNote 24. Supplemental Cash Flow Information\nHONEYWELL INTERNATIONAL INC.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS-(Continued)\n(Dollars in millions, except per share amounts)\nNote 25. Unaudited Quarterly Financial Information\n(1)\nTotal for the full year may differ from the sum of the individual quarters due to the requirement to use weighted average shares each quarter, which may fluctuate with share repurchases and share issuances, and due to the impact of losses in a quarter.\n(2)\nThe results of operations for Transportation Systems business and Homes and Global Distribution business are included in the Consolidated Statement of Operations through the effective dates of the respective spin-offs.\nReport of Independent Registered Public Accounting Firm\nTo the shareowners and the Board of Directors of Honeywell International Inc.\nOpinions on the Financial Statements and Internal Control over Financial Reporting\nWe have audited the accompanying consolidated balance sheets of Honeywell International Inc. and subsidiaries (the \"Company\") as of December 31, 2019 and 2018, and the related consolidated statements of operations, comprehensive income, shareowners’ equity, and cash flows, for each of the three years in the period ended December 31, 2019, and the related notes (collectively referred to as the \"financial statements\"). We also have audited the Company’s internal control over financial reporting as of December 31, 2019, based on criteria established in Internal Control - Integrated Framework (2013) issued by the Committee of Sponsoring Organizations of the Treadway Commission (COSO).\nIn our opinion, the financial statements referred to above present fairly, in all material respects, the financial position of the Company as of December 31, 2019 and 2018, and the results of its operations and its cash flows for each of the three years in the period ended December 31, 2019, in conformity with accounting principles generally accepted in the United States of America (\"generally accepted accounting principles\"). Also, in our opinion, the Company maintained, in all material respects, effective internal control over financial reporting as of December 31, 2019, based on criteria established in Internal Control - Integrated Framework (2013) issued by COSO.\nBasis for Opinions\nThe Company’s management is responsible for these financial statements, for maintaining effective internal control over financial reporting, and for its assessment of the effectiveness of internal control over financial reporting, included in the accompanying Management’s Report on Internal Control Over Financial Reporting. Our responsibility is to express an opinion on these financial statements and an opinion on the Company’s internal control over financial reporting based on our audits. We are a public accounting firm registered with the Public Company Accounting Oversight Board (United States) (PCAOB) and are required to be independent with respect to the Company in accordance with the U.S. federal securities laws and the applicable rules and regulations of the Securities and Exchange Commission and the PCAOB.\nWe conducted our audits in accordance with the standards of the PCAOB. Those standards require that we plan and perform the audits to obtain reasonable assurance about whether the financial statements are free of material misstatement, whether due to error or fraud, and whether effective internal control over financial reporting was maintained in all material respects.\nOur audits of the financial statements included performing procedures to assess the risks of material misstatement of the financial statements, whether due to error or fraud, and performing procedures to respond to those risks. Such procedures included examining, on a test basis, evidence regarding the amounts and disclosures in the financial statements. Our audits also included evaluating the accounting principles used and significant estimates made by management, as well as evaluating the overall presentation of the financial statements. Our audit of internal control over financial reporting included obtaining an understanding of internal control over financial reporting, assessing the risk that a material weakness exists, and testing and evaluating the design and operating effectiveness of internal control based on the assessed risk. Our audits also included performing such other procedures as we considered necessary in the circumstances. We believe that our audits provide a reasonable basis for our opinions.\nDefinition and Limitations of Internal Control over Financial Reporting\nA company’s internal control over financial reporting is a process designed to provide reasonable assurance regarding the reliability of financial reporting and the preparation of financial statements for external purposes in accordance with generally accepted accounting principles. A company’s internal control over financial reporting includes those policies and procedures that (1) pertain to the maintenance of records that, in reasonable detail, accurately and fairly reflect the transactions and dispositions of the assets of the company; (2) provide reasonable assurance that transactions are recorded as necessary to permit preparation of financial statements in accordance with generally accepted accounting principles, and that receipts and expenditures of the company are being made only in accordance with authorizations of management and directors of the company; and (3) provide reasonable assurance regarding prevention or timely detection of unauthorized acquisition, use, or disposition of the company’s assets that could have a material effect on the financial statements.\nBecause of its inherent limitations, internal control over financial reporting may not prevent or detect misstatements. Also, projections of any evaluation of effectiveness to future periods are subject to the risk that controls may become inadequate because of changes in conditions, or that the degree of compliance with the policies or procedures may deteriorate.\nCritical Audit Matters\nThe critical audit matters communicated below are matters arising from the current-period audit of the financial statements that were communicated or required to be communicated to the audit committee and that (1) relate to accounts or disclosures that are material to the financial statements and (2) involved our especially challenging, subjective, or complex judgments. The communication of critical audit matters does not alter in any way our opinion on the financial statements, taken as a whole, and we are not, by communicating the critical audit matters below, providing separate opinions on the critical audit matters or on the accounts or disclosures to which they relate.\nAsbestos Related Liabilities - North American Refractories Company (NARCO) Trust Liability - Refer to Note 20 to the financial statements\nCritical Audit Matter Description\nThe Company is named in asbestos related personal injury claims related to a predecessor company, NARCO. Such claims arise primarily from alleged occupational exposure to asbestos-containing refractory brick and mortar for high-temperature applications.\nSince becoming effective in 2013, the NARCO Trust has experienced delays in becoming fully operational. Disputes and challenges regarding violations of the Trust Distribution Procedures, an expired 18-month standstill agreement and limited claims payments, have all contributed to a lack of sufficient normalized data based on actual claims processing experience in the NARCO Trust.\nAlthough the Company knows the number of claims filed with the NARCO Trust each year, it is not able at this time to determine the portion of the NARCO Trust Liability which represents asserted versus unasserted claims due to the lack of sufficiently reliable claims data.\nMaintaining the NARCO Trust Liability is inherently subjective as it requires management to make significant assumptions and judgements regarding the sufficiency and reliability of historical claims filing data and experience and expected future claims filing rates.\nGiven the subjectivity in maintaining the NARCO Trust Liability the auditing of the NARCO Trust Liability required a high degree of auditor judgment.\nHow the Critical Audit Matter Was Addressed in the Audit\nOur audit procedures related to the NARCO Trust Liability included the following, among others:\n•\nWe tested the effectiveness of internal controls over the annual third-party assessment of the sufficiency and reliability of the NARCO Trust claims data including controls over the review of management’s assumptions and claims data used to estimate the NARCO Trust Liability.\n•\nWe made inquiries of internal and external legal counsel regarding the regulatory and litigation environments related to the NARCO Trust Liability.\n•\nWith the assistance of our internal actuarial specialists, we evaluated NARCO Trust claims data to assess the reasonableness of management’s conclusion that such data is not sufficiently reliable to enable the Company to update the estimate of the recorded NARCO Trust Liability.\nRevenue Recognition and Contracts with Customers - Long-Term Fixed Price Contracts (Performance Materials and Technologies (PMT)) - Refer to Note 1 and Note 7 to the financial statements\nCritical Audit Matter Description\nThe Company’s PMT segment develops and manufactures advanced materials, process technologies, and automation solutions. A portion of PMT’s revenue is generated from long-term fixed price contracts whereby revenue is recognized over the contract term (“over time”) as the work progresses and control of the goods and services is transferred to the customer. Revenue for these contracts is recognized based on the extent of progress toward completion, generally measured by using a cost-to-cost basis input method.\nAccounting for PMT’s long-term fixed price contracts requires management’s judgment in estimating total contract costs. Contract costs, which can be incurred over several years, are largely determined based on negotiated or estimated purchase contract terms and consider factors such as historical performance, technical and schedule risk, internal and subcontractor performance trends, and anticipated labor agreements.\nGiven the significant judgments necessary to estimate costs associated with these long-term contracts, auditing PMT’s long-term fixed price contracts requires a high degree of auditor judgment.\nHow the Critical Audit Matter Was Addressed in the Audit\nOur audit procedures related to PMT’s long-term fixed price contracts included the following, among others:\n•\nWe tested the effectiveness of internal controls over the recognition of revenue and the determination of estimated contract costs including controls over the review of management’s assumptions and key inputs used to recognize revenue and costs on long-term fixed price contracts using the cost-to-cost input method.\n•\nWe evaluated the appropriateness and consistency of management’s methods and assumptions used to recognize revenue and costs on long-term fixed price contracts using the cost-to-cost input method to recognize revenue over time.\n•\nWe selected a sample of long-term fixed price contracts and evaluated the estimates of total cost for each of the long-term fixed price contracts by:\n▪\nComparing costs incurred to date to the costs management estimated to be incurred to date.\n▪\nEvaluating management’s ability to achieve the estimates of total cost by performing corroborating inquiries with Company personnel, including project managers, and comparing the estimates to documentation such as management’s work plans, contract terms and requirements, and purchase orders with suppliers. Our evaluation of management’s assumptions included consideration of historical and current project performance such as consistency of gross margin, identified risks related to project timing including technical and schedule matters, and the status of internal and third-party activities such as hardware, software, and labor.\n▪\nPerforming a substantive analytical procedure, in which we compared the estimated costs to complete to an independent estimate of costs to complete that factored in information obtained from the corroborating inquiries and documentation obtained such as management’s work plans, contract terms and requirements, and purchase orders with suppliers.\n/s/ Deloitte & Touche LLP\nCharlotte, North Carolina\nFebruary 14, 2020\nWe have served as the Company’s auditor since 2014.",
    "item_9": "Item 9. Changes in and Disagreements with Accountants on Accounting and Financial Disclosure\nNot Applicable.",
    "item_9A": "Item 9A. Controls and Procedures\nHoneywell management maintains disclosure controls and procedures designed to provide reasonable assurance that information required to be disclosed in reports filed under the Securities Exchange Act of 1934, as amended (Exchange Act) is recorded, processed, summarized and reported within the specified time periods and accumulated and communicated to our management, including our principal executive officer and principal financial officer, as appropriate to allow timely decisions regarding required disclosure. There have been no changes that have materially affected, or are reasonably likely to materially affect, Honeywell’s internal control over financial reporting that have occurred during the quarter ended December 31, 2019.\nOur management, with the participation of our CEO and CFO, evaluated the effectiveness of our disclosure controls and procedures (as defined in Rules 13a-15(e) or 15d-15(e) promulgated under the Exchange Act) at December 31, 2019. Based on these evaluations, our CEO and CFO concluded that our disclosure controls and procedures required by paragraph (b) of Rules 13a-15 or 15d-15 were effective as of December 31, 2019.\nManagement’s Report on Internal Control Over Financial Reporting\nHoneywell management is responsible for establishing and maintaining adequate internal control over financial reporting and for its assessment of the effectiveness of internal control over financial reporting as defined in Rules 13a-15(f) and 15d-15(f) under the Securities Exchange Act of 1934. Honeywell’s internal control over financial reporting is a process designed to provide reasonable assurance to our management and board of directors regarding the reliability of financial reporting and the preparation of financial statements for external purposes in accordance with generally accepted accounting principles.\nBecause of its inherent limitations, internal control over financial reporting may not prevent or detect misstatements.\nManagement assessed the effectiveness of Honeywell’s internal control over financial reporting as of December 31, 2019. In making this assessment, management used the criteria set forth by the Committee of Sponsoring Organizations of the Treadway Commission (COSO) in Internal Control-Integrated Framework (2013).\nBased on this assessment, management determined that Honeywell maintained effective internal control over financial reporting as of December 31, 2019.\nThe effectiveness of Honeywell’s internal control over financial reporting as of December 31, 2019 has been audited by Deloitte & Touche LLP, an independent registered public accounting firm, as stated in their report which is included in Item 8. Financial Statements and Supplementary Data.",
    "item_9B": "Item 9B. Other Information\nNot Applicable.\nPART III.",
    "item_9C": "",
    "item_10": "Item 10. Directors and Executive Officers of the Registrant\nInformation relating to the Directors of Honeywell, as well as information relating to compliance with Section 16(a) of the Securities Exchange Act of 1934, will be contained in our definitive Proxy Statement involving the election of the Directors, which will be filed with the SEC pursuant to Regulation 14A not later than 120 days after December 31, 2019, and such information is incorporated herein by reference. Certain other information relating to the Executive Officers of Honeywell appears in Part I of this Annual Report on Form 10-K under the heading Executive Officers of the Registrant.\nThe members of the Audit Committee of our Board of Directors are: George Paz (Chair), Kevin Burke, Jaime Chico Pardo (ex officio member), D. Scott Davis, Linnet Deily, Judd Gregg and Robin L. Washington. The Board has determined that Mr. Paz, Mr. Davis and Ms. Washington are audit committee financial experts as defined by applicable SEC rules and that Mr. Paz, Mr. Burke, Mr. Davis, Ms. Deily and Ms. Washington satisfy the accounting or related financial management expertise criteria established by the NYSE. All members of the Audit Committee are independent as that term is defined in applicable SEC rules and NYSE listing standards.\nHoneywell’s corporate governance policies and procedures, including the Code of Business Conduct, Corporate Governance Guidelines and Charters of the Committees of the Board of Directors are available, free of charge, on our website under the heading Investor Relations (see Corporate Governance), or by writing to Honeywell, 300 South Tryon Street, Charlotte, North Carolina 28202, c/o Vice President and Corporate Secretary. Honeywell’s Code of Business Conduct applies to all Honeywell directors, officers (including the Chief Executive Officer, Chief Financial Officer and Controller) and employees. Amendments to or waivers of the Code of Business Conduct granted to any of Honeywell’s directors or executive officers will be published on our website within five business days of such amendment or waiver.",
    "item_11": "Item 11. Executive Compensation\nInformation relating to executive compensation is contained in the Proxy Statement referred to above in Item 10. Directors and Executive Officers of the Registrant, and such information is incorporated herein by reference.",
    "item_12": "Item 12. Security Ownership of Certain Beneficial Owners and Management and Related Stockholder Matters\nInformation relating to security ownership of certain beneficial owners and management and related stockholder matters is contained in the Proxy Statement referred to above in Item 10. Directors and Executive Officers of the Registrant, and such information is incorporated herein by reference.\nEQUITY COMPENSATION PLANS\nAs of December 31, 2019, information about our equity compensation plans is as follows:\n(1)\nEquity compensation plans approved by shareowners which are included in column (a) of the table are the 2016 Stock Incentive Plan, the 2011 Stock Incentive Plan, and the 2006 Stock Incentive Plan (including 18,473,640\nshares of Common Stock to be issued for options; 2,820,462 RSUs subject to continued employment; 402,054 RSUs at target level and subject to company performance metrics and continued employment, and 525,252 deferred RSUs); and the 2016 Stock Plan for Non-Employee Directors and the 2006 Stock Plan for Non-Employee Directors (including 257,922 shares of Common Stock to be issued for options; and 17,549 RSUs subject to continued services). RSUs included in column (a) of the table represent the full number of RSUs awarded and outstanding whereas the number of shares of Common Stock to be issued upon vesting will be lower than what is reflected on the table because the value of shares required to meet employee tax withholding requirements are not issued.\nBecause the number of future shares that may be distributed to employees participating in the Honeywell Global Stock Plan is unknown, no shares attributable to that plan are included in column (a) of the table above.\n(2)\nColumn (b) relates to stock options and does not include any exercise price for RSUs because an RSU’s value is dependent upon attainment of certain performance goals or continued employment or service and they are settled for shares of Common Stock on a one-for-one basis.\n(3)\nThe number of shares that may be issued under the 2016 Stock Incentive Plan as of December 31, 2019 is 37,364,854 which includes the following additional shares that may again be available for issuance: shares that are settled for cash, expire, are canceled, or under similar prior plans, are tendered as option exercise price or tax withholding obligations, are reacquired with cash option exercise price or with monies attributable to any tax deduction to Honeywell upon the exercise of an option, or are under any outstanding awards assumed under any equity compensation plan of an entity acquired by Honeywell. No securities are available for future issuance under the 2011 Stock Incentive Plan or the 2006 Stock Incentive Plan.\nThe number of shares that may be issued under the Honeywell Global Stock Plan as of December 31, 2019 is 1,770,812. This plan is an umbrella plan for three plans described below maintained solely for eligible employees of participating non-U.S. countries.\n•\nThe UK Sharebuilder Plan allows an eligible UK employee to invest taxable earnings in Common Stock. The Company matches those shares and dividends paid are used to purchase additional shares of Common Stock. For the year ending December 31, 2019, 34,787 shares were credited to participants’ accounts under the UK Sharebuilder Plan.\n•\nThe Honeywell Aerospace Ireland Share Participation Plan and the Honeywell Measurex (Ireland) Limited Group Employee Profit Sharing Plan allow eligible Irish employees to contribute a percentage of base pay and/or bonus that is invested in Common Stock. For the year ending December 31, 2019, 2,083 shares of Common Stock were credited to participants’ accounts under these plans.\nThe remaining 866,273 shares included in column (c) are shares remaining under the 2016 Stock Plan for Non-Employee Directors.\n(4)\nEquity compensation plans not approved by shareowners included in the table refers to the Honeywell Excess Benefit Plan and Supplemental Savings Plan.\nThe Honeywell Excess Benefit Plan and Supplemental Savings Plan for highly compensated employees is an unfunded, non-tax qualified plan that provides benefits equal to the employee deferrals and company matching allocations that would have been provided under Honeywell’s U.S. tax-qualified savings plan if the Internal Revenue Code limitations on compensation and contributions did not apply. The Company matching contribution is credited to participants’ accounts in the form of notional shares of Common Stock. The notional shares are distributed in the form of actual shares of Common Stock. The number of shares to be issued under this plan based on the value of the notional shares as of December 31, 2019 is 293,763.\n(5)\nColumn (b) does not include any exercise price for notional shares allocated to employees under Honeywell’s equity compensation plans not approved by shareowners because all of these shares are only settled for shares of Common Stock on a one-for-one basis.\n(6)\nThe amount of securities available for future issuance under the Honeywell Excess Benefit Plan and Supplemental Savings Plan is not determinable because the number of securities that may be issued under this plan depends upon the amount deferred to the plan by participants in future years.",
    "item_13": "Item 13. Certain Relationships and Related Transactions\nInformation relating to certain relationships and related transactions is contained in the Proxy Statement referred to above in Item 10. Directors and Executive Officers of the Registrant, and such information is incorporated herein by reference.",
    "item_14": "Item 14. Principal Accounting Fees and Services\nInformation relating to fees paid to and services performed by Deloitte & Touche LLP and our Audit Committee’s pre-approval policies and procedures with respect to non-audit services are contained in the Proxy Statement referred to above in Item 10. Directors and Executive Officers of the Registrant, and such information is incorporated herein by reference.\nPART IV.",
    "item_15": "Item 15. Exhibits and Financial Statement Schedules",
    "item_16": "Item 16. Form 10-K Summary\nNone.\nEXHIBIT INDEX\nExhibit No.\nDescription\n3(i)\nAmended and Restated Certificate of Incorporation of Honeywell International Inc., as amended April 23, 2018 (incorporated by reference to Exhibit 3(i) to Honeywell’s Form 10-Q for the quarter ended June 30, 2018)\n3(ii)\nBy-laws of Honeywell International Inc., as amended April 23, 2018 (incorporated by reference to Exhibit 3(ii) to Honeywell’s 10-Q for the quarter ended June 30, 2018)\n4.1\nHoneywell International Inc. is a party to several long-term debt instruments under which, in each case, the total amount of securities authorized does not exceed 10% of the total assets of Honeywell and its subsidiaries on a consolidated basis. Pursuant to paragraph 4(iii)(A) of Item 601(b) of Regulation S-K, Honeywell agrees to furnish a copy of such instruments to the Securities and Exchange Commission upon request.\n4.2\nDescription of Honeywell International Inc. Securities Registered Pursuant to Section 12 of the Securities Exchange Act of 1934 (filed herewith)\n10.1*\nDeferred Compensation Plan for Non-Employee Directors of Honeywell International Inc., as amended and restated (incorporated by reference to Exhibit 10.2 to Honeywell’s Form 10-Q for quarter ended June 30, 2003)\n10.2*\nAmendment to Deferred Compensation Plan for Non-Employee Directors of Honeywell International Inc., as amended and restated (incorporated by reference to Exhibit 10.1 to Honeywell’s Form 8-K filed December 21, 2004)\n10.3*\nAmendment to Deferred Compensation Plan for Non-Employee Directors of Honeywell International Inc., as amended and restated (incorporated by reference to Exhibit 10.2 to Honeywell’s Form 10-K for the year ended December 31, 2005)\n10.4*\nHoneywell International Inc. Incentive Compensation Plan for Executive Employees, as amended and restated (incorporated by reference to Exhibit 10.4 to Honeywell’s Form 10-K for the year ended December 31, 2018)\n10.5*\nHoneywell Excess Benefit Plan and Honeywell Supplemental Savings Plan, as amended and restated (filed herewith)\n10.6*\nHoneywell International Inc. Severance Plan for Designated Officers, as amended and restated (incorporated by reference to Exhibit 10.6 to Honeywell’s Form 10-K for the year ended December 31, 2013)\n10.7*\nHoneywell Deferred Incentive Compensation Plan, as amended and restated (filed herewith)\n10.8*\nHoneywell International Inc. Supplemental Pension Plan, as amended and restated (incorporated by reference to Exhibit 10.10 to Honeywell’s Form 10-K for the year ended December 31, 2008)\n10.9*\nAmendment to Honeywell International Inc. Supplemental Pension Plan, as amended and restated (incorporated by reference to Exhibit 10.10 to Honeywell’s Form 10-K for the year ended December 31, 2009)\n10.10*\nAmendment to Honeywell International Inc. Supplemental Pension Plan, as amended and restated (incorporated by reference to Exhibit 10.7 to Honeywell’s Form 10-K for the year ended December 31, 2015)\n10.11*\nHoneywell International Inc. Supplemental Executive Retirement Plan for Executives in Career Band 6 and Above, as amended and restated (incorporated by reference to Exhibit 10.12 to Honeywell’s Form 10-K for the year ended December 31, 2008)\n10.12*\nAmendment to Honeywell International Inc. Supplemental Executive Retirement Plan for Executives in Career Band 6 and Above, as amended and restated (incorporated by reference to Exhibit 10.12 to Honeywell’s Form 10-K for the year ended December 31, 2009)\n10.13*\nAmendment to Honeywell International Inc. Supplemental Executive Retirement Plan for Executives in Career Band 6 and Above, as amended and restated (incorporated by reference to Exhibit 10.9 to Honeywell’s Form 10-K for the year ended December 31, 2013)\n10.14*\nAmendment to Honeywell International Inc. Supplemental Executive Retirement Plan for Executives in Career Band 6 and Above, as amended and restated (incorporated by reference to Exhibit 10.8 to Honeywell’s Form 10-K for the year ended December 31, 2015)\nExhibit No.\nDescription\n10.15*\nHoneywell Supplemental Defined Benefit Retirement Plan, as amended and restated (incorporated by reference to Exhibit 10.13 to Honeywell’s Form 10-K for the year ended December 31, 2008)\n10.16*\nAmendment to Honeywell Supplemental Defined Benefit Retirement Plan, as amended and restated (incorporated by reference to Exhibit 10.13 to Honeywell’s Form 10-K for the year ended December 31, 2009)\n10.17*\nAmendment to Honeywell Supplemental Defined Benefit Retirement Plan, as amended and restated (incorporated by reference to Exhibit 10.9 to Honeywell’s Form 10-K for the year ended December 31, 2015)\n10.18*\nHoneywell International Inc. Severance Plan for Corporate Staff Employees (Involuntary Termination Following a Change in Control), as amended and restated (incorporated by reference to Exhibit 10.12 to Honeywell’s Form 10-K for the year ended December 31, 2013)\n10.19*\nHoneywell Supplemental Retirement Plan (incorporated by reference to Exhibit 10.24 to Honeywell’s Form 10-K for the year ended December 31, 2006)\n10.20*\n2006 Stock Incentive Plan of Honeywell International Inc. and Its Affiliates, as amended and restated (incorporated by reference to Exhibit 10.26 to Honeywell’s Form 10-K for the year ended December 31, 2008)\n10.21*\nAmendment to the 2006 Stock Incentive Plan of Honeywell International Inc. and Its Affiliates, as amended and restated (incorporated by reference to Exhibit 10.1 to Honeywell’s 10-Q for the quarter ended March 31, 2011)\n10.22*\n2006 Stock Incentive Plan of Honeywell International Inc. and Its Affiliates-Form of Option Award Agreement (incorporated by reference to Exhibit 10.2 to Honeywell’s Form 10-Q for the quarter ended March 31, 2009)\n10.23*\n2006 Stock Plan for Non-Employee Directors of Honeywell International Inc., as amended and restated (incorporated by reference to Exhibit 10.31 to Honeywell’s Form 10-K for the year ended December 31, 2008)\n10.24*\nAmendment to 2006 Stock Plan for Non-Employee Directors of Honeywell International Inc., as amended and restated (incorporated by reference to Exhibit 10.27 to Honeywell’s Form 10-K for the year ended December 31, 2011)\n10.25*\nAmendment to 2006 Stock Plan for Non-Employee Directors of Honeywell International Inc., as amended and restated (incorporated by reference to Exhibit 10.24 to Honeywell’s Form 10-K for the year ended December 31, 2014)\n10.26*\n2006 Stock Plan for Non-Employee Directors of Honeywell International Inc.-Form of Option Agreement (incorporated by reference to Exhibit 10.3 to Honeywell’s Form 10-Q for the quarter ended March 31, 2012)\n10.27*\n2006 Stock Plan for Non-Employee Directors of Honeywell International Inc.-Form of Restricted Unit Agreement (incorporated by reference to Exhibit 10.4 to Honeywell’s Form 10-Q for the quarter ended March 31, 2012)\n10.28*\n2007 Honeywell Global Employee Stock Plan (incorporated by reference to Honeywell’s Proxy Statement, dated March 12, 2007, filed pursuant to Rule 14a-6 of the Securities Exchange Act of 1934)\n10.29*\n2006 Stock Incentive Plan of Honeywell International Inc. and Its Affiliates-Form of Option Award Agreement, Form 2 (incorporated by reference to Exhibit 10.37 to Honeywell’s Form 10-K for the year ended December 31, 2010)\n10.30*\nLetter Agreement dated September 3, 2009 between Honeywell and Timothy Mahoney (incorporated by reference to Exhibit 10.38 to Honeywell’s Form 10-K for the year ended December 31, 2010)\n10.31*\nForm of Honeywell International Inc. Noncompete Agreement for Senior Executives (incorporated by reference to Exhibit 10.39 to Honeywell’s Form 10-K for the year ended December 31, 2010)\n10.32*\n2011 Stock Incentive Plan of Honeywell International Inc. and its Affiliates (incorporated by reference to Honeywell’s Proxy Statement, dated March 10, 2011, filed pursuant to Rule 14a-6 of the Securities Exchange Act of 1934)\nExhibit No.\nDescription\n10.33*\nAmendment to 2011 Stock Incentive Plan of Honeywell International Inc. and its Affiliates (incorporated by reference to Exhibit 10.36 to Honeywell’s Form 10-K for the year ended December 31, 2012)\n10.34*\nAmendment to 2011 Stock Incentive Plan of Honeywell International Inc. and its Affiliates (incorporated by reference to Exhibit 10.1 to Honeywell’s Form 10-Q for the quarter ended March 31, 2014)\n10.35*\n2011 Stock Incentive Plan of Honeywell International Inc. and its Affiliates-Form of Restricted Unit Agreement (incorporated by reference to Exhibit 10.2 to Honeywell’s Form 10-Q for the quarter ended March 31, 2014)\n10.36*\n2011 Stock Incentive Plan of Honeywell International Inc. and its Affiliates-Form of Restricted Unit Agreement, Form 2 (incorporated by reference to Exhibit 10.3 to Honeywell’s Form 10-Q for the quarter ended March 31, 2014)\n10.37*\n2011 Stock Incentive Plan of Honeywell International Inc. and Its Affiliates-Form of Stock Option Award Agreement (incorporated by reference to Exhibit 10.4 to Honeywell’s Form 10-Q for the quarter ended March 31, 2014)\n10.38*\n2011 Stock Incentive Plan of Honeywell International Inc. and Its Affiliates-Form of Stock Option Award Agreement, Form 2 (incorporated by reference to Exhibit 10.39 to Honeywell’s Form 10-K for the year ended December 31, 2014)\n10.39*\n2011 Stock Incentive Plan of Honeywell International Inc. and Its Affiliates-Form of Growth Plan Agreement (incorporated by reference to Exhibit 10.5 to Honeywell’s Form 10-Q for the quarter ended March 31, 2014)\n10.40*\n2016 Stock Incentive Plan of Honeywell International Inc. and its Affiliates-Form of Performance Plan Grant Agreement (incorporated by reference to Exhibit 10.2 to Honeywell’s Form 10-Q for the quarter ended March 31, 2017)\n10.41*\nLetter Agreement dated February 24, 2012 between Honeywell and Darius Adamczyk (incorporated by reference to Exhibit 10.1 to Honeywell’s Form 10-Q for the quarter ended March 31, 2016)\n10.42*\nOffer letter dated March 31, 2016 from Honeywell International Inc. to Darius Adamczyk (incorporated by reference to Exhibit 99.1 to Honeywell’s Form 8-K filed April 6, 2016)\n10.43*\nEmployment Offer Letter dated March 1, 2017 between Honeywell and Darius Adamczyk (incorporated by reference to Exhibit 99.1 to Honeywell’s Form 8-K filed March 6, 2017)\n10.44*\nOffer letter dated March 11, 2013 from Honeywell International Inc. to Krishna Mikkilineni (incorporated by reference to Exhibit 10.43 to Honeywell’s Form 10-K for the year ended December 31, 2016)\n10.45*\n2016 Stock Incentive Plan of Honeywell International Inc. and its Affiliates (incorporated by reference to Honeywell’s Proxy Statement, dated March 10, 2016, filed pursuant to Rule 14a-6 of the Securities Exchange Act of 1934)\n10.46*\n2016 Stock Incentive Plan of Honeywell International Inc. and its Affiliates-Form of Restricted Unit Agreement (incorporated by reference to Exhibit 10.1 to Honeywell’s Form 10-Q for the quarter ended June 30, 2016)\n10.47*\n2016 Stock Incentive Plan of Honeywell International Inc. and its Affiliates-Form of Restricted Unit Agreement, Form 2 (incorporated by reference to Exhibit 10.2 to Honeywell’s Form 10-Q for the quarter ended June 30, 2016)\n10.48*\n2016 Stock Incentive Plan of Honeywell International Inc. and its Affiliates-Form of Stock Option Award Agreement (incorporated by reference to Exhibit 10.3 to Honeywell’s Form 10-Q for the quarter ended June 30, 2016)\n10.49*\n2016 Stock Plan for Non-Employee Directors (incorporated by reference to Honeywell’s Proxy Statement, dated March 10, 2016, filed pursuant to Rule 14a-6 of the Securities Exchange Act of 1934)\n10.50*\n2016 Stock Plan for Non-Employee Directors of Honeywell International Inc.-Form of Stock Option Award Agreement (incorporated by reference to Exhibit 10.74 to Honeywell’s Form 10-K for the year ended December 31, 2017)\n10.51*\n2016 Stock Plan for Non-Employee Directors of Honeywell International Inc.-Form of Restricted Unit Agreement (incorporated by reference to Exhibit 10.6 to Honeywell’s Form 10-Q for the quarter ended June 30, 2016)\nExhibit No.\nDescription\n10.52*\nUOP LLC Supplemental Pension Plan, as amended and restated (incorporated by reference to Exhibit 10.76 to Honeywell’s 10-K for the year ended December 31, 2017)\n10.53*\nLetter Agreement dated April 1, 2016 between Honeywell and Rajeev Gautam (incorporated by reference to Exhibit 10.1 to Honeywell’s Form 10-Q for the quarter ended March 31, 2018)\n10.54*\nLetter Agreement dated July 27, 2018 between Honeywell and Greg Lewis (incorporated by reference to Exhibit 99.1 to Honeywell’s Form 8-K filed August 2, 2018)\n10.55\n364-Day Credit Agreement, dated as of April 26, 2019, among Honeywell International Inc., the banks, financial institutions, and other institutional lenders parties thereto, Citibank, N.A., as administrative agent, JPMorgan Chase Bank, N.A., as syndication agent, Bank of America, N.A., Barclays Bank PLC, Deutsche Bank Securities Inc., Goldman Sachs Bank USA, Morgan Stanley MUFG Loan Partners, LLC, and Wells Fargo Bank, National Association, as documentation agents, and Citibank N.A. and JPMorgan Chase Bank, N.A., as joint lead arrangers and co-book managers (incorporated by reference to Exhibit 10.1 to Honeywell’s Form 8-K filed April 26, 2019)\n10.56\nAmended and Restated Five-Year Credit Agreement, dated as of April 26, 2019, among Honeywell International Inc., the banks, financial institutions, and other institutional lenders parties thereto, Citibank, N.A., as administrative agent, Citibank Europe PLC, UK Branch, as swing line agent, JPMorgan Chase Bank, N.A., as syndication agent, Bank of America, N.A., Barclays Bank PLC, Deutsche Bank Securities Inc., Goldman Sachs Bank USA, Morgan Stanley MUFG Loan Partners, LLC, and Wells Fargo Bank, National Association, as documentation agents, and Citibank, N.A. and J.P. Morgan Chase Bank N.A., as joint lead arrangers and co-bookrunners (incorporated by reference to Exhibit 10.2 to Honeywell’s Form 8-K filed April 26, 2019)\n10.57*\nOffer Letter dated July 9, 2018 between Honeywell International Inc. and Mark R. James (incorporated by reference to Exhibit 10.1 to Honeywell’s Form 10-Q for the quarter ended March 31, 2019)\n10.58\nIndemnification and Reimbursement Agreement, dated September 12, 2018, by and among Honeywell ASASCO Inc., Honeywell ASASCO 2 Inc., and Honeywell International Inc. (incorporated by reference to Exhibit 2.1 to Honeywell’s Form 8-K filed September 14, 2018)\n10.59\nIndemnification and Reimbursement Agreement dated October 14, 2018 by and among New HAPI Inc. and Honeywell International Inc. (incorporated by reference to Exhibit 2.1 to Honeywell’s Form 8-K filed October 15, 2018)\n10.60*\nRetirement Agreement dated February 7, 2019 between Honeywell and Krishna Mikkilineni (incorporated by reference to Exhibit 10.72 to Honeywell’s Form 10-K for the year ended December 31, 2018)\n10.61*\nAmendment to the 2016 Stock Plan for Non-Employee Directors of Honeywell International Inc. (incorporated by reference to Exhibit 99.2 to Honeywell's Form 8-K filed October 8, 2019)\nSubsidiaries of the Registrant (filed herewith)\n23.1\nConsent of Deloitte & Touche LLP (filed herewith)\nPowers of Attorney (filed herewith)\n31.1\nCertification of Principal Executive Officer Pursuant to Section 302 of the Sarbanes-Oxley Act of 2002 (filed herewith)\n31.2\nCertification of Principal Financial Officer Pursuant to Section 302 of the Sarbanes-Oxley Act of 2002 (filed herewith)\n32.1\nCertification of Principal Executive Officer Pursuant to 18 U.S.C. Section 1350, as Adopted Pursuant to Section 906 of the Sarbanes-Oxley Act of 2002 (filed herewith)\n32.2\nCertification of Principal Financial Officer Pursuant to 18 U.S.C. Section 1350, as Adopted Pursuant to Section 906 of the Sarbanes-Oxley Act of 2002 (filed herewith)\nMine Safety Disclosures (filed herewith)\nExhibit No.\nDescription\n101.INS\nThe following financial statements from the Company's Annual Report on Form 10-K for the year ended December 31, 2019, formatted in Inline XBRL: (i) Consolidated Statements of Cash Flows, (ii) Consolidated Statements of Operations, (iii) Consolidated Statements of Comprehensive Income, (iv) Consolidated Balance Sheets, and (v) Notes to Consolidated Financial Statements, tagged as blocks of text and including detailed tags.\n101.SCH\nXBRL Taxonomy Extension Schema (filed herewith)\n101.CAL\nXBRL Taxonomy Extension Calculation Linkbase (filed herewith)\n101.DEF\nXBRL Taxonomy Extension Definition Linkbase (filed herewith)\n101.LAB\nXBRL Taxonomy Extension Label Linkbase (filed herewith)\n101.PRE\nXBRL Taxonomy Extension Presentation Linkbase (filed herewith)\nThe Exhibits identified above with an asterisk (*) are management contracts or compensatory plans or arrangements.\n** Certain schedules and similar attachments have been omitted pursuant to Item 601(b)(2) of Regulation S-K. The registrant hereby undertakes to furnish copies of any of the omitted schedules and similar attachments upon request by the U.S. Securities and Exchange Commission.",
    "stock_ticker": "HON"
}