{
    "cik": "1057352",
    "company": "COSTAR GROUP, INC.",
    "filing_type": "10-K",
    "filing_date": "2024-02-22",
    "period_of_report": "2023-12-31",
    "sic": "7389",
    "state_of_inc": "DE",
    "state_location": "DC",
    "fiscal_year_end": "1231",
    "filing_html_index": "https://www.sec.gov/Archives/edgar/data/1057352/0001057352-24-000013-index.html",
    "htm_filing_link": "https://www.sec.gov/Archives/edgar/data/1057352/000105735224000013/csgp-20231231.htm",
    "complete_text_filing_link": "https://www.sec.gov/Archives/edgar/data/1057352/0001057352-24-000013.txt",
    "filename": "1057352_10K_2023_0001057352-24-000013.htm",
    "item_1": "Item 1. Business\nIn this Report, the words “we,” “our,” “us,” “CoStar Group” or the “Company” refer to CoStar Group, Inc. and its direct and indirect wholly owned subsidiaries. This Report also refers to our websites, but information contained on those sites is not part of this Report.\nCoStar Group, founded in 1987, is a leading provider of online real estate marketplaces, information and analytics in the U.S. and U.K. based on the fact that we own and operate leading online marketplaces for commercial real estate and apartment listings in the U.S., based on the numbers of unique visitors and site visits per month; provide more information, analytics and marketing services than any of our competitors; offer the most comprehensive commercial real estate database available; and have the largest commercial real estate research department in the industry. We have created and compiled a standardized platform of information, analytics and online marketplace services where industry professionals and consumers of commercial real estate, including apartments, and the related business communities, can continuously interact and facilitate transactions by efficiently accessing and exchanging accurate and standardized real estate-related information. Our service offerings span all commercial property types, including office, retail, industrial, multifamily, land, mixed-use and hospitality. Through our Homes.com Network and our acquisition of OnTheMarket, we also offer online platforms that manage workflow and marketing for residential real estate agents and brokers and provide portals for homebuyers to view residential property listings.\nIndustry Overview\nThe market for real estate information and analysis is vast, based on the variety, volume and value of transactions related to real estate. Each transaction has multiple participants and multiple information requirements, and in order to facilitate transactions, industry participants must have extensive, accurate and current information and analysis. Members of the real estate and related business community require daily access to current data such as space availability, properties for-sale, rental units available, rental rates, vacancy rates, tenant movements, comparable sales, supply, new construction, absorption rates and other important market developments to carry out their businesses effectively. Market research (including historical and forecast conditions) and applied analytics are instrumental to the success of industry participants. There is a strong need for an efficient marketplace, where real estate professionals can exchange information, evaluate opportunities using standardized data and interpretive analyses and interact with each other on a continuous basis.\nA large number of parties involved in commercial and residential real estate and the related business community make use of the services we provide in order to obtain information they need to conduct their businesses, including:\n• Sales and leasing brokers • Government agencies\n• Property owners • Mortgage-backed security issuers\n• Property managers • Appraisers\n• Design and construction professionals • Pension fund managers\n• Real estate developers • Reporters\n• Real estate investment trust managers • Tenant vendors\n• Investment and commercial bankers • Building services vendors\n• Mortgage bankers • Communications providers\n• Mortgage brokers • Insurance companies’ managers\n• Retailers • Institutional advisors\n• Hospitality owners • Investors and asset managers\n• Real estate agents\nThe commercial real estate and related business community historically operated in an inefficient marketplace because of the fragmented approach to gathering and exchanging information within the marketplace. Various organizations, including hundreds of brokerage firms, directory publishers and local research companies, collected data on specific markets and developed software to analyze the information they independently gathered. This highly fragmented methodology resulted in duplication of efforts in the collection and analysis of information, excessive internal cost and the creation of non-standardized data containing varying degrees of accuracy and comprehensiveness, resulting in a formidable information gap.\nThe creation and maintenance of a standardized information platform for commercial real estate requires infrastructure including a standardized database, accurate and comprehensive research capabilities, experienced analysts, easy-to-use technology and intensive participant interaction. By combining our extensive database, researchers, our experienced team of analysts and economists, technological expertise and broad customer base, we believe that we have created such a platform.\nThe apartment rental advertising industry serves property managers and owners who are tasked with finding renters to occupy vacant apartments, as well as renters who are searching for their next home. Property managers have several options at their disposal, including their own websites, drive-by and outdoor advertising, traditional classified ads, free online listing services, search engine marketing and ILS, like Apartments.com and the network of apartment listing websites we own and operate. Many apartment ILS websites feature only the rental availabilities that larger property owners pay to advertise, resulting in a poor user experience in which the renter’s search criteria return either limited or no results, irrelevant results or stale results that do not represent actual availabilities.\nWe believe that consumers expect accurate, actionable and comprehensive apartment rental information. Our apartment ILS websites include renter-focused features like the ability to filter search results according to various criteria (e.g., commute time to work); professional images of the properties, including immersive videos and 3-D interactive models; custom neighborhood profiles; and tenant reviews. Our network of apartment listing websites draws on our multifamily database and includes researched and verified information. We proactively gather information on available rentals to improve the accuracy of the listings on our apartment ILS websites, including real time unit-level availability, current pricing and rent specials. We have continually invested in our network to improve the features and services offered to property managers and website users. Recent additions include: dynamic lead forms that provide more information about prospective residents, making rent trends information publicly available, free digital ad retargeting and integrated online rental solutions, including lease applications with tenant credit and background checks. We believe that we have created and maintain easily searchable apartment ILS websites with a comprehensive selection of rentals, information on actual rental availabilities and rents and in-depth data on neighborhoods, as well as easy to use and actionable tools for the rental process.\nWe believe that consumers expect accurate, actionable and comprehensive homes-for-sale information on a platform that allows collaboration between homebuyers and agents. Our residential websites include homebuyer-focused features like the ability to filter search results according to various criteria (e.g., home features, view and lot type), review rankings of nearby schools and tools to educate consumers on the home buying process. We plan to develop original, media-rich content of neighborhoods, schools, parks and condominium buildings' amenities and common areas to supplement information in agent listings. We are designing tools to facilitate collaboration between homebuyers and agents.\nStrategy\nOur strategy is to provide real estate industry professionals and consumers with critical knowledge to explore and complete transactions by offering the most comprehensive, timely and standardized information on real estate and the right tools to be able to effectively utilize that information. Over time, we have expanded, and we continue to expand, our services for real estate information, analytics and online marketplaces in an effort to continue to meet the needs of the industry as it grows and evolves.\nOur standardized platform includes the most comprehensive proprietary database of commercial real estate information in the industry; the largest research department in the commercial real estate industry; proprietary data collection, information management and quality control systems; a large in-house product development team; a broad suite of web-based information, analytics and online marketplace services; a large team of analysts and economists; risk management tools; and a large, diverse base of clients. Our database has been developed and enhanced for more than 35 years by a research department that makes daily database updates. In addition to our internal efforts to grow the database, we have obtained and assimilated a number of proprietary databases. Our comprehensive commercial real estate database powers our information services, sources data used in our analytic services and provides content for most of our online marketplace services and our auction platform. Our ability to utilize the same commercial real estate information across our standardized platform creates efficiencies in operations and improves data quality for our customers.\nWe deliver our comprehensive commercial real estate information content to our customers primarily via an integrated solution of online service offerings that includes information about space available for-lease, comparable sales information, information about properties for-sale, tenant information, internet marketing services, risk management tools, analytical capabilities, information for clients’ websites, information about industry professionals and their business relationships, data integration and industry news. We also operate complementary online marketplaces for commercial and residential real estate listings and apartment rentals, as well as a commercial real estate auction platform. We strive to cross-sell our services to our customers in order to best suit their needs.\nWe manage and report our business geographically in two operating segments, with our primary areas of measurement and decision-making being North America, which includes the U.S. and Canada, and International, which primarily includes Europe, Asia-Pacific and Latin America. Information about our revenues, long-lived assets and total assets derived from and located in foreign countries is included in Notes 2, 3 and 14 of the Notes to the Consolidated Financial Statements included in Part IV of this Report. Revenues, EBITDA and total assets and liabilities for each of our segments are set forth in Notes 3 and 14 of the Notes to the Consolidated Financial Statements, included in Part IV of this Report. Information about risks associated with our foreign operations is included in “Item 1A. Risk Factors” and “Item 7A. Quantitative and Qualitative Disclosures about Market Risk” in this Report.\nCoStar’s Comprehensive Database\nWe have spent more than 35 years building and acquiring databases of commercial real estate information, which includes information on properties, leasing, sales, comparable sales, tenants and demand statistics, as well as digital images, drone videos and 3-D tours. This highly complex database is comprised of hundreds of data fields, tracking such categories as location, site and zoning information, building characteristics, space and unit characteristics and availability, tax assessments, true ownership, sales and lease comparables, multi-family rents, vacancies and concessions, space requirements, retail locations, mortgage and deed information, for-sale and for-lease listings, fund data, income and expense histories, tenant names, tenant credit scores, view of company locations, lease expirations, contact information, historical trends, forecasts and demographic information. The database also includes building photographs, aerial photographs and videos, 3-D virtual tours, plat maps and floor plans.\nCoStar Research\nResearch Department. Our research professionals undergo an extensive training program so that we can maintain consistent research methods and processes throughout our research department. Our researchers collect and analyze commercial real estate information through phone calls, e-mails and additional research methods including field inspections, public records review, news monitoring, third-party data feeds and user entered content. We have also set up direct feeds from larger apartment sites, owners and brokers, and have put in place an automated system that compiles information sourced from the internet in order to provide the most up-to-date information.\nOur researchers are responsible for maintaining the accuracy and reliability of our database information, training our clients to use CoStar Group products and handling their customer service questions, creating a \"one touch\" approach to customer care. Because of the importance commercial real estate professionals place on our data and our prominent position in the industry,\nmany of these professionals routinely take the initiative and proactively report available space and transactions through our online tool, which we refer to as our Marketing Center, or directly to our researchers.\nOur field research efforts include physical inspections of properties in order to research new availabilities, find additional property inventory, identify new construction, collect tenant information, verify existing information, photograph properties and create high quality videos of interior spaces (including walk-through videos and 3-D virtual tours), amenities and exterior features of properties. Our field researchers are equipped with high resolution digital cameras and handheld laser instruments to precisely measure buildings and geo-code and position them on digital maps. A typical site inspection of a commercial property consists of photographing the building, capturing interior images, videos and 3-D tours, measuring the building, geo-coding the building, capturing “for-sale” or “for-lease” sign information, counting parking spaces, assessing property condition and construction and gathering tenant information. Field researchers also canvass properties, collecting tenant data suite-by-suite. We also utilize a low-flying airplane and a fleet of drones to conduct aerial research of commercial real estate. We place researchers on the low-flying aircraft to scout new commercial developments and take aerial photographs and videos. Our U.S. drone operators are Federal Aviation Administration certified and trained to capture aerial photographs and videos. Our drone operators in the U.K. and Canada are certified and trained to Civil Aviation Authority and Transport Canada standards, respectively, with a permission for commercial operations pending.\nWe are leveraging our capabilities developed from our extensive commercial real estate research efforts to produce original, media rich content of neighborhoods, schools, parks and condominium buildings' amenities and common areas for our residential products using professional photographers and a fleet of drones to conduct aerial research of residential real estate.\nData and Image Providers. We license a small portion of our data and images from public record providers and third-party data sources. Licensing agreements with these entities allow us to use a variety of commercial real estate information, including property ownership, tenant information, demographic information, maps, aerial photographs and 3-D virtual apartment tours of apartment communities, all of which enhance our services. These license agreements generally grant us a non-exclusive license to use the data and images in the creation and supplementation of our information, analytics and online marketplaces.\nManagement and Quality Control Systems. Our research processes include automated and non-automated controls to ensure the integrity of the data collection process. A large number of automated data quality tests check for potential errors, including occupancy date conflicts, available square footage greater than building area, typical floor space greater than building area and expired leases. We also monitor changes to critical fields of information to ensure all information is kept in compliance with our standard definitions and methodology. Our non-automated quality control procedures include:\n•Calling our information sources on recently updated properties to re-verify information;\n•Reviewing recorded or live listen phone calls (in states where applicable) to ensure information was properly sourced and correctly captured;\n•Performing periodic research audits and field checks to determine if we correctly canvassed buildings;\n•Providing training and retraining to our research professionals to ensure accurate and standardized data compilation; and\n•Compiling measurable performance metrics for research teams and managers for feedback on data quality.\nFinally, one of the most important and effective quality control measures we rely on is feedback provided by the commercial real estate professionals using our data every day.\nServices\nOur portfolio of information, analytics and online marketplaces is branded and marketed to our customers and marketplace end users under the primary brands of CoStar, LoopNet, Apartments.com, Homes.com, OnTheMarket,Ten-X, STR. Land.com and BizBuySell. Our services are accessible via the internet and through our mobile applications. Our services are primarily derived from a database of building-specific information and offer customers specialized tools for accessing, analyzing and using our information. Over time, we have enhanced and expanded, and we expect to continue to enhance and expand, our existing information, analytics and online marketplace services. We have developed and we expect to continue to develop additional services leveraging our database to meet the needs of our existing customers as well as potentially new categories of customers.\nOur principal information, analytics and online marketplace services are described in the following paragraphs:\nCoStar\nCoStar is our subscription-based integrated platform for commercial real estate intelligence, which includes information about office, industrial, retail, multifamily, hospitality and student housing properties, properties for sale, comparable sales, tenants, space available for lease, industry professionals and their business relationships, industry news and market status and provides lease analysis, risk management, and hospitality benchmarking capabilities. CoStar is our largest service offering in our North America and International operating segments and contains the following tools and features.\n•Properties provides a comprehensive inventory of office, industrial, retail, multifamily, hospitality and student housing properties and land. We also provide for-lease and for-sale listings, historical data, property analytics, building photographs, demographics, maps and floor plans. Commercial real estate professionals use this tool to identify available space for-lease, evaluate leasing and sale opportunities, value assets and position properties in the marketplace. Our clients also use this feature to analyze market conditions by calculating current vacancy rates, absorption rates or average rental rates, and forecasting future trends based on user-selected variables with powerful map-based search and reporting capabilities.\n•Leasing provides subscribers with comprehensive data on CoStar researched lease transactions and a software tool to capture, manage and maintain their own user-entered lease data, and provides subscribers the ability to analyze this combined lease dataset from an aggregate analytic perspective and generate various reports. In addition, subscribers can incorporate their own data to perform in-depth lease analyses and share those analyses with other subscribers or non-subscribers. This tool can be used to produce an understandable cash flow analysis as well as key metrics about any proposed or existing lease. It combines financial modeling with CoStar’s comprehensive property information, enabling the subscriber to compare lease alternatives, either from a landlord or tenant perspective.\n•Sales is a robust database of commercial real estate sales transactions and is designed for professionals who need to research property comparables, identify market trends, expedite the appraisal process and support property valuations. This feature offers subscribers numerous fields of property information, access to support documents (e.g., deeds of trust) for new comparables, demographics and the ability to view for-sale properties alongside sold properties plotted on a map, aerial image or in a table format.\n•Tenants is a detailed online business-to-business prospecting and analytics tool. providing commercial real estate professionals with the most comprehensive commercial real estate-related tenant information available in our North American markets. CoStar Tenant profiles tenants occupying space in commercial buildings and provides updates on lease expirations - one of the service’s key features - as well as occupancy levels, growth rates and numerous other facts. This allows users to target prospective clients quickly through a searchable database that identifies only those tenants meeting certain criteria.\n•Market Analytics provides owners, investors, brokers, property managers, lenders, appraisers and other commercial real estate professionals the ability to view and report on aggregated market and submarket trends, including leasing, vacancy, rental rates, construction, investment sales activity and overall economic conditions that affect commercial real estate markets. Market Analytics covers all major real estate sectors including office, industrial, retail, multifamily, hospitality and student housing, and provides quantitatively driven and economist curated forecasts of supply, demand, vacancy and rent at the submarket level, and job growth and asset pricing at the market level.\n•Public Record provides access to a searchable database of commercially-zoned parcels in the U.S. Users can search for property attributes and sales transaction, loan, lien and tax assessment information. Information in this module is sourced from numerous counties and jurisdictions that provide this data for ownership, title and property tax assessment purposes.\n•Benchmarking provides hospitality benchmarking, measuring a hotel’s performance against a self-selected aggregated competitive set. These confidential data reports enable customers to understand their market position based on trends and indices. Reports are provided on a monthly, weekly or daily basis, and provide insights about key metrics such as occupancy, ADR and RevPAR. Benchmarking results are only available to industry participants who provide us with data. These participants are typically hotel brands, third-party management companies and owners.\n•Lender provides lenders the tools to manage their loan portfolio and risk. These tools automatically connect the user's portfolio to CoStar's research, market analytics and proprietary COMPASS credit default model, as well as their own data sets, to enable portfolio surveillance, concentration risk monitoring, stress testing and expected credit loss modeling and to support loan originations and underwriting.\nInformation Services\nWe provide real estate and lease management technology solutions, including lease administration, lease accounting and abstraction services, through our CoStar Real Estate Manager service offerings, as well as portfolio and debt analysis, management and reporting capabilities through our CoStar Risk Analytics service offerings. We also provide benchmarking and analytics for the hospitality industry both on a subscription basis and an ad hoc basis. We earn revenue on ad hoc transactions as reports or data are delivered to the customer. We provide information services internationally, through our Business Immo, Belbex and Thomas Daily businesses in France, Spain and Germany, respectively.\n•CoStar Real Estate Manager is a real estate lease administration, portfolio management and lease accounting compliance software solution designed for corporate real estate managers, company executives, financial accounting directors, business unit directors, brokers and project managers. CoStar Real Estate Manager helps users connect real estate initiatives with company strategic goals, streamline portfolio operations, reduce occupancy costs with analytics that track location performance against targets and maximize location performance through proactive portfolio management. Additionally, the software is used to help companies manage their lease accounting compliance and reporting requirements.\n•CoStar Risk Analytics is a trusted partner to many of the largest commercial real estate lenders and CMBS market participants, providing timely data, advanced analytics, time-proven models and extensive experience to support regulatory examinations, risk management and strategic decision making. CoStar Risk Analytics' COMPASS credit default model has been used by commercial real estate lenders, CMBS participants and regulators for over 15 years to estimate required loss reserves, stress test portfolios, generate risk ratings, calculate capital adequacy, underwrite loans, target lending opportunities and price CMBS bonds. Our clients rely on CoStar Risk Analytics for model validations and reporting to support regulatory examinations. Additionally, CoStar Risk Analytics solutions connect client loan and CMBS loan portfolios to CoStar’s industry-leading commercial real estate data, research, analytics and the COMPASS credit model, updated daily, for more informed decision making, portfolio strategy and surveillance. Clients of CoStar Risk Analytics solutions include many of the largest banks, life insurance companies, asset managers, hedge funds, government agencies and regulators.\nMultifamily\nApartments.com, the flagship brand of our network of apartment marketing sites, provides a variety of ad packages and enhancements that allow property managers and owners to fully showcase their apartment community through increased exposure and interactions that allow renters to view, engage and connect with the community. Apartments.com also provides tools to facilitate the rental process, including online tenant applications with background and credit checks and rental payment processing. The Apartments.com Network consists of numerous other apartment marketing sites, including:\n•ApartmentFinder provides lead generation, advertising and internet marketing solutions to property managers and owners through its main site, ApartmentFinder.com.\n•ForRent.com provides digital advertising through a network of four multifamily websites, which includes ForRent.com, AFTER55.com, CorporateHousing.com and ForRentUniversity.com.\n•ApartmentHomeLiving.com provides renters with another national online apartment rental resource that showcases apartments for rent with official prices, pictures, floor plans and detailed information on each apartment.\n•Apartamentos.comTM provides Spanish speaking renters with an online apartment rentals resource offered exclusively in Spanish, with the same primary features found on Apartments.com.\n•WestsideRentals.com specializes in Southern California real estate rentals.\n•Off Campus Partners provides student housing marketplace content and technology to U.S. universities, simplifying the off-campus housing search process for universities, property managers and students.\nOur apartment marketing network of subscription-based advertising services provides property owners, professional property management companies and landlords with a comprehensive advertising destination for their available rental units and offers renters a platform for searching for available rentals. Our apartment marketing network draws on and leverages our multifamily database, which contains detailed information on apartment properties and is designed to meet renter preferences and demands, in order to drive traffic to those sites and attract advertisers who prefer to advertise on heavily trafficked apartment websites. Our network of apartment marketing sites provides a comprehensive selection of rentals, information on actual availabilities and rents and in-depth data on neighborhoods, including restaurants, nightlife, history, schools and other\nfacts important to renters. To help renters find the information that meets their needs, our sites also offer innovative search tools such as the Polygon Search tool, which allow renters to specifically define the area in which they want to find an apartment and Plan Commute tools, which allow renters to search property listings that meet their transportation needs. We also offer complementary services to the rental industry, including the ability for renters to apply for rentals online and for landlords to receive applications, screen tenants and process rental payments and lease renewals.\nLoopNet\nLoopNet is the flagship brand in our network of commercial real estate marketing sites, which also includes LoopNet.co.uk, CityFeet.com and Showcase.com. Our LoopNet online marketplace enables commercial property owners, landlords and real estate brokers working on their behalf to advertise properties for-sale or for-lease and to submit detailed information about property listings. Commercial real estate brokers, buyers and tenants use LoopNet extensively to search for available property listings that meet their criteria. LoopNet offers unique, subscription-based advertising solutions for different segments within the industry and delivers value across its constituent networks. The LoopNet network leverages CoStar Group’s commercial real estate database to provide in-depth and accurate information across all commercial property types, including office, industrial, retail, multifamily, specialty, healthcare, hospitality, sports and entertainment, land and residential. Investors and tenants are also able to consume industry news developed by our in-house editorial team.\nLoopNet Premium Lister is designed for commercial real estate professionals and other customers who seek the broadest possible exposure for their listings, access to leads lists and advanced marketing and searching tools. LoopNet Premium Lister provides subscribers with the ability to market their listings to all LoopNet.com visitors, as well as numerous other features. LoopNet Premium Lister is available for a quarterly or annual subscription.\nLoopNet Diamond, Platinum and Gold Ads are designed for commercial real estate professionals and other customers who seek the broadest possible exposure for their listings, access to leads lists and advanced marketing and searching tools. These LoopNet Ads provide subscribers with full access to our LoopNet network as well as retargeting across a network of prominent sites including the Wall Street Journal, Forbes and Bloomberg. LoopNet Ads are available for a six-month or annual subscription.\nOur international subscription-based online marketplaces are Loopnet.co.uk in the U.K., BureauxLocaux in France and Belbex.com in Spain. These marketplaces provide listings of commercial properties for rent and for sale ranging from traditional offices, serviced offices, co-working spaces, hot-desks, retail locations, industrial units, leisure, hotels and warehousing.\nResidential\nOur Homes.com Network and the acquisition of OnTheMarket have enabled us to expand our offerings to the residential for sale market. Homes.com is a homes for sale listings site that combines our proprietary research with listing information to allow homebuyers an informative and collaborative experience finding homes for sale or lease. Homes.com provides residential real estate professionals subscription-based access to applications that manage residential real estate agent workflow and receives transaction-based revenue for marketing campaigns delivered on third-party platforms. In February 2024, we began selling memberships that allow agents to connect with prospective homebuyers sourced from the agent's own listings. OnTheMarket is a property portal in the U.K. which primarily offers subscriptions-based advertising services to agents.\nOther Marketplaces\nTen-X operates an online auction platform for commercial real estate. Our platform provides brokers, sellers, and buyers access to data-driven technology and marketing tools to expand market visibility and decrease time to close. The platform allows brokers and sellers to onboard assets, evaluate the results of complimentary marketing campaigns and follow up on pre-qualified leads. Buyers can search for properties that meet their investment goals and are given access to market analysis and due diligence documents.\nLand.com is the flagship brand in our network of marketplaces for rural lands for-sale sites, which also includes LandsofAmericaTM, LandAndFarmTM and LandWatch®. Sellers pay a fee to list their land for-sale, and interested buyers can search the respective sites' listings.\nBizBuySell is the flagship brand in our network of marketplaces for operating businesses and franchises for-sale, which also includes BizQuest and FindaFranchise. Business sellers pay a fee to list their operating businesses for-sale, and interested buyers can search the respective sites' listings for free. The BizBuySell, BizQuest and FindaFranchise Franchise Directories allow interested business buyers to search hundreds of franchise opportunities, and franchisors can list their availabilities in the directory on a cost per lead basis.\nWe also provide other services that complement those offered by our primary brands. These include: real estate and lease management technology solutions, lease administration, transaction and project management and lease accounting, through our CoStar Real Estate Manager service offerings; market research, consulting and analysis, portfolio and debt analysis and management and reporting capabilities through our CoStar Investment Analysis and CoStar Risk Analytics service offerings; and benchmarking and analytics for the hospitality industry through our STR offerings.\nOur services are typically distributed to our clients under subscription-based license agreements that typically renew automatically, a majority of which have a term of at least one year. Upon renewal, many of the subscription contract rates may change in accordance with contract provisions or as a result of contract renegotiations. To encourage clients to use our services regularly, we generally charge a fixed monthly amount for our subscription-based services rather than charging fees based on actual platform usage or number of paid clicks. Depending on the type of service, contract rates are generally based on the number of sites, number of users, organization size, the client's business focus, the client's geographic location, the number and types of services to which a client subscribes, the number of properties a client advertises and the prominence and placement of a client's advertised properties in the search results. Our subscription clients generally pay contract fees on a monthly basis, but in some cases may pay us on a quarterly or annual basis. Our transaction-based services primarily consist of auction fees from our Ten-X online auction platform for commercial real estate, which are generally calculated as a percentage of the final sales price for the commercial real estate property sold and recognized as revenue upon the successful closure of an auction. We generally see higher sales of Apartments.com listing services during the peak summer rental season and higher CoStar sales towards the end of the year; however, sales fluctuate from year-to-year and revenue is not generally seasonal because our services are typically sold on a subscription basis.\nClients\nWe draw clients from across the real estate and related business community, including real estate brokers, agents, owners, developers, landlords, property managers, financial institutions, retailers, vendors, appraisers, investment banks, government agencies and other parties involved in real estate. For both the years ended December 31, 2023 and 2022, no single client accounted for more than 5% of our revenues.\nSales and Marketing\nOur overall sales strategy is to provide optimal service to our existing customers, attract new clients and cross-sell the numerous solutions we offer. Our sales teams sell multiple products and are primarily located in field sales offices throughout the U.S., with others in Canada, the U.K., Spain, France and Germany. Our inside sales teams are largely based in Washington, DC and Richmond, Virginia. Our inside sales professionals actively work lead lists, prospect for new customers and perform in-person and virtual product demonstrations to convey the multiple solutions we offer.\nOur local offices typically support field sales and field research operations within the markets in which they operate. This enables our clients to benefit from a local presence. Our field sales force has the primary front-line responsibility for customer service, ensuring client satisfaction and building long-term relationships. Our local offices act as hubs for training, sources of market insight, product feedback sessions and connecting industry participants.\nWe actively manage client accounts with frequent meetings, product trainings and updates on new enhancements to our solutions. In 2023, we successfully implemented a number of important sales initiatives focused on selling our products to brokers, property owners and lenders in the U.S. This focus will continue in 2024.\nOur primary marketing methods include: in person and virtual service demonstrations; targeted paid digital marketing; retargeting and social media marketing; direct marketing, such as email; communication via our corporate website, campaign-specific websites and news services; participation in virtual trade shows and industry events; Company-sponsored events; client referrals; content marketing including webinars, seminars and white papers and other product-specific company newsletters distributed via email to our clients and prospects.\nComprehensive digital marketing and direct marketing are effective means for us to find prospective clients. Our digital marketing efforts include SEO, targeted paid advertising with major search engines, social media and display advertising on commercial real estate industry news and business websites and mobile applications and our direct marketing efforts include television, radio, out-of-home ads, direct mail and email and, when applicable, make extensive use of our unique, proprietary database. Once we have identified a prospective client, our most effective sales method is a service demonstration. We use various forms of integrated marketing and advertising to build brand awareness, brand identity and reinforce the value and benefits of our services.\nWe also sponsor and attend local in person and virtual association activities and events, including events for commercial real estate brokers, residential real estate agents, property owners, investors and retail and financial services institutions, and attend or exhibit at virtual industry trade shows and conferences to reinforce our relationships with our core user groups.\nTo generate brand awareness and site traffic for the Apartments.com network of rental websites, we utilize a multi-channel marketing campaign featuring television and radio ads, online and digital advertising impressions, streaming audio and podcasts, social media, email, public relations and news articles, out-of-home and paid search marketing, all of which are reinforced with substantial SEO efforts. We plan to continue to utilize these marketing methods to generate brand awareness and site traffic for the Apartments.com Network and have implemented similar marketing strategies for LoopNet and Ten-X. To generate brand awareness and site traffic for our residential products, we utilize digital advertising impressions, social media and paid search marketing, all of which are reinforced with SEO efforts. We will continue to work to determine the optimal level of marketing investment for each of these services for future periods.\nTo encourage clients to use our services regularly, we generally charge a fixed monthly amount for our subscription-based information services rather than fees based on actual system usage. Contract rates for subscription-based services are generally based on the number of sites, number of users, organization size, the client’s business focus, geography and the range of subscription services. Our marketing solutions are priced by exposure levels, the number of properties/spaces for-lease, rent or sale and the market in which they are offered. Listings for customers who purchase packages with the highest level of exposure usually appear first in search results and offer the richest media content and engagement opportunities for tenants searching for space, renters looking for an apartment or investors seeking an opportunity. Our subscription clients generally pay contract fees on a monthly basis, but in some cases may pay us on a quarterly or annual basis.\nExpansion and Growth\nAcquisitions\nWe have expanded and continue to expand the coverage and depth of our information, analytics and online marketplace services. In addition to organic growth, we have grown our business through strategic acquisitions. We acquired Homes.com, BureauxLocaux, Business Immo and OnTheMarket in May 2021, October 2021, April 2022 and December 2023, respectively. We continue to integrate our recent acquisitions and the services they offer into our CoStar network.\nSee Notes 5 and 9 of the Notes to the Consolidated Financial Statements, included in Part IV of this Report, for further discussion of these acquisitions.\nDevelopment, Investments and Expansion\nWe plan to continue to invest in our business and our services, evaluate strategic growth opportunities and pursue our key priorities as described below in Item 7. Management’s Discussion and Analysis of Financial Condition and Results of Operations. We are committed to supporting, improving and enhancing our information, analytics and online marketplace solutions, including expanding and improving our offerings for property owners, property managers, brokers, agents, buyers, commercial tenants and residential renters and homebuyers. We expect to continue our software development efforts to improve existing services, introduce new services, integrate and cross-sell services and expand and develop supporting technologies for\nour research, sales and marketing organizations. We reevaluate our priorities on a regular basis and may reevaluate our priorities as economic conditions continue to evolve.\nWe evaluate potential changes to our service offerings from time to time in order to better align the services we offer with customers’ needs. Further, in some cases, when integrating and coordinating our services and assessing industry and client needs, we may decide to combine, shift focus from, de-emphasize, phase out or eliminate a service that, among other things, overlaps or is redundant with other services we offer. In the event that we eliminate or phase out particular service offerings, we may experience reduced revenues and earnings. The decision to eliminate or phase out a service offering may also ultimately result in increased revenues and earnings from sales of other services we offer in lieu of the eliminated or phased out services. However, we cannot predict with certainty the amount or timing of any reductions in revenues and earnings or subsequent increases in revenues and earnings, if any, resulting from the elimination or phasing out of any service offering.\nWe believe that our integration efforts and continued investments in our services, including acquisitions and expansion of our existing service offerings, have created a platform for long-term revenue growth. We expect these investments to result in further penetration of our subscription-based services and the successful cross-selling of our services to customers in existing markets.\nWe have invested in the expansion and development of our field sales force to support the growth and expansion of our company and our service offering, and plan to continue to invest in, evaluate and strategically position our sales force as we continue to develop and grow. In addition, we continue to invest in marketing our services, as well as in our research operations to support continued growth of our information and analytics offerings to meet the growing content needs of our clients. We plan to continue to utilize multi-channel marketing campaigns and to work to determine the optimal level of marketing investments for our services for future periods. While we believe the investments we make in our business create a platform for growth, those investments may reduce our profitability and adversely affect our near-term financial position.\nProprietary Technology\nOur information technology professionals focus on developing new services and features for our customers, improving and maintaining existing services, integrating our current services, securing our comprehensive database of commercial real estate information and delivering research automation tools that improve the quality of our data and increase the efficiency of our research analysts.\nOur information technology team is responsible for developing, improving and maintaining our information, analytics and online marketplace services. Our information technology team is also responsible for developing the infrastructure necessary to support our business processes, comprehensive database of commercial real estate information, analytics and online marketplaces and extensive image library. The team implements technologies and systems that introduce efficient workflows and controls designed to increase the production capacity of our research teams and improve the quality of our data. Over the years, the team has developed data collection and quality control mechanisms that we believe are unique within the commercial real estate industry. The team continues to develop and modify our enterprise information management system that integrates our sales, research, field research, customer support and accounting information. We use this system to maintain our commercial real estate research information, manage contacts with the commercial real estate community, provide research workflow automation and conduct daily automated quality assurance checks. In addition, our information technology team has also developed fraud-detection technology to detect and prevent unauthorized access to our services. To supplement the measures we take to prevent misuse of our information, we added state of the art adaptive authentication technology to the login process of our CoStar product.\nOur information technology professionals maintain the servers and network components necessary to support our services and research systems. Our core services are delivered from multiple data centers and cloud-based computing platforms to support uninterrupted service for our customers and are continually monitored to ensure fast and reliable customer access, to protect against unauthorized intrusions and to detect vulnerabilities.\nOur comprehensive data protection policy provides for use of secure networks, strong passwords and dual factor authentication systems, encrypted data fields, end-to-end encryption, endpoint detection and response systems and services, security information and event management systems, off-site storage, cloud services, end user and developer security training, multilayered anti-phishing malware and spam protections and other protective measures in an effort to ensure the availability and security of all core systems.\nCompetition\nThe market for information, analytics and online marketplaces generally is competitive and extremely dynamic. In the commercial real estate, apartment rentals and home for sale industries, we believe the principal competitive factors affecting these services and providers are:\n•Quality and depth of the underlying databases;\n•Quality and quantity of leads and, for multifamily, leases delivered;\n•Ease of use, flexibility and functionality of the software;\n•Intuitiveness and appeal of the user interface;\n•Timeliness of the data, including listings;\n•Breadth of geographic coverage and services offered;\n•Completeness and accuracy of content;\n•Client service and support;\n•Perception that the service offered is the industry standard;\n•Price;\n•Effectiveness of marketing and sales efforts;\n•Proprietary nature of methodologies, databases and technical resources;\n•Vendor reputation;\n•Brand loyalty among customers; and\n•Capital resources.\nWe compete directly and indirectly for customers with the following categories of companies:\n•Online marketing services, internet listing services, mobile software applications or data exchanges targeted to commercial real estate brokers, buyers and sellers of commercial real estate properties, insurance companies, mortgage brokers and lenders, such as Reed Business Information Limited and its Estates Gazette and Radius Data Exchange products, SquareFoot, officespace.com, Brevitas, Catylist & Commercial Exchange (part of Moody's), Altus Group & Commercial Property Search (part of Reonomy), Digsy, Quantum Listing, RealNex MarketPlace, Rofo, CIMLS, CompStak, Rightmove, Yardi (CommercialEdge), CREXi, TotalCommercial.com, DebtX, Real Capital Markets, VTS, TenantBase and Spacelist;\n•Publishers and distributors of information, analytics and marketing services, including regional providers and national print publications, such as CBRE Economic Advisors, Marshall & Swift, REIS Network (part of Moody's), Real Capital Analytics, Real Capital Markets, Reonomy, Yardi Matrix, RealPage and its Axiometrics business, Altus Insight and Altus RealNet (Canada);\n•Search engines, internet listing services and mobile software applications featuring apartments for rent, such as Google, Bing, Facebook Marketplace, ApartmentGuide.com, Rent.com, Rentals.com, Zillow Rentals, Trulia Rentals, StreetEasy, HotPads.com, MyNewPlace.com, Zumper, Craigslist, ApartmentList.com, Move.com, Realtor.com, RentCafe.com, RentHop, RentBerry, ApartmentRatings, Nooklyn, Home Finder and Rentable;\n•Search engines, internet listing services and mobile software applications featuring homes for sale, such as Google, Bing, Facebook Marketplace, Zillow, Trulia, Redfin, Realtor.com, Move.com, Craigslist, RealtyTrac, MLS.com, Home Finder, For Sale by Owner, Auction.com, Rightmove and Zoopla, as well as agent marketing platforms and workflow providers;\n•Hospitality benchmarking and analytics services, such as Lodging Econometrics, Kalibri Labs, Amadeus, HotStats, Shiji Group (SnapShot), Benchmarking Alliance and Lodging Analytics Research & Consulting (LARC);\n•Online and mobile software application providers in the residential real estate industry, including Zillow, Redfin, Realtor.com and Rocket Mortgage, as well as agent marketing platforms and workflow providers;\n•In the commercial real estate market, locally controlled real estate boards, exchanges or associations sponsoring commercial property listing services and the companies with whom they partner, such as Catylist, the National Association of Realtors, CCIM Institute, Society of Industrial and Office Realtors, the Commercial Association of Realtors Data Services and AIR CRE;\n•Real estate portfolio management software solutions, such as Cougar Software, MRI Software, Altus, RealPage, AppFolio and SiteCompli;\n•Real estate lease management and administration software solutions, such as Accruent, Tririga, Manhattan Software, Tango Analytics, Lease Accelerator, Visual Lease, Sequnetra, Lease Harbor and AMT Direct;\n•Commercial real estate auction platforms such as CREXi, Marketplace, by RealINSIGHT and RCM Lightbox;\n•In-house research departments operated by commercial real estate brokers; and\n•Public record providers.\nAs markets for information, analytics and online marketplaces develop, additional competitors (including companies that could have greater access to data, financial, product development, technical, analytic or marketing resources than we do) may enter a market and competition may intensify. For example, a company like Google, which has a far-reaching web presence and substantial data aggregation capabilities, could enter the commercial real estate marketing arena. A company like Zillow, which already has a presence in residential real estate and the apartment rentals industry, could use its resources to further expand in the online apartment rentals industry creating greater competition among internet listing services for the marketing budgets of property managers and property owners. While we believe that we have successfully differentiated ourselves from existing competitors, current or future competitors could materially harm our business. We may also enter markets where incumbent players have greater name recognition and resources, creating challenges as we work to expand.\nProprietary Rights\nTo protect our proprietary rights in our methodologies, database, software, trademarks and other intellectual property, we depend upon a combination of:\n•Trade secret, misappropriation, unfair competition, copyright, trademark, computer fraud, database protection and other laws;\n•Registration of copyrights and trademarks;\n•Nondisclosure, and other contractual provisions with employees and consultants;\n•License agreements with customers;\n•Patent protection; and\n•Technical measures.\nWe seek to protect our software’s source code, our database and our photography as trade secrets and under copyright law. Although copyright registration is not a prerequisite for copyright protection, we have filed for copyright registration for many of our databases, photographs, software and other materials. Under current U.S. copyright law, the arrangement and selection of data may be protected, but the actual data itself may not be. Certain U.K. database protection laws provide additional protections for our U.K. databases. We license our services under license agreements that grant our clients non-exclusive, non-transferable rights. These agreements restrict the disclosure and use of our information and prohibit the unauthorized reproduction or transfer of any of our proprietary information, methodologies or analytics.\nWe also attempt to protect our proprietary databases, our trade secrets and our proprietary information through confidentiality and agreements with our employees and consultants. Our services also include technical measures designed to detect, discourage and prevent unauthorized access to and/or copying of our intellectual property. We have established an internal antipiracy team that uses fraud-detection technology to continually monitor use of our services to detect and prevent unauthorized access, and we actively prosecute individuals and firms that engage in this unlawful activity.\nWe maintain U.S. and international trademark registrations for CoStar Group’s core service names and proactively file U.S. and international trademark applications covering our new and planned service names. We own U.S. federally registered trademarks for our brands and services including CoStar®, CoStar Property®, CoStar COMPS®, CoStar Lease Analysis®, LoopNet®, Showcase.com®, CityFeet.com®, Apartments.com®, Homes.com®, Land.com®, and Ten-X®, among many others. In the U.S., trademarks are generally valid so long as they are in use and are capable of indicating CoStar Group as the source of services. We consider our trademarks in the aggregate to constitute a valuable asset.\nIn addition, we maintain a patent portfolio that protects certain of our systems and methodologies. We currently have six patents in Canada, which expire in 2033 (1 patent), 2035 (2 patents) and 2036 (3 patents), covering, among other things, certain features of our field research methodologies and user interface features, and 12 patents in the U.S. which expire in, 2025 (1 patent), 2032 (2 patents), 2036 (4 patents), 2037 (4 patents) and 2038 (1 patent), covering, among other things, certain features of our field research methodologies and user interface feature. We regard the rights protected by our patents as valuable to our business, but do not believe that our business is materially dependent on any single patent or portfolio of patents as a whole.\nHuman Capital Resources\nAs of January 31, 2024, we employed 6,152 employees. U.S.-based employees represent approximately 86% of the overall employee population, followed by 12% in European, Asia-Pacific and Latin American countries and 2% in Canadian provinces. None of our employees are represented by a labor union. We have experienced no work stoppages. As is common with many German companies, employees in our German subsidiary, Thomas Daily GmbH, have elected five fellow employees to form a Works Council, which represents our employees at the location. The Works Council has certain co-determination rights and rights to receive information from us and engage us in discussions under applicable law. BureauxLocaux, in France, has a Social and Economic Committee, which is an employee representative body.\nOur human resources and recruiting teams work in partnership with business leaders, using a robust process to attract a diverse slate of candidates to fill vacancies and contribute to our growth, including our Careers page on our corporate website, employee referral program, social media and digital platforms, direct outreach, partnerships with commercial real estate industry groups and universities and specific partnerships and programs. The development and retention of our employees is critical to our success. To support career development, we offer on-demand and in-person training programs to new hires, managers, and leaders. We also offer a mentoring program, which pairs employees seeking mentorship with more experienced colleagues.\nTo assess employee engagement, we partner with a survey vendor to survey employees annually. Insights and results gathered from the survey are shared with our leadership, managers and employees and help to inform our human resources program strategy each year. We believe that diverse teams deliver better and more innovative solutions. The diversity of thought that comes from different perspectives and backgrounds allows us to deliver cutting edge research and technology solutions that best serve our customers. We have a dedicated Diversity, Equity and Inclusion team that is tasked with developing topical programming, communications and training including, but not limited to, celebrations of various heritage months and oversight of our employee resource groups, which create avenues for mentoring and professional development within these groups as well as education and awareness across the organization.\nWe provide competitive pay and benefits to attract and retain high-quality talent. In addition to base salaries, compensation may include annual bonuses, commissions, and equity awards. Employees may also participate in an Employee Stock Purchase Plan and a 401(k) Plan with a company match. Our comprehensive set of health and wellness benefits are affordable, high quality and valuable to employees and their families. Employees have multiple choices for health plans, access to vision and dental benefits and may participate in our employee wellness program as well as our employee assistance program. Additional benefits include paid time off, parental bonding leave, college savings benefits, tuition reimbursement, company-subsidized commuter benefits and access to mental health, tax, and legal services.\nAvailable Information\nOur investor relations internet website is http://www.costargroup.com/investors. The reports we file with or furnish to the SEC, including our annual report, quarterly reports and current reports, as well as amendments to those reports, are available free of charge on our internet website as soon as reasonably practicable after we electronically file such material with, or furnish it to, the SEC. The SEC maintains an internet site that contains reports, proxy and information statements and other information regarding issuers that file electronically with the SEC at http://www.sec.gov.",
    "item_1A": "Item 1A. Risk Factors\nRisks related to our business\nOur revenues and financial position will be adversely affected if we are not able to attract and retain clients. Our success and revenues depend on attracting and retaining subscribers to our information, analytics and online marketplace services. Our subscription-based services generate the largest portion of our revenues. Our revenue may not grow, or could decrease, if we cannot attract new customers, continue to keep our cancellation rate low and continue to sell new services to our existing customers. We may not be able to continue to grow our customer base, keep the cancellation rate low or sell new services to existing customers as a result of several factors, including, continuing global economic and geopolitical volatility, economic pressures and the impact of inflation on our costs and on customer spending; the business failure of current clients; customer decisions that they do not need our services or to use alternative services; customers’ and potential customers’ budgetary constraints; consolidation in the real estate and/or financial services industries; data quality; technical problems; competitive pressures; or devaluation of the local currencies of international customers relative to the U.S. dollar which impairs the purchasing power of such customers. We compete against many other real estate information, analytics and marketing service providers for business. If clients cancel services or decide not to renew their subscription agreements and we do not sell new services to our existing clients or attract new clients, then our renewal rate, net new bookings and revenues may decline or fail to meet expectations.\nWe may not be able to successfully develop and introduce new or upgraded information, analytics and online marketplace services that are attractive to our users and advertisers or successfully combine or shift focus from current services with less demand, which could decrease our revenues and our profitability. Our future business and financial success will depend on our ability to continue to anticipate the needs of customers and potential customers and to successfully introduce new and upgraded services, including services that make our marketplaces useful for users and attractive to advertisers. To be successful, we must be able to quickly adapt to changes in the industry, as well as rapid technological changes, by continually enhancing our information, analytics and online marketplace services. As a result, we must continually invest resources in research and development to improve the appeal and comprehensiveness of our services and effectively incorporate new technologies.\nDeveloping new services and upgrades to services, as well as integrating and coordinating current services, imposes heavy burdens on our systems department, product development team, management and researchers. The processes are costly, and our efforts to develop, integrate and enhance our services may not be successful. In addition, launching and selling a new or upgraded service puts additional strain on our sales and marketing resources. If we are unsuccessful in obtaining greater market share or in obtaining widespread adoption of new or upgraded services, we may not be able to offset the expenses associated with the development, launch and marketing of the new or upgraded service, which could have a material adverse effect on our financial results. For example, we have and will continue to invest significantly in developing our marketplaces and content and, to generate brand awareness and site traffic, we have and will continue to invest significant resources in multi-channel marketing campaigns for select marketplaces. If these development efforts and marketing campaigns do not increase brand awareness, site traffic, subscriptions for marketplaces services and/or revenues, the cost of these campaigns could have an adverse effect on our financial results.\nIn addition, as we integrate acquired businesses, we continue to assess which services we believe will best meet the needs of our customers. If we eliminate or phase out a service and are not able to offer and successfully market and sell an alternative service, our revenues may decrease, which could have a material adverse effect on our results of operations.\nWe may not be able to compete successfully against existing or future competitors in attracting advertisers, which could harm our business, results of operations and financial condition. We compete to attract advertisers. Our competitors may have greater brand recognition or more direct sales personnel than we have and may generate more web traffic than we do, which may provide them with competitive advantages. To compete successfully for advertisers, we must continue to invest resources in developing our advertising platform and proving the effectiveness and relevance of our advertising services. Pressure from competitors seeking to acquire a greater share of our advertisers’ overall marketing budget could adversely affect our pricing and margins, lower our revenue and increase our research and development and marketing expenses. If we are unable to compete successfully against our existing or future competitors, our business, results of operations or financial condition could be adversely affected.\nCompetition could render our services uncompetitive and reduce our profitability. The markets for information systems and services and for online marketplaces in general are highly competitive and rapidly changing. Competition in these markets may increase further if economic conditions or other circumstances cause customer bases and customer spending to decrease and service providers to compete for fewer customer resources. Our existing or future competitors may have greater name recognition, larger customer bases, better technology or data, lower prices, easier access to data, greater user traffic or greater financial, technical or marketing resources than we have to provide services that users might view as superior to our offerings. Competitors may introduce different solutions that attract users away from our services or provide solutions similar to ours that\nhave the advantage of better branding or marketing resources. Our competitors may be able to undertake more effective marketing campaigns, obtain more data, adopt more aggressive pricing policies, make more attractive offers to potential employees, subscribers, advertisers, distribution partners and content providers or may be able to respond more quickly to new or emerging technologies or changes in user requirements. Increased competition could result in lower revenues and higher expenses, which would reduce our profitability.\nOur operating results and revenues are subject to fluctuations and our quarterly financial results may be subject to market cyclicality, each of which could negatively affect our stock price. The real estate market may be influenced by general economic conditions, economic cycles, changes in interest rates, seasonality and many other factors, which in turn may impact our financial results. The different sectors of the large and fragmented industry, such as office, industrial, retail, multifamily, single family and others, are influenced differently by different factors, and have historically moved through economic cycles with different timing. As such, it is difficult to estimate the potential impact of economic cycles and conditions or seasonality from year-to-year on our overall operating results. For example, we generally see higher sales of Apartments.com listing services during the peak summer rental season and higher CoStar sales towards the end of the year; however, sales fluctuate from year-to-year and may fluctuate more widely when there are changes in general economic conditions or the industry.The timing of widely observed holidays and vacation periods, particularly slowdowns during the end-of-year holiday period, and availability of real estate agents and related service providers during these periods, could significantly affect our quarterly operating results during that period. If we are unable to adequately respond to economic, seasonal or cyclical conditions, our revenues, expenses and operating results may fluctuate from quarter to quarter. Our operating results, revenues and expenses may fluctuate for many reasons, including those described in this paragraph and below:\n•Rates of subscriber adoption and retention;\n•Timing of our annual sales conference or significant marketing events;\n•Changes in our pricing strategy and timing of changes;\n•The timing and success of new service introductions and enhancements;\n•The shift of focus from certain services we offer or the phase out of services that overlap or are redundant with other services we offer;\n•The amount and timing of our expenses and capital expenditures;\n•The amount and timing of non-cash stock-based charges;\n•Acquisition-related costs or impairment charges associated with investments and acquisitions;\n•Competition;\n•Changes or consolidation in the real estate industry;\n•Interest rate fluctuations;\n•Execution of our expansion and integration plans;\n•The development of our sales force;\n•Foreign currency exchange rate fluctuations;\n•Inflation; and\n•Changes in client budgets.\nThese fluctuations could negatively affect our results of operations during the period in question and/or future periods or cause our stock price to decline. In addition, changes in accounting policies or practices may affect our level of net income. Fluctuations in our financial results, revenues and expenses may cause the market price of our common stock to decline.\nGlobal economic uncertainties and downturns or a downturn or consolidation in the real estate industry may decrease customer demand for our services and adversely affect our business and results of operations. Global economic uncertainties or downturns could adversely affect our business and results of operations, including financial and credit market fluctuations, changes in economic policy, increased inflation and responsive actions, rising interest rates or a period of elevated interest rates, labor shortages, supply chain disruptions, trade uncertainty, political unrest, geographical instability or other impacts from the macroeconomic environment. These macroeconomic conditions could cause a decrease in customer spending and negatively affect the rate of growth of our business. The real estate market may be adversely impacted by many different factors, including lower than expected job growth or job losses resulting in reduced real estate demand; reduced real estate demand due to continued remote work policies or a period of elevated interest rates; rising interest rates, inflation, slowing transaction volumes and other macroeconomic trends that negatively impact investment returns; excessive speculative new construction in localized markets resulting in increased vacancy rates and diminished rent growth; unanticipated disasters or global health events; and other adverse events such as decreased growth in the working age population resulting in reduced demand for all types of real estate. In response to concerns over inflation, the U.S. Federal Reserve raised interest rates in each quarter of 2022 and the first, second and third quarters 2023. A downturn in the real estate market, including as a result of increased interest rates or a decline in leasing activity and absorption rates may affect our ability to generate revenues and may lead to more cancellations by our current or future customers, either of which could cause our revenues or our revenue growth rate to decline and reduce our profitability. A depressed real estate market has a negative impact on our core customer base, which could decrease demand for\nour information, analytics and online marketplaces. Also, companies in this industry may consolidate, often in order to reduce expenses. Consolidation, or other cost-cutting measures by our customers, may lead to cancellations of our information, analytics and online marketplace services by our customers, reduce the number of our existing clients, reduce the size of our target market or increase our clients’ bargaining power, all of which could cause our revenues to decline and reduce our profitability. If cancellations, reductions of services and failures to pay increase, and we are unable to offset the resulting decrease in revenues by increasing sales to new or existing customers, our revenues may decline or grow at lower rates.\nIf we are unable to hire qualified persons for, or retain and continue to develop, our sales force, or if our sales force is unproductive, our revenues could be adversely affected. In order to support revenues and revenue growth, we need to continue to develop, train and retain our sales force. Our ability to build and develop a strong sales force may be affected by a number of factors, including: our ability to attract, integrate and motivate sales personnel; our ability to effectively train our sales force; the ability of our sales force to sell an increased number and different types of services; our ability to manage effectively an outbound telesales group; the length of time it takes new sales personnel to become productive; the competition we face from other companies in hiring and retaining sales personnel; our ability to effectively structure our sales force; and our ability to effectively manage a multi-location sales organization, including field sales personnel. If we are unable to hire qualified sales personnel and develop and retain our sales force, including sales force management, or if our sales force is unproductive, our revenues or growth rate could decline and our expenses could increase. We may face additional challenges in hiring employees in an increasingly competitive job market.\nOur business depends on retaining and attracting highly capable management and operating personnel. Our success depends in large part on our ability to retain and attract management and operating personnel, including our President and Chief Executive Officer, Andrew Florance, and our other officers and key employees. Our business requires highly skilled technical, sales, management, web product and development, marketing and research personnel, who are in high demand and are often subject to competing offers. The measures we use to attract and retain key personnel may not be enough to attract and retain the personnel we need or to offset the impact on our business of the loss of the services of Mr. Florance or other key officers or employees. If Mr. Florance were to become unavailable for any reason, there could be a material adverse impact on our operations. The loss of other key personnel, including members of management as well as key technology, product development, and marketing personnel, could also disrupt our operations and have an adverse effect on our business.\nOur internal and external investments may place downward pressure on our operating margins. To increase our revenue growth, we continue to invest significantly in our business, including internal investments in product and content development to expand the breadth and depth of services we provide to our customers and external investments in sales and marketing to generate brand awareness and traffic to our websites. Our operating margins may experience downward pressure in the short term as a result of these investments. Furthermore, our investments may not produce the expected results. If we are unable to successfully execute our investment strategy, we may experience decreases in our revenues or revenue growth rate and operating margins.\nIntroducing new products may be difficult and expensive. If we are unable to do so successfully, our brands may be adversely affected, and we may not be able to maintain or grow our current revenue and profit levels. In February 2024 we launched our Homes.com monetization strategy. We have incurred, and expect to continue to incur, significant costs to develop and market Homes.com. If we are unable to attract and retain agent subscribers and consumers, we may not be able to execute our growth plans or recognize a return on the investments we have made into Homes.com. Failure to gain market acceptance for Homes.com could impede our ability to maintain or grow current revenue levels or reduce profits for our other brands, adversely affect the image of our brands, erode our competitive position, and result in long-term harm to our business and financial results. Extrapolations annualizing initial sales results may differ materially from actual results realized in future periods and may not take into account other future market conditions that may negatively affect those results.\nWe may be unable to increase awareness of our brands, including CoStar, LoopNet, Apartments.com, Homes.com Land.com, BizBuySell, STR, Ten-X, and OnTheMarket, which could adversely affect our business. We rely heavily on our brands, which we believe are key assets of our company. Awareness and differentiation of our brands are important for attracting and expanding the number of users of, and subscribers to, our online marketplaces, such as the LoopNet Network, the Apartments.com Network, our Homes.com and OnTheMarket residential marketplaces, the Land.com Network and our CoStar Showcase. We continue to invest significantly in sales and marketing as we seek to grow the numbers of users of, subscribers to and advertisers on, our marketplaces. Our methods of advertising may not be successful in increasing brand awareness or, ultimately, be cost-effective. If we are unable to maintain or enhance user and advertiser awareness of our brands, or if we are unable to recover our marketing and advertising costs through increased usage of our services and increased advertising on our websites, our business, results of operations and financial condition could be adversely affected.\nIf internet search engines do not prominently feature our websites on the search engine results page, traffic to our websites would decrease and, if we are unable to maintain or increase traffic to our marketplaces, our business and operating results could be adversely affected. Our ability to generate revenues from our marketplace business depends, in part, on our ability to\nattract users to our websites. Google, Bing, DuckDuckGo and other internet search engines drive traffic to our websites, including CoStar.com, the LoopNet Network, the Apartments.com Network, our Homes.com and OnTheMarket residential marketplaces, the Land.com Network, Ten-X.com and BizBuySell. For example, when a user enters in a search query for an apartment building name or address into an internet search engine, the internet search engine’s ranking of our Apartments.com or Homes.com webpages will determine how prominently such webpages are displayed on the search engine results page. Our ability to maintain prominent search result rankings and positioning is not entirely within our control. Our competitors’ SEO and SEM efforts may result in webpages from their websites receiving higher rankings than the webpages from our websites. Internet search engines could revise their algorithms and methodologies in ways that would adversely affect our search result rankings. Internet search engine providers could form partnerships or enter into other business relationships with our competitors resulting in competitors’ sites receiving higher search result rankings. Internet search engines are increasingly placing alternative search features (such as featured snippets, local map results and other immersive experiences) on the search engine results page above or more prominently than search engine results. If our search result rankings are not prominently displayed, traffic to our websites may decline which could slow the growth of our user base. Our websites have experienced fluctuations in search result rankings in the past and we anticipate similar fluctuations will occur in the future. If we experience a material reduction in the number of users directed to our websites through internet search engines or otherwise fail to maintain or increase traffic to our marketplaces, our ability to acquire additional subscribers or advertisers and deliver leads to and retain existing subscribers and advertisers could be adversely affected. As a result, our business, results of operations and financial condition could be adversely affected. Increases in our operating expenses could negatively impact our operating results if we are unable to generate more revenues through increased sales of subscriptions to our marketplace products. Additionally, the methods, including Google Analytics, that we use to measure unique visitors to our portals may misstate the actual number of unique persons who visit our network of mobile applications and websites for a given month or may differ from the methods used by competitors, which may impact the comparability of unique visitors between companies. Additionally, the methods, including Google Analytics, that we use to measure unique visitors to our portals may misstate the actual number of unique persons who visit our network of mobile applications and websites for a given month or may differ from the methods used by competitors, which may impact the comparability of unique visitors between companies.\nIf real estate professionals or other advertisers reduce or cancel their advertising spending with us and we are unable to attract new advertisers, our operating results would be harmed. Our marketplace businesses, including the LoopNet Network, the Apartments.com Network, our Homes.com and OnTheMarket residential marketplaces, CoStar Showcase and the Land.com Network, depend on advertising revenues generated primarily through sales to persons in the real estate industry, including broker, agents, property managers and owners, real estate agents, and other advertisers. Our ability to attract and retain advertisers, and ultimately to generate advertising revenue, depends on a number of factors, including:\n•Increasing the number of unique visitors to, and users of, our websites and mobile applications;\n•The quantity and quality of the leads that we provide to our advertisers;\n•The success of any marketing and product development efforts directed at attracting additional users and advertisers to our marketplaces;\n•Keeping pace with changes in technology and with our competitors; and\n•Offering an attractive return on investment to our advertisers for their advertising dollars spent with us.\nFurther, with respect to the Apartments.com Network and LoopNet Networks, our ability to attract and retain advertisers also depends on the current apartment rental market and apartment vacancy rates and commercial rental market and vacancy rates, respectively. If vacancy rates are too high or too low, advertisers may not need to utilize our marketplace services.\nMany of the advertisers who advertise on our marketplaces do not have long-term contracts. These advertisers could choose to modify or discontinue their relationships with us with little or no advance notice. As existing subscriptions for advertising expire, we may not be successful in renewing these subscriptions or securing new subscriptions. We may not succeed in retaining existing advertisers’ spending or capturing a greater share of such spending if we are unable to convince advertisers of the effectiveness of our services as compared to alternatives. In addition, future changes to our pricing methodology for advertising services may cause advertisers to reduce or discontinue their advertising with us. If current advertisers reduce or end their advertising spending with us and we are unable to attract new advertisers, our advertising revenues and business, results of operations and financial condition could be adversely affected.\nIf we are not able to successfully identify, finance, integrate and/or manage costs related to acquisitions, our business operations and financial position could be adversely affected. We have expanded our markets and services in part through acquisitions of complementary businesses, services, databases and technologies, and expect to continue to do so in the future. Our acquisition strategy depends on our ability to identify, and the availability of, suitable acquisition candidates. We are likely to incur costs in connection with proposed acquisitions, but may ultimately be unable or unwilling to consummate any particular proposed transaction for various reasons. For example, in 2021, the FTC withheld approval for our proposed acquisition of RentPath, the purchase agreement was subsequently terminated and we incurred a termination fee of $52 million.\nWe are also likely to incur severance costs and other integration costs post-acquisition. Costs in connection with acquisitions and integrations may be higher than expected and could adversely affect our financial condition, results of operations or prospects of the combined business. In addition, acquisitions involve numerous risks, including risks that we will not be able to realize or capitalize on synergies created through combinations; manage the integration of personnel and products or services; manage the integration of acquired infrastructure and controls; control potential increases in operating costs; manage geographically remote operations; maintain management’s attention on other business concerns and avoid potential disruptions in ongoing operations during an acquisition process or integration efforts; successfully enter markets and sectors in which we have either limited or no direct experience, including foreign markets whose practices, regulations or laws may pose increased risk; and retain key employees, clients or vendors and other business partners of the acquired companies. We may not successfully integrate acquired businesses or assets and may not achieve anticipated benefits of an acquisition, including expected synergies. For example, we may be unable to fully integrate BureauxLocaux, Business Immo and OnTheMarket with CoStar Group when and as expected.\nWe were previously subject to a consent order agreed to among the FTC staff, CoStar Group and LoopNet on April 17, 2012 in connection with the LoopNet merger. This consent order expired in August 2022, but if we become subject to similar orders in the future, compliance with such orders could prevent us from closing certain acquisitions or add significant time and cost to such acquisitions, ultimately making an acquisition prohibitive or preventing us from realizing its anticipated benefits.\nExternal factors, such as compliance with laws and regulations and shifting market preferences, may also impact the successful integration of an acquired business. An acquired business could strain our system of internal controls and diminish its effectiveness. Acquisitions could result in dilutive issuances of equity securities, the incurrence of debt and substantial amortization expenses of other intangible assets. We may be unable to obtain financing on favorable terms, or at all, if necessary to finance future acquisitions, making it impossible or more costly to complete future acquisitions. If we are able to obtain financing, the terms may be onerous and restrict our operations. Further, certain acquisitions may be subject to regulatory approval, which can be time-consuming and costly to obtain or may be denied, as in the case of RentPath. If regulatory approval is obtained, the terms of any such approval may impose limitations on our ongoing operations or require us to divest assets or lines of business. If regulatory approval is denied, we may incur significant, additional costs payable to an acquisition target as a result of failure to close the transaction. For example, we incurred a termination fee of $52 million in connection with termination of the RentPath purchase agreement. Significant break-up fees incurred in the future may adversely affect our results of operations and financial condition.\nAs a result of our acquisitions, we had approximately $2.7 billion of goodwill and intangibles as of December 31, 2023. Future acquisitions may increase this amount. If we are required to recognize goodwill and intangibles impairment charges in the future, this would negatively affect our financial results in the periods of such charges, which may reduce our profitability.\nCyberattacks and security vulnerabilities could result in serious harm to our reputation, business and financial condition. Our business relies on IT Systems and involves the generation, collection, storage, processing and transmission of Confidential Information, including personal information and proprietary business information, by us and by third-party providers we rely on. We own and manage IT Systems but also rely on third-party managed IT Systems and a broad array of third-party products and services to support our business operations. An increasing number of organizations, including large merchants, businesses, technology companies and financial institutions, as well as government institutions, have disclosed security incidents, disruptions to, and breaches of their or third-party providers’ IT Systems, some of which have involved sophisticated and highly targeted attacks, including on websites, mobile applications and infrastructure, following a trend of cyberattacks increasing in frequency and magnitude on a global basis.\nOur IT Systems, or those of third parties on which we rely, may be disrupted or damaged and our Confidential Information may be compromised, corrupted, lost or stolen. The tools and techniques (including artificial intelligence) used to obtain unauthorized, improper or illegal access to a target’s systems, data or customers’ data, disable or degrade services, or sabotage systems are constantly evolving and have become increasingly complex and sophisticated. It may be difficult to detect, investigate or remediate such cyber attacks quickly and such attacks often are not recognized or detected until after they have been launched against a target. We expect that unauthorized parties will continue to attempt to gain access to or disrupt our IT systems or facilities through various means, including hacking into IT Systems or facilities or those of our customers or vendors, malware (including ransomware) or attempting to fraudulently induce (for example, through spear phishing attacks or social engineering) our employees, customers, vendors or other users of IT Systems into disclosing access credentials or other sensitive information, which may in turn be used to access our IT Systems.\nNumerous and evolving cybersecurity threats, including from diverse threat actors, such as state-sponsored organizations, opportunistic hackers and hacktivists, as well as through diverse attack vectors, such as advanced cyberattacks, phishing, social engineering schemes, malware (including ransomware), malfeasance by insiders, human or technological error, and as a result of bugs, misconfigurations or exploited vulnerabilities in software or hardware, could compromise the confidentiality, availability and integrity of Confidential Information and our IT systems. Our efforts to prevent, detect and respond to data\nsecurity incidents, may not be effective due to attackers increasingly using tools and techniques that are designed to circumvent controls, to avoid detection, and to remove or obfuscate forensic evidence. Further, the security measures and procedures our customers, vendors and other users of our systems have in place to protect IT Systems and Confidential Information may not be successful or sufficient to counter all data breaches, cyberattacks or system failures. There can be no assurance that our cybersecurity risk management program and processes, including our policies, controls, or procedures, will be fully implemented, complied with or effective in protecting our IT Systems and Confidential Information.\nOur IT Systems may be vulnerable to cyberattacks or security breaches, and third parties may be able to access our, our customers’ or our employees’ Confidential Information, including personal or proprietary information, that is stored on or accessible through those systems. We have experienced and expect to continue to experience in the future, cyberattacks as well as breaches of our security measures due to human error, malfeasance, system errors or vulnerabilities or other irregularities. In the past, one of our vendors providing IT infrastructure management software was compromised by cyberattacks. We are regularly exposed to vulnerabilities in widely deployed third-party software that we use in the ordinary course of business, such as the Log4J vulnerability. While these vulnerabilities did not have a material adverse effect on our operations, they and similar incidents require us to devote time and resources to monitoring and remediation on a regular basis.\nIn the past three years, we have not experienced a material cybersecurity incident, but any actual or perceived cybersecurity incidents or breaches of our security could result in any or all of the following, among other things, any of which could adversely affect our business and results of operations:\n•Interrupt our operations;\n•Result in our systems or services being unavailable;\n•Result in improper disclosures of data;\n•Result in improper payments;\n•Materially harm our reputation and brands;\n•Result in significant regulatory scrutiny, enforcement actions, legal proceedings and claims (including class action lawsuits) and other legal and financial exposure;\n•Cause us to incur significant remediation, system restoration, incident response and compliance costs;\n•Lead to loss of customer confidence in, or decreased use of, our products and services;\n•Divert the attention of management from the operation of our business; and\n•Result in significant contractual penalties or other payments as a result of third-party losses or claims.\nIn addition, any cyberattacks or data security breaches affecting companies that we acquire our customers or vendors (including data center and cloud computing providers) could have similar negative effects on our business. Further, we may not be able to recover any or all damages suffered as a result of such security breach or other security incident from such third-party providers. Notwithstanding our efforts, there can be no assurance that vulnerabilities in widely deployed software will not materially harm our business. Any breach of our security measures or the loss, inadvertent disclosure or unapproved dissemination of Confidential Information about us or our customers, including the potential loss or disclosure of such information or data, could result in litigation, regulatory enforcement and potential liability for us, damage our brand and reputation or otherwise materially harm our business, financial condition or competitive position.\nThe coverage under our insurance policies for cybersecurity and related issues may not be adequate to reimburse us for losses caused by cyberattacks or other security incidents or be available on economically reasonable terms or at all.\nTechnical problems or disruptions that affect either our customers’ ability to access our services, or the software, internal applications, database and network systems underlying our services, could damage our reputation and lead to reduced demand for our information, analytics and online marketplace services, lower revenues and increased costs. Our business, brands and reputation depend upon the satisfactory performance, reliability and availability of our websites, the internet and our service providers. Interruptions in these systems, whether due to system failures, computer viruses, software errors, physical or electronic break-ins, or malicious hacks or attacks on our systems (such as denial of service attacks or use of malware such as ransomware) could affect the security and availability of our services on our mobile applications and our websites and prevent or inhibit users’ access to our services. Our operations also depend on our ability to protect our databases, computers and software, telecommunications equipment and facilities against damage from potential dangers such as fire, flood, power loss, security breaches, computer viruses, telecommunications failures, terrorist attacks, acts of war, electronic and physical break-ins, computer viruses, earthquakes and similar events.\nIn addition, the software, internal applications and systems underlying our services are complex and may not be error-free. We may encounter technical problems when we attempt to enhance our software, internal applications and systems. Our users rely on our services to conduct their own businesses. Disruptions in, technical problems with, or reductions in ability to access our services for any reason could damage our users’ businesses, harm our reputation, result in additional costs or reduce\ndemand for our information, analytics and online marketplace services, any of which could harm our business, results of operations and financial condition.\nAmazon Web Services (\"AWS\") and Akamai Connected Cloud (\"ACC\") are distributed computing infrastructure platforms for business operations, commonly referred to as “cloud” computing services. We currently run a majority of our computing on AWS and ACC and have built our software and computer systems to use computing, storage capabilities, bandwidth, and other services provided by AWS and ACC. Given this, any significant disruption of or interference with AWS or ACC, whether temporary, regular, or prolonged, would negatively impact our operations and our business.\nWe also maintain communications, network and computer hardware used to operate some of our mobile applications and websites at facilities in Virginia and California. We do not own or control the operation of certain of these facilities. Our systems and operations are vulnerable to damage or interruption from fire, flood, power loss, security breaches, computer viruses, telecommunications failure, terrorist attacks, acts of war, electronic and physical break-ins, earthquakes and similar events. These risks may be increased with respect to operations housed at facilities we do not own or control. The occurrence of any of the foregoing events could result in damage to our systems and hardware or could cause them to fail completely, and our insurance may not cover such events or may be insufficient to compensate us for losses that may occur.\nA failure of our systems at any site could result in reduced functionality for our users, and a total failure of our systems could cause our mobile applications or websites to be inaccessible. Problems faced or caused by our information technology service providers, including content distribution network providers, private network providers, internet service providers and third-party web-hosting providers, or with the systems by which they allocate capacity among their customers (as applicable), could adversely affect the experience of our users. Any financial difficulties, such as bankruptcy reorganization, faced by these third-party service providers or any of the service providers with whom they contract may have negative effects on our business, the nature and extent of which are difficult to predict. If our third-party service providers are unable to keep up with our growing needs for capacity, our business could be harmed. In addition, if distribution channels for our mobile applications experience disruptions, such disruptions could adversely affect the ability of users and potential users to access or update our mobile applications, which could harm our business.\nOur business interruption insurance may not cover certain events or may be insufficient to compensate us for the potentially significant losses, including the potential harm to the future growth of our business, which may result from interruptions in our service as a result of system failures or malicious attacks. Any errors, defects, disruptions or other performance problems with our services could harm our reputation, business, results of operations and financial condition.\nThe significant costs associated with undertaking a large infrastructure project to build out our campus in Richmond, Virginia, have impacted and will continue to impact our financial condition and results of operations. In December 2021, we announced our plans to expand our research and technology center in Richmond, Virginia. These plans have required and will continue to require significant capital expenditures over the next several years and our business plans may change. Future changes in growth or fluctuations in cash flow may also negatively impact our ability to finance this project. Additionally, actual capital expenditures could vary materially from our projected capital expenditures, which could negatively impact our business, operating results and financial condition. If we are provided with any grants, tax credits, abatements or other incentives related to this expansion effort and do not meet requirements associated with those incentives, we may not be able to benefit from those incentives, which could cause the cost of the project to be significantly more than anticipated or significantly increase our taxes above what we currently expect. To date, we have financed construction with cash on hand and plan to finance the remainder of construction in the same way. Use of cash on hand to finance construction has and will continue to reduce the amount of cash available for other corporate uses and could also reduce our ability to meet our scheduled debt service obligations or to meet the covenants required to borrow additional funds under our 2020 Credit Agreement. Any of the foregoing may adversely affect our financial position and results of operations.\nOur current or future geographic expansion plans may not result in increased revenues, which may negatively impact our business, results of operations and financial position. Expanding into new markets and increasing the depth of our coverage in existing markets imposes additional burdens on our research, systems development, sales, marketing and general managerial resources. If we are unable to manage our expansion efforts effectively, if our expansion efforts take longer or are more expensive than planned or we are not successful in marketing and selling our services in existing or new markets, our expansion may have a material adverse effect on our financial position by increasing our expenses without increasing our revenues.\nOur business and results of operations may be, and our financial condition may be, impacted by the lasting effects of the COVID-19 pandemic on the global economy, the real estate industry, and our customers and such impact could be materially adverse and continue for an unknown period of time. The COVID-19 pandemic created significant economic volatility, uncertainty and disruption around the world, including in the real estate industry.\nThe demand for office space decreased during and following the COVID-19 pandemic as businesses implemented hybrid or all work-from-home arrangements in response to employee desire for more flexibility, which may lead to a downturn in the commercial real estate market. A depressed commercial real estate market would have a negative impact on our core customer base, which could impact our customers’ ability to subscribe and pay for our services and reduce demand for our services. Reduced demand and increased cancellations could cause our revenues or our revenue growth rates to decline and reduce our profitability. The extent and duration of any future weakening of the economy or future downturns in the commercial real estate market as a lasting result of the COVID-19 pandemic is unknown, and there can be no assurance that any of the governmental or private sector initiatives designed to strengthen the economy will be successful or available to us and our customers and, if successful, when the benefits will be seen.\nWe are subject to a number of risks related to acceptance of credit cards and debit cards and facilitation of other customer payments.\nWe depend on processing vendors to process a significant number of credit and debit card transactions and ACH payments, for payments made to us directly for our services, by renters to landlords using our online leasing services, or by real estate agents to purchase our Homes.com services. If we or any one or more of these service providers fail to maintain adequate systems to authorize and process credit card transactions, one or more of the major credit card companies could disallow our continued use of their payment products. If we are unable to maintain our chargeback rate or refund rates at acceptable levels, our processing vendors may increase our transaction fees or terminate their relationships with us. We could lose customers if we are not able to continue to use payment products of the major credit card companies. Further, if we or any one or more of these service providers fail to maintain adequate systems for authorization and processing of credit, debit, ACH or similar payments or if any such service provider were to terminate or modify its relationship with us unexpectedly, our ability to process those customer transactions would be adversely affected, which could decrease sales, discourage customers away from our marketplace services, result in potential legal liability, and harm our business and reputation. In addition, if the systems for the authorization and processing of credit card transactions fail to work properly and, as a result, we do not charge our customers’ credit cards on a timely basis or at all, our business, revenue, results of operations and financial condition could be harmed.\nWe are also subject to payment card association operating rules, certification requirements and rules governing electronic funds transfers, which could change or be reinterpreted in ways that make it more difficult for us to comply. We are required to comply with payment card industry security standards. Failing to comply with those standards may violate payment card association operating rules, federal and state laws and regulations and the terms of our contracts with payment processors. Any failure to comply also may subject us to fines, penalties, damages and civil liability, and may result in the loss of our ability to accept credit and debit card payments. Further, there is no guarantee that such compliance will prevent illegal or improper use of our payment systems or the theft, loss, or misuse of data pertaining to credit and debit cards, cardholders and transactions.\nThe payment methods that we offer also subject us to potential fraud and theft by criminals, who are becoming increasingly sophisticated, seeking to obtain unauthorized access to or exploit weaknesses that may exist in the payment systems. If we fail to comply with applicable rules or requirements for the payment methods we accept, or if payment-related data are compromised due to a breach of data, we may be liable for significant costs incurred by payment card issuing banks and other third parties or subject to fines and higher transaction fees, or our ability to accept or facilitate certain types of payments may be impaired. In addition, our customers could lose confidence in certain payment types, which may result in a shift to other payment types or potential changes to our payment systems that may result in higher costs. If we fail to adequately control fraudulent payment transactions, we may face civil liability, diminished public perception of our security measures and higher costs, each of which could harm our business, results of operations and financial condition.\nIf we are unable to maintain our chargeback rate or refund rates at acceptable levels, our processing vendors may increase our transaction fees or terminate their relationships with us. Any increases in our credit and debit card fees could harm our results of operations, particularly if we elect not to raise our rates for our services to offset the increase. The termination of our ability to process payments on any major credit or debit card would significantly impair our ability to operate our business.\nClimate change and other events beyond our control could harm our business. Natural disasters, disease outbreaks and pandemics, power shortages, terrorism, political unrest, telecommunications failure, vandalism, geopolitical instability, war, climate change, and other events beyond our control could negatively impact our operations or otherwise harm our business. Such events may result in damage or loss of service to our data centers or other infrastructure that our operations rely on, potentially reduce the attractiveness of real estate in areas we provide services, cause delays in product development or availability, or result in losses of critical data, any of which may adversely impact our operations.\nIn addition, the impacts of climate change on the global economy and our industry are rapidly evolving. Physical impacts of climate change (including, but not limited to, floods, droughts, more frequent and/or intense storms, and wildfires) may\ndisrupt our operations, as well as the operations of our suppliers and customers. Longer-term physical impacts may also result in changing consumer preferences, which may adversely impact demand for certain of our products. Transition impacts of climate change may subject us to increased regulations, reporting requirements (such as the SEC’s proposed climate change disclosure rule), standards, or expectations regarding the environmental impacts of our business. Failure to disclose accurate information in a timely manner may also adversely affect our reputation, business, or financial performance.\nIncreased attention to ESG matters may require us to incur additional costs or otherwise adversely impact our business. Increased attention to climate change; diversity, equity, and inclusion; and other ESG issues, as well as societal expectations regarding voluntary ESG initiatives and disclosures, may result in increased costs (including, but not limited to, increased costs related to compliance, stakeholder engagement, and contracting), impact our reputation, or otherwise affect our business performance. In addition, organizations that provide information to investors on corporate governance and related matters have developed ratings processes for evaluating companies on ESG matters. Such ratings are used by some investors to inform their investment or voting decisions. Unfavorable ESG ratings could lead to negative investor sentiment toward us and/or our industry, which could have a negative impact on our access to and costs of capital. To the extent ESG matters negatively impact our reputation, we may also not be able to compete as effectively to recruit or retain employees. We may take certain actions, including the establishment of ESG-related goals or targets, to improve the ESG profile of our Company and/or offerings and/or to respond to stakeholder demand; however, such actions may be costly or be subject to numerous conditions that are outside our control, and we cannot guarantee that such actions will have the desired effect.\nMoreover, while we may create and publish voluntary disclosures regarding ESG matters from time to time, many of the statements in those voluntary disclosures are based on hypothetical expectations and assumptions that may or may not be representative of current or actual risks or events or forecasts of expected risks or events, including the costs associated therewith. Such expectations and assumptions are necessarily uncertain and may be prone to error or subject to misinterpretation given the long timelines involved and the lack of an established single approach to identifying, measuring and reporting on many ESG matters. Such disclosures may also be at least partially reliant on third-party information that we have not independently verified or cannot be independently verified. In addition, we expect there will likely be increasing levels of regulation, disclosure-related and otherwise, with respect to ESG matters, and increased regulation will likely lead to increased compliance costs as well as scrutiny that could heighten all of the risks identified in this risk factor. Such ESG matters may also impact our suppliers or customers, which may adversely impact our business, financial condition, or results of operations.\nRisks related to our data, intellectual property and listings\nIf we are not able to obtain and maintain accurate, comprehensive or reliable data, we could experience reduced demand for our information, analytics and online marketplace services. Our success depends on our clients’ confidence in the comprehensiveness, accuracy and reliability of the data and analysis we provide.\nEstablishing and maintaining accurate and reliable data and analysis is challenging. If our data, including the data we obtain from third parties or directly from brokers through the Marketing Center feature on CoStar and LoopNet, or analysis is not current, accurate, comprehensive or reliable, we could experience reduced demand for our services or be subject to legal claims by our customers, either of which could result in lower revenues and higher expenses.\nIf we are unable to enforce or defend our ownership and use of intellectual property, our business, brands, competitive position and operating results could be harmed. The success of our business depends in large part on our intellectual property, including intellectual property involved in our methodologies, databases, services and software. We rely on a combination of trademark, trade secret, patent, copyright and other laws, nondisclosure and noncompetition provisions, license agreements and other contractual provisions and technical measures to protect our intellectual property rights. However, current law may not provide for adequate protection of our databases and the actual data. In addition, legal standards relating to the validity, enforceability and scope of protection of proprietary rights in internet-related businesses are uncertain and evolving, and changes in these standards may adversely impact the viability or value of our proprietary rights. We find our proprietary content on competitors’ sites. If we are not successful in protecting our intellectual property, including our content, our brands and our business, results of operations and financial condition could be harmed. The same would be true if a court found that our services infringe other persons’ intellectual property rights. Any intellectual property lawsuits or threatened lawsuits in which we are involved, either as a plaintiff or as a defendant, have cost us and could continue to cost us a significant amount of time and money and distract management’s attention from operating our business. In addition, if we do not prevail on an intellectual property claim, this could result in a change to our methodology or information, analytics and online marketplace services and could reduce our profitability.\nEffective trademark, trade secret, patent and copyright protection may not be available in every country in which we provide our services. The laws of certain countries do not protect proprietary rights to the same extent as the laws of the U.S. and, therefore, in certain jurisdictions, we may be unable to protect our intellectual property and our proprietary technology\nadequately against unauthorized third-party copying or use, which could harm our competitive position. This risk will increase as we continue to expand our business into new international jurisdictions.\nWe may not be able to successfully halt the operation of websites that aggregate our data, as well as data from other companies, or \"copycat\" websites that may misappropriate our data. We have expended significant resources to develop proprietary content and any misappropriation of our data could reduce that value of that content or our return on investment related to that content, which could harm our competitive position and results of operations. Third parties may misappropriate our data through website scraping, robots or other means and aggregate and display this data on their websites. Artificial intelligence is becoming increasingly powerful and sophisticated, and third parties may utilize artificial intelligence to misappropriate our data more quickly and at a larger scale than in the past. In addition, “copycat” websites may misappropriate data on our website and attempt to imitate our brands or the functionality of our website. We may not be able to detect all such websites in a timely manner and, even if we could, technological and legal measures available to us may be insufficient to stop their operations and the misappropriation of our data. Any measures that we may take to enforce our rights could require us to expend significant financial or other resources.\nWe may be subject to legal liability for collecting, displaying or distributing information. Because the content in our database is collected from various sources and distributed to others, we may be subject to claims for breach of contract, defamation, negligence, unfair competition or copyright or trademark infringement or claims based on other theories, such as breach of laws related to privacy and data protection. We could also be subject to claims based upon the content that is accessible from our website through links to other websites or information on our website supplied by third parties. Even if these claims do not result in liability to us, we could incur significant costs in investigating and defending against any claims, and we could be subject to public notice requirements that may affect our reputation. Our potential liability for information distributed by us to others could require us to implement measures to reduce our exposure to such liability, which may require us to expend substantial resources and limit the attractiveness of our information, analytics and online marketplaces to users. These risks may be exacerbated from impacts, or perceived impacts, of emerging technologies (including, but not limited to, machine learning) on human rights, privacy, or other social considerations, which may result in reputational harm, compliance costs for any new rules or interpretations, or other adverse impacts on our operations and financial performance.\nIf we are unable to obtain or retain listings from real estate brokers, agents, property owners and apartment property managers, our marketplace services could be less attractive to current or potential customers, which could reduce our revenues. The value of our real estate marketplace services to our customers depends on our ability to increase the number of property listings provided and searches conducted. As the number of listings increases, so does the utility of a marketplace’s search, listing and marketing services. We depend substantially on brokers, agents, property owners and, in the case of apartment rentals, property managers to submit listings to our marketplaces. If these parties choose not to continue their listings with us, or choose to list them with a competitor, our marketplace services could be less attractive to other real estate industry transaction participants, resulting in reduced revenue.\nWe may not be able to maintain or establish relationships with third-party listing providers, which could limit the information we have to power our products and services and impair our ability to attract or retain customers. Our ability to attract agents and consumers to our Homes.com Network, its websites and mobile applications and other residential real estate tools depends, to some degree, on us providing timely access to comprehensive and accurate real estate listings and information. We get listings data primarily from MLSs in the markets we serve. We also source listings data from public records, other third-party listing providers, and other sources. Many of our agreements with real estate listing providers may be terminated with limited notice or cause. Many of our competitors and other real estate websites have similar access to MLSs and listing data and may be able to source certain real estate information faster or more efficiently than we can. Because MLS participation is voluntary, brokers and homeowners may decline to post their listings data to their local MLS or may seek to change or limit the way that data is distributed. Another industry participant or group could create a new listings data service, which could impact the relative quality or quantity of information of our listing providers. The loss of existing relationships with MLSs and other listing providers, whether due to termination of agreements, loss of MLS memberships, or otherwise, changes to our rights to use or timely access listing data or an inability to continue to add new listing providers or changes to the way real estate information is shared, may negatively impact our listing data quality. This could markedly decrease the quantity and quality of the sale and rental data we provide, reduce customer confidence in our products and services and cause customers to go elsewhere for real estate listings and information, which could severely harm our business, results of operations and financial condition.\nIf we fail to comply with the rules and compliance requirements of MLSs, our access to and use of listings data may be restricted or terminated. Our products and services access and use listings data through MLS memberships and must comply with each MLS’s rules and compliance requirements to maintain their access to listings data and remain a member in good standing. Each MLS has adopted its own rules, policies, and agreement terms governing, among other things, how MLS data\nmay be used and how listings data must be displayed on our websites and mobile applications. MLS members are also subject to compliance operations requirements and, as a result, must respond to complaints lodged by the MLS or other MLS participants on required timelines. MLS rules vary among markets and are in some cases inconsistent between MLSs, such that we are required to customize our websites, mobile applications, or services to accommodate differences between MLS rules. Handling complaints received by MLS members across markets may create heightened operational or financial risks with short response and resolution deadlines. Complying with the rules and compliance requirements of each MLS requires significant investment, including personnel, technology and development resources, and the exercise of considerable judgment. Rules and compliance requirements of MLSs may be changed across markets, including potential for targeted changes in response to our operations. If we are deemed to be noncompliant with an MLS’s rules or to have provided improper responses to or resolution of complaints, we may face disciplinary sanctions by that MLS, which could include monetary fines, restricting or terminating our access to that MLS’s data, or other disciplinary measures. The loss or degradation of this listings data could materially and adversely affect traffic to our websites and mobile applications, which could severely harm our business, results of operations and financial condition.\nRisks related to our international operations\nInternational operations expose us to additional business risks, which may reduce our profitability. Our international operations and expansion subject us to additional business risks, including: currency exchange rate fluctuations; difficulty in adapting to the differing business practices and laws in foreign countries, including differing laws regarding privacy and data protection; difficulty in managing foreign operations; limited protection for intellectual property rights in some countries; difficulty in collecting accounts receivable and longer collection periods; costs of enforcing contractual obligations; impact of recessions in economies outside the U.S.; geopolitical instability, terrorism and war; and potentially adverse tax consequences. In addition, international expansion imposes additional burdens on our executive and administrative personnel, systems development, research and sales departments and general managerial resources. If we are not able to manage our international operations successfully, we may incur higher expenses and our profitability may be reduced. Finally, the investment required for additional international expansion sometimes exceeds the profit generated from such expansion, which reduces our profitability and may adversely affect our financial position.\nFluctuating foreign currency exchange rates may negatively impact our business, results of operations and financial position. A portion of our business is denominated in foreign currencies. We translate sales and other results denominated in foreign currency into U.S. dollars for our financial statements. During periods of a strengthening U.S. dollar, our reported international sales and earnings could be reduced because foreign currencies may translate into fewer U.S. dollars. Foreign currency exchange rates have fluctuated and may continue to fluctuate.\nSignificant foreign currency exchange rate fluctuations may negatively impact our international revenue, which in turn affects our consolidated revenue. Currently, we are not party to any hedging transactions intended to reduce our exposure to exchange rate fluctuations. We may seek to enter into hedging transactions in the future, but we may be unable to enter into these transactions successfully, on acceptable terms or at all. We cannot predict whether we will incur foreign exchange losses in the future. Further, significant foreign exchange rate fluctuations resulting in a decline in the respective local currency may decrease the value of our foreign assets, as well as decrease our revenues and earnings from our foreign subsidiaries, which would reduce our profitability and adversely affect our financial position.\nRisks related to our indebtedness\nWe have a significant amount of indebtedness, which could decrease our flexibility and adversely affect our business, financial condition and results of operations. As of December 31, 2023, we had $1 billion of Senior Notes outstanding and an additional approximately $750 million available to be drawn under the 2020 Credit Agreement. Borrowings under the 2020 Credit Agreement bear interest at varying rates and expose us to interest rate risk. There can be no assurance that our future cash flows will be sufficient to make payments of interest or principal on the Senior Notes or any amounts due and payable under the 2020 Credit Agreement. If our cash flows and capital resources are insufficient to fund our debt service obligations, we could face substantial liquidity problems and could be forced to reduce or delay investments and capital expenditures or to dispose of material assets or operations, seek additional debt or equity capital or restructure or refinance our indebtedness. We may not be able to effect any such alternative measures on commercially reasonable terms or at all, and, even if successful, those alternative actions may not allow us to meet our scheduled debt service obligations. Furthermore, we may incur substantial additional indebtedness, including secured indebtedness, and if we incur additional indebtedness or other liabilities, the related risks that we face could intensify.\nThe 2020 Credit Agreement contains customary restrictive covenants imposing operating and financial restrictions on us, including restrictions that may limit our ability to engage in acts that we believe may be in our long-term best interests. These covenants restrict our ability and the ability of our domestic subsidiaries to, among other things, (i) incur additional indebtedness, (ii) incur liens, (iii) pay dividends or make certain other restricted payments, investments or acquisitions, (iv)\nmerge or consolidate with another person, and (v) sell, assign, lease or otherwise dispose of all or substantially all of our assets. In addition, the 2020 Credit Agreement requires us to comply with a maintenance covenant that we will not exceed a total net leverage ratio, calculated as total consolidated debt, net of up to $1.0 billion of unrestricted cash and cash equivalents, to consolidated EBITDA, of 4.50 to 1.00. The operating restrictions and financial covenants in the 2020 Credit Agreement may limit our ability to finance future operations or capital needs, to engage in other business activities or to respond to changes in market conditions. Our ability to comply with any financial covenants could be affected materially by events beyond our control, and we may be unable to satisfy any such requirements. If we fail to comply with these covenants, we may need to seek waivers or amendments of such covenants, seek alternative or additional sources of financing or reduce our expenditures. We may be unable to obtain such waivers, amendments or alternative or additional financing on a timely basis or at all, or on favorable terms.\nA breach of the covenants under the 2020 Credit Agreement or the indenture that governs the Senior Notes could result in an event of default under the applicable indebtedness. Such a default may allow the creditors to accelerate the related debt and may result in the acceleration of any other debt to which a cross-acceleration provision applies. In the event the holders of the Senior Notes or our other debt accelerate the repayment of our borrowings, we and our subsidiaries may not have sufficient assets to repay that indebtedness.\nIn May 2023, we amended the 2020 Credit Agreement to replace LIBOR as the reference rate with Term SOFR for U.S. dollar-denominated borrowings, SONIA rates for Sterling-denominated borrowings and EURIBOR for Euro-denominated borrowings. It is unclear, however, whether SOFR, SONIA or EURIBOR will retain market acceptance as a LIBOR replacement tool, and we may need to renegotiate our 2020 Credit Agreement if other LIBOR alternatives are established and become more widely adopted. Each of SOFR, SONIA and EURIBOR differ from LIBOR, both in the actual rate and how it is calculated. It is not possible to predict what effect the change to SOFR, SONIA and EURIBOR may have on our interest rates.\nOur indebtedness increases our vulnerability to general adverse economic and industry conditions; requires us to dedicate a portion of our cash flow from operations to payments on indebtedness, reducing the availability of cash flow to fund capital expenditures, marketing and other general corporate activities; limits our ability to borrow additional funds; and may limit our flexibility in planning for, or reacting to, changes in our business and the industries in which we operate.\nA lowering or withdrawal of the ratings assigned to our debt securities by rating agencies may increase our future borrowing costs, reduce our access to capital or result in the loss of certain covenant suspensions. Our debt rating could be lowered or withdrawn entirely by a rating agency if, in that rating agency’s judgment, future circumstances relating to the basis of the rating, such as adverse changes, warrant. Any future lowering of our ratings likely would make it more difficult or more expensive for us to obtain additional debt financing.\nIn addition, during a Covenant Suspension Period, certain customary negative and affirmative covenants contained in the 2020 Credit Agreement are suspended, including the covenants restricting affiliate transactions, incurrence of indebtedness, investments, asset sales and restricted payments. A lowering of one or both of our investment grade ratings would result in increased compliance costs and would impose certain operating restrictions, either of which could be materially adverse to our operations and financial results.\nRisks related to regulatory compliance and legal matters\nOur actual or perceived failure to comply with privacy laws and standards could adversely affect our business, financial condition and results of operations. We depend on IT Systems. We own and manage some IT Systems but also rely on third-party service providers and vendors for a range of products and services, including cloud products/services, that are critical to internal and/or external customer-facing operations. In the course of our business, we and certain of our third-party providers collect, use, transmit and disclose Confidential Information, including personal data about our employees, current and potential customers and employees of third parties we work with.\nAs a result, we are subject to a variety of state, national and international laws and regulations that apply to the collection, use, retention, protection, disclosure, transfer and other processing of personal information, including, but not limited to, the GDPR and CCPA. These laws and regulations are evolving, with new or modified laws and regulations proposed and implemented frequently and existing laws and regulations subject to new or different interpretations. For example, the GDPR creates data protection requirements in the EU and UK and imposes substantial fines for breaches of the data protection rules. The GDPR increased our responsibility and liability in relation to personal data that we process. The CCPA, among other things, provides the rights to California residents related to their personal information, places limitations on data uses and creates new audit requirements for higher risk data. The CCPA also provides for civil penalties for violations, as well as a private right of action for data breaches that may increase data breach litigation. Other state privacy laws apply to operations, and similar laws have been proposed, and likely will continue to be proposed, in other states and at the federal level, and if passed, may have potentially conflicting requirements that would make compliance challenging.\nIn addition to risks we face under applicable privacy laws, we are subject to evolving consumer protection and marketing laws and increased litigation and government enforcement by the Federal Trade Commission and state Attorneys General. These agencies are aggressively interpreting and enforcing federal and state consumer protection laws in relation to very broad sales and marketing and advertising contexts. There are also federal laws covering our activities that are a source of potential liability for our business, including the CAN-SPAM Act, the TCPA, and the FCRA. In particular, any claims that we have violated the TCPA could be costly to litigate and could expose us to substantial statutory damages or settlement costs.\nAny failure or alleged failure to comply with privacy, data protection or consumer protection laws could lead to government enforcement actions and litigation and significant penalties against us, and could materially adversely affect our reputation, business, financial condition, cash flows and results of operations. Compliance with any of the foregoing laws and regulations can be costly, can delay or impede the development of new products, and may require us to change the way we operate.\nThe interpretation and application of many privacy and data protection laws are uncertain. These laws may be interpreted and applied in a manner that is inconsistent with our existing data management practices or the features of our products. If so, in addition to the possibility of negative publicity, fines, lawsuits and other claims and penalties, we could be required to fundamentally change our business activities and practices or modify our products, which could harm our business.\nChanges in tax laws, regulations or fiscal and tax policies or the manner of their interpretation or enforcement could adversely impact our financial performance. New tax laws or regulations, or changes in existing laws or regulations, or the manner of their interpretation or enforcement, could increase our cost of doing business. In addition, from time to time, U.S. and foreign tax authorities, including state and local governments, consider legislation that could increase our effective tax rate. Further, the Organization for Economic Co-operation and Development has a framework to implement a global minimum corporate tax of 15% for companies with global revenues and profits above certain thresholds (referred to as Pillar 2), with certain aspects of Pillar 2 effective January 1, 2024 and other aspects effective January 1, 2025. While it is uncertain whether the U.S. will enact legislation to adopt Pillar 2, certain countries in which we operate have adopted legislation, and other countries are in the process of introducing legislation to implement Pillar 2. Although we do not expect Pillar 2 to have a material impact on our effective tax rate or our consolidated results of operations, financial position, and cash flows at this time, certain implementation details have yet to be developed, and the enactment of certain of these changes has not yet taken effect in all jurisdictions in which we operate. As a result, these changes may have adverse consequences for us, may increase our compliance costs and may increase the amount of tax we are required to pay in certain jurisdictions.\nThird-party claims, litigation, regulatory proceedings or government investigations to which we are subject or in which we become involved, regardless of their merit, may significantly increase our expenses and adversely affect our stock price. From time to time we may be subject to third-party claims, lawsuits, regulatory proceedings or government investigations into whether our business practices comport with applicable law, which may include claims with respect to intellectual property, cybersecurity, privacy, data protection, antitrust, breach of contract, employment, mergers and acquisitions and other matters. Regardless of the merit of such claims, proceedings or investigations, defending against them could cost us a significant amount of time and money, result in negative publicity, and/or adversely affect our stock price. In addition, if any claims or proceedings are decided against us or if a settlement requires us to pay a large monetary amount or take other action that materially restricts or impedes our operations, our profitability could be significantly reduced and our financial position could be adversely affected.\nWe do not currently intend to pay dividends on our common stock and, consequently, your ability to achieve a return on your investment will depend on appreciation in the price of our common stock. We have never declared or paid any cash dividends on our common stock and do not intend to do so for the foreseeable future. We currently intend to invest our future earnings, if any, to finance our growth or share repurchases. In addition, provisions of the 2020 Credit Agreement governing our credit facilities limit our ability to pay cash dividends. Therefore, you are not likely to receive any dividends on your common stock for the foreseeable future and the success of an investment in shares of our common stock will depend upon any future appreciation in their value. There is no guarantee that shares of our common stock will appreciate in value or even maintain the price at which our stockholders have purchased their shares.",
    "item_1B": "Item 1B. Unresolved Staff Comments\nNone.",
    "item_1C": "Item 1C. Cybersecurity\nCybersecurity Risk Management and Strategy\nWe have developed and implemented a cybersecurity risk management program intended to protect the confidentiality, integrity, and availability of our critical systems and information.\nOur cybersecurity risk management program is guided by the National Institute of Standards and Technology Cybersecurity Framework (NIST CSF). This does not imply that we meet any particular technical standards, specifications, or requirements at all times, only that we use the NIST CSF as a guide to help us identify, assess, and manage cybersecurity risks relevant to our business. Additionally, we engage a third-party vendor regularly to benchmark our information security program’s maturity against the NIST CSF.\nOur cybersecurity risk management program is integrated into our overall enterprise risk management program, and shares common methodologies, reporting channels and governance processes that apply across the enterprise risk management program to other legal, compliance, strategic, operational, and financial risk areas.\nKey elements of our cybersecurity risk management program include, but are not limited to the following:\na.Internal and external asset identification, assessment, monitoring and classification procedures to evaluate cybersecurity risks and inform mitigation efforts.\nb.A security team principally responsible for managing (1) our cybersecurity risk assessment processes, (2) our cyber processes, and (3) our cyber threat and incident response;\nc.The use of external service providers, where appropriate, to assess defenses, analyze threat intelligence, or otherwise assist with aspects of our security controls;\nd.Cybersecurity awareness training of our employees, software development teams, incident response personnel, and senior management;\ne.A cybersecurity incident response plan that includes procedures for responding to cybersecurity incidents; and regular tabletop exercises to assess our response readiness; and\nf.A third-party risk management process for key service providers, suppliers, and vendors who access critical systems and data based on risk profile.\nWe have not identified material risks from known cybersecurity threats, including as a result of any prior cybersecurity incidents, that have materially affected us, including our operations, business strategy, results of operations, or financial condition. We face certain ongoing risks from cybersecurity threats that, if realized, are reasonably likely to materially affect us, including our operations, business strategy, results of operations, or financial condition. See Risk Factors - “Cyberattacks and security vulnerabilities could result in serious harm to our reputation, business and financial condition.” and “Technical problems or disruptions that affect either our customers’ ability to access our services, or the software, internal applications, database and network systems underlying our services, could damage our reputation and lead to reduced demand for our information, analytics and online marketplace services, lower revenues and increased costs.”\nCybersecurity Governance\nOur Board considers cybersecurity risk as part of its risk oversight function and has delegated to the Audit Committee oversight of cybersecurity and other information technology risks. The Audit Committee oversees management’s implementation of our cybersecurity risk management program.\nOur Audit Committee receives reports from management on our cybersecurity risks. In addition, management updates the Audit Committee, as necessary, regarding any significant cybersecurity incidents. The Audit Committee reports to the full Board regarding its activities, including those related to cybersecurity.\nOur management team is informed and monitors the prevention, detection, mitigation and remediation of cybersecurity threats. The team has primary responsibility for our overall cybersecurity risk management program and supervises both our internal cybersecurity personnel and our retained external cybersecurity consultants. Our management team’s experience includes industry-recognized certifications, such as CISSP, CISM, and CISA, decades of experience as part of our IT team, and previous cybersecurity leadership positions at various Fortune 500 companies and U.S. Defense contractors.\nOur management team is informed about and monitors the prevention, detection, mitigation, and remediation of cybersecurity risks and incidents through various means, which may include briefings from internal security personnel; threat intelligence and other information obtained from governmental, public or private sources, including external consultants engaged by us; and alerts and reports produced by security tools deployed in the IT environment.",
    "item_2": "Item 2. Properties\nOur headquarters is located at 1331 L Street, NW, in downtown Washington, DC, where we occupy approximately 169,000 square feet of office space, with a lease that expires on May 31, 2025 (with two five-year renewal options). Our headquarters is used primarily by our North America operating segment. Our principal facility in the U.K. is located in London, where we occupy 42,000 square feet of office space. Our lease for this facility has a term ending August 31, 2025. This facility is used by our International operating segment, including our recent acquisition, OnTheMarket.\nOur staff in Richmond, Virginia occupy an owned building located at 501 S 5th Street, where we occupy approximately 310,000 square feet, an owned building located at 901 Semmes Avenue, where we own and occupy approximately 117,000 square feet; and leased space at 951 E Byrd St., where we occupy approximately 97,000 square feet. These locations house research, product development and sales functions. All of our owned properties are held under fee simple ownership and are not materially encumbered.\nWe also operate certain of our research, development and sales functions out of additional leased office spaces in Irvine, California; San Diego, California; and Atlanta, Georgia. Additionally, we lease office space in a variety of other metropolitan areas. These locations include, among others, the following: Hendersonville, Tennessee; Norfolk, Virginia; Boston, Massachusetts; New York, New York; San Francisco, California; and Los Angeles, California.\nWe believe these facilities are suitable and appropriately support our business needs.",
    "item_3": "Item 3. Legal Proceedings\nCurrently, and from time to time, we are involved in litigation incidental to the conduct of our business, including, among others, the legal actions discussed under “Contingencies” in Note 13 “Commitments and Contingencies” of the Notes to our Consolidated Financial Statements. While our management presently believes that the ultimate outcome of these proceedings, individually and in the aggregate, will not materially harm our business, financial position, future results of operations or liquidity, legal proceedings are inherently uncertain, and unfavorable rulings could, individually or in the aggregate, have a material adverse effect on our business, financial position, future results of operations or liquidity.",
    "item_4": "Item 4. Mine Safety Disclosures\nNot Applicable.\nPART II",
    "item_5": "Item 5. Market for Registrant’s Common Equity, Related Stockholder Matters and Issuer Purchases of Equity Securities\nOur common stock is traded on the Nasdaq Global Select Market under the symbol “CSGP.” As of January 31, 2024, there were 1,654 holders of record of our common stock.\nDividend Policy. We have never declared or paid any dividends on our common stock. We do not anticipate paying any dividends on our common stock during the foreseeable future, but intend to retain any earnings for future growth of our business.\nRecent Issues of Unregistered Securities. We did not issue any unregistered securities during the year ended December 31, 2023.\nIssuer Purchases of Equity Securities. The following table is a summary of our repurchases of common stock for the quarter ended December 31, 2023:\nISSUER PURCHASES OF EQUITY SECURITIES\n(1) The number of shares purchased consists of shares of common stock tendered by employees to the Company to satisfy the employees' minimum tax withholding obligations arising as a result of vesting of restricted stock grants under the Company’s 2016 Stock Incentive Plan, as amended, which shares were purchased by the Company based on their fair market value on the trading day immediately preceding the vesting date. None of these share purchases were part of a publicly announced program to purchase common stock of the Company.\nStock Price Performance Graph\nThe stock performance graph below shows how an initial investment of $100 in our common stock would have compared to:\n•An equal investment in the S&P 500 Index; and\n•An equal investment in the S&P 500 Internet Services & Infrastructure Index.\nThe comparison covers the period beginning December 31, 2018 and ending on December 31, 2023, and assumes the reinvestment of any dividends. Note that this performance is historical and is not necessarily indicative of future price performance.",
    "item_6": "Item 6. Reserved",
    "item_7": "Item 7. Management’s Discussion and Analysis of Financial Condition and Results of Operations\nThe following Management’s Discussion and Analysis of Financial Condition and Results of Operations contains “forward-looking statements,” including statements about our beliefs and expectations. There are many risks and uncertainties that could cause actual results to differ materially from those discussed in the forward-looking statements. Potential factors that could cause actual results to differ materially from those discussed in any forward-looking statements include, but are not limited to, those stated above in under the heading “Cautionary Statement Concerning Forward-Looking Statements” and in Item 1A. under the heading “Risk Factors,” as well as those described from time to time in our filings with the SEC.\nAll forward-looking statements are based on information available to us on the date of this filing and we assume no obligation to update such statements, whether as a result of new information, future events or otherwise. The following discussion should be read in conjunction with our Quarterly Reports on Form 10-Q, Current Reports on Form 8-K and other filings with the SEC and the consolidated financial statements and related notes included in this Report.\nOverview\nOur principal information, analytics and online marketplace services are described in the following paragraphs by type of service:\nCoStar\nCoStar is our subscription-based integrated platform for commercial real estate intelligence, which includes information about office, industrial, retail, multifamily, hospitality and student housing properties, properties for sale, comparable sales, tenants, space available for lease, industry professionals and their business relationships, industry news and market status and provides lease analytical, risk management, and hospitality benchmarking capabilities. CoStar's revenue growth rate for the year ended December 31, 2023 slowed compared to the year ended December 31, 2022. We expect CoStar's revenue growth rate for the year ending December 31, 2024 to be consistent with the revenue growth rate for the year ended December 31, 2023 primarily due to converting legacy STR customers to our new CoStar based benchmarking product offsetting lower inflation-based price adjustments.\nInformation Services\nWe provide real estate and lease management technology solutions, including lease administration, lease accounting and abstraction services, through our CoStar Real Estate Manager service offerings, as well as portfolio and debt analysis, management and reporting capabilities through our CoStar Risk Analytics service offerings. We also provide benchmarking and analytics for the hospitality industry both on a subscription basis and an ad hoc basis. We earn revenue on ad hoc transactions as reports or data are delivered to customers. We provide information services internationally, through our Business Immo, Belbex and Thomas Daily businesses in France, Spain and Germany, respectively. Information Services revenue growth rate for the year ended December 31, 2023 slowed compared to the year ended December 31, 2022. We expect Information Services' revenue growth rate for the year ending December 31, 2024 to slow compared to the revenue growth rate for the year ended December 31, 2023 as a result of transitioning legacy STR customers to our new CoStar based benchmarking product.\nMultifamily\nApartments.com is the flagship brand of our apartment marketing network of subscription-based advertising services and provides property management companies and landlords with a comprehensive advertising destination for their available rental units and offers renters a platform for searching for available rentals. This network also earns transaction-based revenue primarily from providing online tenant applications, including background and credit checks, and rental payment processing. Multifamily's revenue growth rate for the year ended December 31, 2023 accelerated compared to the year ended December 31, 2022 as a result of higher sales volumes driven by increases in pricing on renewals and an increase in the number of properties listed on our network. We expect Multifamily's revenue growth rate for the year ending December 31, 2024 to moderate compared to the revenue growth rate for the year ended December 31, 2023 due to lower inflation-based price adjustments.\nLoopNet\nOur LoopNet network of commercial real estate websites offer subscription-based, online marketplace services that enable commercial property owners, landlords and real estate agents working on their behalf to advertise properties for sale or for lease and to submit detailed information about property listings. Commercial real estate agents, buyers and tenants use the LoopNet network of online marketplace services to search for available property listings that meet their criteria. LoopNet's revenue growth rate for the year ended December 31, 2023 accelerated compared to the year ended December 31, 2022, due to an increase in the average price per listing. We expect LoopNet's revenue growth rate for the year ending December 31, 2024 to\nslow compared to the revenue growth rate for the year ended December 31, 2023 as a result of disruptions related to transitioning sales and service activities to a dedicated LoopNet field sales team.\nResidential\nOur Homes.com Network and the acquisition of OnTheMarket have enabled us to expand our offerings to the residential for sale market. Homes.com is a homes for sale listings site that combines our proprietary research with listing information to allow homebuyers an informative and collaborative experience finding homes for sale or lease. Homes.com provides residential real estate professionals subscription-based access to applications that manage residential real estate agent workflow and receives transaction-based revenue for marketing campaigns delivered on third-party platforms. In February 2024, we began selling subscription memberships to promote the home listing as well as the agent in the sort order. OnTheMarket is a property portal in the U.K., which primarily offers subscriptions-based advertising services to agents. Residential's revenues for the year ended December 31, 2023 decreased compared to the year ended December 31, 2022, due to the discontinuation of certain non-strategic products and services. We expect Residential's revenues for the year ending December 31, 2024 to increase compared to the year ended December 31, 2023 due to the OnTheMarket Acquisition and the launch of our new Homes.com product.\nOther Marketplaces\nOur other marketplaces include Ten-X, an online auction platform for commercial real estate and our BizBuySell and Land.com networks. The BizBuySell network provides online marketplaces for businesses and franchises for sale, and THE Land.com network provides online marketplaces for rural land for sale. Other marketplaces' revenues for the year ended December 31, 2023 decreased compared to the year ended December 31, 2022, due to lower Ten-X transaction revenue, partially offset by growth in other products. We expect other marketplaces' revenues for the year ending December 31, 2024 to be consistent with the revenues for the year ended December 31, 2023.\nSubscription-based Services\nThe majority of our revenue is generated from service offerings that are distributed to our clients under subscription-based agreements that typically renew automatically and have a term of at least one year. We recognize subscription revenues on a straight-line basis over the life of the contract.\nFor the years ended December 31, 2023, 2022 and 2021, our annualized net new bookings of subscription-based services on all contracts were approximately $286 million, $305 million and $217 million, respectively. Net new bookings is calculated based on the annualized amount of change in the Company's sales bookings resulting from new subscription-based contracts, changes to existing subscription-based contracts and cancellations of subscription-based contracts for the period reported. Net new bookings is calculated on all subscription-based contracts without regard to contract term. Net new bookings is considered an operating metric that is an indicator of future subscription revenue growth and is also used as a metric of sales force productivity by us and investors. However, information regarding net new bookings is not comparable to, nor should it be substituted for, an analysis of our revenues over time. Revenue from our subscription-based contracts were approximately 95%, 93% and 93% of total revenue for the years ended December 31, 2023, 2022 and 2021, respectively. The increase in the percentage of our revenue from subscription-based contracts from 2022 to 2023 was primarily due to the growth in our subscription-based services.\nFor the trailing 12 months ended December 31, 2023, 2022 and 2021, our contract renewal rates for subscription-based services for contracts with a term of at least one year were approximately 90%, 90% and 92%, respectively; and, therefore, our cancellation rates for those services for the same periods were approximately 10%, 10% and 8%, respectively. Our contract renewal rate is a quantitative measurement that is typically closely correlated with our revenue results. As a result, we believe that the rate may be a reliable indicator of short-term and long-term performance absent extraordinary circumstances. Our trailing 12-month contract renewal rate may decline as a result of negative economic conditions, consolidations among our clients, reductions in customer spending or decreases in our customer base. Revenue from our subscription-based contracts with a term of at least one year were approximately 82%, 80% and 77% of total revenue for the trailing 12 months ended December 31, 2023, 2022 and 2021, respectively. The increase in the percentage of our revenue from subscription-based contracts for contracts with a term of at least one year from 2022 to 2023 was due to increases in sales of longer term advertising products. The decrease in the percentage of our revenue from subscription-based contracts with a term of at least one year from 2023 to 2022 was primarily due to the acquisitions of companies that contained a higher percentage of transaction-based revenue than our legacy businesses, as well as increases in sales of shorter term advertising products.\nDevelopment, Investments and Expansion\nWe plan to continue to invest in our business and our services, evaluate strategic growth opportunities and pursue our key priorities as described below. We are committed to supporting, improving and enhancing our information, analytics and online marketplace solutions, including expanding and improving our offerings for our client base and site users, including property owners, property managers, buyers, commercial tenants and residential renters and buyers. We expect to continue our software development efforts to improve existing services, introduce new services, integrate and cross-sell services, integrate recently completed acquisitions and expand and develop supporting technologies for our research, sales and marketing organizations. We may reevaluate our priorities as economic conditions continue to evolve.\nOur key priorities for the year ending December 31, 2024 currently include:\n•Continuing to develop and invest in our residential marketplaces. For Homes.com we are creating additional content for neighborhoods, parks, schools and condos. In February 2024, we launched our new Homes.com subscription memberships to promote the home listing as well as the agent in the sort order on the website. We intend to create an expanded dedicated sales force, to supplement the efforts of our sales team already in place. We plan to increase our residential marketing investment, including the launch of a brand campaign.\nFor OnTheMarket, we plan to integrate OnTheMarket into the Company’s operations including additional investment in marketing, content creation and enhancing OnTheMarket’s website to improve performance and facilitate better search engine optimization.\n•Continuing to enhance our facilities. We are expanding our research and technology center in Richmond, Virginia. We broke ground on the expansion in November 2022 and expect construction to be substantially completed in the first half of 2026. The expansion includes construction of two new buildings spanning 750,000 square feet and will bring our campus footprint to over 1 million square feet when completed. We plan to increase our research, technology, operations, software development, marketing and sales teams in this location.\nIn February 2024, we closed on the purchase of a building in Arlington, Virginia and we plan to build out a space for our employees. The lease on our current Washington, DC headquarters ends in 2025.\nWe expect our investment in these priorities will increase our research, selling and marketing and facilities expenses, including potential impairments of assets associated with the acquired building. Each of these will reduce our net income and may reduce our cash on hand for the year ending December 31, 2024 compared to the year ended December 31, 2023. We intend to continue to assess the need for additional investments in our business in order to develop and distribute new services and functionality within our current platform or expand the reach of, or otherwise improve, our current service offerings. Any future product development or expansion of services, combination and coordination of services or elimination of services or corporate expansion, development or restructuring efforts could reduce our profitability and increase our capital expenditures. Any new investments, changes to our service offerings or other unforeseen events could cause us to experience reduced revenues or generate losses and negative cash flow from operations in the future. Any development efforts must comply with our credit facility, which contains restrictive covenants that restrict our operations and use of our cash flow and may prevent us from taking certain actions that we believe could increase our profitability or otherwise enhance our business.\nFor further discussion of our Company, strategy and products, see our business overview set forth in \"Item 1. Business\" in this Report.\nImpacts of Current Economic Conditions\nIn response to the concerns over inflation risk, the U.S. Federal Reserve raised interest rates over the past two years. It is currently unclear how the commercial real estate industry will ultimately be impacted by the current economic conditions. Rising interest rates or a period of elevated interest rates may reduce demand for all types of real estate. If the demand for office space or other real estate decreases significantly, there could be a downturn in the commercial real estate market that may materially adversely affect many of our clients. A depressed commercial real estate market would have a negative impact on our core customer base, which could impact our customers’ ability to subscribe and pay for our services and reduce demand for our services. Reduced demand and increased cancellations could cause our revenues or our revenue growth rates to decline and reduce our profitability.\nNon-GAAP Financial Measures\nWe prepare and publicly release quarterly unaudited financial statements prepared in accordance with GAAP. We also disclose and discuss certain non-GAAP financial measures in our public releases, investor conference calls and filings with the SEC. The non-GAAP financial measures that we may disclose include EBITDA, adjusted EBITDA, adjusted EBITDA margin,\nnon-GAAP net income and non-GAAP net income per diluted share. EBITDA is our net income before interest income or expense, net, other income or expense, net, loss on debt extinguishment, income taxes, depreciation and amortization. We typically disclose EBITDA on a consolidated and an operating segment basis in our earnings releases, investor conference calls and filings with the SEC. Adjusted EBITDA is different from EBITDA because we further adjust EBITDA for stock-based compensation expense, acquisition- and integration-related costs, restructuring costs and settlements and impairments incurred outside our ordinary course of business. Adjusted EBITDA margin represents adjusted EBITDA divided by revenues for the period. Non-GAAP net income is determined by adjusting our net income for stock-based compensation expense, acquisition- and integration-related costs, restructuring costs, settlement and impairment costs incurred outside our ordinary course of business and loss on debt extinguishment, as well as amortization of acquired intangible assets and other related costs, and then subtracting an assumed provision for income taxes. Non-GAAP net income per diluted share is a non-GAAP financial measure that represents non-GAAP net income divided by the number of diluted shares outstanding for the period used in the calculation of GAAP net income per diluted share.\nWe may disclose adjusted EBITDA, adjusted EBITDA margin, non-GAAP net income and non-GAAP net income per diluted share on a consolidated basis in our earnings releases, investor conference calls and filings with the SEC. The non-GAAP financial measures that we use may not be comparable to similarly titled measures reported by other companies. Also, in the future, we may disclose different non-GAAP financial measures in order to help our investors meaningfully evaluate and compare our results of operations to our previously reported results of operations or to those of other companies in our industry.\nWe view EBITDA, adjusted EBITDA, adjusted EBITDA margin, non-GAAP net income and non-GAAP net income per diluted share as operating performance measures. We believe that the most directly comparable GAAP financial measure to EBITDA, adjusted EBITDA and non-GAAP net income is net income. We believe the most directly comparable GAAP financial measures to non-GAAP net income per diluted share and adjusted EBITDA margin are net income per diluted share and net income divided by revenue, respectively. In calculating EBITDA, adjusted EBITDA, adjusted EBITDA margin, non-GAAP net income and non-GAAP net income per diluted share, we exclude from net income the financial items that we believe should be separately identified to provide additional analysis of the financial components of the day-to-day operation of our business. We have outlined below the type and scope of these exclusions and the material limitations on the use of these non-GAAP financial measures as a result of these exclusions. EBITDA, adjusted EBITDA, adjusted EBITDA margin, non-GAAP net income and non-GAAP net income per diluted share are not measurements of financial performance under GAAP and should not be considered as a measure of liquidity, as an alternative to net income or as an indicator of any other measure of performance derived in accordance with GAAP. Investors and potential investors in our securities should not rely on EBITDA, adjusted EBITDA, adjusted EBITDA margin, non-GAAP net income and non-GAAP net income per diluted share as a substitute for any GAAP financial measure, including net income and net income per diluted share. In addition, we urge investors and potential investors in our securities to carefully review the GAAP financial information included as part of our Annual Reports on Form 10-K and Quarterly Reports on Form 10-Q that are filed with the SEC, as well as our quarterly earnings releases, and compare the GAAP financial information with our EBITDA, adjusted EBITDA, adjusted EBITDA margin, non-GAAP net income and non-GAAP net income per diluted share.\nEBITDA, adjusted EBITDA, adjusted EBITDA margin, non-GAAP net income and non-GAAP net income per diluted share may be used by management to internally measure our operating and management performance and may be used by investors as supplemental financial measures to evaluate the performance of our business. We believe that these non-GAAP measures, when viewed with our GAAP results and accompanying reconciliations, provide additional information to investors that is useful to understand the factors and trends affecting our business without the impact of certain acquisition-related items. We have spent more than 30 years building our database of commercial real estate information and expanding our markets and services partially through acquisitions of complementary businesses. Due to these acquisitions, our net income has included significant charges for amortization of acquired intangible assets, depreciation and other amortization, acquisition- and integration-related costs, restructuring costs and loss on debt extinguishment. Adjusted EBITDA, adjusted EBITDA margin, non-GAAP net income and non-GAAP net income per diluted share exclude these charges and provide meaningful information about the operating performance of our business, apart from charges for amortization of acquired intangible assets, depreciation and other amortization, acquisition- and integration-related costs, restructuring costs; settlement and impairment costs incurred outside our ordinary course of business. We believe the disclosure of non-GAAP measures can help investors meaningfully evaluate and compare our performance from quarter-to-quarter and from year-to-year without the impact of these items. We also believe the non-GAAP measures we disclose are measures of our ongoing operating performance because the isolation of non-cash charges, such as amortization and depreciation, and other items, such as interest income or expense, net, other income or expense, net, income taxes, stock-based compensation expenses, acquisition- and integration-related costs, restructuring costs, loss on debt extinguishment and settlement and impairment costs incurred outside our ordinary course of business, provides additional information about our cost structure, and, over time, helps track our operating progress. In addition, investors, securities analysts and others have regularly relied on EBITDA and may rely on adjusted EBITDA, adjusted\nEBITDA margin, non-GAAP net income or non-GAAP net income per diluted share to provide a financial measure by which to compare our operating performance against that of other companies in our industry.\nSet forth below are descriptions of financial items that have been excluded from net income to calculate EBITDA and the material limitations associated with using this non-GAAP financial measure as compared to net income:\n•Amortization of acquired intangible assets in cost of revenues may be useful for investors to consider because it represents the diminishing value of any acquired trade names and other intangible assets and the use of our acquired technology, which is one of the sources of information for our database of commercial real estate information. We do not believe these charges necessarily reflect the current and ongoing cash charges related to our operating cost structure.\n•Amortization of acquired intangible assets in operating expenses may be useful for investors to consider because it represents the estimated attrition of our acquired customer base. We do not believe these charges necessarily reflect the current and ongoing cash charges related to our operating cost structure.\n•Depreciation and other amortization may be useful for investors to consider because they generally represent the wear and tear on our property and equipment used in our operations. We do not believe these charges necessarily reflect the current and ongoing cash charges related to our operating cost structure.\n•The amount of interest income or expense, net and other income or expense, net we generate and incur may be useful for investors to consider and may result in current cash inflows and outflows. However, we do not consider the amount of interest income or expense, net and other income or expense, net to be a representative component of the day-to-day operating performance of our business.\n•Income tax expense may be useful for investors to consider because it generally represents the taxes which may be payable for the period and the change in deferred income taxes during the period and may reduce the amount of funds otherwise available for use in our business. However, we do not consider the amount of income tax expense to be a representative component of the day-to-day operating performance of our business.\n•The amount of loss on our debt extinguishment may be useful for investors to consider because it generally represents losses from the early extinguishment of debt. However, we do not consider the amount of the loss on debt extinguishment to be a representative component of the day-to-day operating performance of our business.\nSet forth below are descriptions of additional financial items that have been excluded from EBITDA to calculate adjusted EBITDA and the material limitations associated with using this non-GAAP financial measure as compared to net income:\n•Stock-based compensation expense may be useful for investors to consider because it represents a portion of the compensation of our employees and executives. Determining the fair value of the stock-based instruments involves a high degree of judgment and estimation and the expenses recorded may bear little resemblance to the actual value realized upon the future exercise or termination of the related stock-based awards. Therefore, we believe it is useful to exclude stock-based compensation in order to better understand the long-term performance of our core business.\n•The amount of acquisition- and integration-related costs incurred may be useful for investors to consider because such costs generally represent professional service fees and direct expenses related to acquisitions. Because we do not acquire businesses on a predictable cycle, we do not consider the amount of acquisition- and integration-related costs to be a representative component of the day-to-day operating performance of our business.\n•The amount of settlement and impairment costs incurred outside of our ordinary course of business may be useful for investors to consider because they generally represent gains or losses from the settlement of litigation matters, charges related to terminations of contracts or impairments of acquired intangible assets or other long lived assets. We do not believe these charges necessarily reflect the current and ongoing cash charges related to our operating cost structure.\n•The amount of restructuring costs incurred may be useful for investors to consider because they generally represent costs incurred in connection with a change in a contract or a change in the makeup of our properties or personnel. Because we do not carry out restructuring activities on a predictable cycle, we do not consider the amount of restructuring related costs to be a representative component of the day-to-day operating performance of our business.\nThe financial items that have been excluded from our net income to calculate non-GAAP net income and non-GAAP net income per diluted share are amortization of acquired intangible assets and other related costs, stock-based compensation, acquisition- and integration-related costs, restructuring and related costs and settlement and impairment costs incurred outside\nour ordinary course of business. These items are discussed above with respect to the calculation of adjusted EBITDA together with the material limitations associated with using this non-GAAP financial measure as compared to net income. In addition to these exclusions from net income, we subtract an assumed provision for income taxes to calculate non-GAAP net income. In both 2023 and 2022, we assumed a 26% tax rate, which approximated our historical long-term statutory corporate tax rate, excluding the impact of discrete items.\nManagement compensates for the above-described limitations of using non-GAAP measures by using a non-GAAP measure only to supplement our GAAP results and to provide additional information that is useful to investors to understand the factors and trends affecting our business.\nSee Note 14 of the Notes to Consolidated Financial Statements included in Part IV of this Report for the reconciliation of our net income to our EBITDA.\nConsolidated Results of Operations\nThe following table provides our selected consolidated results of operations for the indicated periods (in millions and as a percentage of total revenue):\n(1) Amounts may not foot due to rounding.\nThe following table provides our revenues by type of service (in millions and as a percentage of total revenue):\n(1) For further discussion of our Company, strategy and products, see our business overview set forth in \"Item 1. Business\" in this Report.\n(2) Totals may not foot due to rounding.\nComparison of Year Ended December 31, 2023 and Year Ended December 31, 2022\nThe following table provides a comparison of our selected consolidated results of operations for the years ended December 31, 2023 and 2022 (in millions):\nRevenues. Revenues increased $273 million, or 12.5%, to $2.5 billion. The increase in our revenues included:\n•an increase in Multifamily revenues of $169 million, or 22.6%, due to higher sales volume driven by an increase in the number of properties listed on our network and increases in pricing on renewals,\n•an increase in CoStar revenues of $88 million, or 10.5%, due to higher sales volume driven by the impact of annual price increases and customer upgrades on contract renewals, as well as an increase in subscribers,\n•an increase in LoopNet revenues of $34 million, or 14.7%, due to an increase in the average price for listings,\n•an increase in Information services revenues of $14 million, or 8.6%, primarily attributable to an increase in revenues for STR of $7 million, CoStar Real Estate Manager of $5 million and $2 million of revenue related to the Business Immo Acquisition,\n•a decrease in Residential revenues of $28 million, or 37.4%, due to the discontinuation of certain products and services that were inconsistent with our long-term business strategy partially offset by $2 million of revenue related to the OnTheMarket Acquisition and\n•a decrease in Other marketplaces revenues of $4 million, or 3.0%, due to lower property volumes auctioned on Ten-X partially offset by increases in revenue of Land.com.\nGross Profit and Cost of Revenues. Gross profit increased $195 million, or 11.0%, to $2.0 billion in 2023, and the gross profit percentage decreased from 81% to 80%. The increase in gross profit was due to higher revenues partially offset by an increase in the cost of revenues. Cost of revenues increased $78 million, or 18.7% to $492 million and, as a percentage of revenues, increased from 19% to 20%. The increase in cost of revenues included:\n•an increase in personnel costs of $61 million related to rising headcount to support our residential research efforts, and increases in salaries, bonus, stock-based compensation and benefits costs for our existing employees,\n•an increase of $25 million in technology costs to host our database and products and\n•an decrease of $11 million in expenses related to advertising purchased on behalf of customers.\nSelling and Marketing Expenses. Selling and marketing expenses increased $306 million, or 44.7%, to $990 million and, as a percentage of revenues, increased from 31% to 40%. The increase included:\n•an increase in marketing expenses of $244 million for advertising our brands,\n•an increase in personnel and events costs of $63 million related to rising headcount in our sales force and increases in salaries, bonus, stock-based compensation and benefits costs for our existing employees and\nSoftware Development Expenses. Software development expenses increased $47 million, or 21.1% to $268 million and, as a percentage of revenues, increased from 10% to 11%. The increase primarily included higher personnel costs of $42 million related to rising headcount to support our residential efforts and increases in salaries, bonus, stock-based compensation and benefits costs for our existing employees.\nGeneral and Administrative Expenses. General and administrative expenses increased $43 million, or 12.6%, to $382 million and, as a percentage of revenues, was consistent at 16%. The increase included:\n•an increase of $17 million in credit loss expense primarily due to our expectations that the downturn in the commercial real estate market will increase delinquent trade receivables,\n•an increase of $19 million in professional service costs due to diligence efforts associated with potential acquisitions and legal fees to defend our intellectual property rights and\n•an increase of $11 million in personnel costs related to increases in salaries, bonus, stock-based compensation and benefits costs for our existing employees and rising headcount.\nCustomer Base Amortization Expense. Customer base amortization expense decreased $31 million, or 42.7%, to $42 million and, as a percentage of revenues, decreased from 3% to 2%. The decrease was primarily attributable to acceleration of amortization of $16 million related to eliminating certain usage fees for agent access to the Homesnap product recorded in 2022, as well as a reduction in amortization expense related to customer base assets acquired in the acquisitions of LoopNet, ForRent and Ten-X, which have been amortizing on an accelerated basis since the respective acquisitions.\nInterest Income, Net. Interest income, net increased $182 million, or 565.4%, to $214 million due to an increase in interest earned on our cash equivalents.\nOther Income, Net. Other income, net was insignificant for both the years ended December 31, 2023, and 2022.\nIncome Tax Expense. Income tax expense increased $10 million, or 8.2%, to $127 million and the effective tax rate increased 1% to 25% of income before income taxes. The increase in income tax expense was primarily attributable to additional income before income taxes and a benefit recognized in 2022 for state tax credits.\nFor a comparison of our results of operations for the fiscal year ended December 31, 2022 to the year ended December 31, 2021, see Item 7, Management’s Discussion and Analysis of Financial Condition and Results of Operations in our Annual Report on the Form 10-K for the year ended December 31, 2022, which was filed with the SEC on February 22, 2023.\nComparison of Business Segment Results for Year Ended December 31, 2023 and Year Ended December 31, 2022\nWe manage our business geographically in two operating segments, with the primary areas of measurement and decision-making being North America, which includes the U.S. and Canada, and International, which primarily includes Europe, Asia-Pacific and Latin America. Management relies on an internal management reporting process that provides revenue and operating segment EBITDA, which is our net income before interest income or expense, net, other income or expense, net, loss on debt extinguishment, income taxes, depreciation and amortization. Management believes that operating segment EBITDA is an appropriate measure for evaluating the operational performance of our operating segments. EBITDA is used by management to internally measure operating and management performance and to evaluate the performance of our business.\nSegment Revenues. North America revenues increased $260 million, or 12.3%, to $2.4 billion and included:\n•an increase in CoStar revenues of $86 million, or 10.7%, due to higher sales volume driven by the impact of annual price increases and customer upgrades on contract renewals, as well as an increase in subscribers,\n•an increase in Information services revenues of $7 million, or 5.9%, primarily attributable to an increase in revenues for CoStar Real Estate Manager of $5 million and STR of $3 million,\n•an increase in Multifamily revenues of $169 million, or 22.7%, due to higher sales volume driven by increases in pricing on renewals and an increase in the number of properties listed on our network,\n•an increase in LoopNet revenues of $32 million, or 14.2%, due to an increase in the average price for listings,\n•a decrease in Residential revenues of $30 million, or 40.4%, due to the discontinuation of certain products and services that were inconsistent with our long-term business strategy and\n•a decrease in Other marketplaces revenues of $4 million, or 3.0%, due to the lower property volumes auctioned on Ten-X partially offset by increases in revenue of Land.com..\nInternational revenues increased $13 million, or 16.9%, to $89 million and primarily included:\n•an increase in Information services revenues of $6 million, or 18.8%, primarily attributable to an increase in revenues for STR of $4 million and $2 million of revenue related to the Business Immo Acquisition,\n•an increase in CoStar revenues of $2 million, or 6.5%, due to higher sales volume driven by the impact of annual price increases and customer upgrades on contract renewals, as well as an increase in subscribers,\n•an increase in LoopNet revenues of $2 million, or 30.6%, due to an increase in the average price for listings and\n•$2 million of revenue related to the OnTheMarket Acquisition.\nSegment EBITDA. North America EBITDA decreased to $403 million for the year ended December 31, 2023, from $577 million for the year ended December 31, 2022. The decrease in North America EBITDA was primarily due to increases in personnel costs, marketing costs, technology hosting costs, professional service fees, sales events costs, credit loss expense and occupancy costs partially offset by increases in revenues described above. International EBITDA decreased to a loss of $13 million for the year ended December 31, 2023 from $5 million for the year ended December 31, 2022. The decrease was due to increased personnel costs, partially offset by, an increase in revenue.\nFor a comparison of our business segment results of operations for the fiscal year ended December 31, 2022 to the year ended December 31, 2021, see Item 7, Management’s Discussion and Analysis of Financial Condition and Results of Operations in our Annual Report on Form 10-K for the year ended December 31, 2022, which was filed with the SEC on February 22, 2023.\nLiquidity and Capital Resources\nWe believe the balance of cash and cash equivalents, which was $5.2 billion as of December 31, 2023, along with cash generated by ongoing operations and continued access to capital markets, will be sufficient to satisfy our cash requirements over the next 12 months and beyond. Our material cash requirements include the following contractual and other obligations.\nDebt. As of December 31, 2023, we had outstanding an aggregate principal amount of $1.0 billion of Senior Notes due July 15, 2030. Future interest payments associated with the Senior Notes are $196.0 million, with $28.0 million payable within 12 months.\nLeases. We have lease arrangements for office facilities, data centers and certain vehicles. As of December 31, 2023, we had fixed lease payment obligations of $110 million, with $39 million payable within 12 months.\nPurchase Obligations. Our purchase obligations are associated with agreements that are enforceable and legally binding and that specify all significant terms, including fixed or minimum services to be used, fixed, minimum or variable price provisions, and the approximate timing of the transaction and have an original term greater than one year. The services acquired under these agreements primarily relate to web hosting, sponsorship agreements, third-party data or listings and software subscriptions. As of December 31, 2023, we had purchase obligations of $264 million, with $81 million payable within 12 months.\nConstruction Commitments. We are expanding our Richmond, Virginia campus, which is expected to result in material cash requirements in 2024 and beyond. We broke ground on the expansion in November 2022 and expect construction to be substantially completed in the first half of 2026. We negotiated various tax incentives with the Commonwealth of Virginia and the City of Richmond including the allowance to use market-based income apportionment for income taxes and partial reimbursements of property tax assessments related to the value of the campus expansion. These incentives are conditional upon achieving job creation and capital expenditure targets from 2022 to 2029. Failure to meet these targets could result in a reduction of the value of the tax incentives and repayment of previous tax reductions. The value of the incentives is dependent on our taxable income.\nWe expect the total cost of construction, net of the estimated value of the tax incentives from 2023 to 2032, to be in the range of $450 - $600 million. We have engaged a project manager, architects and a general contractor on terms that generally require payments as services are provided or construction is performed. As of December 31, 2023, we have paid $128 million and we have committed to spend an additional $437 million as further work is performed under these contracts. We plan to amend these contracts to include additional commitments as construction progresses. Total cash expenditures for 2024 are expected to be approximately $385 million. We expect to fund the expansion with cash on hand.\nIn January 2024, the Company entered into a conditional purchase and sale agreement for an office building in Arlington, Virginia. The Company closed on the transaction in February 2024 along with an agreement to purchase the land underlying the building. These transactions totaled $340.0 million, inclusive of property taxes, titling insurance and other transaction costs and were paid with cash on hand.\nOur future capital requirements will depend on many factors, including, among others, our operating results, expansion and integration efforts and our level of acquisition activity or other strategic transactions. To date, we have grown in part by acquiring other companies, and we expect to continue to make acquisitions.\nCash and cash equivalents increased to $5.2 billion as of December 31, 2023, compared to cash and cash equivalents of $5.0 billion as of December 31, 2022. The increase in cash and cash equivalents for the year ended December 31, 2023 was primarily due to cash flow from operations of $489.5 million, partially offset by spending on capital assets\nNet cash provided by operating activities for the year ended December 31, 2023 was $489.5 million compared to $478.7 million for the year ended December 31, 2022. The $10.8 million increase was primarily due to higher net income, excluding certain non-cash expenses.\nNet cash used in investing activities for the year ended December 31, 2023 was $238.6 million compared to $69.1 million for the year ended December 31, 2022. The change was primarily due to an increase in cash paid for acquisitions of $93.3 million, increased spending for the Richmond campus of $82.3 million, and a decrease in proceeds from sale of property and equipment and other assets of $30.1 million.\nNet cash used in financing activities for the year ended December 31, 2023 was $3.7 million compared to net cash provided by financing activities of $734.0 million for the year ended December 31, 2022. The change was primarily due to $745.7 million of net proceeds from our September 2022 equity offering.\nCritical Accounting Estimates\nThe preparation of financial statements and related disclosures in conformity with GAAP requires management to make estimates and assumptions that affect the reported amounts of assets and liabilities, the disclosure of contingent assets and liabilities at the date of the financial statements and revenues and expenses during the period reported. The following accounting policies involve a “critical accounting estimate” because they are particularly dependent on estimates and assumptions made by management about matters that are highly uncertain at the time the accounting estimates are made. In addition, while we have used our best estimates based on facts and circumstances available to us at the time, different acceptable assumptions would yield different results. Changes in the accounting estimates are reasonably likely to occur from period to period, which may have a material impact on the presentation of our financial condition and results of operations. We review these estimates and assumptions periodically and reflect the effects of revisions in the period that they are determined to be necessary. We consider policies relating to the following matters to be critical accounting policies:\n•Intangible assets and goodwill;\n•Income taxes;\n•Revenue recognition; and\n•Business combinations.\nWith respect to our accounting policy for intangible assets and goodwill, we further supplement in Note 2 of the Notes to the Consolidated Financial Statements included in Part IV of this Report with the following:\nWe assess the impairment of identifiable intangibles and goodwill whenever events or changes in circumstances indicate that the carrying value may not be recoverable. Judgments made by management relate to the expected useful lives of intangible assets and our ability to recover the carrying value of such assets. The accuracy of these judgments may be adversely affected by several factors, including the factors listed below:\n•Significant underperformance relative to historical or projected future operating results;\n•Significant changes in the manner of our use of the acquired assets or the strategy for our overall business;\n•Significant negative industry or economic trends; or\n•Significant decline in our market capitalization relative to net book value for a sustained period.\nWhen we determine that the carrying value of intangible assets may not be recovered based upon the existence of one or more of the above indicators, we test for impairment.\nGoodwill and identifiable intangible assets that are not subject to amortization are tested annually for impairment by each reporting unit on October 1 of each year and are also tested for impairment more frequently based upon the existence of one or more of the above indicators.\nGoodwill represents the future economic benefits arising from a business combination and is calculated as the excess of purchase consideration paid in a business combination over the fair value of assets of the net identifiable assets acquired. Goodwill is not amortized, but instead tested for impairment at least annually by each reporting unit, or more frequently if an event or other circumstance indicates that the fair value of a reporting unit may be below its carrying amount. We may first assess qualitative factors to evaluate whether it is more likely than not that the fair value of a reporting unit is less than its carrying amount, or elect to bypass the qualitative assessment. If it is determined that it is more likely than not that the fair value of a reporting unit is less than its carrying value, or we elect to bypass the qualitative assessment, we then perform a quantitative assessment by determining the fair value of each reporting unit. We estimate the fair value of each reporting unit based on a projected discounted cash flow model that includes significant assumptions and estimates including our discount rate, growth rate and future financial performance. Assumptions about the discount rate are based on a weighted average cost of capital for comparable companies and determined by management to be commensurate with the risk in our current business model. Assumptions about the growth rate and future financial performance of a reporting unit are based on our forecasts, business plans, economic projections and anticipated future cash flows. These assumptions are subject to change from period-to-period and could be adversely impacted by the uncertainty surrounding global market conditions, commercial real estate conditions and the competitive environment in which we operate. Changes in these or other factors could negatively affect our reporting units' fair value and potentially result in impairment charges. Such impairment charges could have an adverse effect on our results of operations. The fair value of each reporting unit is compared to the carrying amount of the reporting unit. If the carrying value of the reporting unit exceeds the fair value, then an impairment loss is recognized for the difference.\nAs of October 1, 2023, we assessed the relevant qualitative factors for our North America reporting unit and concluded that it was not more likely than not that the fair value of this reporting unit was less than its respective carrying amounts. We elected to bypass performing the qualitative screen and performed the first step quantitative analysis of the goodwill impairment test for our International reporting unit in 2023, which indicated that the fair value of this unit exceeded its carrying value. There have been no events or changes in circumstances as a result of our qualitative impairment analysis on October 1, 2023, that would indicate that the carrying value of each reporting unit may not be recoverable.\nFor an in-depth discussion of each of our significant accounting policies, including our critical accounting policies and further information regarding estimates and assumptions involved in their application, see Note 2 of the Notes to the Consolidated Financial Statements included in Part IV of this Report.\nRecent Accounting Pronouncements\nSee Note 2 of the Notes to the Consolidated Financial Statements included in this Report for further discussion of recent accounting pronouncements, including the expected dates of adoption.",
    "item_7A": "Item 7A. Quantitative and Qualitative Disclosures About Market Risk\nWe provide information, analytics and online marketplace services to commercial real estate and related business communities within the regions where we operate which primarily include, North America, Europe, Asia-Pacific and Latin\nAmerica. The functional currency for a majority of our operations is the local currency, with the exception of certain international locations for which the functional currency is the British Pound.\nFluctuations in the British Pound, Canadian dollar and Euro may have an impact on our business, results of operations and financial position. For both the years ended December 31, 2023 and December 31, 2022, revenues denominated in foreign currencies were approximately 4%, of total revenue. For the years ended December 31, 2023 and December 31, 2022, our revenues would have decreased by approximately $10 million and $8 million, respectively, if the U.S. dollar exchange rate used strengthened by 10%. For the years ended December 31, 2023 and December 31, 2022, our revenues would have increased by approximately 4% and $8 million, respectively, if the U.S. dollar exchange rate used weakened by 10%. Fluctuations in the exchange rates of revenues denominated in any other foreign currencies would have had an immaterial impact on our consolidated results. In addition, we have assets and liabilities denominated in foreign currencies. We currently do not use financial instruments to hedge our exposure to exchange rate fluctuations with respect to our foreign subsidiaries. We may seek to enter into hedging transactions in the future to reduce our exposure to exchange rate fluctuations, but we may be unable to enter into hedging transactions successfully, on acceptable terms or at all. As of December 31, 2023, accumulated other comprehensive loss included a loss from foreign currency translation adjustments of approximately $17.6 million.\nWe do not believe we have material exposure to market risks associated with changes in interest rates related to cash equivalent securities held as of December 31, 2023. As of December 31, 2023, we had of cash and cash equivalents. If there is an increase or decrease in interest rates, there will be a corresponding increase or decrease in the amount of interest earned on our cash and cash equivalents. We currently diversify our cash and cash equivalents holdings amongst multiple financial institutions and AAA-rated Government and Treasury Money Market Funds.\nWe are subject to interest rate market risk in connection with our revolving credit facility. On July 1, 2020, we entered into the 2020 Credit Agreement, which provides for variable rate borrowings of up to $750 million. On July 1, 2020, we issued $1.0 billion aggregate principal amount of Senior Notes. Changes in interest rates would not have a material impact to our current interest and debt financing expense, as all of our borrowings except for our credit facility are fixed rate, and no amounts were outstanding under our credit facility as of December 31, 2023. See Note 11 of the Notes to the Consolidated Financial Statements included in this Report for additional information regarding our 2020 Credit Agreement.\nWe had approximately $2.7 billion of goodwill and intangible assets as of December 31, 2023. As of December 31, 2023, we believe our intangible assets will be recoverable; however, changes in the economy, the business in which we operate and our own relative performance could change the assumptions used to evaluate intangible asset recoverability. In the event that we determine that an asset has been impaired, we would recognize an impairment charge equal to the amount by which the carrying amount of the assets exceeds the fair value of the asset. We continue to monitor these assumptions and their effect on the estimated recoverability of our intangible assets.",
    "item_8": "Item 8. Financial Statements and Supplementary Data\nFinancial Statements meeting the requirements of Regulation S-X, including reports of independent registered public accounting firm Ernst & Young LLP, are set forth beginning at page. Supplementary data is set forth in “Management’s Discussion and Analysis of Financial Condition and Results of Operations” under the caption “Consolidated Results of Operations.”",
    "item_9": "Item 9. Changes in and Disagreements with Accountants on Accounting and Financial Disclosure\nNone.",
    "item_9A": "Item 9A. Controls and Procedures\nWe maintain disclosure controls and procedures that are designed to ensure that information required to be disclosed in our reports filed or submitted under the Securities Exchange Act of 1934, as amended, is recorded, processed, summarized and reported, within the time periods specified in the SEC’s rules and forms, and that such information is accumulated and communicated to our management, including our Chief Executive Officer and Chief Financial Officer, as appropriate, to allow for timely decisions regarding required disclosure. In designing and evaluating the disclosure controls and procedures, management recognized that any controls and procedures, no matter how well designed and operated, can provide only reasonable assurance of achieving the desired control objectives, and management is required to apply its judgment in evaluating the cost-benefit relationship of possible controls and procedures.\nAs of December 31, 2023, we carried out an evaluation, under the supervision and with the participation of our management, including our Chief Executive Officer and our Chief Financial Officer, of the effectiveness of the design and operation of our disclosure controls and procedures as of the end of the fiscal year. Based on the foregoing, our Chief Executive Officer and Chief Financial Officer concluded that our disclosure controls and procedures were effective as of December 31, 2023 and were operating at a reasonable assurance level.\nWe continue to implement a financial system that is designed to improve the efficiency and effectiveness of our operational and financial accounting processes. This implementation is expected to be a multi-year project. Consistent with any process change that we implement, the design of the internal controls has and will continue to be evaluated for effectiveness as part of our overall assessment of the effectiveness of our disclosure controls and procedures. We expect that the implementation of this system will improve our internal control over financial reporting.\nOther than the implementation of a new financial system noted above, there have been no changes in our internal control over financial reporting during our most recent fiscal quarter that have materially affected, or are reasonably likely to materially affect, our internal control over financial reporting.\nManagement’s Report on Internal Control over Financial Reporting\nManagement of CoStar Group is responsible for establishing and maintaining adequate internal control over financial reporting and for the assessment of the effectiveness of internal control over financial reporting. As defined by the SEC, internal control over financial reporting is a process designed by, or supervised by, the Company’s principal executive and principal financial officers, to provide reasonable assurance regarding the reliability of financial reporting and the preparation of financial statements in accordance with GAAP.\nThe Company’s internal control over financial reporting is supported by written policies and procedures, which (1) pertain to the maintenance of records that, in reasonable detail, accurately and fairly reflect the transactions and dispositions of the Company’s assets; (2) provide reasonable assurance that transactions are recorded as necessary to permit preparation of financial statements in accordance with GAAP, and that receipts and expenditures of the Company are being made only in accordance with authorizations of the Company’s management and directors; and (3) provide reasonable assurance regarding prevention or timely detection of unauthorized acquisition, use or disposition of the Company’s assets that could have a material effect on the financial statements.\nBecause of its inherent limitations, internal control over financial reporting may not prevent or detect misstatements. Projections of any evaluation of effectiveness to future periods are subject to the risk that controls may become inadequate because of changes in conditions, or that the degree of compliance with the policies or procedures may deteriorate.\nIn connection with the preparation of the Company's annual financial statements, management of the Company has undertaken an assessment of the effectiveness of the Company’s internal control over financial reporting as of December 31, 2023 based on criteria established in Internal Control - Integrated Framework (2013 framework) issued by the Committee of\nSponsoring Organizations of the Treadway Commission. Management's assessment included an evaluation of the design of the Company's internal control over financial reporting and testing of the operational effectiveness of the Company's internal control over financial reporting.\nBased on this assessment, management has concluded that the Company's internal control over financial reporting was effective as of December 31, 2023.\nErnst & Young LLP, the independent registered public accounting firm that audited the Company's financial statements included in this report, has issued an attestation report on the effectiveness of internal control over financial reporting, a copy of which is included in this Report.\nIn December 2023, we completed the OnTheMarket Acquisition. As permitted by the SEC, we have elected to exclude the internal controls of this acquisition, which has not been integrated into our existing processes and controls, from our assessment of the effectiveness of internal control over financial reporting as of December 31, 2023. The excluded financial position of OnTheMarket represented less than 1% of our total assets as of December 31, 2023, and less than 1% of our revenues and total operating costs for the year then ended. We will include the internal controls of OnTheMarket in our assessment of the effectiveness of our internal control over financial reporting as of December 31, 2024.",
    "item_9B": "Item 9B. Other Information.\nNone.",
    "item_9C": "Item 9C. Disclosure Regarding Foreign Jurisdictions that Prevent Inspections.\nNot applicable.\nPART III",
    "item_10": "Item 10. Directors, Executive Officers and Corporate Governance\nCoStar Group has adopted a Code of Conduct for its directors. In addition, CoStar Group has adopted a separate Code of Business Conduct and Ethics for its officers and employees, including its principal executive, financial and accounting officers, or persons performing similar functions. Copies of each of these codes may be found in the “Investors” section of the Company’s website at https://investors.costargroup.com/leadership. We intend to disclose future amendments to certain provisions of our Codes, or waivers of such provisions granted to executive officers and directors, as required by the SEC rules on the Company's website within four business days following the date of such amendment or waiver.\nThe remaining information required by this Item is incorporated by reference to our Proxy Statement for our 2024 annual meeting of stockholders under the captions “Director Nominees,” “Executive Officers,” Corporate Governance Highlights,” “Board Committees,” “Insider trading arrangements and policies,” and, if applicable, “Delinquent Section 16(a) Reports.”",
    "item_11": "Item 11. Executive Compensation\nThe information required by this Item is incorporated by reference to our Proxy Statement for our 2024 annual meeting of stockholders under the captions “Compensation Discussion and Analysis,” “Director Compensation,” “Compensation Committee Interlocks and Insider Participation,” and “Compensation Committee Report.”",
    "item_12": "Item 12. Security Ownership of Certain Beneficial Owners and Management and Related Stockholder Matters\nThe information required by this Item is incorporated by reference to our Proxy Statement for our 2024 annual meeting of stockholders under the captions “Equity Compensation Plan Information” and “Stock Ownership Information.”",
    "item_13": "Item 13. Certain Relationships and Related Transactions, and Director Independence\nThe information required by this Item is incorporated by reference to our Proxy Statement for our 2024 annual meeting of stockholders under the captions “Certain Relationships and Related Transactions” and “Corporate Governance Matters.”",
    "item_14": "Item 14. Principal Accountant Fees and Services\nThe information required by this Item is incorporated by reference to our Proxy Statement for our 2024 annual meeting of stockholders under the caption “Ratification of the Appointment of Independent Registered Public Accounting Firm.”\nPART IV",
    "item_15": "Item 15. Exhibits and Financial Statement Schedules\n(a)(1) The following financial statements are filed as a part of this Report: CoStar Group, Inc. Consolidated Financial Statements.\n(a)(2) Financial statement schedules: Additional financial statement schedules are omitted because they are not applicable or not required or because the required information is incorporated herein by reference or included in the financial statements or related notes included elsewhere in this report.\n(a)(3) The documents required to be filed as exhibits to this Report under Item 601 of Regulation S-K are listed as follows:\nExhibits\nExhibit No. Description\n3.1\nFourth Amended and Restated Certificate of Incorporation of CoStar Group, Inc. (Incorporated by reference to Exhibit 3.1 to the Registrant's Current Report on Form 8-K filed with the SEC on June 7, 2021).\n3.2\nFourth Amended and Restated By-Laws of CoStar Group, Inc. (Incorporated by reference to Exhibit 3.1 to the Registrant’s Current Report on Form 8-K filed with the SEC on May 9, 2022).\n4.1\nSpecimen Common Stock Certificate (Incorporated by reference to Exhibit 4.1 to the Registration Statement on Form S-4 of the Registrant (Reg. No. 333-174214) filed with the SEC on June 3, 2011).\n4.2\nDescription of the Registrant's Securities Registered Pursuant to Section 12 of the Securities Exchange Act of 1934 (Incorporated by reference to Exhibit 4.2 to the Registrant's Annual Report on Form 10-K filed with the SEC on February 23, 2022).\n4.3\nIndenture, dated as of July 1, 2020, by and among CoStar Group, Inc., as issuer, the guarantors named therein and Wilmington Trust, National Association, as trustee, relating to the 2.800% Senior Notes due 2030, including the form of 2.800% Senior Notes due 2030 (Incorporated by reference to Exhibit 4.1 to the Registrant’s Current Report on Form 8-K filed with the SEC on July 1, 2020).\n*10.1\nCoStar Group, Inc. 2016 Stock Incentive Plan (Incorporated by reference to Exhibit 4.4 to the Registration Statement on Form S-8 of the Registrant (Reg. No. 333-212278) filed with the SEC on June 28, 2016).\n*10.2\nFirst Amendment to the CoStar Group, Inc. 2016 Stock Incentive Plan (Incorporated by reference to Exhibit 10.1 to the Registrant’s Quarterly Report on Form 10-Q filed April 25, 2018).\n*10.3\nCoStar Group, Inc. 2007 Stock Incentive Plan, as amended (Incorporated by reference to Exhibit 10.1 to the Registrant’s Current Report on Form 8-K filed June 8, 2012).\n*10.4\nCoStar Group, Inc. 2007 Stock Incentive Plan French Sub-Plan (Incorporated by reference to Exhibit 10.3 to the Registrant’s Report on Form 10-K filed February 29, 2008).\n*10.5\nForm of CoStar Group, Inc. 2016 Plan Restricted Stock Grant Agreement between the Registrant and certain of its officers, directors and employees (Incorporated by reference to Exhibit 10.3 to the Registrant’s Quarterly Report on Form 10-Q filed July 28, 2016).\n*10.6\nForm of CoStar Group, Inc. 2016 Plan Restricted Stock Grant Agreement for Service Awards between the Registrant and certain of its officers and employees (Incorporated by reference to Exhibit 10.4 to the Registrant’s Quarterly Report on Form 10-Q filed July 28, 2016).\n*10.7\nForm of CoStar Group, Inc. 2016 Plan Restricted Stock Unit Grant Agreement between the Registrant and certain of its officers and employees (Incorporated by reference to Exhibit 10.5 to the Registrant’s Quarterly Report on Form 10-Q filed July 28, 2016).\n*10.8\nForm of CoStar Group, Inc. 2016 Plan Incentive Stock Option Grant Agreement between the Registrant and certain of its officers and employees (Incorporated by reference to Exhibit 10.6 to the Registrant’s Quarterly Report on Form 10-Q filed July 28, 2016).\n*10.9\nForm of CoStar Group, Inc. 2016 Plan Incentive Stock Option Grant Agreement between the Registrant and Andrew C. Florance (Incorporated by reference to Exhibit 10.7 to the Registrant’s Quarterly Report on Form 10-Q filed July 28, 2016).\n*10.10\nForm of CoStar Group, Inc. 2016 Plan Nonqualified Stock Option Grant Agreement between the Registrant and certain of its officers, directors and employees (Incorporated by reference to Exhibit 10.8 to the Registrant’s Quarterly Report on Form 10-Q filed July 28, 2016).\nExhibit No. Description\n*10.11\nForm of CoStar Group, Inc. 2016 Plan Nonqualified Stock Option Grant Agreement between the Registrant and Andrew C. Florance (Incorporated by reference to Exhibit 10.9 to the Registrant’s Quarterly Report on Form 10-Q filed July 28, 2016).\n*10.12\nForm of 2007 Plan Restricted Stock Grant Agreement between the Registrant and certain of its officers, directors and employees (Incorporated by reference to Exhibit 99.1 to the Registrant’s Current Report on Form 8-K filed June 22, 2007).\n*10.13\nForm of 2007 Plan Restricted Stock Unit Agreement between the Registrant and certain of its officers and employees (Incorporated by reference to Exhibit 10.8 to the Registrant's Annual Report on Form 10-K filed February 20, 2014).\n*10.14\nForm of 2007 Plan Incentive Stock Option Grant Agreement between the Registrant and certain of its officers and employees (Incorporated by reference to Exhibit 10.8 to the Registrant’s Annual Report on Form 10-K filed February 24, 2009).\n*10.15\nForm of 2007 Plan Incentive Stock Option Grant Agreement between the Registrant and Andrew C. Florance (Incorporated by reference to Exhibit 10.9 to the Registrant’s Annual Report on Form 10-K filed February 24, 2009).\n*10.16\nForm of 2007 Plan Nonqualified Stock Option Grant Agreement between the Registrant and certain of its officers and employees (Incorporated by reference to Exhibit 10.10 to the Registrant’s Annual Report on Form 10-K filed February 24, 2009).\n*10.17\nForm of 2007 Plan Nonqualified Stock Option Grant Agreement between the Registrant and certain of its directors (Incorporated by reference to Exhibit 10.11 to the Registrant’s Annual Report on Form 10-K filed February 24, 2009).\n*10.18\nForm of 2007 Plan Nonqualified Stock Option Grant Agreement between the Registrant and Andrew C. Florance (Incorporated by reference to Exhibit 10.12 to the Registrant’s Annual Report on Form 10-K filed February 24, 2009).\n*10.19\nForm of 2007 Plan French Sub-Plan Restricted Stock Agreement between the Registrant and certain of its employees (Incorporated by reference to Exhibit 10.10 to the Registrant’s Annual Report on Form 10-K filed February 29, 2008).\n*10.20\nCoStar Group, Inc. 2016 Cash Incentive Plan (Incorporated by reference to Exhibit 10.2 to the Registrant’s Quarterly Report on Form 10-Q filed July 28, 2016).\n*10.21\nSecond Amended and Restated Employee Stock Purchase Plan (Incorporated by reference to Exhibit 4.4 to the Registrant’s Registration Statement on Form S-8 (No. 333-258220) filed with the SEC on July 28, 2021).\n*10.22\nCanadian Addendum to CoStar Group ESPP (filed herewith).\n*10.23\nCoStar Group, Inc. Management Stock Purchase Plan (Incorporated by reference to Exhibit 10.21 to the Registrant’s Annual Report on Form 10-K filed February 23, 2018).\n*10.24\nSummary of Non-Employee Director Compensation (Incorporated by reference to Exhibit 10.1 to the Registrant's Quarterly Report on Form 10-Q filed on October 24, 2013).\n*10.25\nEmployment Agreement for Andrew C. Florance (Incorporated by reference to Exhibit 10.2 to Amendment No. 1 to the Registrant's Registration Statement on Form S-1 (Reg. No. 333-47953) filed with the SEC on April 27, 1998).\n*10.26\nFirst Amendment to Andrew C. Florance Employment Agreement, effective January 1, 2009 (Incorporated by reference to Exhibit 10.16 to the Registrant’s Annual Report on Form 10-K filed February 24, 2009).\n10.27\nForm of Indemnification Agreement between the Registrant and each of its officers and directors (Incorporated by reference to Exhibit 10.1 to the Registrant’s Quarterly Report on Form 10-Q filed on May 7, 2004).\n10.28\nDeed of Office Lease by and between GLL L-Street 1331, LLC and CoStar Realty Information, Inc., dated February 18, 2011, and made effective as of June 1, 2010 (Incorporated by reference to Exhibit 10.1 to the Registrant’s Quarterly Report on form 10-Q filed on April 29, 2011).\n10.29\nSecond Amended and Restated Credit Agreement, dated as of July 1, 2020, by and among CoStar Group, Inc., as borrower, CoStar Realty Information, Inc., as co-borrower, the lenders party thereto and Bank of America, N.A., as administrative agent (Incorporated by reference to Exhibit 10.1 to the Registrant’s Current Report on Form 8-K filed with the SEC on July 1, 2020)\n10.30\nFirst Amendment to the Second Amended and Restated Credit Agreement, dated as of May 8, 2023, among CoStar Group, Inc., as borrower, CoStar Realty Information, Inc., as co-borrower, the lenders from time to time party thereto and Bank of America, N.A., as administrative agent (Incorporated by reference to Exhibit 10.1 to the Registrant’s Quarterly Report on Form 10-Q filed July 26, 2023)\n21.1\nSubsidiaries of the Registrant (filed herewith).\n23.1\nConsent of Ernst & Young LLP, Independent Registered Public Accounting Firm (filed herewith).\nExhibit No. Description\n31.1\nCertification of Principal Executive Officer pursuant to Section 302 of the Sarbanes-Oxley Act of 2002 (filed herewith).\n31.2\nCertification of Principal Financial Officer pursuant to Section 302 of the Sarbanes-Oxley Act of 2002 (filed herewith).\n32.1\nCertification of Principal Executive Officer pursuant to 18 U.S.C. Sec. 1350, as adopted pursuant to Section 906 of the Sarbanes-Oxley Act of 2002 (furnished herewith).\n32.2\nCertification of Principal Financial Officer pursuant to 18 U.S.C. Sec. 1350, as adopted pursuant to Section 906 of the Sarbanes-Oxley Act of 2002 (furnished herewith).\nCoStar Group, Inc. Clawback Policy, effective September 13, 2023 (filed herewith).\n101.INS The following financial statements from the Company’s Annual Report on Form 10-K for the year ended December 31, 2023, formatted in Inline XBRL: (i) Consolidated Statements of Operations; (ii) Consolidated Statements of Comprehensive Income; (iii) Consolidated Balance Sheets; (iv) Consolidated Statements of Cash Flows; and (v) Notes to Consolidated Financial Statements, tagged as blocks of text and including detailed tags.\n101.SCH Inline XBRL Taxonomy Extension Schema Document.\n101.CAL Inline XBRL Taxonomy Extension Calculation Linkbase Document.\n101.DEF Inline XBRL Taxonomy Extension Definition Linkbase Document.\n101.LAB Inline XBRL Taxonomy Extension Label Linkbase Document.\n101.PRE Inline XBRL Taxonomy Extension Presentation Linkbase Document.\n104 The cover page from the Registrant's Annual Report on Form 10-K for the year ended December 31, 2023, formatted in Inline XBRL (included as Exhibit 101).\n* Management Contract or Compensatory Plan or Arrangement.",
    "item_16": "Item 16. Form 10-K Summary\nNone.",
    "stock_ticker": "CSGP"
}