{
    "cik": "1057352",
    "company": "COSTAR GROUP, INC.",
    "filing_type": "10-K",
    "filing_date": "2021-02-24",
    "period_of_report": "2020-12-31",
    "sic": "7389",
    "state_of_inc": "DE",
    "state_location": "DC",
    "fiscal_year_end": "1231",
    "filing_html_index": "https://www.sec.gov/Archives/edgar/data/1057352/0001057352-21-000032-index.html",
    "htm_filing_link": "https://www.sec.gov/Archives/edgar/data/1057352/000105735221000032/csgp-20201231.htm",
    "complete_text_filing_link": "https://www.sec.gov/Archives/edgar/data/1057352/0001057352-21-000032.txt",
    "filename": "1057352_10K_2020_0001057352-21-000032.htm",
    "item_1": "Item 1. Business\nIn this report, the words “we,” “our,” “us,” “CoStar” or the “Company” refer to CoStar Group, Inc. and its direct and indirect wholly owned subsidiaries. This report also refers to our websites, but information contained on those sites is not part of this report.\nCoStar Group, Inc., a Delaware corporation, founded in 1987, is the number one provider of information, analytics and online marketplaces to the commercial real estate industry in the United States (“U.S.”) and United Kingdom (“U.K.”) based on the fact that we offer the most comprehensive commercial real estate database available; have the largest research department in the industry; own and operate leading online marketplaces for commercial real estate and apartment listings in the U.S. based on the numbers of unique visitors and site visits per month; and provide more information, analytics and marketing services than any of our competitors. We have created and compiled a standardized platform of information, analytics and online marketplace services where industry professionals and consumers of commercial real estate, including apartments, and the related business communities, can continuously interact and facilitate transactions by efficiently accessing and exchanging accurate and standardized real estate-related information. Our service offerings span all commercial property types, including office, retail, industrial, multifamily, commercial land, mixed-use and hospitality. With our recent acquisition of Homesnap, Inc., (“Homesnap”) we also offer an online mobile software platform for residential real estate agents and brokers.\nWe manage our business geographically in two operating segments, with our primary areas of measurement and decision-making being North America, which includes the U.S. and Canada, and International, which primarily includes Europe, Asia-Pacific and Latin America. On October 22, 2019, we acquired STR, Inc. and STR Global, Ltd. (together with STR, Inc., \"STR\"), which provides benchmarking and analytics for the hospitality industry. On June 24, 2020, we acquired Ten-X Holding Company, Inc. and its subsidiaries (\"Ten-X\"), which operate an online auction platform for commercial real estate. On October 26, 2020, we acquired Emporis GmbH, a Germany-based provider of international commercial real estate data and images, and on December 22, 2020, we acquired Homesnap. See Notes 5 and 9 to the accompanying Notes to the Consolidated Financial Statements included in Part IV of this Annual Report on Form 10-K for further discussion of the Homesnap acquisition.\nStrategy\nOur strategy is to provide real estate industry professionals and consumers with critical knowledge to explore and complete transactions by offering the most comprehensive, timely and standardized information on real estate and the right tools to be able to effectively utilize that information. Over time, we have expanded, and we continue to expand, our services for real estate information, analytics and online marketplaces in an effort to continue to meet the needs of the industry as it grows and evolves.\nOur standardized platform includes the most comprehensive proprietary database of commercial real estate information in the industry; the largest research department in the industry; proprietary data collection, information management and quality control systems; a large in-house product development team; a broad suite of web-based information, analytics and online marketplace services; a large team of analysts and economists; and a large, diverse base of clients. Our database has been developed and enhanced for more than 30 years by a research department that makes thousands of daily database updates. In addition to our internal efforts to grow the database, we have obtained and assimilated a significant number of proprietary databases. Our comprehensive commercial real estate database powers our information services, sources data used in our analytic services and provides content for most of our online marketplace services and our auction platform. Our ability to utilize the same commercial real estate information across our standardized platform creates efficiencies in operations and improves data quality for our customers.\nWe deliver our comprehensive commercial real estate information content to our U.S. and European customers primarily via an integrated suite of online service offerings that includes information about space available for-lease, comparable sales\ninformation, information about properties for-sale, tenant information, Internet marketing services, analytical capabilities, information for clients’ websites, information about industry professionals and their business relationships, data integration and industry news. We also operate complementary online marketplaces for commercial real estate listings and apartment rentals, as well as a commercial real estate auction platform. We strive to cross-sell our services to our customers in order to best suit their needs.\nInformation about our revenues, long-lived assets and total assets derived from and located in foreign countries is included in Notes 2, 3 and 14 of the Notes to Consolidated Financial Statements included in this Annual Report on Form 10-K. Revenues; net income before interest and other income (expense), income taxes, depreciation and amortization (“EBITDA”); and total assets and liabilities for each of our segments are set forth in Notes 3 and 14 to our consolidated financial statements. Information about risks associated with our foreign operations is included in “Item 1A. Risk Factors” and “Item 7A. Quantitative and Qualitative Disclosures about Market Risk” in this Annual Report on Form 10-K.\nOur primary brands include CoStar®, LoopNet®, Apartments.comTM, STR®, Ten-X®, BizBuySell®, LandsofAmericaTM, and HomeSnap®, which are accessible via the Internet and through our mobile applications. Our subscription-based services consist primarily of CoStar Suite® services, which include information, analytics and online marketplace services offered to the commercial real estate industry and related professionals. CoStar Suite® is sold as a platform of service offerings consisting of CoStar Property Professional®, CoStar COMPS Professional® and CoStar Tenant®, and is our largest service offering in our North America and International operating segments.\nLoopNet® is the flagship brand in our network of commercial real estate marketing sites, which also includes Cityfeet.com and Showcase.com. Our LoopNet online marketplace enables commercial property owners, landlords, and brokers to advertise properties for-sale or for-lease and to submit detailed information about property listings. Commercial real estate agents, buyers, investors, and tenants use LoopNet extensively to search for available property listings that meet their criteria. LoopNet offers unique, subscription-based advertising solutions for different segments within the industry and delivers value across its constituent networks. The LoopNet network leverages CoStar’s commercial real estate database to provide in-depth and accurate information across all commercial property types, including office, industrial, retail, restaurant, shopping center, multifamily, specialty, health care, hospitality, sports and entertainment, land, and residential income. Investors and tenants are also able to consume industry news developed by our in-house editorial team.\nWe are consolidating STR data and services with CoStar Suite to create an integrated platform, which is expected to allow us to create valuable new and improved tools for industry participants. We are also working on integrating the Ten-X platform into both LoopNet and CoStar, to expand the audience for Ten-X auctions to include our online commercial real estate users.\nApartments.comTM is the flagship brand in our network of apartment marketing sites, which also includes ApartmentFinder.comTM, ForRent.com®, ApartmentHomeLiving.comTM, WestsideRentals.com®, AFTER55.com®, CorporateHousing.comTM, ForRentUniversity.com®, Apartamentos.comTM, which is our apartment-listing site offered exclusively in Spanish, and OffCampusPartners.com, which provides student housing marketplace content and powers off campus housing sites for many universities across the U.S. Our apartment marketing network of subscription-based services offers renters a searchable database of apartment listings and provides property owners, professional property management companies and landlords with an advertising destination. Our apartment marketing network draws on and leverages CoStar’s multifamily database, which contains detailed information on apartment properties and is designed to meet renter preferences and demands, in order to drive traffic to those sites and attract advertisers who prefer to advertise on heavily trafficked apartment websites. Our network of apartment marketing sites provides a comprehensive selection of rentals, information on actual availabilities and rents, and in-depth data on neighborhoods, including restaurants, nightlife, history, schools and other facts important to renters. To help renters find the information that meets their needs, we have sites that also offer innovative search tools such as the PolygonTM Search tool, which allow renters to specifically define the area in which they want to find an apartment and Plan Commute tools, which allow renters to search property listings that meet their transportation needs. We also offer complementary services to the rental industry, including the ability for renters to apply for rentals online, and for landlords to receive applications, screen tenants, and process rental payments and lease renewals.\nOur BizBuySell services, which include BizQuest® and FindaFranchise, provide an online marketplace for businesses and franchises for-sale. Our LandsofAmerica services, which include LandAndFarm and LandWatch®, provide an online marketplace for rural lands for-sale and are also accessible via our Land.com domain.\nWe also provide other services that complement those offered through our primary brands. These include real estate and lease management solutions, lease administration, lease accounting and abstraction services, through our CoStar Real Estate Manager service offerings; market research, consulting and analysis, portfolio and debt analysis, and management and reporting\ncapabilities through our CoStar Investment Analysis and CoStar Risk Analytics service offerings; and benchmarking and analytics for the hospitality industry through our STR offerings.\nOur services are typically distributed to our clients under subscription-based license agreements that renew automatically, a majority of which have a term of at least one year. Upon renewal, many of the subscription contract rates may change in accordance with contract provisions or as a result of contract renegotiations. To encourage clients to use our services regularly, we generally charge a fixed monthly amount for our subscription-based services rather than charging fees based on actual system usage or number of paid clicks. Depending on the type of service, contract rates are generally based on the number of sites, number of users, organization size, the client's business focus, geography, the number and types of services to which a client subscribes, the number of properties a client advertises and the prominence and placement of a client's advertised properties in the search results. Our subscription clients generally pay contract fees on a monthly basis, but in some cases may pay us on a quarterly or annual basis. Auction transaction fees from our newly acquired online auction platform, Ten-X, are generally charged upon the successful closure of an auction as a percentage of the winning buyer's offer price for the commercial real estate property sold. We generally see higher sales of Apartments.com listing services during the peak summer rental season and higher CoStar Suite sales towards the end of the year, however sales fluctuate from year-to-year and revenue is not generally seasonal because our services are typically sold on a subscription basis.\nExpansion and Growth\nAcquisitions\nWe have expanded and continue to expand the coverage and depth of our information, analytics and online marketplace services. In addition to organic growth, we have grown our business through strategic acquisitions. Most recently, on June 24, 2020, we acquired Ten-X, which operates an online auction platform for commercial real estate; on October 26, 2020, we acquired Emporis GmbH, a Germany-based provider of international commercial real estate data and images, which we subsequently merged into another of our German subsidiaries; and on December 22, 2020, we acquired Homesnap, which operates an online mobile software platform for residential real estate agents and brokers. We continue to integrate our recent acquisitions and the services they offer into our CoStar network. See Notes 5 and 9 to the accompanying Notes to the Consolidated Financial Statements included in Part IV of this Annual Report on Form 10-K for further discussion of these acquisitions.\nDevelopment, Investments and Expansion\nWe are committed to supporting, improving and enhancing our information, analytics and online marketplace solutions, including expanding and improving our offerings for property owners, property managers, brokers, agents, buyers, commercial tenants and residential renters. We expect to continue our software development efforts to improve existing services, introduce new services, integrate and cross-sell services, and expand and develop supporting technologies for our research, sales and marketing organizations.\nWe evaluate potential changes to our service offerings from time to time in order to better align the services we offer with customers’ needs. Further, in some cases, when integrating and coordinating our services and assessing industry and client needs, we may decide to combine, shift focus from, de-emphasize, phase out, or eliminate a service that, among other things, overlaps or is redundant with other services we offer. In the event that we eliminate or phase out particular service offerings, we may experience reduced revenues and earnings. The decision to eliminate or phase out a service offering may also ultimately result in increased revenues and earnings from sales of other services we offer in lieu of the eliminated or phased out services. However, we cannot predict with certainty the amount or timing of any reductions in revenues and earnings or subsequent increases in revenues and earnings, if any, resulting from the elimination or phasing out of any service offering.\nWe are consolidating STR hospitality data and benchmarking and analytics services with CoStar Suite to create an integrated platform. We expect that the combination of STR's and CoStar's offerings will allow us to create valuable new and improved tools for commercial real estate industry participants. We plan to drive international expansion, in part, through STR's global operations and to apply STR's benchmarking expertise to other commercial real estate segments we serve. We are working on integrating the Ten-X platform into both the LoopNet and CoStar service offerings, to expand the audience for Ten-X auctions to include our online commercial real estate users. To increase exposure, we have upgraded LoopNet listings for properties to be auctioned on Ten-X and are allocating banner space on both our CoStar and LoopNet sites to Ten-X to cross-market our services. We are beginning to incorporate recently acquired Emporis commercial real estate data and images into CoStar, and our Homesnap team is creating new and improved tools to help agents promote their residential listings, connect with buyers and sellers and streamline their daily workflow.\nWe believe that our integration efforts and continued investments in our services, including acquisitions and expansion of our existing service offerings, have created a platform for long-term revenue growth. We expect these investments to result in further penetration of our subscription-based services and the successful cross-selling of our services to customers in existing markets.\nWe have invested in the expansion and development of our field sales force to support the growth and expansion of our company and our service offerings, and plan to continue to invest in, evaluate and strategically position our sales force as the Company continues to develop and grow. Specifically, we continue to invest in marketing our services, as well as in our research operations to support continued growth of our information and analytics offerings to meet the growing content needs of our clients. Starting in 2019 and continuing throughout 2020, we increased our investment in Apartments.com marketing. We plan to continue to utilize a multi-channel marketing campaign and to work to determine the optimal level of marketing investment for our services for future periods. While we believe the investments we make in our business create a platform for growth, those investments may reduce our profitability and adversely affect our near-term financial position.\nTo support our continued expansion and development, in 2020 we completed a public equity offering, a Senior Notes offering and the refinancing of our revolving credit facility. For additional discussion of our public equity offering, Senior Notes offering and refinancing of our revolving credit facility, please see \"Management's Discussion and Analysis of Financial Condition and Results of Operations“-Overview-Development, Investments and Expansion\" and Notes 11 and 15 to the accompanying Notes to the Consolidated Financial Statements included in Part IV of this Annual Report on Form 10-K.\nIndustry Overview\nThe market for real estate information and analysis is vast based on the variety, volume and value of transactions related to real estate. Each transaction has multiple participants and multiple information requirements, and in order to facilitate transactions, industry participants must have extensive, accurate and current information and analysis. Members of the real estate and related business community require daily access to current data such as space availability, properties for-sale, rental units available, rental rates, vacancy rates, tenant movements, sales comparables, supply, new construction, absorption rates and other important market developments to carry out their businesses effectively. Market research (including historical and forecast conditions) and applied analytics are instrumental to the success of industry participants. There is a strong need for an efficient marketplace, where real estate professionals can exchange information, evaluate opportunities using standardized data and interpretive analyses, and interact with each other on a continuous basis.\nA large number of parties involved in commercial and residential real estate and the related business community make use of the services we provide in order to obtain information they need to conduct their businesses, including:\n• Sales and leasing brokers • Government agencies\n• Property owners • Mortgage-backed security issuers\n• Property managers • Appraisers\n• Design and construction professionals • Pension fund managers\n• Real estate developers • Reporters\n• Real estate investment trust managers • Tenant vendors\n• Investment and commercial bankers • Building services vendors\n• Mortgage bankers • Communications providers\n• Mortgage brokers • Insurance companies’ managers\n• Retailers • Institutional advisors\n• Hospitality owners • Investors and asset managers\n• Real estate agents\nThe commercial real estate and related business community historically operated in an inefficient marketplace because of the fragmented approach to gathering and exchanging information within the marketplace. Various organizations, including hundreds of brokerage firms, directory publishers and local research companies, collected data on specific markets and developed software to analyze the information they independently gathered. This highly fragmented methodology resulted in duplication of efforts in the collection and analysis of information, excessive internal cost and the creation of non-standardized data containing varying degrees of accuracy and comprehensiveness, resulting in a formidable information gap.\nThe creation and maintenance of a standardized information platform for commercial real estate requires infrastructure including a standardized database, accurate and comprehensive research capabilities, experienced analysts, easy to use technology and intensive participant interaction. By combining our extensive database, researchers, our experienced team of analysts and economists, technological expertise and broad customer base, we believe that we have created such a platform.\nThe apartment rental advertising industry serves property managers and owners who are tasked with finding renters to occupy vacant apartments, as well as renters who are searching for their next home. Property managers have several options at their disposal, including their own websites, drive-by and outdoor advertising, traditional classified ads, free online listing services, search engine marketing and Internet listings services (“ILS”), like Apartments.com and the network of apartment listing websites we own and operate. Many apartment ILS websites feature only the rental availabilities that larger property owners pay to advertise, resulting in a poor user experience in which the renter’s search criteria return either limited or no results, irrelevant results or stale results that do not represent actual availabilities.\nWe believe that consumers expect accurate, actionable and comprehensive apartment rental information. Our apartment ILS websites include renter-focused features like the ability to filter search results according to various criteria (e.g., commute time to work); professional images of the properties, including immersive videos and 3-D interactive models; custom neighborhood profiles; and tenant reviews. Our network of apartment listing websites draws on our multifamily database and includes researched and verified information. We proactively gather information on available rentals to improve the accuracy of the listings on our apartment ILS websites, including real time unit-level availability, current pricing, and rent specials. We have continually invested in our network to improve the features and services offered to property managers and website users. Recent additions include: dynamic lead forms that provide more information about prospective residents, a reporting suite that provides customers with rent comparables, making rent trends information publicly available and free digital ad retargeting, and integrated online rental solutions, including lease applications, and tenant credit and background checks. We believe that we have created and maintain easily searchable apartment ILS websites with a comprehensive selection of rentals, information on actual rental availabilities and rents, and in-depth data on neighborhoods, as well as easy to use and actionable tools for the rental process.\nCoStar’s Comprehensive Database\nCoStar has spent more than 30 years building and acquiring databases of commercial real estate information, which includes information on leasing, sales, comparable sales, tenants, and demand statistics, as well as digital images. This highly complex database is comprised of hundreds of data fields, tracking such categories as location, site and zoning information, building characteristics, space and unit availability, tax assessments, ownership, sales and lease comparables, space requirements, number of retail stores, number of listings, mortgage and deed information, for-sale and for-lease listings, income and expense histories, tenant names, lease expirations, contact information, historical trends, demographic information and retail sales per square foot. The database also includes building photographs, aerial photographs, 3D virtual tours, plat maps and floor plans.\nCoStar Research\nResearch Department. Our research professionals undergo an extensive training program so that we can maintain consistent research methods and processes throughout our research department. Our researchers collect and analyze commercial real estate information through phone calls, e-mails and Internet updates, in addition to field inspections, public records review, news monitoring and third-party data feeds. We have also set up direct feeds from larger apartment sites and have put in place an automated system that compiles information sourced from the Internet in order to provide the most up-to-date information on rental availabilities.\nOur researchers are responsible for maintaining the accuracy and reliability of our database information, training our clients to use the CoStar products and handling their customer service questions, creating a \"one touch\" approach to customer care. As part of the process, researchers use to update records in our database, researchers develop cooperative relationships with industry professionals that allow them to gather useful information. Because of the importance commercial real estate professionals place on our data and our prominent position in the industry, many of these professionals routinely take the initiative and proactively report available space and transactions through our online tool, which we refer to as our Marketing Center, or directly to our researchers.\nCoStar's field research effort includes physical inspection of properties in order to research new availabilities, find additional property inventory, new construction, collect tenant information, verify existing information, photograph properties and create high quality videos of interior spaces (including walk-through videos and 3D virtual tours), amenities and exterior\nfeatures of properties. CoStar utilizes high-tech, field research vehicles primarily within North America and Europe. A significant majority of these vehicles are customized, energy efficient hybrid cars that are equipped with computers, Global Positioning System tracking software, high resolution digital cameras and handheld laser instruments to precisely measure buildings and geo-code and position them on digital maps. Each CoStar vehicle uses wireless technology to track and transmit field data. A typical site inspection consists of photographing the building, measuring the building, geo-coding the building, capturing “for-sale” or “for-lease” sign information, counting parking spaces, assessing property condition and construction, and gathering tenant information. Field researchers also canvass properties, collecting tenant data suite-by-suite. CoStar also utilizes a low-flying airplane and a fleet of drones to conduct aerial research of commercial real estate. We place researchers on the low-flying aircraft to scout additional commercial developments and take aerial photographs and videos. Our U.S. drone operators are Federal Aviation Administration certified and trained to capture aerial photographs and videos of commercial real estate. Our drone operators in the U.K. and Canada are certified and trained to Civil Aviation Authority standards with a permission for commercial operations pending.\nData and Image Providers. We license a small portion of our data and images from public record providers and third-party data sources. Licensing agreements with these entities allow us to use a variety of commercial real estate information, including property ownership, tenant information, demographic information, maps, aerial photographs and 3D virtual apartment tours of apartment communities, all of which enhance various CoStar services. These license agreements generally grant us a non-exclusive license to use the data and images in the creation and supplementation of our information, analytics and online marketplaces.\nManagement and Quality Control Systems. Our research processes include automated and non-automated controls to ensure the integrity of the data collection process. A large number of automated data quality tests check for potential errors, including occupancy date conflicts, available square footage greater than building area, typical floor space greater than land area and expired leases. We also monitor changes to critical fields of information to ensure all information is kept in compliance with our standard definitions and methodology. Our non-automated quality control procedures include:\n•Calling our information sources on recently updated properties to re-verify information;\n•Performing periodic research audits and field checks to determine if we correctly canvassed buildings;\n•Providing training and retraining to our research professionals to ensure accurate and standardized data compilation; and\n•Compiling measurable performance metrics for research teams and managers for feedback on data quality.\nFinally, one of the most important and effective quality control measures we rely on is feedback provided by the commercial real estate professionals using our data every day.\nProprietary Technology\nCoStar’s information technology professionals focus on developing new services and features for our customers, improving and maintaining existing services, integrating our current services, securing our comprehensive database of commercial real estate information and delivering research automation tools that improve the quality of our data and increase the efficiency of our research analysts.\nOur information technology team is responsible for developing, improving and maintaining CoStar's information, analytics and online marketplace services. Our information technology team is also responsible for developing the infrastructure necessary to support CoStar’s business processes, our comprehensive database of commercial real estate information, analytics and online marketplaces and our extensive image library. The team implements technologies and systems that introduce efficient workflows and controls designed to increase the production capacity of our research teams and improve the quality of our data. Over the years, the team has developed data collection and quality control mechanisms that we believe are unique within the commercial real estate industry. The team continues to develop and modify our enterprise information management system that integrates CoStar's sales, research, field research, customer support and accounting information. We use this system to maintain our commercial real estate research information, manage contacts with the commercial real estate community, provide research workflow automation and conduct daily automated quality assurance checks. In addition, our information technology team has also developed fraud-detection technology to detect and prevent unauthorized access to our services. To supplement the measures we take to prevent misuse of our information, we added state of the art adaptive authentication technology to the login process of our CoStar Suite product.\nOur information technology professionals maintain the servers and network components necessary to support CoStar services and research systems. CoStar's core services are served from multiple data centers to support uninterrupted service for our customers. CoStar’s services are continually monitored in an effort to ensure our customers fast and reliable access.\nCoStar's comprehensive data protection policy provides for use of secure networks, strong passwords and dual factor authentication systems, encrypted data fields, end to end encryption, endpoint detection and response systems and services, security information and event management systems, off-site storage, cloud services, end user and developer security training, multilayered anti-phishing malware and spam protections and other protective measures in an effort to ensure the availability and security of all core systems.\nServices\nOur suite of information, analytics and online marketplaces is branded and marketed to our customers. Our services are primarily derived from a database of building-specific information and offer customers specialized tools for accessing, analyzing and using our information. Over time, we have enhanced and expanded, and expect to continue to enhance and expand, our existing information, analytics and online marketplace services and we have developed and expect to continue to develop additional services that make use of our comprehensive database to meet the needs of our existing customers as well as potential new categories of customers.\nOur principal information, analytics and online marketplace services are described in the following paragraphs:\nInformation and Analytics\nCoStar Suite®\nCoStar Suite® is our integrated suite of online commercial real estate service offerings, which includes information about space available for-lease, information about properties for-sale, comparable sales information, tenant information, market analytics including leasing, sales and construction trends, information about industry professionals and their business relationships and industry news. CoStar Suite includes the following products and services, which are delivered through desktop, mobile and other Internet-connected devices to our subscribers primarily in our North American and European markets.\n•CoStar Property® provides a comprehensive inventory of office, industrial, retail, multifamily and student housing properties and land. We also provide for-lease and for-sale listings, historical data, property analytics, building photographs, demographics, maps and floor plans. Commercial real estate professionals use CoStar Property to identify available space for-lease, evaluate leasing and sale opportunities, value assets and position properties in the marketplace. Our clients also use CoStar Property to analyze market conditions by calculating current vacancy rates, absorption rates or average rental rates, and forecasting future trends based on user selected variables. CoStar Property provides subscribers with powerful map-based search & reporting capabilities.\n•CoStar COMPS® is the industry’s most comprehensive database of comparable commercial real estate sales transactions and is designed for professionals who need to research property comparables, identify market trends, expedite the appraisal process and support property valuations. CoStar COMPS offers subscribers numerous fields of property information, access to support documents (e.g., deeds of trust) for new comparables, demographics and the ability to view for-sale properties alongside sold properties plotted on a map or aerial image or in a table format.\n•CoStar Market Analytics provides owners, investors, brokers property managers, lenders, appraisers and other commercial real estate professionals the ability to view and report on aggregated market and submarket trends, including leasing, vacancy, rental rates, construction, investment sales activity and overall economic conditions that affect commercial real estate markets. CoStar Market Analytics covers all major real estate sectors including office, industrial, retail, multifamily and student housing, and provides quantitatively driven and economist curated forecasts of supply, demand, vacancy, and rent at the submarket level, and job growth and asset pricing at the market level.\n•CoStar Tenant® is a detailed online business-to-business prospecting and analytical tool providing commercial real estate professionals with the most comprehensive commercial real estate-related tenant information available in our North American markets. CoStar Tenant profiles tenants occupying space in commercial buildings and provides updates on lease expirations - one of the service’s key features - as well as occupancy levels, growth rates and numerous other facts. Delivering this information via the Internet allows users to target prospective clients quickly through a searchable database that identifies only those tenants meeting certain criteria.\n•CoStar Lease Comps provides subscribers comprehensive data regarding CoStar researched lease transactions and a software tool to capture, manage and maintain their own user-entered lease data. In addition, CoStar Lease Comps\nprovides subscribers the ability to analyze this combined lease dataset from an aggregate analytic perspective and generate various reports.\n•CoStar Lease Analysis® is a workflow tool that allows subscribers to incorporate CoStar data with their own data to perform in-depth lease analyses and share those analyses with other subscribers or non-subscribers. CoStar Lease Analysis can be used to produce an understandable cash flow analysis as well as key metrics about any proposed or existing lease. It combines financial modeling with CoStar’s comprehensive property information, enabling the subscriber to compare lease alternatives, either from a landlord or tenant perspective.\n•CoStar Public Record is CoStar’s newest commercial real estate servicing offering. It provides access to a searchable database of nearly 38 million commercially-zoned parcels in the U.S. Users can search for property attributes, sale transaction, loan, lien and tax assessments information. Information in this module is sourced from numerous counties and jurisdictions that provide this data for ownership, title and property tax assessment purposes.\nInformation Services\nCoStar Real Estate Manager® is a real estate and asset management and lease accounting software solution designed for corporate real estate managers, company executives, financial accounting directors, business unit directors, brokers and project managers. CoStar Real Estate Manager helps users connect real estate initiatives with company strategic goals, streamline portfolio operations, automate the process for collecting and managing space requests, reduce occupancy costs with analytics that track location performance against targets and maximize location performance through proactive portfolio management. Additionally, the software is used to help companies manage their lease accounting and reporting requirements.\nCoStar Risk Analytics® is a trusted partner to many of the largest commercial real estate lenders and commercial mortgage-based securities (CMBS) market participants, providing timely data, advanced analytics, time proven models and extensive experience to support regulatory examinations, risk management and strategic decision making. The CoStar Risk Analytics COMPASS credit default model has been used by commercial real estate lenders, CMBS participants and regulators for over 15 years to estimate required loss reserves, stress test portfolios, generate risk ratings, calculate capital adequacy, underwrite loans, target lending opportunities and price CMBS bonds. Our clients rely on CoStar Risk Analytics for model validations and reporting to support regulatory examinations. Additionally, CoStar Risk Analytics solutions connect client loan and CMBS loan portfolios to CoStar’s industry leading commercial real estate data, research, analytics and the COMPASS credit model, updated daily, for more informed decision making, portfolio strategy and surveillance. Clients of CoStar Risk Analytics solutions include many of the largest banks, life insurance companies, asset managers, hedge funds, government agencies and regulators.\nSTAR Report is STR’s data analytics report. It provides hospitality benchmarking, measuring a hotel’s performance against a self-selected aggregated competitive set. STR's confidential data reports enable customers to understand their market position based on trends and indices. Reports are provided on a monthly, weekly or daily basis and provide insights about key metrics such as occupancy, average daily rate (ADR) and revenue per available room (RevPAR). STAR Reports are only available to industry participants who provide data to STR -- typically hotel brands, third party management companies and owners. STR also offers ad hoc reports with a customizable data set providing aggregated hotel performance data for a bespoke set of hotels or standardized industry segments (e.g. market or submarket).\nOnline Marketplaces\nMultifamily\nApartments.comTM, the flagship brand of our network of apartment marketing sites, provides a variety of ad packages and enhancements that allow property managers and owners to fully showcase their apartment community through increased exposure and interactions that allow renters to view, engage and connect with the community. Apartments.com also provides tools to facilitate the rental process, including online applications, background and credit checks and rental payment processing. The Apartments.com network consists of numerous other apartment marketing sites, including:\n•ApartmentFinder® provides lead generation, advertising and Internet marketing solutions to property managers and owners through its main site, ApartmentFinder.com.\n•ForRent.com® provides digital advertising through a network of four multifamily websites - which includes ForRent.com, AFTER55.com, CorporateHousing.com and ForRentUniversity.com.\n•ApartmentHomeLiving.comTM provides renters with another national online apartment rental resource that showcases apartments for rent with official prices, pictures, floor plans and detailed information on each apartment.\n•Apartamentos.comTM provides Spanish speaking renters with an online apartment rentals resource offered exclusively in Spanish, with the same primary features found on Apartments.com.\n•Westside Rentals® specializes in Southern California real estate rentals.\n•Off Campus Partners provides student housing marketplace content and technology to U.S. universities, simplifying the off-campus housing search process for universities, property managers, and students.\nCommercial Property and Land\nLoopNet Premium Lister® is designed for commercial real estate professionals and other customers who seek the broadest possible exposure for their listings, access to leads lists, and advanced marketing and searching tools. LoopNet Premium Lister provides subscribers with the ability to market their listings to all LoopNet.com visitors, as well as numerous other features. LoopNet Premium Lister is available for a quarterly or annual subscription.\nLoopNet Diamond, Platinum and Gold Ads are designed for commercial real estate professionals and other customers who seek the broadest possible exposure for their listings, access to leads lists, and advanced marketing and searching tools. These LoopNet Ads provide subscribers with full access to three of the industry’s top commercial real estate marketplaces, LoopNet®, Cityfeet® and Showcase.com®, as well as online newspaper websites including the Wall Street Journal. LoopNet Ads are available for a six-month or annual subscription.\nTen-X® operates an online auction platform for commercial real estate. We are working on integrating the Ten-X platform into both LoopNet and CoStar services, to expand the audience for Ten-X auctions to include our online commercial real estate users.\nLandsofAmericaTM, LandAndFarmTM and LandWatch® LandsofAmerica.com, LandAndFarm.com, and LandWatch.com are leading online marketplaces for rural land for-sale. Sellers pay a fee to list their land for-sale, and interested buyers can search the respective sites' listings for free. The LandsofAmerica.com, LandAndFarm.com and LandWatch.com websites are also accessible via our Land.com domain.\nBizBuySell®, BizQuest® and FindaFranchise BizBuySell.com, BizQuest.com and FindaFranchise.com are leading online marketplaces for operating businesses and franchises for-sale. Business sellers pay a fee to list their operating businesses for-sale, and interested buyers can search the respective sites' listings for free. The BizBuySell, BizQuest and FindaFranchise Franchise Directories allow interested business buyers to search hundreds of franchise opportunities, and franchisors can list their availabilities in the directory on a cost per lead basis.\nHomeSnap® is an industry-leading online and mobile software platform that provides user-friendly applications to optimize residential real estate agent workflow and reinforce the agent-client relationship.\nClients\nWe draw clients from across the real estate and related business community, including real estate brokers, agents, owners, developers, landlords, property managers, financial institutions, retailers, vendors, appraisers, investment banks, government agencies and other parties involved in real estate. For the years ended December 31, 2020, 2019 and 2018, no single client accounted for more than 5% of our revenues.\nSales and Marketing\nOur overall sales strategy is to provide optimal service to our existing customers, attract new clients and cross-sell the numerous solutions we have to offer. Our sales teams sell multiple products and are primarily located in field sales offices throughout the U.S., with others in Canada, the U.K., Spain, France, and Germany. Our inside sales teams are largely based in Washington, DC and Richmond, Virginia. Our inside sales professionals actively work lead lists, prospect for new customers and perform virtual product demonstrations. Our professionals utilize the Internet and remote presentation tools to convey the multiple solutions we offer. In response to the COVID-19 pandemic, our entire sales force has been equipped to operate remotely.\nOur local offices typically support field sales and field research operations within the markets in which they operate. This enables our clients to benefit from a local presence. Our field sales force has the primary front-line responsibility for customer service, ensuring client satisfaction and building long-term relationships. Our local offices act as hubs for training, sources of market insight, product feedback sessions and connecting industry participants.\nWe actively manage all client accounts with frequent meetings, trainings, and updates on new enhancements. In 2020, we successfully implemented a number of important sales initiatives, focused on selling our products to brokers, property owners and lenders in the U.S. This focus will continue in 2021. Our initiatives to partner with brokers to provide value to property owners allowed us to successfully position LoopNet Ads as a valuable marketing solution for a property owner’s major risk, namely, the cost of vacant space and the resulting negative impact on valuation of the property or portfolio, a risk that has been significantly magnified as a result of the COVID-19 pandemic. Additionally, we worked closely with clients to help them navigate the unprecedented challenges brought on by the COVID-19 pandemic through relevant training initiatives and curated webinars. During the fourth quarter of 2020, we began establishing a dedicated LoopNet sales division. Both our field sales and LoopNet sales teams will continue to sell LoopNet solutions.\nTo generate brand awareness and site traffic for the Apartments.com network of rental websites, we utilize a multi-channel marketing campaign featuring television and radio ads, online and digital advertising impressions, streaming audio and podcasts, social media, email, public relations and news articles, out-of-home and paid search marketing, all of which are reinforced with substantial Search Engine Optimization efforts. We plan to continue to utilize these marketing methods to generate brand awareness and site traffic for the Apartments.com network and implement similar marketing strategies for LoopNet and Ten-X. We will continue to work to determine the optimal level of marketing investment for each of these services for future periods.\nOur CoStar U.K. sales force continued to grow our existing client base, and trained users on the numerous product enhancements we released during 2019 and 2020. In Canada, our sales representatives were focused on targeting brokers, owners and lender prospects for subscribing to our suite of products.\nWe seek to make our services essential to our clients’ businesses. To encourage clients to use our services regularly, we generally charge a fixed monthly amount for our subscription-based information services rather than fees based on actual system usage. Contract rates for subscription-based services are generally based on the number of sites, number of users, organization size, the client’s business focus, geography and the range of services subscribed for. Our marketing solutions are priced by exposure levels, the number of properties/spaces for-lease, rent or sale and the market in which they are offered. Listings for customers who purchase packages with the highest level of exposure usually appear first in search results and offer the richest media content and engagement opportunities for tenants searching for space, renters looking for an apartment or investors seeking an opportunity. Our subscription clients generally pay contract fees on a monthly basis, but in some cases may pay us on a quarterly or annual basis.\nIn 2020, in response to the COVID-19 pandemic, our primary marketing methods included: virtual service demonstrations; targeted paid digital marketing; retargeting and social marketing; direct marketing such as email; communication via our corporate website and news services; participation in virtual trade shows and industry events; virtual Company-sponsored events; client referrals; content marketing including webinars, seminars, and white papers and other company newsletters distributed via email to our clients and prospects.\nTo generate brand awareness and site traffic for the Apartments.com network of rental websites, we utilize a multi-channel marketing campaign featuring television and radio ads, online and digital advertising impressions, streaming audio and podcasts, social media, email, public relations and news articles, out-of-home and paid search marketing, all of which are reinforced with substantial Search Engine Optimization efforts. We plan to continue to utilize these marketing methods to generate brand awareness and site traffic, and will continue to work to determine the optimal level of marketing investment for our services for future periods.\nComprehensive digital marketing and direct marketing are effective means for us to find prospective clients. Our digital marketing efforts include Search Engine Optimization, paid advertising with major search engines, social media and display advertising on commercial real estate news and business websites and mobile applications, and our direct marketing efforts include television, radio, out-of-home ads, direct mail and email and, when applicable, make extensive use of our unique, proprietary database. Once we have identified a prospective client, our most effective sales method is a service demonstration. We use various forms of integrated marketing and advertising to build brand awareness, brand identity and reinforce the value and benefits of our services. We also sponsor and attend local virtual association activities and events, including industry-leading events for commercial real estate brokers, property owners, investors and retail and financial services institutions, and attend or exhibit at virtual industry trade shows and conferences to reinforce our relationships with our core user groups.\nNews has always been a valuable part of CoStar's core subscription offering. CoStar's award-winning news teams report on the latest deals and developments across our markets, keeping subscribers informed and driving higher usage in our core product. In 2020, we enhanced our offerings, including producing a series of special reports on the impact of the COVID-19 pandemic on the commercial real estate industry and working with our analyst team, added weekly video updates and periodic webinars to discuss key changes to national and local markets. We merged STR's Hotel News Now news service into CoStar News, giving CoStar subscribers direct access to STR's hospitality news and analysis, while expanding the real estate audience for STR. Similarly, following CoStar's acquisition of Ten-X, we launched news coverage of commercial real estate auctions, telling the stories of prominent properties up for bid, including those featured on Ten-X. We continued to build our newsletter franchise, adding one focused on the hospitality industry and another highlighting the best of our analyst reports. We created new features for our newsletters showcasing the best of CoStar's architectural photography and data graphics. Finally, the news team, working with CoStar's research group, now produces quarterly Power Broker stories recognizing the top deals in each of our U.S., U.K. and Canadian markets, increasing broker exposure in the marketplace.\nCompetition\nThe market for information, analytics and online marketplaces generally is competitive and extremely dynamic. In the commercial real estate and apartment rentals industries, we believe the principal competitive factors affecting these services and providers are:\n•Quality and depth of the underlying databases;\n•Quality and quantity of leads and leases delivered;\n•Ease of use, flexibility and functionality of the software;\n•Intuitiveness and appeal of the user interface;\n•Timeliness of the data, including listings;\n•Breadth of geographic coverage and services offered;\n•Completeness and accuracy of content;\n•Client service and support;\n•Perception that the service offered is the industry standard;\n•Price;\n•Effectiveness of marketing and sales efforts;\n•Proprietary nature of methodologies, databases and technical resources;\n•Vendor reputation;\n•Brand loyalty among customers; and\n•Capital resources.\nWe compete directly and indirectly for customers with the following categories of companies:\n•Online marketing services, websites or data exchanges targeted to commercial real estate brokers, buyers and sellers of commercial real estate properties, insurance companies, mortgage brokers and lenders, such as Reed Business Information Limited and its Estates Gazette and Radius Data Exchange products, SquareFoot, officespace.com, Brevitas, Catylist (now a part of Moody's), 42Floors, Altus Group (Commercial Property Search), Digsy, Quantum Listing, RealNex MarketPlace, TenantWise, Rofo, BuildingSearch.com, CIMLS, CompStak, Rightmove, Yardi (PropertyShark and CommercialCafe), CREXi, TotalCommercial.com, DebtX, Real Capital Markets, and VTS;\n•Publishers and distributors of information, analytics and marketing services, including regional providers and national print publications, such as CBRE Economic Advisors, Marshall & Swift, REIS Network (part of the Moody's Analytics Accelerator), Real Capital Analytics, Real Capital Markets, Reonomy, Yardi Matrix, RealPage and its Axiometrics business, Altus Insight and Altus RealNet (Canada);\n•Search engine and Internet listing services featuring apartments for rent, such as Google, Bing, Facebook Marketplace, ApartmentGuide.com, Rent.com, Rentals.com, Zillow Rentals, Trulia Rentals, StreetEasy, NakedApartments.com, HotPads.com, MyNewPlace.com, Zumper, PadMapper, Craigslist, ApartmentList.com, Move.com, Realtor.com, Adobo, RadPad, RentJungle, RentCafe.com, RentHop, RentBerry, and ApartmentRatings;\n•Hospitality benchmarking and analytics services, such as Lodging Econometrics, Kalibri Labs, Travelclick, HotStats and Shigi Group (SnapShot);\n•Online and mobile software application providers in the residential real estate industry, including Zillow, Redfin and Realtor.com, as well as agent marketing platforms and workflow providers;\n•Locally controlled real estate boards, exchanges or associations sponsoring property listing services and the companies with whom they partner, such as Catylist, the National Association of Realtors, CCIM Institute, Society of Industrial and Office Realtors, the Commercial Association of Realtors Data Services and AIR CRE;\n•Real estate portfolio management software solutions, such as Cougar Software, MRI Software, Altus, RealPage, AppFolio and SiteCompli;\n•Real estate lease management and administration software solutions, such as Accruent, Tririga, Manhattan Software, Tango Analytics, Lease Accelerator, Visual Lease, Sequnetra, Lease Harbor and AMT Direct;\n•In-house research departments operated by commercial real estate brokers; and\n•Public record providers.\nAs the market for information, analytics and online marketplaces develops, additional competitors (including companies which could have greater access to data, financial, product development, technical, analytic or marketing resources than we do) may enter the market and competition may intensify. For example, a company like Bloomberg L.P. has the resources, and has previously announced an intention, to move into the commercial real estate information business. Further, a company like Google, which has a far-reaching web presence and substantial data aggregation capabilities, could enter the commercial real estate marketing arena. A company like Zillow, which already has a presence in residential real estate and the apartment rentals industry, could use its resources to further expand in the online apartment rentals industry creating greater competition among Internet listing services for the marketing budgets of property managers and property owners. While we believe that we have successfully differentiated ourselves from existing competitors, current or future competitors could materially harm our business.\nProprietary Rights\nTo protect our proprietary rights in our methodologies, database, software, trademarks and other intellectual property, we depend upon a combination of:\n•Trade secret, misappropriation, unfair competition, copyright, trademark, computer fraud, database protection and other laws;\n•Registration of copyrights and trademarks;\n•Nondisclosure, noncompetition and other contractual provisions with employees and consultants;\n•License agreements with customers;\n•Patent protection; and\n•Technical measures.\nWe seek to protect our software’s source code, our database and our photography as trade secrets and under copyright law. Although copyright registration is not a prerequisite for copyright protection, we have filed for copyright registration for many of our databases, photographs, software and other materials. Under current U.S. copyright law, the arrangement and selection of data may be protected, but the actual data itself may not be. Certain U.K. database protection laws provide additional protections for our U.K. databases. We license our services under license agreements that grant our clients non-exclusive, non-transferable rights. These agreements restrict the disclosure and use of our information and prohibit the unauthorized reproduction or transfer of any of our proprietary information, methodologies or analytics.\nWe also attempt to protect our proprietary databases, our trade secrets and our proprietary information through confidentiality and noncompetition agreements with our employees and consultants. Our services also include technical measures designed to detect, discourage and prevent unauthorized access to and/or copying of our intellectual property. We have established an internal antipiracy team that uses fraud-detection technology to continually monitor use of our services to detect and prevent unauthorized access, and we actively prosecute individuals and firms that engage in this unlawful activity.\nWe maintain U.S. and international trademark registrations for CoStar’s core service names and proactively file U.S. and international trademark applications covering our new and planned service names. Our federally registered trademarks include CoStar®, CoStar Suite®, CoStar Property®, CoStar COMPS®, CoStar Tenant®, CoStar Lease Analysis®, LoopNet®, Showcase.com®, Cityfeet.com®, Apartments.com®, Lands of America®, Ten-X® and HomeSnap®, among many others. In the U.S., trademarks are generally valid as long as they are in use and have not been found to be generic. We consider our trademarks in the aggregate to constitute a valuable asset.\nIn addition, we maintain a patent portfolio that protects certain of our systems and methodologies. We currently have one granted patent in the U.K., which expires in 2021, covering, among other things, certain of our field research methodologies, five patents in Canada, which expire in 2021 (2 patents) and 2036 (3 patents), covering, among other things, certain features of our field research methodologies and user interface features, and fifteen patents in the U.S. which expire in 2021 (2 patents), 2022 (2 patents), 2025 (1 patent), 2032 (2 patents), 2036 (3 patents), 2037 (4 patents), and 2038 (1 patent), covering, among other things, certain features of our field research methodologies and user interface feature. We regard the rights protected by our patents as valuable to our business, but do not believe that our business is materially dependent on any single patent or portfolio of patents as a whole.\nHuman Capital Resources\nAs of January 31, 2021, we employed 4,752 employees. U.S-based employees represent approximately 88% of the overall employee population, followed by 10% in European and Asia-Pacific and Latin American countries, and 2% in Canadian provinces. None of our employees are represented by a labor union. We have experienced no work stoppages. We believe that our employee relations are excellent. As is common with many German companies, employees in our German subsidiary, Thomas Daily GmbH, have elected five fellow employees to form a Works Council, which represents our employees at the location. The Works Council has certain co-determination rights and rights to receive information from us and engage us in discussions under applicable law.\nOur human resources and recruiting team works in partnership with business leaders, using a robust and diverse talent attraction strategy to fill vacancies and contribute to our growth, including our Careers page on our corporate website, employee referral program, social media and digital platforms, direct outreach, partnerships with commercial real estate industry groups and universities, and specific partnerships and programs to ensure a diverse slate of candidates for each role. The development and retention of our employees is critical to our success. To support career development, we offer on-demand and in-person training programs to new hires, managers, and leaders. We also offer a mentoring program, which pairs employees seeking mentorship with more experienced colleagues.\nTo assess employee engagement, we partner with a survey vendor to survey employees annually. Insights and results gathered from the survey are shared with our leadership, managers and employees and help to inform our human resources program strategy each year. We believe that diverse teams deliver better and more innovative solutions. The diversity of thought that comes from different perspectives and backgrounds allows us to deliver cutting edge research and technology solutions that best serve our customers. We have a dedicated Diversity, Equity and Inclusion team that is tasked with developing topical programming, communications and training including, but not limited to, celebrations of various heritage months and oversight of our employee resource groups, which create avenues for mentoring and professional development within these groups as well as education and awareness across the organization.\nWe provide competitive pay and benefits to attract and retain high quality talent. In addition to base salaries, compensation may include annual bonuses, commissions, and equity awards. Employees may also participate in an Employee Stock Purchase\nPlan, and a 401(k) Plan with a company match. Our comprehensive set of health and wellness benefits are affordable, high quality and valuable to employees and their families. Employees have multiple choices for health plans, access to vision and dental benefits and may participate in our employee wellness program as well as our employee assistance program. Additional benefits include paid time off, parental bonding leave, college savings benefits, tuition reimbursement, company-subsidized commuter benefits and access to mental health, tax, and legal services.\nWe consider the health and wellbeing of our employees, clients, and communities to be our top priority during the COVID-19 pandemic. We transitioned from in-office to remote work for non-essential employees in early March of 2020 through the adoption of new, stable, and secure technologies to support employees in remaining fully productive while working remotely. We also adopted new policies and procedures to ensure safety, which currently include requirements for mask wearing in the office and when coming into contact with the community. We provide personal protective equipment for all employees, including face coverings, hand sanitizer, antibacterial surface sanitizer and other protective equipment as needed. In addition, our office space workstations have been redesigned and upgraded to allow for six feet of social distancing between them and include physical barrier shielding. HVAC systems in our offices have been upgraded with enhanced filtration, increased fresh air intake and ultraviolet lighting disinfection. We have also made a significant investment in commercial grade air filtration equipment and monitor air quality in majority of our office locations. Finally, all high contact surfaces in our offices are cleaned multiple times during the day and deep cleaned each night. We also provide free COVID-19 PCR and antibody testing for our employees and their immediate household family members.\nAvailable Information\nOur investor relations Internet website is http://www.costargroup.com/investors. The reports we file with or furnish to the Securities and Exchange Commission, including our annual report, quarterly reports and current reports, as well as amendments to those reports, are available free of charge on our Internet website as soon as reasonably practicable after we electronically file such material with, or furnish it to, the Securities and Exchange Commission. The Securities and Exchange Commission maintains an Internet site that contains reports, proxy and information statements, and other information regarding issuers that file electronically with the Commission at http://www.sec.gov.",
    "item_1A": "Item 1A. Risk Factors\nRisks related to our business\nOur revenues and financial position will be adversely affected if we are not able to attract and retain clients. Our success and revenues depend on attracting and retaining subscribers to our information, analytics and online marketplace services. Our subscription-based services generate the largest portion of our revenues. Our revenue may not grow, or could decrease, if we cannot attract new customers, continue to keep our cancellation rate low and continue to sell new services to our existing customers. We may not be able to continue to grow our customer base, keep the cancellation rate low or sell new services to existing customers as a result of several factors, including, without limitation: economic pressures; the business failure of current clients; customer decisions that they do not need our services or to use alternative services; customers’ and potential customers’ budgetary constraints; consolidation in the real estate and/or financial services industries; data quality; technical problems; competitive pressures; or devaluation of the local currencies of international customers relative to the U.S. dollar which impairs the purchasing power of such customers. We compete against many other real estate information, analytics, and marketing service providers for business. If clients cancel services or decide not to renew their subscription agreements, and we do not sell new services to our existing clients or attract new clients, then our renewal rate, net new sales and revenues may decline or fail to meet expectations.\nWe may not be able to successfully develop and introduce new or upgraded information, analytics and online marketplace services that are attractive to our users and advertisers or successfully combine or shift focus from current services with less demand, which could decrease our revenues and our profitability. Our future business and financial success will depend on our ability to continue to anticipate the needs of customers and potential customers, and to successfully introduce new and upgraded services into the marketplace, including services that make our marketplaces useful for users and attractive to advertisers. To be successful, we must be able to quickly adapt to changes in the industry, as well as rapid technological changes by continually enhancing our information, analytics and online marketplace services. As a result, we must continually invest resources in research and development to improve the appeal and comprehensiveness of our services and effectively incorporate new technologies.\nDeveloping new services and upgrades to services, as well as integrating and coordinating current services, imposes heavy burdens on our systems department, product development team, management and researchers. The processes are costly, and our efforts to develop, integrate and enhance our services may not be successful. In addition, launching and selling a new or upgraded service puts additional strain on our sales and marketing resources. If we are unsuccessful in obtaining greater market share or in obtaining widespread adoption of new or upgraded services, we may not be able to offset the expenses associated with the development, launch and marketing of the new or upgraded service, which could have a material adverse effect on our financial results. For example, to generate brand awareness and site traffic for our Apartments.com network of rental websites, we invest significant resources in a multi-channel marketing campaign. If the marketing campaign does not continue to increase brand awareness, site traffic and/or revenues, the cost of the campaign could have an adverse effect on our financial results.\nIn addition, as we integrate acquired businesses, we continue to assess which services we believe will best meet the needs of our customers. If we eliminate or phase out a service and are not able to offer and successfully market and sell an alternative service, our revenue may decrease, which could have a material adverse effect on our results of operations.\nWe may not be able to compete successfully against existing or future competitors in attracting advertisers, which could harm our business, results of operations and financial condition. We may not be able to compete successfully against existing or future competitors in attracting advertisers, which could harm our business, results of operations and financial condition. We compete to attract advertisers. Our competitors may have greater brand recognition or more direct sales personnel than we have and may generate more web traffic than we do, which may provide them with competitive advantages. To compete successfully for advertisers, we must continue to invest resources in developing our advertising platform and proving the effectiveness and relevance of our advertising services. Pressure from competitors seeking to acquire a greater share of our advertisers’ overall marketing budget could adversely affect our pricing and margins, lower our revenue, and increase our research and development and marketing expenses. If we are unable to compete successfully against our existing or future competitors, our business, results of operations or financial condition could be adversely affected.\nOur business and results of operations have been and will be, and our financial condition may be, impacted by the COVID-19 pandemic and such impact could be materially adverse and continue for an unknown period of time. The global spread of COVID-19 has created significant economic volatility, uncertainty and disruption around the world. The extent to which COVID-19 will further impact our business, operations and financial results, including the duration and magnitude of such impact, is uncertain and will depend on numerous rapidly evolving factors that we cannot accurately predict including, among others:\n•the length and severity of the pandemic;\n•the availability of vaccines to our employees and clients;\n•the negative impact on global and regional economies, credit markets and economic activity;\n•governmental, business and individual actions taken in response to the pandemic and the impact of those actions on global economic activity;\n•the impact of business disruptions and reductions in employment levels and the level of consumer confidence in the economy on our clients and the resulting impact on their demand for our services and solutions;\n•business consolidations or failures among businesses that we serve;\n•our clients’ ability to pay for our services and solutions and our ability to collect payment for services provided;\n•our ability to market, develop, provide, and train clients on the use of our services and solutions, including as a result of our employees or our clients’ employees working remotely, worker absenteeism or decreased productivity, quarantines, social distancing or other travel or health-related restrictions;\n•the pace and extent of economic recovery following the COVID-19 pandemic, including recovery in the real estate industry in particular;\n•increased costs of additional safety procedures and increased technology-related expenses to provide for business continuity; and\n•increased cyber security risk, data accessibility concerns and susceptibility to communication disruptions because our employees and employees of our clients are working remotely.\nAs a result of COVID-19 and its impact on global economic conditions, including the real estate industry, towards the end of the first quarter and in the first two months of the second quarter of 2020, we saw an increase in customer requests for cancellations or suspensions, a reduction in new customer sales, failures to pay and delays in payments of amounts owed to us. We may see additional requests as current economic conditions cause customers to reduce expenses and prolong the decision-making time before purchasing third party services, which may lead to fewer of our services being purchased or service cancellations. The extent and duration of any future continued weakening of the economy is unknown, and there can be no assurance that any of the governmental or private sector initiatives designed to strengthen the economy will be successful or available to us and our customers and, if successful, when the benefits will be seen. We expect that cancellations or suspensions, reductions of services and failures to pay amounts due to us may increase at any time while the economic impact of the pandemic and the response to the pandemic impacts our customer base. We compete against many other real estate information and marketing service providers for business. If cancellations, reductions of services and failures to pay increase and we are unable to offset the resulting decrease in revenue by increasing sales to new or existing customers, our revenues will decline and our profitability will be adversely affected.\nAs a business, we have experienced and may continue to experience challenges, including increased costs, as we have and continue to pivot our employees’ work locations and hours as deemed necessary to respond to COVID-19 to protect the health and well-being of our employees, customers and community. Any actual or perceived failure to comply with government orders, rules, laws or regulations as a result of changes in our operations in response to COVID-19 could subject us to investigations, claims, fines and other penalties, which in turn could adversely affect our business.\nCOVID-19, and the disruption in global economic conditions stemming from the pandemic, could also precipitate or aggravate the other risk factors discussed in this Report, which could materially adversely affect our business, financial condition and results of operations. Further, the COVID-19 pandemic may also affect our operating and financial results in a manner that is not presently known to us or that we currently do not consider to present significant risks. For additional discussion of the impacts of the COVID-19 pandemic, which could be materially adverse to our operations and financial results, please see \"Management’s Discussion and Analysis of Financial Condition and Results of Operations - Impact of the COVID-19 Pandemic\" in Item 7 of Part II of this Annual Report on Form 10-K.\nA downturn or consolidation in the real estate industry may decrease customer demand for our services. The real estate market may be adversely impacted by many different factors, including lower than expected job growth or job losses resulting in reduced real estate demand; rising interest rates and slowing transaction volumes due to the impact of the COVID-19 pandemic or otherwise that negatively impact investment returns; excessive speculative new construction in localized markets resulting in increased vacancy rates and diminished rent growth; and unanticipated disasters and other adverse events such as slowing of the growth in the working age population resulting in reduced demand for all types of real estate. A downturn in the real estate market, including as a result of a decline in leasing activity and absorption rates may affect our ability to generate revenues and may lead to more cancellations by our current or future customers, either of which could cause our revenues or our revenue growth rate to decline and reduce our profitability. A depressed real estate market has a negative impact on our core customer base, which could decrease demand for our information, analytics and online marketplaces. Also, companies in this industry may consolidate, often in order to reduce expenses. Consolidation, or other cost-cutting measures by our customers, may lead to cancellations of our information, analytics and online marketplace services by our customers, reduce the\nnumber of our existing clients, reduce the size of our target market or increase our clients’ bargaining power, all of which could cause our revenues to decline and reduce our profitability. If cancellations, reductions of services, and failures to pay increase, and we are unable to offset the resulting decrease in revenues by increasing sales to new or existing customers, our revenues may decline or grow at lower rates.\nIf we are unable to hire qualified persons for, or retain and continue to develop, our sales force, or if our sales force is unproductive, our revenues could be adversely affected. In order to support revenues and revenue growth, we need to continue to develop, train and retain our sales force. Our ability to build and develop a strong sales force may be affected by a number of factors, including: our ability to attract, integrate and motivate sales personnel; our ability to effectively train our sales force; the ability of our sales force to sell an increased number and different types of services; our ability to manage effectively an outbound telesales group; the length of time it takes new sales personnel to become productive; the competition we face from other companies in hiring and retaining sales personnel; our ability to effectively structure our sales force; and our ability to effectively manage a multi-location sales organization, including field sales personnel. If we are unable to hire qualified sales personnel and develop and retain our sales force, including sales force management, or if our sales force is unproductive, our revenues or growth rate could decline and our expenses could increase.\nWe may be unable to increase awareness of our brands, including CoStar, LoopNet, Apartments.com, BizBuySell, LandsofAmerica, STR, Ten-X and Homesnap, which could adversely affect our business. We rely heavily on our brands, which we believe are key assets of our company. Awareness and differentiation of our brands are important for attracting and expanding the number of users of, and subscribers to, our online marketplaces, such as LoopNet, the Apartments.com network of rental websites, CoStar Showcase, and the Land.com network of rural lands for-sale. We expect to continue to invest in sales and marketing in 2021 as we seek to grow the numbers of subscribers to, and advertisers on, our marketplaces. Our methods of advertising may not be successful in increasing brand awareness or, ultimately, be cost-effective. If we are unable to maintain or enhance user and advertiser awareness of our brands, or if we are unable to recover our marketing and advertising costs through increased usage of our services and increased advertising on our websites, our business, results of operations and financial condition could be adversely affected.\nOur internal and external investments may place downward pressure on our operating margins. To increase our revenue growth, we continue to invest in our business, including internal investments in product development to expand the breadth and depth of services we provide to our customers and external investments in sales and marketing to generate brand awareness. Our operating margins may experience downward pressure in the short term as a result of these investments. Furthermore, our investments may not produce the expected results. If we are unable to successfully execute our investment strategy, we may experience decreases in our revenues and operating margins.\nIf Internet search engines do not prominently feature our websites on the search engine results page, traffic to our websites would decrease and, if we are unable to maintain or increase traffic to our marketplaces, our business and operating results could be adversely affected. Our ability to generate revenues from our marketplace business depends, in part, on our ability to attract users to our websites. Google, Bing, DuckDuckGo and other Internet search engines drive traffic to our websites, including CoStar.com, the Apartments.com network of rental websites, the LoopNet.com network of commercial real estate websites, Ten-X.com, the BizBuySell.com network of business for-sale websites and the Land.com network of land for-sale websites. For example, when a user enters in a search query for an apartment building name or address into an Internet search engine, the Internet search engine’s ranking of our Apartments.com webpages will determine how prominently such webpages are displayed on the search engine results page. Our ability to maintain prominent search result rankings and positioning is not entirely within our control. Our competitors’ Search Engine Optimization (SEO) and Search Engine Marketing (SEM) efforts may result in webpages from their websites receiving higher rankings than the webpages from our websites. Internet search engines could revise their algorithms and methodologies in ways that would adversely affect our search result rankings. Internet search engine providers could form partnerships or enter into other business relationships with our competitors resulting in competitors’ sites receiving higher search result rankings. Internet search engines are increasingly placing alternative search features (such as featured snippets, local map results and other immersive experiences) on the search engine results page above or more prominently than search engine results. If our search result rankings are not prominently displayed, traffic to our websites may decline which could slow the growth of our user base. Our websites have experienced fluctuations in search result rankings in the past, and we anticipate similar fluctuations will occur in the future. If we experience a material reduction in the number of users directed to our websites through Internet search engines or otherwise fail to maintain or increase traffic to our marketplaces, our ability to acquire additional subscribers or advertisers and deliver leads to and retain existing subscribers and advertisers could be adversely affected. As a result, our business, results of operations and financial condition could be adversely affected. Our marketing expenses may increase in connection with our efforts to maintain or increase traffic to our websites. Increases in our operating expenses could negatively impact our operating results if we are unable to generate more revenues through increased sales of subscriptions to our marketplace products.\nCompetition could render our services uncompetitive and reduce our profitability. The markets for information systems and services and for online marketplaces in general are highly competitive and rapidly changing. Competition in these markets may increase further if economic conditions or other circumstances cause customer bases and customer spending to decrease and service providers to compete for fewer customer resources. Our existing or future competitors, may have greater name recognition, larger customer bases, better technology or data, lower prices, easier access to data, greater user traffic or greater financial, technical or marketing resources than we have to provide services that users might view as superior to our offerings. Competitors may introduce different solutions that attract users away from our services or provide solutions similar to ours that have the advantage of better branding or marketing resources. Our competitors may be able to undertake more effective marketing campaigns, obtain more data, adopt more aggressive pricing policies, make more attractive offers to potential employees, subscribers, advertisers, distribution partners and content providers or may be able to respond more quickly to new or emerging technologies or changes in user requirements. Increased competition could result in lower revenues and higher expenses, which would reduce our profitability.\nIf real estate professionals or other advertisers reduce or cancel their advertising spending with us and we are unable to attract new advertisers, our operating results would be harmed. Our marketplace businesses, including LoopNet, the Apartments.com network of rental websites, and the Land.com network of rural lands for-sale, depend on advertising revenues generated primarily through sales to persons in the real estate industry, including property managers and owners and other advertisers. Our ability to attract and retain advertisers, and ultimately to generate advertising revenue, depends on a number of factors, including:\n•Increasing the number of unique visitors to, and users of, our websites and mobile applications;\n•The quantity and quality of the leads that we provide to our advertisers;\n•The success of any marketing and product development efforts directed at attracting additional users and advertisers to our marketplaces;\n•Keeping pace with changes in technology and with our competitors; and\n•Offering an attractive return on investment to our advertisers for their advertising dollars spent with us.\nFurther, with respect to the Apartments.com network of rental websites, our ability to attract and retain advertisers also depends on the current apartment rental market and apartment vacancy rates. If vacancy rates are too high or too low, advertisers may not need to utilize our marketplace services.\nMany of the advertisers who advertise on our marketplaces do not have long-term contracts. These advertisers could choose to modify or discontinue their relationships with us with little or no advance notice. As existing subscriptions for advertising expire, we may not be successful in renewing these subscriptions or securing new subscriptions. We may not succeed in retaining existing advertisers’ spending or capturing a greater share of such spending if we are unable to convince advertisers of the effectiveness of our services as compared to alternatives. In addition, future changes to our pricing methodology for advertising services may cause advertisers to reduce or discontinue their advertising with us. If current advertisers reduce or end their advertising spending with us and we are unable to attract new advertisers, our advertising revenues and business, results of operations and financial condition could be adversely affected.\nIf we are not able to successfully identify, finance, integrate and/or manage costs related to acquisitions, our business operations and financial position could be adversely affected. We have expanded our markets and services in part through acquisitions of complementary businesses, services, databases and technologies, and expect to continue to do so in the future. Our acquisition strategy depends on our ability to identify, and the availability of, suitable acquisition candidates. We are likely to incur costs in connection with proposed acquisitions, but may ultimately be unable or unwilling to consummate any particular proposed transaction for various reasons. For example, the FTC recently withheld approval for our proposed acquisition of RentPath, the purchase agreement was subsequently terminated, and we incurred a termination fee of $52 million. We are also likely to incur severance costs and other integration costs post-acquisition. Costs in connection with acquisitions and integrations may be higher than expected and could adversely affect our financial condition, results of operation or prospects of the combined business. In addition, acquisitions involve numerous risks, including risks that we will not be able to realize or capitalize on synergies created through combinations; manage the integration of personnel and products or services; manage the integration of acquired infrastructure and controls; control potential increases in operating costs; manage geographically remote operations; maintain management’s attention on other business concerns and avoid potential disruptions in ongoing operations during an acquisition process or integration efforts; successfully enter markets and sectors in which we have either limited or no direct experience, including foreign markets whose practices, regulations or laws may pose increased risk; and retain key employees, clients or vendors and other business partners of the acquired companies. We may not successfully integrate acquired businesses or assets and may not achieve anticipated benefits of an acquisition, including expected synergies. For example, we may be unable to fully integrate STR, Ten-X and Homesnap with CoStar when and as expected.\nWe are subject to an FTC consent order, which is publicly available on the FTC's website at http://www.ftc.gov/, that, among other things, requires us to give the FTC advance notice of certain acquisitions. Compliance with this order could prevent us from closing certain acquisitions or add significant time and cost to such acquisitions, ultimately making an acquisition prohibitive or preventing us from realizing its anticipated benefits.\nExternal factors, such as compliance with laws and regulations, and shifting market preferences, may also impact the successful integration of an acquired business. An acquired business could strain our system of internal controls and diminish its effectiveness. Acquisitions could result in dilutive issuances of equity securities, the incurrence of debt, and substantial amortization expenses of other intangible assets. We may be unable to obtain financing on favorable terms, or at all, if necessary to finance future acquisitions, making it impossible or more costly to complete future acquisitions. If we are able to obtain financing, the terms may be onerous and restrict our operations. Further, certain acquisitions may be subject to regulatory approval, which can be time consuming and costly to obtain or may be denied, as in the case of RentPath. If regulatory approval is obtained, the terms of any such approval may impose limitations on our ongoing operations or require us to divest assets or lines of business. If regulatory approval is denied, we may incur significant, additional costs payable to an acquisition target as a result of failure to close the transaction. For example, we incurred a termination fee of $52 million in connection with termination of the RentPath purchase agreement. Significant break-up fees incurred in the future may adversely affect our results of operation and financial condition.\nAs a result of our acquisitions, we had approximately $2.7 billion of goodwill and intangibles as of December 31, 2020. Future acquisitions may increase this amount. If we are required to recognize goodwill and intangibles impairment charges in the future, this would negatively affect our financial results in the periods of such charges, which may reduce our profitability.\nOur actual or perceived failure to comply with privacy laws and standards could adversely affect our business, financial condition and results of operations. We depend on information technology networks and systems to process, transmit and store electronic information and to communicate among our locations around the world and with our clients and vendors. We collect, use and disclose personally identifiable information, such as names, addresses, phone numbers and email addresses. We collect, store and use biometric data and sensitive or confidential transaction and account information. We also collect personal information from tenants and landlords, including social security numbers, birthdates and financial information to facilitate the apartment rental application and payment process between a renter and property manager. As a result, we are subject to a variety of state, national, and international laws and regulations that apply to the collection, use, retention, protection, disclosure, transfer and other processing of personal data, including the Fair Credit Reporting Act, the General Data Protection Regulation (GDPR) and California Consumer Privacy Act (CCPA). These laws and regulations are evolving, with new or modified laws and regulations proposed and implemented frequently and existing laws and regulations subject to new or different interpretations. For example, the GDPR introduced new data protection requirements in the EU and imposes substantial fines for breaches of the data protection rules. The GDPR increased our responsibility and liability in relation to personal data that we process. Following the end of the Brexit transition on December 31, 2020, the EU and U.K. agreed, as part of a wider trade deal, a further transitional period at least another four months, extendable to six months, during which personal data may flow freely from the European Economic Area (the “EEA”) to the U.K.. During that period, the European Commission is considering whether to make an “adequacy decision” in favor of the U.K., finding that the U.K. offers protection of personal data equivalent to the EEA, which will allow data to continue to flow freely between the EEA and the U.K. On February 19, 2021, the European Commission published draft adequacy decisions. If no final adequacy decision is made in favor of the U.K. before the end of the further transitional period, because transfers of personal data between an EEA country and the U.K. will be transfers to a “third country”, we may be required to put in place additional mechanisms in place to enable transfers of data from EEA countries to the U.K. to ensure compliance with the GDPR. The CCPA, which became effective on January 1, 2020, expands the rights of California residents to access and require deletion of their personal information, opt out of certain personal information sharing and receive detailed information about how their personal information is used. The CCPA also provides for civil penalties for violations, as well as a private right of action for data breaches that may increase data breach litigation. Any failure or alleged failure to comply with the rules arising from the GDPR and related national laws of EU member states or the U.K., CCPA and other privacy or data protection laws adopted by other jurisdictions, could lead to government enforcement actions and significant penalties against us, and could materially adversely affect our reputation, business, financial condition, cash flows and results of operations. Compliance with any of the foregoing laws and regulations can be costly, can delay or impede the development of new products, and may require us to change the way we operate.\nThe interpretation and application of many privacy and data protection laws are uncertain. These laws may be interpreted and applied in a manner that is inconsistent with our existing data management practices or the features of our products. If so, in addition to the possibility of negative publicity, fines, lawsuits and other claims and penalties, we could be required to fundamentally change our business activities and practices or modify our products, which could harm our business.\nCyberattacks and security vulnerabilities could result in serious harm to our reputation, business, and financial condition. As stated above, our business involves the collection, storage, processing and transmission of customers’ personal data. We also collect, store and process employee personal data. An increasing number of organizations, including large merchants, businesses, technology companies and financial institutions, as well as government institutions, have disclosed breaches of their information security systems, some of which have involved sophisticated and highly targeted attacks, including on their websites, mobile applications, and infrastructure.\nThe techniques used to obtain unauthorized, improper or illegal access to a target's systems, data or customers' data, disable or degrade services, or sabotage systems are constantly evolving and have become increasingly complex and sophisticated, may be difficult to detect quickly and often are not recognized or detected until after they have been launched against a target. We expect that unauthorized parties will continue to attempt to gain access to our systems or facilities through various means, including hacking into our systems or facilities or those of our customers or vendors, or attempting to fraudulently induce (for example, through spear phishing attacks or social engineering) our employees, customers, vendors or other users of our systems into disclosing user names, passwords, or other sensitive information, which may in turn be used to access our information technology systems. Numerous and evolving cybersecurity threats, including advanced and persisting cyberattacks, phishing and social engineering schemes, could compromise the confidentiality, availability, and integrity of the data in our systems. Our efforts to prevent, detect and respond to data security incidents, may not be effective. Further, the security measures and procedures our customers, vendors and other users of our systems have in place to protect sensitive consumer data and other information may not be successful or sufficient to counter all data breaches, cyberattacks or system failures.\nOur information technology and infrastructure may be vulnerable to cyberattacks or security breaches, and third parties may be able to access our customers’ or employees’ personal or proprietary information that is stored on or accessible through those systems. We have experienced from time to time, and may experience in the future, breaches of our security measures due to human error, malfeasance, system errors or vulnerabilities or other irregularities. Actual or perceived breaches of our security could result in any of the following, among other things, any of which could adversely affect our business and results of operations:\n•Interrupt our operations,\n•Result in our systems or services being unavailable,\n•Result in improper disclosures of data,\n•Materially harm our reputation and brands,\n•Result in significant regulatory scrutiny and legal and financial exposure,\n•Cause us to incur significant remediation costs,\n•Lead to loss of customer confidence in, or decreased use of, our products and services,\n•Divert the attention of management from the operation of our business, and\n•Result in significant contractual penalties or other payments as a result of third-party losses or claims.\nIn addition, any cyberattacks or data security breaches affecting companies that we acquire or our customers or vendors (including data center and cloud computing providers) could have similar negative effects on our business. For example, In December 2020, we became aware that one of our vendors providing IT infrastructure management software, SolarWinds Corporation, had been compromised by cyberattacks. As of December 22, 2020, we had implemented the fully patched versions of the SolarWinds software and we took additional measures to block Internet connectivity to and from all SolarWinds' Orion servers. Although we have not identified any compromise of our IT systems due to the use of SolarWinds software to date, we continue to monitor our network for any potential impact related to the SolarWinds cyberattack. Any breach of our security measures or the loss, inadvertent disclosure or unapproved dissemination of proprietary information or sensitive or confidential data about us or our customers, including the potential loss or disclosure of such information or data as a result of the SolarWinds cyberattack, could result in litigation and potential liability for us, damage our brand and reputation or otherwise harm our business. The coverage under our insurance policies may not be adequate to reimburse us for losses caused by security breaches.\nTechnical problems or disruptions that affect either our customers’ ability to access our services, or the software, internal applications, database and network systems underlying our services, could damage our reputation and lead to reduced demand for our information, analytics and online marketplace services, lower revenues and increased costs. Our business, brands and reputation depend upon the satisfactory performance, reliability and availability of our websites, the Internet and our service providers. Interruptions in these systems, whether due to system failures, computer viruses, software errors, physical or electronic break-ins, or malicious hacks or attacks on our systems (such as denial of service attacks), could affect the security and availability of our services on our mobile applications and our websites and prevent or inhibit users' access to our services. Our operations also depend on our ability to protect our databases, computers and software, telecommunications equipment and facilities against damage from potential dangers such as fire, flood, power loss, security breaches, computer viruses, telecommunications failures, terrorist attacks, acts of war, electronic and physical break-ins, computer viruses, earthquakes and similar events.\nIn addition, the software, internal applications and systems underlying our services are complex and may not be error-free. We may encounter technical problems when we attempt to enhance our software, internal applications and systems. Our users rely on our services for the conduct of their own businesses. Disruptions in, technical problems with, or reductions in ability to access, our services for any reason could damage our users’ businesses, harm our reputation, result in additional costs or reduce demand for our information, analytics and online marketplace services, any of which could harm our business, results of operations and financial condition.\nThe majority of the communications, network and computer hardware used to operate our mobile applications and websites are located at facilities in Virginia and California. We do not own or control the operation of certain of these facilities. Our systems and operations are vulnerable to damage or interruption from fire, flood, power loss, security breaches, computer viruses, telecommunications failure, terrorist attacks, acts of war, electronic and physical break-ins, earthquakes and similar events. These risks may be increased with respect to operations housed at facilities we do not own or control. The occurrence of any of the foregoing events could result in damage to our systems and hardware or could cause them to fail completely, and our insurance may not cover such events or may be insufficient to compensate us for losses that may occur.\nA failure of our systems at any site could result in reduced functionality for our users, and a total failure of our systems could cause our mobile applications or websites to be inaccessible. Problems faced or caused by our information technology service providers, including content distribution service providers, private network providers, Internet providers and third-party web-hosting providers, or with the systems by which they allocate capacity among their customers (as applicable), could adversely affect the experience of our users. Any financial difficulties, such as bankruptcy reorganization, faced by these third-party service providers or any of the service providers with whom they contract may have negative effects on our business, the nature and extent of which are difficult to predict. If our third-party service providers are unable to keep up with our growing needs for capacity, our business could be harmed. In addition, if distribution channels for our mobile applications experience disruptions, such disruptions could adversely affect the ability of users and potential users to access or update our mobile applications, which could harm our business.\nOur business interruption insurance may not cover certain events or may be insufficient to compensate us for the potentially significant losses, including the potential harm to the future growth of our business, which may result from interruptions in our service as a result of system failures or malicious attacks. Any errors, defects, disruptions or other performance problems with our services could harm our reputation, business, results of operations and financial condition.\nOur current or future geographic expansion plans may not result in increased revenues, which may negatively impact our business, results of operations and financial position. Expanding into new markets and increasing the depth of our coverage in existing markets imposes additional burdens on our research, systems development, sales, marketing and general managerial resources. If we are unable to manage our expansion efforts effectively, if our expansion efforts take longer or are more expensive than planned or we are not successful in marketing and selling our services in existing or new markets, our expansion may have a material adverse effect on our financial position by increasing our expenses without increasing our revenues.\nOur operating results and revenues are subject to fluctuations and our quarterly financial results may be subject to market cyclicality, each of which could negatively affect our stock price. The real estate market may be influenced by general economic conditions, economic cycles, seasonality and many other factors, which in turn may impact our financial results. The different sectors of the large and fragmented industry, such as office, industrial, retail, multifamily, single family and others, are influenced differently by different factors, and have historically moved through economic cycles with different timing. As such, it is difficult to estimate the potential impact of economic cycles and conditions or seasonality from year-to-year on our overall operating results. We generally see higher sales of Apartments.com listing services during the peak summer rental season and higher CoStar Suite sales towards the end of the year, however sales fluctuate from year-to-year and may fluctuate more widely when there are changes in general economic conditions or the industry, such as changes resulting from the COVID-19\npandemic. In addition, we generally incur greater marketing expenses during the second quarter, which coincides with the peak season for apartment rentals. The timing of widely observed holidays and vacation periods, particularly slowdowns during the end-of-year holiday period, and availability of real estate agents and related service providers during these periods, could significantly affect our quarterly operating results during that period. If we are unable to adequately respond to economic, seasonal or cyclical conditions, our revenues, expenses and operating results may fluctuate from quarter to quarter. Our operating results, revenues and expenses may fluctuate for many reasons, including those described in this paragraph and below and elsewhere in this Annual Report on Form 10-K:\n•Rates of subscriber adoption and retention;\n•Timing of our sales conference or significant marketing events;\n•Changes in our pricing strategy and timing of changes;\n•The timing and success of new service introductions and enhancements;\n•The shift of focus from, or phase out of services that overlap or are redundant with other services we offer;\n•The amount and timing of our expenses and capital expenditures;\n•The amount and timing of non-cash stock-based charges;\n•Acquisition-related costs or impairment charges associated with such investments and acquisitions;\n•Competition;\n•Changes or consolidation in the real estate industry;\n•Interest rate fluctuations;\n•Execution of our expansion and integration plans;\n•The development of our sales force;\n•Foreign currency and exchange rate fluctuations;\n•Inflation; and\n•Changes in client budgets.\nThese fluctuations could negatively affect our results of operations during the period in question and/or future periods or cause our stock price to decline. In addition, changes in accounting policies or practices may affect our level of net income. Fluctuations in our financial results, revenues and expenses may cause the market price of our common stock to decline.\nFluctuating foreign currencies may negatively impact our business, results of operations and financial position. A portion of our business is denominated in foreign currencies. We translate sales and other results denominated in foreign currency into U.S. dollars for our financial statements. During periods of a strengthening U.S. dollar, our reported international sales and earnings could be reduced because foreign currencies may translate into fewer U.S. dollars. Foreign currency exchange rates have fluctuated and may continue to fluctuate. Significant foreign currency exchange rate fluctuations may negatively impact our international revenue, which in turn affects our consolidated revenue. Currently, we are not party to any hedging transactions intended to reduce our exposure to exchange rate fluctuations. We may seek to enter into hedging transactions in the future, but we may be unable to enter into these transactions successfully, on acceptable terms or at all. We cannot predict whether we will incur foreign exchange losses in the future. Further, significant foreign exchange fluctuations resulting in a decline in the respective local currency may decrease the value of our foreign assets, as well as decrease our revenues and earnings from our foreign subsidiaries, which would reduce our profitability and adversely affect our financial position.\nOur business depends on retaining and attracting highly capable management and operating personnel. Our success depends in large part on our ability to retain and attract management and operating personnel, including our President and Chief Executive Officer, Andrew Florance, and our other officers and key employees. Our business requires highly skilled technical, sales, management, web product and development, marketing and research personnel, who are in high demand and are often subject to competing offers. To retain and attract key personnel, we use various measures, including employment agreements, awards under a stock incentive plan and incentive bonuses for key employees. These measures may not be enough to retain and attract the personnel we need or to offset the impact on our business of the loss of the services of Mr. Florance or other key officers or employees.\nChanges in tax laws, regulations or fiscal and tax policies or the manner of their interpretation or enforcement could adversely impact our financial performance. New laws or regulations, or changes in existing laws or regulations, or the manner of their interpretation or enforcement, could increase our cost of doing business. For example, in December 2017, the United States enacted The Tax Cuts and Jobs Act (the \"Tax Act\"), and various provisions of the new law may adversely affect us. Certain aspects of Tax Reform are unclear and may not be clarified for some time. During 2018, the Department of the Treasury issued certain guidance in the form of notices and proposed regulations with respect to several provisions of the new legislation. We expect that additional regulations or other guidance may be issued with respect to the Tax Act in subsequent years. We continue to examine the impact this tax reform legislation may have on our business. In addition, if federal, state, local or\nforeign tax authorities change applicable tax laws or issue new guidance, including in response to the Tax Act, our overall taxes could increase, and our business, financial condition or results of operations may be adversely impacted.\nWe are subject to a number of risks related to acceptance of credit cards and debit cards and facilitation of other customer payments.\nWe depend on processing vendors to complete credit and debit card transactions. If we or our processing vendors fail to maintain adequate systems to authorize and process credit card transactions, one or more of the major credit card companies could disallow our continued use of their payment products. If we are unable to maintain our chargeback rate or refund rates at acceptable levels, our processing vendors may increase our transaction fees or terminate their relationships with us. We could lose customers if we are not able to continue to use payment products of the major credit card companies. In addition, if the systems to authorize and process credit card transactions fail to work properly and, as a result, we do not charge our customers’ credit cards on a timely basis or at all, our business, revenue, results of operations and financial condition could be harmed.\nWe depend on processing vendors to complete credit and debit card transactions and Automated Clearing House (ACH) payments, both for payments made to us directly for our services and for payments made by renters to landlords using our online leasing services. If we or any one or more of these service providers fail to maintain adequate systems for authorization and processing credit card payments, it could cause one or more of the major credit card companies to disallow our continued use of their payment products. Further, if we or any one or more of these service providers fail to maintain adequate systems for authorization and processing of credit, debit, ACH or similar payments or if any such service provider were to terminate or modify its relationship with us unexpectedly, our ability to process those customer transactions would be adversely affected, which could decrease sales, discourage customers away from our marketplace services, result in potential legal liability, and harm our business and reputation. In addition, if the systems for the authorization and processing of credit card transactions fail to work properly and, as a result, we do not charge our customers’ credit cards on a timely basis or at all, our business, revenue, results of operations and financial condition could be harmed.\nWe are also subject to payment card association operating rules, certification requirements and rules governing electronic funds transfers, which could change or be reinterpreted in ways that make it more difficult for us to comply. We are required to comply with payment card industry security standards. Failing to comply with those standards may violate payment card association operating rules, federal and state laws and regulations, and the terms of our contracts with payment processors. Any failure to comply also may subject us to fines, penalties, damages and civil liability, and may result in the loss of our ability to accept credit and debit card payments. Further, there is no guarantee that such compliance will prevent illegal or improper use of our payment systems or the theft, loss, or misuse of data pertaining to credit and debit cards, cardholders and transactions.\nThe payment methods that we offer also subject us to potential fraud and theft by criminals, who are becoming increasingly sophisticated, seeking to obtain unauthorized access to or exploit weaknesses that may exist in the payment systems. If we fail to comply with applicable rules or requirements for the payment methods we accept, or if payment-related data are compromised due to a breach of data, we may be liable for significant costs incurred by payment card issuing banks and other third parties or subject to fines and higher transaction fees, or our ability to accept or facilitate certain types of payments may be impaired. In addition, our customers could lose confidence in certain payment types, which may result in a shift to other payment types or potential changes to our payment systems that may result in higher costs. If we fail to adequately control fraudulent payment transactions, we may face civil liability, diminished public perception of our security measures and higher costs, each of which could harm our business, results of operations and financial condition.\nIf we are unable to maintain our chargeback rate or refund rates at acceptable levels, our processing vendors may increase our transaction fees or terminate their relationships with us. Any increases in our credit and debit card fees could harm our results of operations, particularly if we elect not to raise our rates for our services to offset the increase. The termination of our ability to process payments on any major credit or debit card would significantly impair our ability to operate our business.\nRisks related to our data, intellectual property and listings\nIf we are not able to obtain and maintain accurate, comprehensive or reliable data, we could experience reduced demand for our information, analytics and online marketplace services. Our success depends on our clients’ confidence in the comprehensiveness, accuracy and reliability of the data and analysis we provide. Establishing and maintaining accurate and reliable data and analysis is challenging. If our data, including the data we obtain from third parties or directly from brokers through the Marketing Center feature on CoStar and LoopNet, or analysis is not current, accurate, comprehensive or reliable, we could experience reduced demand for our services or be subject to legal claims by our customers, either of which could result in lower revenues and higher expenses.\nIf we are unable to enforce or defend our ownership and use of intellectual property, our business, brands, competitive position and operating results could be harmed. The success of our business depends in large part on our intellectual property, including intellectual property involved in our methodologies, databases, services and software. We rely on a combination of trademark, trade secret, patent, copyright and other laws, nondisclosure and noncompetition provisions, license agreements and other contractual provisions and technical measures to protect our intellectual property rights. However, current law may not provide for adequate protection of our databases and the actual data. In addition, legal standards relating to the validity, enforceability and scope of protection of proprietary rights in Internet-related businesses are uncertain and evolving, and changes in these standards may adversely impact the viability or value of our proprietary rights. We find our proprietary content on competitors' sites. If we are not successful in protecting our intellectual property, including our content, our brands and our business, results of operations and financial condition could be harmed. The same would be true if a court found that our services infringe other persons’ intellectual property rights. Any intellectual property lawsuits or threatened lawsuits in which we are involved, either as a plaintiff or as a defendant, have cost us and could continue to cost us a significant amount of time and money and distract management’s attention from operating our business. In addition, if we do not prevail on an intellectual property claim, this could result in a change to our methodology or information, analytics and online marketplace services and could reduce our profitability.\nEffective trademark, trade secret, patent, and copyright protection may not be available in every country in which we provide our services. The laws of certain countries do not protect proprietary rights to the same extent as the laws of the United States and, therefore, in certain jurisdictions, we may be unable to protect our intellectual property and our proprietary technology adequately against unauthorized third-party copying or use, which could harm our competitive position. This risk will increase as we continue to expand our business into new international jurisdictions.\nWe may not be able to successfully halt the operation of websites that aggregate our data, as well as data from other companies, or copycat websites that may misappropriate our data. Third parties may misappropriate our data through website scraping, robots or other means and aggregate and display this data on their websites. In addition, “copycat” websites may misappropriate data on our website and attempt to imitate our brands or the functionality of our website. We may not be able to detect all such websites in a timely manner and, even if we could, technological and legal measures available to us may be insufficient to stop their operations and the misappropriation of our data. Any measures that we may take to enforce our rights could require us to expend significant financial or other resources.\nWe may be subject to legal liability for collecting, displaying or distributing information. Because the content in our database is collected from various sources and distributed to others, we may be subject to claims for breach of contract, defamation, negligence, unfair competition or copyright or trademark infringement or claims based on other theories, such as breach of laws related to privacy and data protection. We could also be subject to claims based upon the content that is accessible from our website through links to other websites or information on our website supplied by third parties. Even if these claims do not result in liability to us, we could incur significant costs in investigating and defending against any claims and we could be subject to public notice requirements that may affect our reputation. Our potential liability for information distributed by us to others could require us to implement measures to reduce our exposure to such liability, which may require us to expend substantial resources and limit the attractiveness of our information, analytics and online marketplaces to users.\nIf we are unable to obtain or retain listings from real estate brokers, agents, property owners and apartment property managers, our marketplace services, could be less attractive to current or potential customers, which could reduce our revenues. The value of our real estate marketplace services to our customers depends on our ability to increase the number of property listings provided and searches conducted. As the number of listings increases, so does the utility of a marketplace's search, listing and marketing services. We depend substantially on brokers, agents, property owners and, in the case of apartment rentals, property managers to submit listings to our marketplaces. If these parties choose not to continue their listings with us, or choose to list them with a competitor, our CRE marketplace services could be less attractive to other real estate industry transaction participants, resulting in reduced revenue. Similarly, the value and utility of our other marketplaces, including the BizBuySell.com network of business for-sale websites, are also dependent on attracting and retaining listings.\nRisks related to our international operations\nInternational operations expose us to additional business risks, which may reduce our profitability. Our international operations and expansion subject us to additional business risks, including: currency exchange rate fluctuations; adapting to the differing business practices and laws in foreign countries; including differing laws regarding privacy and data protection; difficulties in managing foreign operations; limited protection for intellectual property rights in some countries; difficulty in collecting accounts receivable and longer collection periods; costs of enforcing contractual obligations; impact of recessions in economies outside the U.S.; and potentially adverse tax consequences. In addition, international expansion imposes additional burdens on our executive and administrative personnel, systems development, research and sales departments, and general\nmanagerial resources. If we are not able to manage our international operations successfully, we may incur higher expenses and our profitability may be reduced. Finally, the investment required for additional international expansion sometimes exceeds the profit generated from such expansion, which reduces our profitability and may adversely affect our financial position.\nThe economic effects of “Brexit” may affect relationships with existing and future customers and could have an adverse impact on our business and operating results. On June 23, 2016, the U.K. held a referendum in which British citizens approved an exit from the European Union (“E.U.”), commonly referred to as “Brexit.” On January 31, 2020, the U.K. officially withdrew from the E.U, beginning a transition period of negotiations between the British government and the E.U. and other governments. On December 24, 2020, the E.U. and the U.K. announced they had entered into a post-Brexit deal on certain aspects of trade and other strategic and political issues. The impact of Brexit, the December 2020 post-Brexit agreement and the future relationship between the E.U. and the U.K., including terms not addressed in the December 2020 agreement, remain uncertain. Such uncertainty could cause political and economic uncertainty in the U.K. and the rest of Europe, which could harm our business and financial results. In particular, Brexit caused and could continue to cause significant volatility in global equity markets, currency exchange rates and other asset prices, including those related to real property. Brexit may also lead to divergent national laws and regulations as the U.K. determines which E.U. laws to replace or replicate, and compliance with those laws and regulations may be cumbersome, difficult or costly. Further, Brexit may lead other E.U. member countries to consider referendums regarding their E.U. membership. We cannot yet predict the future implications of Brexit, including whether it could increase our cost of doing business or otherwise adversely affect our financial condition or results of operations. The impact to us from Brexit may affect not only our U.K. operations but operations in other parts of the E.U.\nRisks related to our indebtedness\nWe have a significant amount of indebtedness, which could decrease our flexibility and adversely affect our business, financial condition, and results of operations. As of December 31, 2020, we had approximately $1 billion of Senior Notes outstanding and an additional approximately $750 million available to be drawn under the 2020 Credit Agreement. There can be no assurance that our future cash flows will be sufficient to make payments of interest or principal on the Senior Notes or any amounts due and payable under the 2020 Credit Agreement. If our cash flows and capital resources are insufficient to fund our debt service obligations, we could face substantial liquidity problems and could be forced to reduce or delay investments and capital expenditures or to dispose of material assets or operations, seek additional debt or equity capital or restructure or refinance our indebtedness. We may not be able to effect any such alternative measures on commercially reasonable terms or at all, and, even if successful, those alternative actions may not allow us to meet our scheduled debt service obligations. Furthermore, we may incur substantial additional indebtedness, including secured indebtedness, and if we incur additional indebtedness or other liabilities, the related risks that we face could intensify.\nThe 2020 Credit Agreement contains customary restrictive covenants imposing operating and financial restrictions on us, including restrictions that may limit our ability to engage in acts that we believe may be in our long-term best interests. These covenants restrict our ability and the ability of our domestic subsidiaries to, among other things, (i) incur additional indebtedness, (ii) incur liens, (iii) pay dividends or make certain other restricted payments, investments or acquisitions, (iv) merge or consolidate with another person, and (v) sell, assign, lease or otherwise dispose of all or substantially all of our assets. In addition, the 2020 Credit Agreement requires us to comply with a maintenance covenant that we will not exceed a total net leverage ratio, calculated as total consolidated debt, net of up to $1.0 billion of unrestricted cash and cash equivalents, to consolidated EBITDA, of 4.50 to 1.00. The operating restrictions and financial covenants in the 2020 Credit Agreement may limit our ability to finance future operations or capital needs, to engage in other business activities or to respond to changes in market conditions. Our ability to comply with any financial covenants could be affected materially by events beyond our control, and we may be unable to satisfy any such requirements. If we fail to comply with these covenants, we may need to seek waivers or amendments of such covenants, seek alternative or additional sources of financing or reduce our expenditures. We may be unable to obtain such waivers, amendments or alternative or additional financing on a timely basis or at all, or on favorable terms.\nA breach of the covenants under the 2020 Credit Agreement or the indenture that governs the Senior Notes could result in an event of default under the applicable indebtedness. Such a default may allow the creditors to accelerate the related debt and may result in the acceleration of any other debt to which a cross-acceleration provision applies. In the event the holders of the Senior Notes or our other debt accelerate the repayment of our borrowings, we and our subsidiaries may not have sufficient assets to repay that indebtedness.\nOur borrowings under the 2020 Credit Agreement will carry a variable interest rate based on the Euro Interbank Offered Rate (“EURIBOR”) or the London Interbank Offered Rate (“LIBOR”) as a benchmark for establishing the rate of interest. LIBOR is the subject of recent national, international and other regulatory guidance and proposals for reform. The U.K. authority that regulates LIBOR announced that it will not compel banks to submit rates for the calculation of LIBOR after June\n2023. The full impact of any transition away from LIBOR remains unclear. We may need or seek to negotiate with our lenders for an alternative rate. We may not be able to agree with our lenders on a replacement reference rate that is as favorable as LIBOR, which may increase in the cost of our borrowings under the 2020 Credit Agreement.\nOur indebtedness increases our vulnerability to general adverse economic and industry conditions; requires us to dedicate a portion of our cash flow from operations to payments on indebtedness, reducing the availability of cash flow to fund capital expenditures, marketing and other general corporate activities; limits our ability to borrow additional funds; and may limit our flexibility in planning for, or reacting to, changes in our business and the industries in which we operate.\nA lowering or withdrawal of the ratings assigned to our debt securities by rating agencies may increase our future borrowing costs, reduce our access to capital or result in the loss of certain covenant suspensions. Our debt rating could be lowered or withdrawn entirely by a rating agency if, in that rating agency’s judgment, future circumstances relating to the basis of the rating, such as adverse changes, warrant. Any future lowering of our ratings likely would make it more difficult or more expensive for us to obtain additional debt financing.\nIn addition, the 2020 Credit Agreement provides that, during any period of time in which we maintain a corporate investment grade rating from any two of Standard & Poor’s Rating Services, Fitch Ratings, Inc. or Moody’s Investors Services, Inc. (such period, a “Covenant Suspension Period”), certain customary negative and affirmative covenants contained in the 2020 Credit Agreement are suspended, including the covenants restricting affiliate transactions, incurrence of indebtedness, investments, asset sales and restricted payments. A lowering of one or both of our investment grade ratings would result in increased compliance costs and would impose certain operating restrictions, either of which could be materially adverse to our operations and financial results.",
    "item_1B": "Item 1B. Unresolved Staff Comments\nNone.",
    "item_1C": "",
    "item_2": "Item 2. Properties\nOur headquarters is located at 1331 L Street, NW, in downtown Washington, DC, where we occupy approximately 169,093 square feet of office space, with a lease that expires May 31, 2025 (with two 5-year renewal options). Our headquarters is used primarily by our North America operating segment. Our principal facility in the U.K. is located in London, where we occupy 23,064 square feet of office space. Our lease for this facility has a term ending August 31, 2025. This facility is used by our International operating segment.\nWe also operate our research functions out of leased office spaces in Richmond, Virginia; San Diego, California; and Atlanta, Georgia. Additionally, we lease office space in a variety of other metropolitan areas. These locations include, among others, the following: Hendersonville, Tennessee; Irvine, California; Boston, Massachusetts; San Francisco, California; Ontario, California; and Los Angeles, California.\nWe believe these facilities are suitable and appropriately support our business needs.",
    "item_3": "Item 3. Legal Proceedings\nCurrently, and from time to time, we are involved in litigation incidental to the conduct of our business, including, among others, the legal actions discussed under “Contingencies” in Note 13 “Commitments and Contingencies” to our Financial Statements. While our management presently believes that the ultimate outcome of these proceedings, individually and in the aggregate, will not materially harm our business, financial position, future results of operations or liquidity, legal proceedings are inherently uncertain, and unfavorable rulings could, individually or in aggregate, have a material adverse effect on our business, financial position, future results of operations or liquidity.",
    "item_4": "Item 4. Mine Safety Disclosures\nNot Applicable.\nPART II",
    "item_5": "Item 5. Market for Registrant’s Common Equity, Related Stockholder Matters and Issuer Purchases of Equity Securities\nOur common stock is traded on the Nasdaq Global Select Market under the symbol “CSGP.” As of January 31, 2021, there were 1,751 holders of record of our common stock.\nDividend Policy. We have never declared or paid any dividends on our common stock. We do not anticipate paying any dividends on our common stock during the foreseeable future, but intend to retain any earnings for future growth of our business.\nRecent Issues of Unregistered Securities. We did not issue any unregistered securities during the year ended December 31, 2020.\nIssuer Purchases of Equity Securities. The following table is a summary of our repurchases of common stock during each of the three months in the quarter ended December 31, 2020:\nISSUER PURCHASES OF EQUITY SECURITIES\n(1) The number of shares purchased consists of shares of common stock tendered by employees to the Company to satisfy the employees' minimum tax withholding obligations arising as a result of vesting of restricted stock grants under the Company’s 2016 Stock Incentive Plan, as amended, which shares were purchased by the Company based on their fair market value on the trading day immediately preceding the vesting date. None of these share purchases were part of a publicly announced program to purchase common stock of the Company.\nStock Price Performance Graph\nThe stock performance graph below shows how an initial investment of $100 in our common stock would have compared to:\n•An equal investment in the Standards & Poor's Stock 500 (“S&P 500”) Index; and\n•An equal investment in the S&P 500 Internet Services & Infrastructure Index.\nThe comparison covers the period beginning December 31, 2015, and ending on December 31, 2020, and assumes the reinvestment of any dividends. Note that this performance is historical and is not necessarily indicative of future price performance.",
    "item_6": "Item 6. Selected Financial Data\nSelected Financial Data\n(in thousands, except per share data)\nThe following table provides selected consolidated financial data for the five years ended December 31, 2020. The consolidated statements of operations data shown below for each of the three years ended December 31, 2020, 2019 and 2018 and the consolidated balance sheet data as of December 31, 2020 and 2019 are derived from audited consolidated financial statements that are included in this report. The consolidated statements of operations data for each of the years ended 2017 and 2016 and the consolidated balance sheet data as of December 31, 2018, 2017 and 2016 shown below are derived from audited consolidated financial statements for those years that are not included in this report. Information about prior period acquisitions and the adoption of recent accounting pronouncements that may affect the comparability of the selected financial information presented below are included in \"Item 1. Business\" and Note 2 to the Notes to the Consolidated Financial Statements included in Part IV of this Annual Report on Form 10-K. The total assets and total long-term liabilities reported in the consolidated balance sheet data have been reclassified to conform to our current presentation as a result of the retrospective application of the authoritative guidance to simplify the presentation of debt issuance costs.\nThe following data should be read in conjunction with “Item 7. Management’s Discussion and Analysis of Financial Condition and Results of Operations,” “Item 8. Financial Statements and Supplementary Data,” and the other information contained elsewhere in this Annual Report on Form 10-K.",
    "item_7": "Item 7. Management’s Discussion and Analysis of Financial Condition and Results of Operations\nThe following Management’s Discussion and Analysis of Financial Condition and Results of Operations contains “forward-looking statements,” including statements about our beliefs and expectations. There are many risks and uncertainties that could cause actual results to differ materially from those discussed in the forward-looking statements. Potential factors that could cause actual results to differ materially from those discussed in any forward-looking statements include, but are not limited to, those stated above in Item 1A. under the headings “Risk Factors - Cautionary Statement Concerning Forward-Looking Statements” and “Risk Factors,” as well as those described from time to time in our filings with the Securities and Exchange Commission.\nAll forward-looking statements are based on information available to us on the date of this filing and we assume no obligation to update such statements, whether as a result of new information, future events or otherwise. The following discussion should be read in conjunction with our Quarterly Reports on Form 10-Q, Current Reports on Form 8-K and other filings with the Securities and Exchange Commission and the consolidated financial statements and related notes included in this Annual Report on Form 10-K.\nOverview\nOur principal information, analytics and online marketplace services are described in the following paragraphs by type of service:\nInformation and Analytics\nCoStar Suite®. Our subscription-based information services consist primarily of CoStar Suite services. CoStar Suite is sold as a platform of service offerings consisting of CoStar Property®, CoStar COMPS®, CoStar Market Analytics, CoStar Tenant®, CoStar Lease Comps and CoStar Public Record through our online and mobile applications. Our integrated suite of online service offerings includes information about space available for lease, comparable sales information, information about properties for sale, tenant information, Internet marketing services, analytical capabilities, information for clients' websites, information about industry professionals and their business relationships, and industry news. Our commercial real estate sales force is currently responsible for selling multiple product lines, including CoStar Suite and LoopNet. Starting in late 2019, we shifted the focus of our sales force to sales of LoopNet Diamond, Platinum and Gold Ads. As a result of this shift, as well as the continued impact of COVID-19 on our current and potential customer base, we saw a decline in CoStar Suite revenue growth rates in 2020 compared to 2019 growth rates and expect similar growth rates throughout 2021.\nInformation services. We provide real estate and lease management technology solutions, including lease administration, lease accounting and abstraction services, through our CoStar Real Estate Manager® service offerings, as well as portfolio and debt analysis, management and reporting capabilities through our CoStar Investment Analysis and CoStar Risk Analytics® service offerings. On October 22, 2019, we acquired STR and we now also provide STR’s complementary benchmarking and analytics services to the hospitality industry. STR sells the majority of its services on a subscription basis, but also receives one-time or ad hoc transaction fee revenues. We provide information services internationally, through our Grecam, Belbex and Thomas Daily businesses in France, Spain and Germany, respectively. The growth rates of information services increased in 2020 compared to 2019 primarily due to the STR acquisition. The hospitality industry has been severely impacted by COVID-19, as a result, revenue for STR declined in the second quarter of 2020 and increased moderately during the remainder of the year. We anticipate STR revenue and overall information services growth rates to moderate during 2021.\nOnline Marketplaces\nMultifamily. Apartments.comTM is part of our network of apartment marketing sites, which primarily includes ApartmentFinder®, ForRent.com®, ApartmentHomeLiving.comTM, Apartamentos.comTM, Westside Rentals, and Off Campus Partners, LLC (\"OCP\"). Our network of subscription-based advertising services provides property management companies and landlords with a comprehensive advertising destination for their available rental units and offers renters a platform for searching for available rentals. During 2020, multifamily revenue growth rates generally continued to increase relative to 2019 revenue growth rates as tenants, property owners and landlords continued to transact in our digital environment.\nCommercial property and land. Our LoopNet.com network of commercial real estate websites offer subscription-based, online marketplace services that enable commercial property owners, landlords and real estate agents working on their behalf to advertise properties for sale or for lease and to submit detailed information about property listings. Commercial real estate agents, buyers and tenants use the LoopNet.com network of online marketplace services to search for available property listings that meet their criteria. On June 24, 2020, we acquired Ten-X, an online auction platform for commercial real estate. On\nDecember 22, 2020, we acquired Homesnap, an industry-leading online and mobile software platform that provides user-friendly applications to optimize residential real estate agent workflow and reinforce the agent-client relationship. Our BizBuySell network, which includes BizQuest® and FindaFranchise, and our Land.com network of sites, which includes LandsofAmerica, LandAndFarm and LandWatch®, are also included in our commercial property and land service revenue. The BizBuySell network provides online marketplaces for businesses for-sale and our Land.com network of sites provide online marketplaces for rural lands for-sale. As part of our rebuild and launch of the LoopNet Diamond, Platinum and Gold Ads products during the fourth quarter of 2019, we shifted the focus of our commercial real estate sales force to LoopNet Ads. As a result, the LoopNet revenue growth rate increased in the fourth quarter of 2019. Growth was flat during the first half of 2020 as LoopNet.com sales volumes declined and cancellations increased as a result of COVID-19 and its impact on the commercial real estate industry. During the second half of 2020, we saw an increase in sales and expect LoopNet revenue growth rates to continue at those levels in 2021. Overall, revenues in commercial property and land increased during 2020 compared to 2019 primarily due to revenue from our newly acquired online auction platform, Ten-X and, to a lesser extent, revenue growth from LoopNet.com. Overall, we expect an increase in the commercial property and land growth rates in 2021 compared to 2020 primarily due to the Homesnap acquisition and continued impact of the Ten-X acquisition.\nImpact of the COVID-19 Pandemic\nA novel strain of coronavirus known as \"COVID-19\" was first identified in Wuhan, China in December 2019, and was subsequently declared a pandemic by the World Health Organization on March 11, 2020. COVID-19 has surfaced in nearly all regions around the world and resulted in travel restrictions and business slowdowns or shutdowns in affected areas. The full impact of the COVID-19 pandemic is unknown and is evolving as the pandemic continues. The COVID-19 pandemic did not materially affect our consolidated financial statements for the year ended December 31, 2020.\nWe are closely and continually monitoring the impact of the COVID-19 pandemic on our business, employees, customers, and communities. To protect the health and safety of our employees and to help stop the spread of the disease, we shifted to a digital, remote workplace in mid-March 2020. As of that time, nearly all of our employees began to work from home and continue to do so as of the date of this filing. We have temporarily shifted certain employees’ job responsibilities so they can work from home and modified our in-person research and sales processes so that they can be conducted safely and in compliance with social distancing guidelines to protect our employees, our customers and our communities. We believe our employees are operating at near normal levels of productivity in this digital environment. We continue to monitor events related to the pandemic, as well as the guidelines and mandates provided by governmental and health authorities. We plan to continue adapting our business operations when and as deemed appropriate to comply with these guidelines and mandates and to respond to changing circumstances.\nIn connection with the shift to work from home, we incurred and may continue to incur expenses to help employees perform their jobs effectively and securely. In preparation for an eventual return to work in the office, we have also incurred and expect to continue to incur expenses to help protect the health and safety of our employees and visitors. In response to the COVID-19 pandemic, we have taken steps to manage our costs, including minimizing hiring to essential positions, restricting business travel and canceling in-person marketing events. We expect to continue to minimize travel and restrict in-person marketing events during the first half of 2021. Overall, the increased direct spend related to the COVID-19 pandemic, including office reconfiguration, has not been material to date and has had minimal impact on our financial position and operating results as these expenses have been generally offset by the cost savings described above. As the situation evolves, we may implement additional cost reductions.\nCurrent general economic conditions in the U.S. and the world as a result of the COVID-19 pandemic are negatively affecting business operations for our clients and are expected to result in business consolidations and, in certain circumstances, failures. In general, customers are seeking to reduce expenses as a result of current economic conditions. The extent and duration of any future continued weakening of the global economy is unknown. There can be no assurance that any of the governmental or private sector initiatives designed to strengthen the U.S. and other economies will ultimately be successful or available to us and our customers, and, if successful, when the benefits will be available or seen. Because of the rapidly evolving nature of the COVID-19 pandemic and responses to it by, and the impact on, global economies, our revenue or earnings forecasts may not prove to be accurate. Any expected changes in financial results discussed in this report, including any expected impact of COVID-19, are based on our current observations and experience and involve estimates and assumptions. As the extent and duration of the impacts from COVID-19 remain unclear, our estimates and assumptions may evolve as conditions change. Our current observations and past experience and results may not be an indicator of ongoing trends or future results, and actual results could differ significantly from our estimates and expectations.\nOur near-term revenues are relatively predictable as a result of our subscription-based business model; however, we expect that we will continue to experience the effects of the COVID-19 pandemic on our business, results of operations and overall\nfinancial performance. Such effects may include, among others, a decrease in new customer sales and increases in customer cancellations, suspensions, service reductions and failures to pay or delays in payments of amounts owed to us. We are more likely to incur asset impairment charges or restructuring charges, or further increase our allowance for credit losses, as a result of this crisis and related economic downturn, which could adversely affect our results of operations. The amount and frequency of such actions will be affected by the severity and duration of the COVID-19 pandemic. We experienced a decrease in net new bookings of subscription-based services and an increase in customer requests for cancellations and suspensions towards the end of the first quarter of 2020 that continued through May 2020; however, those requests have eased since then, and sales related to marketplace service offerings have returned to pre-pandemic levels. During 2020, we increased the allowance for credit loss as a result of increased write-off trends and increased the forecasted credit loss estimate on high credit risk customers to reflect the uncertainty around the duration and speed of an economic recovery in the first three quarters of 2020. However, the credit loss expense normalized in the fourth quarter of 2020. Due to the uncertainty associated with the COVID-19 pandemic, we will continue to monitor customer behavior and its impact on our results of operations. See Note 3 in this Annual Report on Form 10-K for further discussion.\nWe strengthened our liquidity position through an equity offering of common stock in May 2020 and an offering of Senior Notes and amendment and restatement of our credit facility in early July 2020. See Note 11 and Note 15 in this Annual Report on Form 10-K for further discussion of our recent equity and Senior Notes offerings and our 2020 Credit Agreement. The effects of the pandemic have not affected our ability to date to access funding on reasonably similar terms as were available to us prior to March 2020. We discuss the current and potential impact of select provisions of the CARES Act (defined below) in our liquidity discussion.\nFor the years ended December 31, 2020, 2019 and 2018 our annualized net new bookings of subscription-based services on all contracts were approximately $184 million, $210 million and $169 million, respectively, calculated based on the annualized amount of change in our sales resulting from all new subscription-based contracts or upsales on all existing subscription-based contracts, less write downs and cancellations, for the period reported. We recognize subscription revenues on a straight-line basis over the life of the contract. Net bookings is considered a key indicator of future subscription revenue growth and is also used as a metric of salesforce productivity by management and investors.\nFor the years ended December 31, 2020, 2019 and 2018, our contract renewal rate for existing CoStar subscription-based services on annual contracts was approximately 89%, 90% and 90% respectively, and, therefore, our cancellation rate for those services was approximately 11%, 10%, and 10%, respectively. Our contract renewal rate is a quantitative measurement that is typically closely correlated with our revenue results. As a result, management also believes that the rate may be a reliable indicator of short-term and long-term performance. Our trailing twelve-month contract renewal rate may decline if, among other reasons, negative economic conditions lead to greater business failures and/or consolidations among our clients, reductions in customer spending, or decreases in our customer base.\nDevelopment, Investments and Expansion\nWe plan to continue to invest in our business and our services, evaluate strategic growth opportunities, and pursue our key priorities as described below, while we closely monitor the economic developments from the COVID-19 pandemic and manage our response to such developments. We are committed to supporting, improving and enhancing our information, analytics and online marketplace solutions, including expanding and improving our offerings for our client base and site users, including property owners, property managers, buyers, commercial tenants and residential renters. We expect to continue our software development efforts to improve existing services, introduce new services, integrate and cross-sell services, integrate recently completed acquisitions and expand and develop supporting technologies for our research, sales and marketing organizations. We may reevaluate our priorities as the COVID-19 pandemic continues to evolve.\nOur key priorities for 2021 currently include:\n•Integrating and developing service offerings of recently completed acquisitions, including STR, Ten-X and Homesnap, with our business operations. We are consolidating STR data and services with CoStar Suite to create an integrated platform. We expect that the combination of STR's and CoStar's offerings will allow us to create valuable new and improved tools for industry participants. We plan to drive international expansion, in part, through STR's global operations and to apply STR's benchmarking expertise to other commercial real estate segments we serve. We are working on integrating the Ten-X platform with both LoopNet and CoStar, to expand the audience for Ten-X auctions to include our online commercial real estate users. To increase exposure, we have upgraded LoopNet listings for properties to be auctioned on Ten-X and are allocating banner space on both our CoStar and LoopNet sites to Ten-X to\ncross-market our services. Our Homesnap team is creating new and improved tools to help agents promote their residential listings, connect with buyers and sellers and streamline their daily workflow.\n•Continuing to invest in the LoopNet marketplace and the Ten-X auction platform. We are enhancing the content on LoopNet.com (including high-quality imagery), seeking targeted advertisements, providing premium listing services (such as LoopNet Diamond, Platinum, and Gold Ads) that increase a property listing’s exposure, and adding more content for premium listings to better meet the needs of a broader cross section of the commercial real estate industry. We have started recruiting and developing a dedicated sales team to help support and grow the business. To support the LoopNet marketplace, we implemented training and incentive programs for our sales team to increase sales of LoopNet Ads, with a focus on brokers and property owners. We plan to expand the Ten-X sales force during 2021 and focus on increasing the number of qualified bidders and the number of owners bringing properties to the site. To generate brand awareness and site traffic for the LoopNet.com network and Ten-X, we plan to significantly increase our investment in marketing and utilize a multi media marketing campaign, reinforced with search engine optimization efforts. We will continue to work to determine the optimal level of marketing investment for each of these services for future periods.\n•Continuing to invest in CoStar Suite, including capabilities that allow us to broaden the reach of CoStar Suite internationally by offering multiple languages and currencies on the platform. We plan to enhance CoStar Suite by making additional investments in analytical and service capabilities focused on lenders and owners of commercial real estate. We also recently acquired Emporis GmbH, a Germany-based provider of international commercial real estate data and images that we are integrating into CoStar. In addition, we plan to invest in the technology and infrastructure of our other existing service offerings and the backend systems that support our offerings.\n•Continuing to develop, improve and market our Apartments.com service offerings that focus on creating the best and most comprehensive consumer rental search experience as well as continuing to advance the digital rental experience that allows renters to apply for leases and make rent payments, and for landlords to run tenant credit and background checks, all online through a single platform. We seek user feedback as we work to improve our services and continue to aggressively market our multifamily listing services in an effort to provide more value to consumers and, in turn, to attract advertisers. Our Apartments.com marketing investment is focused on enhanced brand awareness and search engine marketing. As we continue to assess the success and effectiveness of our marketing campaign, we will continue to work to determine the optimal level and focus of our marketing investment for our services for future periods and may adjust our marketing spend and focus as we deem appropriate.\nTo support our continued expansion and development, in 2020, we completed a public equity offering, a senior notes offering and the refinancing of our revolving credit facility. In May 2020, we completed a public equity offering of 2.6 million shares of common stock for $655 per share. Net proceeds from the public equity offering were approximately $1.7 billion, after deducting approximately $35 million of underwriting fees, commissions and other stock issuance costs. We expect to use the net proceeds from the public equity offering to fund all or a portion of the costs of any strategic acquisitions we pursue in the future, to finance the growth of our business and/or for working capital and other general corporate purposes. General corporate purposes may include additions to working capital, capital expenditures, repayment of debt, investments in our subsidiaries, and the repurchase, redemption or retirement of securities, including our common stock.\nOn July 1, 2020, we issued $1.0 billion aggregate principal amount of 2.800% Senior Notes due July 15, 2030 (the “Senior Notes”). Interest on the Senior Notes is payable semi-annually in arrears beginning January 15, 2021. We may redeem the Senior Notes in whole or in part (a) at any time prior to April 15, 2030, at a redemption price equal to 100% of the principal amount of the Senior Notes, plus the Applicable Premium (as calculated in accordance with the indenture governing the Senior Notes) as of, and any accrued and unpaid interest, if any, on the principal amount of Senior Notes being redeemed to, but excluding, the redemption date, and (b) on or after April 15, 2030, at a redemption price equal to 100% of the principal amount of the Senior Notes, plus any accrued and unpaid interest, if any, on the principal amount of Senior Notes being redeemed to, but excluding, the redemption date. We used a portion of the net proceeds from the issuance of the Senior Notes to repay outstanding borrowings under the 2017 Credit Agreement, and we intend to use the remaining proceeds to fund all or a portion of the costs of any strategic acquisitions we pursue in the future, to finance the growth of our business and/or for working capital and other general corporate purposes.\nOn July 1, 2020, we also entered into a second amended and restated credit agreement (the “2020 Credit Agreement”), which amended and restated in its entirety our existing credit agreement (the \"2017 Credit Agreement\"). The 2020 Credit\nAgreement provides for a $750 million revolving credit facility with a term of five years and a letter of credit sublimit of $20 million from a syndicate of financial institutions as lenders and issuing banks. On July 1, 2020, we repaid the outstanding borrowings under our existing $750 million revolving credit facility pursuant to the 2017 Credit Agreement using the proceeds from the issuance of the Senior Notes. Funds drawn down on the revolving credit facility pursuant to the 2020 Credit Agreement may be used for working capital and other general corporate purposes. The 2020 Credit Agreement, along with the proceeds from the May equity offering, the July Senior Notes offering and cash generated by our business are expected to support our continued growth and give us flexibility to act on strategic acquisition opportunities that may arise. See Notes 11 and 15 in this Annual Report on Form 10-K for further discussion of our recent equity and Senior Notes offerings and our 2020 Credit Agreement.\nWe intend to continue to assess the need for additional investments in our business, in addition to the investments discussed above, in order to develop and distribute new services and functionality within our current platform or expand the reach of, or otherwise improve, our current service offerings. Any future product development or expansion of services, combination and coordination of services or elimination of services or corporate expansion, development or restructuring efforts could reduce our profitability and increase our capital expenditures. Any new investments, changes to our service offerings or other unforeseen events could cause us to experience reduced revenues or generate losses and negative cash flow from operations in the future. Any development efforts must comply with our credit facility, which contains restrictive covenants that restrict our operations and use of our cash flow and may prevent us from taking certain actions that we believe could increase our profitability or otherwise enhance our business.\nFor further discussion of our Company, strategy and products, see our business overview set forth in \"Item 1. Business\" in this Annual Report on Form 10-K.\nNon-GAAP Financial Measures\nWe prepare and publicly release quarterly unaudited financial statements prepared in accordance with generally accepted accounting principles (“GAAP”). We also disclose and discuss certain non-GAAP financial measures in our public releases, investor conference calls and filings with the Securities and Exchange Commission. The non-GAAP financial measures that we may disclose include net income before interest (expense) income and other (expense) income, loss on debt extinguishment, income taxes, depreciation and amortization (“EBITDA”), adjusted EBITDA, adjusted EBITDA margin, non-GAAP net income and non-GAAP net income per diluted share. EBITDA is our net income before interest (expense) income and other (expense) income, loss on debt extinguishment, income taxes, depreciation and amortization. We typically disclose EBITDA on a consolidated and an operating segment basis in our earnings releases, investor conference calls and filings with the Securities and Exchange Commission. Adjusted EBITDA is different from EBITDA because we further adjust EBITDA for stock-based compensation expense, acquisition- and integration-related costs, restructuring costs and settlements and impairments incurred outside our ordinary course of business. Adjusted EBITDA margin represents adjusted EBITDA divided by revenues for the period. Non-GAAP net income is determined by adjusting our net income for stock-based compensation expense, acquisition- and integration-related costs, restructuring costs, settlement and impairment costs incurred outside our ordinary course of business and loss on debt extinguishment, as well as amortization of acquired intangible assets and other related costs, and then subtracting an assumed provision for income taxes. Non-GAAP net income per diluted share is a non-GAAP financial measure that represents non-GAAP net income divided by the number of diluted shares outstanding for the period used in the calculation of GAAP net income per diluted share.\nWe may disclose adjusted EBITDA, adjusted EBITDA margin, non-GAAP net income and non-GAAP net income per diluted share on a consolidated basis in our earnings releases, investor conference calls and filings with the Securities and Exchange Commission. The non-GAAP financial measures that we use may not be comparable to similarly titled measures reported by other companies. Also, in the future, we may disclose different non-GAAP financial measures in order to help our investors meaningfully evaluate and compare our results of operations to our previously reported results of operations or to those of other companies in our industry.\nWe view EBITDA, adjusted EBITDA, adjusted EBITDA margin, non-GAAP net income and non-GAAP net income per diluted share as operating performance measures. We believe that the most directly comparable GAAP financial measure to EBITDA, adjusted EBITDA and non-GAAP net income is net income. We believe the most directly comparable GAAP financial measures to non-GAAP net income per diluted share and adjusted EBITDA margin are net income per diluted share and net income divided by revenue, respectively. In calculating EBITDA, adjusted EBITDA, adjusted EBITDA margin, non-GAAP net income and non-GAAP net income per diluted share, we exclude from net income the financial items that we believe should be separately identified to provide additional analysis of the financial components of the day-to-day operation of our business. We have outlined below the type and scope of these exclusions and the material limitations on the use of these non-GAAP financial measures as a result of these exclusions. EBITDA, adjusted EBITDA, adjusted EBITDA margin, non-GAAP\nnet income and non-GAAP net income per diluted share are not measurements of financial performance under GAAP and should not be considered as a measure of liquidity, as an alternative to net income or as an indicator of any other measure of performance derived in accordance with GAAP. Investors and potential investors in our securities should not rely on EBITDA, adjusted EBITDA, adjusted EBITDA margin, non-GAAP net income and non-GAAP net income per diluted share as a substitute for any GAAP financial measure, including net income and net income per diluted share. In addition, we urge investors and potential investors in our securities to carefully review the GAAP financial information included as part of our Annual Reports on Form 10-K and Quarterly Reports on Form 10-Q that are filed with the Securities and Exchange Commission, as well as our quarterly earnings releases, and compare the GAAP financial information with our EBITDA, adjusted EBITDA, adjusted EBITDA margin, non-GAAP net income and non-GAAP net income per diluted share.\nEBITDA, adjusted EBITDA, adjusted EBITDA margin, non-GAAP net income and non-GAAP net income per diluted share may be used by management to internally measure our operating and management performance and may be used by investors as supplemental financial measures to evaluate the performance of our business. We believe that these non-GAAP measures, when viewed with our GAAP results and accompanying reconciliations, provide additional information to investors that is useful to understand the factors and trends affecting our business without the impact of certain acquisition-related items. We have spent more than 30 years building our database of commercial real estate information and expanding our markets and services partially through acquisitions of complementary businesses. Due to these acquisitions, our net income has included significant charges for amortization of acquired intangible assets, depreciation and other amortization, acquisition- and integration-related costs, restructuring costs, and loss on debt extinguishment. Adjusted EBITDA, adjusted EBITDA margin, non-GAAP net income and non-GAAP net income per diluted share exclude these charges and provide meaningful information about the operating performance of our business, apart from charges for amortization of acquired intangible assets, depreciation and other amortization, acquisition- and integration-related costs, restructuring costs; settlement and impairment costs incurred outside our ordinary course of business. We believe the disclosure of non-GAAP measures can help investors meaningfully evaluate and compare our performance from quarter to quarter and from year to year without the impact of these items. We also believe the non-GAAP measures we disclose are measures of our ongoing operating performance because the isolation of non-cash charges, such as amortization and depreciation, and other items, such as interest (expense) income and other (expense) income, income taxes, stock-based compensation expenses, acquisition- and integration-related costs, restructuring costs, loss on debt extinguishment and settlement and impairment costs incurred outside our ordinary course of business, provides additional information about our cost structure, and, over time, helps track our operating progress. In addition, investors, securities analysts and others have regularly relied on EBITDA and may rely on adjusted EBITDA, adjusted EBITDA margin, non-GAAP net income or non-GAAP net income per diluted share to provide a financial measure by which to compare our operating performance against that of other companies in our industry.\nSet forth below are descriptions of financial items that have been excluded from net income to calculate EBITDA and the material limitations associated with using this non-GAAP financial measure as compared to net income:\n•Amortization of acquired intangible assets in cost of revenues may be useful for investors to consider because it represents the diminishing value of any acquired trade names and other intangible assets and the use of our acquired technology, which is one of the sources of information for our database of commercial real estate information. We do not believe these charges necessarily reflect the current and ongoing cash charges related to our operating cost structure.\n•Amortization of acquired intangible assets in operating expenses may be useful for investors to consider because it represents the estimated attrition of our acquired customer base. We do not believe these charges necessarily reflect the current and ongoing cash charges related to our operating cost structure.\n•Depreciation and other amortization may be useful for investors to consider because they generally represent the wear and tear on our property and equipment used in our operations. We do not believe these charges necessarily reflect the current and ongoing cash charges related to our operating cost structure.\n•The amount of interest (expense) income and other (expense) income we generate and incur may be useful for investors to consider and may result in current cash inflows and outflows. However, we do not consider the amount of interest (expense) income and other (expense) income to be a representative component of the day-to-day operating performance of our business.\n•Income tax expense may be useful for investors to consider because it generally represents the taxes which may be payable for the period and the change in deferred income taxes during the period and may reduce the amount of funds\notherwise available for use in our business. However, we do not consider the amount of income tax expense to be a representative component of the day-to-day operating performance of our business.\n•The amount of loss on our debt extinguishment may be useful for investors to consider because it generally represents losses from the early extinguishment of debt. However, we do not consider the amount of the loss on debt extinguishment to be a representative component of the day-to-day operating performance of our business.\nSet forth below are descriptions of additional financial items that have been excluded from EBITDA to calculate adjusted EBITDA and the material limitations associated with using this non-GAAP financial measure as compared to net income:\n•Stock-based compensation expense may be useful for investors to consider because it represents a portion of the compensation of our employees and executives. Determining the fair value of the stock-based instruments involves a high degree of judgment and estimation and the expenses recorded may bear little resemblance to the actual value realized upon the future exercise or termination of the related stock-based awards. Therefore, we believe it is useful to exclude stock-based compensation in order to better understand the long-term performance of our core business.\n•The amount of acquisition- and integration-related costs incurred may be useful for investors to consider because such costs generally represent professional service fees and direct expenses related to acquisitions. Because we do not acquire businesses on a predictable cycle, we do not consider the amount of acquisition- and integration-related costs to be a representative component of the day-to-day operating performance of our business.\n•The amount of settlement and impairment costs incurred outside of our ordinary course of business may be useful for investors to consider because they generally represent gains or losses from the settlement of litigation matters or impairments on acquired intangible assets. We do not believe these charges necessarily reflect the current and ongoing cash charges related to our operating cost structure.\n•The amount of restructuring costs incurred may be useful for investors to consider because they generally represent costs incurred in connection with a change in a contract or a change in the makeup of our properties or personnel. We do not consider the amount of restructuring related costs to be a representative component of the day-to-day operating performance of our business.\nThe financial items that have been excluded from our net income to calculate non-GAAP net income and non-GAAP net income per diluted share are amortization of acquired intangible assets and other related costs, stock-based compensation, acquisition- and integration-related costs, restructuring and related costs and settlement and impairment costs incurred outside our ordinary course of business. These items are discussed above with respect to the calculation of adjusted EBITDA together with the material limitations associated with using this non-GAAP financial measure as compared to net income. In addition to these exclusions from net income, we subtract an assumed provision for income taxes to calculate non-GAAP net income. In 2020 and 2019, we assumed a 25% tax rate, which approximated our historical long-term statutory corporate tax rate, excluding the impact of discrete items.\nManagement compensates for the above-described limitations of using non-GAAP measures by using a non-GAAP measure only to supplement our GAAP results and to provide additional information that is useful to investors to understand the factors and trends affecting our business.\nThe following table shows our net income reconciled to our EBITDA and our net cash flows from operating, investing and financing activities for the indicated periods (in thousands):\nConsolidated Results of Operations\nThe following table provides our selected consolidated results of operations for the indicated periods (in thousands and as a percentage of total revenue):\nThe following table provides our revenues by type of service (in thousands and as a percentage of total revenue):\n(1) For further discussion of our Company, strategy and products, see our business overview set forth in \"Item 1. Business\" in this Annual Report on Form 10-K.\nComparison of Year Ended December 31, 2020 and Year Ended December 31, 2019\nThe following table provides a comparison of our selected consolidated results of operations for the years ended December 31, 2020 and 2019 (in thousands):\nRevenues. Revenues increased to $1.7 billion in 2020, from $1.4 billion in 2019. The $259 million increase was primarily attributable to an $108 million, or 22%, increase in multifamily revenue. The multifamily increase was due to upsells of existing customer packages to higher value advertising packages, and higher sales volume due to an increase in property listings as a result of recent investments in marketing. Commercial property and land revenue increased $63 million, or 31%, due to revenue of $32 million from the acquisition of Ten-X, and growth in our LoopNet online marketplace services of $30 million as a result of stronger site traffic, driving sales of higher value advertisements. CoStar Suite revenues increased $47 million, or 8%, primarily due to renewal price increases from prior periods and, to a lesser extent, higher sales volume due to an increase in subscribers. Information services revenue increased $41 million, or 47%, primarily due to $44 million from the acquisition of STR, partially offset by a decrease of $2 million in revenue for our CoStar Real Estate Manager service offerings.\nGross Profit. Gross profit increased to $1.4 billion in 2020, from $1.1 billion in 2019. The gross profit percentage was 81% for 2020 compared to 79% for 2019. The increase in gross profit was due to higher revenues partially impacted by an increase in cost of revenues of $20 million, or 7%, mostly due to the acquisitions of STR and Ten-X, which were the primary drivers of higher personnel costs of $12 million, and increased intangible asset amortization of $4 million, and to a lesser extent, increases in bank and merchant fees of $4 million and IT equipment and office supplies of $4 million related to employees directly supporting our customers as they transitioned to working from home during the COVID-19 pandemic. These increases were partially offset by a $4 million decrease in travel and entertainment expenses for research and product support employees.\nSelling and Marketing Expenses. Selling and marketing expenses increased to $536 million in 2020, from $409 million in 2019. The increase was primarily attributable to $92 million in additional marketing spend, including $57 million in search engine marketing, primarily for Apartments.com and LoopNet, a $40 million increase in marketing agency fees, and a $6 million increase in other forms of marketing, led by digital, partially offset by a decrease in event spending of $11 million. In addition, the increase in expenses was caused by higher personnel costs of $40 million driven by the acquisitions of STR and Ten-X, as well as, higher sales commissions, in addition to $2 million increases in each of occupancy and supplies. These increases were partially offset by a $9 million decrease in travel and entertainment expense.\nSoftware Development Expenses. Software development expenses increased to $163 million in 2020, from $126 million in 2019, and increased as a percentage of revenues to 10% in 2020, compared to 9% in 2019. The increase in the amount of software development expense was primarily due to a $33 million increase in personnel costs as a result of increased headcount and temporary services to enhance our product offerings, including $11 million due to the acquisitions of STR and Ten-X, as well as a $2 million increase in occupancy costs.\nGeneral and Administrative Expenses. General and administrative expenses increased to $300 million in 2020, from $179 million in 2019, and increased as a percentage of revenues to 18% in 2020 from 13% in 2019. The increase in general and administrative expenses was partially attributable to the $52 million break fee and $8 million in extension payments that we were contractually obligated to pay under the Asset Purchase Agreement with RentPath, which we terminated in December 2020. In addition, there were increases in personnel costs of $27 million due to increased headcount driven by the acquisitions of STR and Ten-X, credit loss expense of $14 million primarily due to our expectations that the economic downturn caused by the COVID-19 pandemic will increase delinquent trade receivables, professional services of $14 million driven by an increase in other acquisition related costs, and additional software and equipment of $5 million.\nCustomer Base Amortization Expense. Customer base amortization expense increased to $62 million in 2020, from $34 million in 2019, and increased as a percentage of revenues to 4% in 2020, compared to 2% in 2019. The increase in customer base amortization expense was primarily due to the STR and Ten-X acquisitions.\nInterest (Expense) Income. Interest (expense) income was a net expense of $17 million in 2020, as compared to net income of $17 million in 2019. The change from the prior year was due to an increase in interest expense of $19 million, of which, $5 million was related to the $745 million draw on the 2017 Credit Agreement in the first quarter of 2020 and $14 million related to our Senior Notes issued on July 1, 2020, respectively. In addition, there was a decrease of $15 million in interest income caused by lower rates of return on our cash and cash equivalent balances compared to the prior year.\nOther (Expense) Income. Other (expense) income was a net expense of $1 million in 2020, as compared to net income of $11 million in 2019. The change was primarily due to $11 million in legal settlement proceeds received in 2019.\nIncome Tax Expense. Income tax expense decreased to $44 million in 2020, from $76 million in 2019. The decrease was primarily due to lower income before income taxes for 2020, as well as an increase in excess tax benefits. The effective tax rate for 2020 was 16%, compared to 19% in 2019 and lower than the statutory rates due to research and development credits as well as excess tax benefits.\nFor a comparison of our results of operations for the fiscal year ended December 31, 2019 to the year ended December 31, 2018, see Item 7, Management’s Discussion and Analysis of Financial Condition and Results of Operations in our Annual Report on Form 10-K for the year ended December 31, 2019, which was filed with the U.S. Securities and Exchange Commission on February 26, 2020.\nComparison of Business Segment Results for Year Ended December 31, 2020 and Year Ended December 31, 2019\nWe manage our business geographically in two operating segments, with the primary areas of measurement and decision-making being North America, which includes the U.S. and Canada, and International, which primarily includes Europe, Asia-Pacific and Latin America. Management relies on an internal management reporting process that provides revenue and operating segment EBITDA, which is our net income before interest (expense) income and other (expense) income, loss on debt extinguishment, income taxes, depreciation and amortization. Management believes that operating segment EBITDA is an appropriate measure for evaluating the operational performance of our operating segments. EBITDA is used by management to internally measure operating and management performance and to evaluate the performance of the business. However, this measure should be considered in addition to, not as a substitute for or superior to, income from operations or other measures of financial performance prepared in accordance with GAAP.\nSegment Revenues. North America revenues increased to $1.6 billion for the year ended December 31, 2020, from $1.4 billion for the year ended December 31, 2019. The increase in North America revenues was primarily due to a $108 million increase in multifamily revenues driven by upsells of existing customer packages to higher value advertising packages and higher sales volume as a result of recent investments in marketing. Commercial property and land revenues increased $63 million primarily due to the acquisition of Ten-X, as well as growth in our LoopNet service offering. Costar Suite revenues increased $44 million primarily due to price increases upon renewal of subscriptions in the past year, and to a lesser extent, higher sales volume. Information services increased $27 million due to the acquisition of STR. International revenues increased\nto $57 million for the year ended December 31, 2020, from $40 million for the year ended December 31, 2019. The increase in International revenues was primarily due the acquisition of STR.\nSegment EBITDA. North America EBITDA decreased to $411 million for the year ended December 31, 2020, from $452 million for the year ended December 31, 2019. The decrease in North America EBITDA was due primarily to the $52 million break fee and $8 million in extension payments that we were contractually obligated to pay under the Asset Purchase Agreement with RentPath, which we terminated in December 2020. Additionally, increases in personnel, general and administrative, and marketing costs were offset by an increase in revenue. International EBITDA increased to a loss of $5 million for the year ended December 31, 2020 from a loss of $7 million December 31, 2019 primarily as a result of increased revenue, offset by increases in personnel and general and administrative costs.\nFor a comparison of our business segment results of operations for the fiscal year ended December 31, 2019 to the year ended December 31, 2018, see Item 7, Management’s Discussion and Analysis of Financial Condition and Results of Operations in our Annual Report on Form 10-K for the year ended December 31, 2019, which was filed with the U.S. Securities and Exchange Commission on February 26, 2020.\nConsolidated Quarterly Results of Operations\nThe following tables present our unaudited consolidated results of operations on a quarterly basis for the indicated periods (in thousands, except per share amounts, and as a percentage of total revenues). These tables should be read in conjunction with the consolidated financial statements and related notes included in this Annual Report on Form 10-K. The quarterly results of historical periods are not necessarily indicative of quarterly results for any future period.\nLiquidity and Capital Resources\nOur principal sources of liquidity are cash from operations and more recently, proceeds from our debt and equity offerings. Total cash, cash equivalents and restricted cash increased to approximately $3.8 billion as of December 31, 2020, compared to approximately $1.1 billion as of December 31, 2019. The increase in cash, cash equivalents and restricted cash for the year ended December 31, 2020 was primarily due to proceeds from our May 2020 equity offering, net of transaction costs, of $1.7 billion, as well as proceeds from the July 2020 issuance of our Senior Notes, net of transaction costs, of $983 million. In addition, cash generated from operations contributed $486 million, partially offset by cash paid for acquisitions, net of cash acquired, of $426 million.\nIn May 2020, we completed a public equity offering of 2.6 million shares of common stock for $655 per share and on July 1, 2020, we issued $1.0 billion aggregate principal amount of Senior Notes, entered into the 2020 Credit Agreement, which amended and restated in its entirety the 2017 Credit Agreement, and repaid in full the balance on the existing $750 million revolving credit facility under the 2017 Credit Agreement. For further discussion of our recent equity and Senior Notes offerings and our 2020 Credit Agreement, see “-Overview-Development, Investments and Expansion” and Notes 11 and 15 to the accompanying Notes to the Consolidated Financial Statements included in Part IV of this Annual Report on Form 10-K for further discussion.\nNet cash provided by operating activities for the year ended December 31, 2020 was $486 million compared to $458 million for the year ended December 31, 2019. The approximately $29 million increase from December 31, 2019 to December 31, 2020 was primarily due to changes in working capital, partially offset by a decrease in net income excluding certain non-cash expenses such as depreciation and amortization and credit loss expense, as well as a decrease in deferred income taxes.\nNet cash used in investing activities for the year ended December 31, 2020 was $464 million compared to $484 million for the year ended December 31, 2019. The $20 million decrease in cash used in investing activities was primarily due to $438 million net cash paid for acquisitions in 2019, which included the acquisitions of STR and Off Campus Partners, compared to $426 million net cash paid during 2020, including the acquisitions of Homesnap, Ten-X and Emporis GmbH, as well as, the sale of our ARS investments of $10 million in 2020. This was partially offset by an increase in capital expenditures to $48 million in 2020 compared to $46 million during 2019.\nNet cash provided by financing activities for the year ended December 31, 2020 was $2.7 billion compared to net cash used in financing activities of $4 million for the year ended December 31, 2019. This $2.7 billion increase is primarily due to proceeds from our May 2020 equity offering, net of transaction costs, of $1.7 billion, as well as, proceeds from the issuance of our July 1, 2020 Senior Notes, net of transaction costs, of $983 million. We expect to use the proceeds from these transactions to fund all or a portion of the costs of any strategic acquisitions we pursue in the future, to finance the growth of our business and for working capital and other general corporate purposes. The increased cash position allows for greater financial flexibility in light of ongoing uncertainty in the global markets resulting from the COVID-19 pandemic. See Notes 11 and 15 to the accompanying Notes to the Consolidated Financial Statements included in Part IV of this Annual Report on Form 10-K for further discussion.\nOur future capital requirements will depend on many factors, including, among others, our operating results, expansion and integration efforts, and our level of acquisition activity or other strategic transactions. To date, we have grown in part by acquiring other companies, and we expect to continue to make acquisitions. On February 11, 2020, our wholly owned subsidiary entered into a purchase agreement to acquire all of the equity interests of reorganized RentPath, following an internal restructuring pursuant to a chapter 11 plan of reorganization, for $588 million in cash. The purchase agreement required us to deposit a $59 million termination fee into an escrow account in the event the purchase agreement is terminated prior to closing under specified circumstances. In December 2020, the sellers gave notice of termination of the purchase agreement and we commenced an adversary proceeding against the sellers seeking a declaratory judgment that RentPath was in breach of the agreement and that we were not obligated to pay the termination fee. In February 2021, we and the sellers settled the adversary proceeding and agreed that we would pay $52 million of the $59 million contractual termination fee. See Note 13 to the accompanying Notes to the Consolidated Financial Statements included in Part IV of this Annual Report on Form 10-K for further discussion.\nOn March 27, 2020, President Trump signed into law the Coronavirus Aid, Relief and Economic Security Act (the \"CARES Act\"). The CARES Act, among other things, includes provisions relating to the deferral of taxes, valuation allowances, and balance sheet classifications, as well as provisions relating to refundable payroll tax credits, deferral of employer social security payments, net operating loss carryback periods, alternative minimum tax credit refunds, modifications to the net interest deduction limitations and technical corrections to tax depreciation methods for qualified improvement property. As permitted under the CARES Act, we deferred payroll taxes due in 2020 to 2021 and 2022.\nAs of the filing date of this Annual Report on Form 10-K, we believe that our available cash combined with positive cash flow provided by operating activities should be sufficient for us to maintain and fund our operations for at least the next twelve months. Our ability to maintain adequate capital for our operations in the future depends upon numerous rapidly evolving factors, many of which we cannot accurately predict or assess, including, among others, the length and severity of the economic downturn associated with the COVID-19 pandemic, related disruption of the international and national economy and credit markets; actions taken by governments, businesses and individuals in response to the pandemic such as office and other workplace closures, worker absenteeism, quarantines, mass-transit disruptions or other travel or health-related restrictions; how quickly economies, including the commercial real estate industry in particular, recover after the pandemic subsidies; sales of our services; and collection of accounts receivables. We plan to continue to monitor and evaluate the financial impact of the COVID-19 pandemic as it evolves.\nContractual Obligations. The following table summarizes our principal contractual obligations at December 31, 2020, excluding the RentPath termination fee and the effect such obligations are expected to have on our liquidity and cash flows in future periods (in thousands):\n(1) Amounts do not include (i) contracts with terms of twelve months or less, (ii) multi-year contracts that may be terminated by a third-party or us, or (iii) employment agreements. Amounts do not include income taxes payable due to uncertainty regarding the timing of future cash payments.\nCritical Accounting Policies\nThe preparation of financial statements and related disclosures in conformity with U.S. generally accepted accounting principles (“GAAP”) requires management to make estimates and assumptions that affect the reported amounts of assets and liabilities, the disclosure of contingent assets and liabilities at the date of the financial statements and revenues and expenses during the period reported. The following accounting policies involve a “critical accounting estimate” because they are particularly dependent on estimates and assumptions made by management about matters that are highly uncertain at the time the accounting estimates are made. In addition, while we have used our best estimates based on facts and circumstances available to us at the time, different acceptable assumptions would yield different results. Changes in the accounting estimates are reasonably likely to occur from period to period, which may have a material impact on the presentation of our financial condition and results of operations. We review these estimates and assumptions periodically and reflect the effects of revisions in the period that they are determined to be necessary. We consider policies relating to the following matters to be critical accounting policies:\n•Long-lived assets, intangible assets and goodwill\n•Income taxes\n•Revenue recognition\n•Business combinations\nWith respect to our accounting policy for long-lived assets, intangible assets and goodwill, we further supplement in Note 2 of the Notes to the Consolidated Financial Statements included in this Annual Report on Form 10-K with the following:\nWe assess the impairment of long-lived assets, identifiable intangibles and goodwill whenever events or changes in circumstances indicate that the carrying value may not be recoverable. Judgments made by management relate to the expected useful lives of long-lived assets and our ability to recover the carrying value of such assets. The accuracy of these judgments may be adversely affected by several factors, including the factors listed below:\n•Significant underperformance relative to historical or projected future operating results;\n•Significant changes in the manner of our use of the acquired assets or the strategy for our overall business;\n•Significant negative industry or economic trends; or\n•Significant decline in our market capitalization relative to net book value for a sustained period.\nWhen we determine that the carrying value of long-lived and identifiable intangible assets may not be recovered based upon the existence of one or more of the above indicators, we test for impairment.\nGoodwill and identifiable intangible assets that are not subject to amortization are tested annually for impairment by each reporting unit on October 1 of each year and are also tested for impairment more frequently based upon the existence of one or more of the above indicators.\nGoodwill represents the excess of costs over the fair value of assets of acquired businesses. Goodwill is not amortized, but instead tested for impairment at least annually by each reporting unit. We may first assess qualitative factors to evaluate whether it is more likely than not that the fair value of a reporting unit is less than its carrying amount or elect to bypass such assessment. If it is determined that it is more likely than not that the fair value of a reporting unit is less than its carrying value, or we elect to bypass such assessment, we then determine the fair value of each reporting unit. We estimate the fair value of each reporting unit based on a projected discounted cash flow model that includes significant assumptions and estimates including our discount rate, growth rate and future financial performance. Assumptions about the discount rate are based on a weighted average cost of capital for comparable companies. Assumptions about the growth rate and future financial performance of a reporting unit are based on our forecasts, business plans, economic projections and anticipated future cash flows. These assumptions are subject to change from period to period and could be adversely impacted by the uncertainty surrounding global market conditions, commercial real estate conditions and the competitive environment in which we operate. Changes in these or other factors could negatively affect our reporting units' fair value and potentially result in impairment charges. Such impairment charges could have an adverse effect on our results of operations.\nThe fair value of each reporting unit is compared to the carrying amount of the reporting unit. If the carrying value of the reporting unit exceeds the fair value, then an impairment loss is recognized for the difference. We estimate the fair value of our reporting units based on a projected discounted cash flow method using a discount rate determined by our management to be commensurate with the risk in our current business model. As of October 1, 2020, we assessed the relevant qualitative factors for our North America reporting unit and concluded that it was not more likely than not that the fair value of this reporting unit was less than its respective carrying amounts. We elected to bypass performing the qualitative screen and performed the first\nstep quantitative analysis of the goodwill impairment test for our International reporting unit in the current year, which indicated that the fair value of this unit exceeded its carrying value.\nThere have been no events or changes in circumstances as a result of our qualitative impairment analysis on October 1, 2020, that would indicate that the carrying value of each reporting unit may not be recoverable.\nFor an in-depth discussion of each of our significant accounting policies, including our critical accounting policies and further information regarding estimates and assumptions involved in their application, see Note 2 to the accompanying consolidated financial statements included in this Annual Report on Form 10-K.\nRecent Accounting Pronouncements\nSee Note 2 of the Notes to Consolidated Financial Statements included in this Annual Report on Form 10-K for information on recent accounting pronouncements, including the expected dates of adoption.",
    "item_7A": "Item 7A. Quantitative and Qualitative Disclosures About Market Risk\nWe provide information, analytics and online marketplace services to commercial real estate and related business communities within the regions where we operate which primarily include, North America, Europe, Asia-Pacific and Latin America. The functional currency for a majority of our operations is the local currency, with the exception of certain STR international locations for which the functional currency is the British Pound.\nFluctuations in the British Pound, Canadian dollar and Euro may have an impact on our business, results of operations and financial position. For the years ended December 31, 2020 and December 31, 2019, revenues denominated in foreign currencies were approximately 5% and 4%, respectively, of total revenue. For the years ended December 31, 2020 and December 31, 2019, our revenues would have decreased by approximately $8 million and $6 million if the U.S. dollar exchange rate used strengthened by 10%. For the years ended December 31, 2020 and December 31, 2019, our revenues would have increased by approximately $8 million and $6 million if the U.S. dollar exchange rate used weakened by 10%. Fluctuations in the exchange rates of revenues denominated in any other foreign currencies would have had an immaterial impact on our consolidated results. In addition, we have assets and liabilities denominated in foreign currencies. We currently do not use financial instruments to hedge our exposure to exchange rate fluctuations with respect to our foreign subsidiaries. We may seek to enter into hedging transactions in the future to reduce our exposure to exchange rate fluctuations, but we may be unable to enter into hedging transactions successfully, on acceptable terms or at all. As of December 31, 2020, accumulated other comprehensive loss included a loss from foreign currency translation adjustments of approximately $0.9 million.\nWe do not believe we have material exposure to market risks associated with changes in interest rates related to cash equivalent securities held as of December 31, 2020. As of December 31, 2020, we had $3.8 billion of cash, cash equivalents and restricted cash. If there is an increase or decrease in interest rates, there will be a corresponding increase or decrease in the amount of interest earned on our cash and cash equivalents. We currently diversify our cash and cash equivalents holdings amongst multiple financial institutions.\nWe are subject to interest rate market risk in connection with our new revolving credit facility. On July 1, 2020, we entered into the 2020 Credit Agreement, which provides for variable rate borrowings of up to $750 million. On July 1, 2020, we issued $1.0 billion aggregate principal amount of 2.800% Senior Notes due July 15, 2030. Changes in interest rates would not have a material impact to our current interest and debt financing expense, as all our borrowings except for our credit facility are fixed rate, and our credit facility is currently undrawn as of December 31, 2020. See Note 11 of the Notes to Consolidated Financial Statements included in this Annual Report on Form 10-K regarding our 2020 Credit Agreement.\nWe had approximately $2.7 billion of goodwill and intangible assets as of December 31, 2020. As of December 31, 2020, we believe our intangible assets will be recoverable; however, changes in the economy, the business in which we operate and our own relative performance could change the assumptions used to evaluate intangible asset recoverability. In the event that we determine that an asset has been impaired, we would recognize an impairment charge equal to the amount by which the carrying amount of the assets exceeds the fair value of the asset. We continue to monitor these assumptions and their effect on the estimated recoverability of our intangible assets.",
    "item_8": "Item 8. Financial Statements and Supplementary Data\nFinancial Statements meeting the requirements of Regulation S-X are set forth beginning at page. Supplementary data is set forth in “Management’s Discussion and Analysis of Financial Condition and Results of Operations” under the caption “Consolidated Results of Operations” and “Consolidated Quarterly Results of Operations.”",
    "item_9": "Item 9. Changes in and Disagreements with Accountants on Accounting and Financial Disclosure\nNone.",
    "item_9A": "Item 9A. Controls and Procedures\nWe maintain disclosure controls and procedures that are designed to ensure that information required to be disclosed in our reports filed or submitted under the Exchange Act is recorded, processed, summarized and reported, within the time periods specified in the Securities and Exchange Commission’s rules and forms, and that such information is accumulated and communicated to our management, including our Chief Executive Officer and Chief Financial Officer, as appropriate, to allow for timely decisions regarding required disclosure. In designing and evaluating the disclosure controls and procedures, management recognized that any controls and procedures, no matter how well designed and operated, can provide only reasonable assurance of achieving the desired control objectives, and management is required to apply its judgment in evaluating the cost-benefit relationship of possible controls and procedures.\nWe carried out an evaluation, under the supervision and with the participation of our management, including our Chief Executive Officer and our Chief Financial Officer, of the effectiveness of the design and operation of our disclosure controls and procedures as of the end of the fiscal year. Based on the foregoing, our Chief Executive Officer and Chief Financial Officer concluded that our disclosure controls and procedures were effective and were operating at a reasonable assurance level as of December 31, 2020.\nWe continue to implement a financial system that is designed to improve the efficiency and effectiveness of our operational and financial accounting processes. This implementation is expected to continue beyond 2021. Consistent with any process change that we implement, the design of the internal controls has and will continue to be evaluated for effectiveness as part of our overall assessment of the effectiveness of our disclosure controls and procedures. We expect that the implementation of this system will improve our internal controls over financial reporting.\nOther than the implementation of a new financial system noted above, there have been no changes in our internal control over financial reporting during our most recent fiscal year that have materially affected, or are reasonably likely to materially affect, our internal control over financial reporting.\nManagement’s Report on Internal Control over Financial Reporting\nManagement of CoStar is responsible for establishing and maintaining adequate internal control over financial reporting and for the assessment of the effectiveness of internal control over financial reporting. As defined by the Securities and Exchange Commission, internal control over financial reporting is a process designed by, or supervised by, the Company’s principal executive and principal financial officers, to provide reasonable assurance regarding the reliability of financial reporting and the preparation of financial statements in accordance with GAAP.\nThe Company’s internal control over financial reporting is supported by written policies and procedures, that (1) pertain to the maintenance of records that, in reasonable detail, accurately and fairly reflect the transactions and dispositions of the Company’s assets; (2) provide reasonable assurance that transactions are recorded as necessary to permit preparation of financial statements in accordance with GAAP, and that receipts and expenditures of the Company are being made only in accordance with authorizations of the Company’s management and directors; and (3) provide reasonable assurance regarding prevention or timely detection of unauthorized acquisition, use or disposition of the Company’s assets that could have a material effect on the financial statements.\nBecause of its inherent limitations, internal control over financial reporting may not prevent or detect misstatements. Projections of any evaluation of effectiveness to future periods are subject to the risk that controls may become inadequate because of changes in conditions, or that the degree of compliance with the policies or procedures may deteriorate.\nIn connection with the preparation of the Company's annual financial statements, management of the Company has undertaken an assessment of the effectiveness of the Company’s internal control over financial reporting as of December 31,\n2020 based on criteria established in Internal Control - Integrated Framework (2013 framework) issued by the Committee of Sponsoring Organizations of the Treadway Commission (“the COSO Framework”). Management's assessment included an evaluation of the design of the Company's internal control over financial reporting and testing of the operational effectiveness of the Company's internal control over financial reporting.\nBased on this assessment, management has concluded that the Company's internal control over financial reporting was effective as of December 31, 2020.\nErnst & Young LLP, the independent registered public accounting firm that audited the Company's financial statements included in this report, has issued an attestation report on the effectiveness of internal control over financial reporting, a copy of which is included in this Annual Report on Form 10-K.\nOn December 22, 2020 and June 24, 2020, we completed the acquisitions of Homesnap and Ten-X, respectively. As permitted by the Securities and Exchange Commission, we have elected to exclude the internal controls of these acquisitions that have not been integrated into our existing processes and controls from our assessment of the effectiveness of internal control over financial reporting as of December 31, 2020. The excluded aggregate financial position of Homesnap and Ten-X collectively represented less than 1% of our total assets as of December 31, 2020, and less than 2% of our revenues and total operating costs for the year then ended. We will include the internal controls of Homesnap and Ten-X in our assessment of the effectiveness of our internal control over financial reporting as of December 31, 2021.",
    "item_9B": "Item 9B. Other Information.\nNone.\nPART III",
    "item_9C": "",
    "item_10": "Item 10. Directors, Executive Officers and Corporate Governance\nCoStar has adopted a Code of Conduct for its directors. In addition, CoStar has adopted a separate Code of Conduct for its officers and employees, including its principal executive, financial and accounting officers, or persons performing similar functions. Copies of each of these codes may be found in the “Investors” section of the Company’s website at www.investors.costargroup.com/leadership. We intend to disclose future amendments to certain provisions of our Codes, or waivers of such provisions granted to executive officers and directors, as required by the Security of Exchange (\"SEC') rules on the website within four business days following the date of such amendment or waiver.\nThe remaining information required by this Item is incorporated by reference to our Proxy Statement for our 2021 annual meeting of stockholders under the captions “Nominees for the Board of Directors,” “Nominees’ Business Experience, Qualifications and Directorships,” “Executive Officers and Key Employees,” “Board Meetings and Committees,” and \"Delinquent Section 16(a) Reports.\"",
    "item_11": "Item 11. Executive Compensation\nThe information required by this Item is incorporated by reference to our Proxy Statement for our 2021 annual meeting of stockholders under the captions “Compensation Discussion and Analysis,” “Executive Compensation Tables and Discussion,” “Narratives to Summary Compensation Table and Grants of Plan-Based Awards Table,” “Director Compensation,” “Compensation Committee Interlocks and Insider Participation,” and “Compensation Committee Report.”",
    "item_12": "Item 12. Security Ownership of Certain Beneficial Owners and Management and Related Stockholder Matters\nThe information required by this Item is incorporated by reference to our Proxy Statement for our 2021 annual meeting of stockholders under the captions “Equity Compensation Plan Information” and “Stock Ownership Information.”",
    "item_13": "Item 13. Certain Relationships and Related Transactions, and Director Independence\nThe information required by this Item is incorporated by reference to our Proxy Statement for our 2021 annual meeting of stockholders under the captions “Certain Relationships and Related Transactions” and “Corporate Governance Matters.”",
    "item_14": "Item 14. Principal Accountant Fees and Services\nThe information required by this Item is incorporated by reference to our Proxy Statement for our 2021 annual meeting of stockholders under the caption “Ratification of the Appointment of Independent Registered Public Accounting Firm.”\nPART IV",
    "item_15": "Item 15. Exhibits and Financial Statement Schedules\n(a)(1) The following financial statements are filed as a part of this report: CoStar Group, Inc. Consolidated Financial Statements.\n(a)(2) Financial statement schedules:\nSchedule II - Valuation and Qualifying Accounts\nThe table below details the activity of the allowance for doubtful accounts and sales credits (1) for the years ended December 31, 2019 and 2018 (in thousands):\n(1)Additions to the allowance for doubtful accounts are charged to bad debt expense. Additions to the allowance for sales credits are charged against revenues.\n(2)On January 1, 2020, the Company adopted ASU 2016-13, Financial Instruments-Credit Losses (Topic 326): Measurement of Credit Losses on Financial Instruments, using the modified retrospective method. The adoption resulted in a $0.5 million reduction to the December 31, 2019 allowance for credit losses. See Note 4 for a description of changes in the allowance for credit losses for the year ended December 31, 2020.\nAdditional financial statement schedules are omitted because they are not applicable or not required or because the required information is incorporated herein by reference or included in the financial statements or related notes included elsewhere in this report.\n(a)(3) The documents required to be filed as exhibits to this Report under Item 601 of Regulation S-K are listed as follows:\nExhibits\nExhibit No. Description\n3.1\nThird Amended and Restated Certificate of Incorporation (Incorporated by reference to Exhibit 3.1 to the Registrant's Current Report on Form 8-K filed with the Commission on June 6, 2013).\n3.2\nThird Amended and Restated By-Laws (Incorporated by reference to Exhibit 3.1 to the Registrant’s Current Report on Form 8-K filed with the Commission on September 24, 2013).\n4.1\nSpecimen Common Stock Certificate (Incorporated by reference to Exhibit 4.1 to the Registration Statement on Form S-4 of the Registrant (Reg. No. 333-174214) filed with the Commission on June 3, 2011).\n4.2\nDescription of the Registrant's Securities Registered Pursuant to Section 12 of the Securities Exchange Act of 1934 (Incorporated by reference to Exhibit 4.2 to the Registrant’s Annual Report on Form 10-K filed with the Commission on February 26, 2020).\n4.3\nIndenture, dated as of July 1, 2020, by and among CoStar Group, Inc., as issuer, the guarantors named therein and Wilmington Trust, National Association, as trustee, relating to the 2.800% Senior Notes due 2030, including the form of 2.800% Senior Notes due 2030 (Incorporated by reference to Exhibit 4.1 to the Registrant’s Current Report on Form 8-K filed with the Commission on July 1, 2020).\n*10.1\nCoStar Group, Inc. 2016 Stock Incentive Plan (Incorporated by reference to Exhibit 4.4 to the Registration Statement on Form S-8 of the Registrant (Reg. No. 333-212278) filed with the Commission on June 28, 2016).\n*10.2\nFirst Amendment to the CoStar Group, Inc. 2016 Stock Incentive Plan (Incorporated by reference to Exhibit 10.1 to the Registrant’s Quarterly Report on Form 10-Q filed April 25, 2018).\n*10.3\nCoStar Group, Inc. 2007 Stock Incentive Plan, as amended (Incorporated by reference to Exhibit 10.1 to the Registrant’s Current Report on Form 8-K filed June 8, 2012).\n*10.4\nCoStar Group, Inc. 2007 Stock Incentive Plan French Sub-Plan (Incorporated by reference to Exhibit 10.3 to the Registrant’s Report on Form 10-K filed February 29, 2008).\nExhibit No. Description\n*10.5\nForm of CoStar Group, Inc. 2016 Plan Restricted Stock Grant Agreement between the Registrant and certain of its officers, directors and employees (Incorporated by reference to Exhibit 10.3 to the Registrant’s Quarterly Report on Form 10-Q filed July 28, 2016).\n*10.6\nForm of CoStar Group, Inc. 2016 Plan Restricted Stock Grant Agreement for Service Awards between the Registrant and certain of its officers and employees (Incorporated by reference to Exhibit 10.4 to the Registrant’s Quarterly Report on Form 10-Q filed July 28, 2016).\n*10.7\nForm of CoStar Group, Inc. 2016 Plan Restricted Stock Unit Grant Agreement between the Registrant and certain of its officers and employees (Incorporated by reference to Exhibit 10.5 to the Registrant’s Quarterly Report on Form 10-Q filed July 28, 2016).\n*10.8\nForm of CoStar Group, Inc. 2016 Plan Incentive Stock Option Grant Agreement between the Registrant and certain of its officers and employees (Incorporated by reference to Exhibit 10.6 to the Registrant’s Quarterly Report on Form 10-Q filed July 28, 2016).\n*10.9\nForm of CoStar Group, Inc. 2016 Plan Incentive Stock Option Grant Agreement between the Registrant and Andrew C. Florance (Incorporated by reference to Exhibit 10.7 to the Registrant’s Quarterly Report on Form 10-Q filed July 28, 2016).\n*10.10\nForm of CoStar Group, Inc. 2016 Plan Nonqualified Stock Option Grant Agreement between the Registrant and certain of its officers, directors and employees (Incorporated by reference to Exhibit 10.8 to the Registrant’s Quarterly Report on Form 10-Q filed July 28, 2016).\n*10.11\nForm of CoStar Group, Inc. 2016 Plan Nonqualified Stock Option Grant Agreement between the Registrant and Andrew C. Florance (Incorporated by reference to Exhibit 10.9 to the Registrant’s Quarterly Report on Form 10-Q filed July 28, 2016).\n*10.12\nForm of 2007 Plan Restricted Stock Grant Agreement between the Registrant and certain of its officers, directors and employees (Incorporated by reference to Exhibit 99.1 to the Registrant’s Report on Form 8-K filed June 22, 2007).\n*10.13\nForm of 2007 Plan Restricted Stock Unit Agreement between the Registrant and certain of its officers and employees (Incorporated by reference to Exhibit 10.8 to the Registrant's Report on Form 10-K filed February 20, 2014).\n*10.14\nForm of 2007 Plan Incentive Stock Option Grant Agreement between the Registrant and certain of its officers and employees (Incorporated by reference to Exhibit 10.8 to the Registrant’s Report on Form 10-K filed February 24, 2009).\n*10.15\nForm of 2007 Plan Incentive Stock Option Grant Agreement between the Registrant and Andrew C. Florance (Incorporated by reference to Exhibit 10.9 to the Registrant’s Report on Form 10-K filed February 24, 2009).\n*10.16\nForm of 2007 Plan Nonqualified Stock Option Grant Agreement between the Registrant and certain of its officers and employees (Incorporated by reference to Exhibit 10.10 to the Registrant’s Report on Form 10-K filed February 24, 2009).\n*10.17\nForm of 2007 Plan Nonqualified Stock Option Grant Agreement between the Registrant and certain of its directors (Incorporated by reference to Exhibit 10.11 to the Registrant’s Report on Form 10-K filed February 24, 2009).\n*10.18\nForm of 2007 Plan Nonqualified Stock Option Grant Agreement between the Registrant and Andrew C. Florance (Incorporated by reference to Exhibit 10.12 to the Registrant’s Report on Form 10-K filed February 24, 2009).\n*10.19\nForm of 2007 Plan French Sub-Plan Restricted Stock Agreement between the Registrant and certain of its employees (Incorporated by reference to Exhibit 10.10 to the Registrant’s Report on Form 10-K filed February 29, 2008).\n*10.20\nCoStar Group, Inc. 2016 Cash Incentive Plan (Incorporated by reference to Exhibit 10.2 to the Registrant’s Quarterly Report on Form 10-Q filed July 28, 2016).\n*10.21\nCoStar Group, Inc. Amended and Restated Employee Stock Purchase Plan (Incorporated by reference to Exhibit 4.4 to the Registrant’s Registration Statement on Form S-8 filed with the Commission on September 14, 2015).\n*10.22\nCoStar Group, Inc. Management Stock Purchase Plan (Incorporated by reference to Exhibit 10.21 to the Registrant’s Report on Form 10-K filed February 23, 2018).\n*10.23\nSummary of Non-Employee Director Compensation (Incorporated by reference to Exhibit 10.1 to the Registrant's Report on Form 10-Q filed on October 24, 2013).\n*10.24\nEmployment Agreement for Andrew C. Florance (Incorporated by reference to Exhibit 10.2 to Amendment No. 1 to the Registration Statement on Form S-1 of the Registrant (Reg. No. 333-47953) filed with the Commission on April 27, 1998).\n*10.25\nFirst Amendment to Andrew C. Florance Employment Agreement, effective January 1, 2009 (Incorporated by reference to Exhibit 10.16 to the Registrant’s Report on Form 10-K filed February 24, 2009).\nExhibit No. Description\n10.26\nForm of Indemnification Agreement between the Registrant and each of its officers and directors (Incorporated by reference to Exhibit 10.1 to the Registrant’s Report on Form 10-Q filed on May 7, 2004).\n10.27\nDeed of Office Lease by and between GLL L-Street 1331, LLC and CoStar Realty Information, Inc., dated February 18, 2011, and made effective as of June 1, 2010 (Incorporated by reference to Exhibit 10.1 to the Registrant’s Report on form 10-Q filed on April 29, 2011).\n10.28\nAsset Purchase Agreement, dated as of the Petition Date (on or about February 12, 2020), among CSGP Holdings, LLC, CoStar Group, Inc. (solely for the specified purposes), RentPath Holdings, Inc. and the other Sellers named therein (Incorporated by reference to Exhibit 10.1 to the Registrant’s Current Report on Form 8-K filed with the Commission on February 13, 2020).\n10.29\nAgreement and Plan of Merger, dated as of May 13, 2020, by and among Ten-X Holding Company, Inc., CoStar Realty Information, Inc., Crescendo Sub, Inc., and Thomas H. Lee Equity Fund VII, L.P., solely in its capacity as representative thereunder (Incorporated by reference to Exhibit 10.1 to the Registrant’s Current Report on Form 8-K filed with the Commission on May 14, 2020)\n10.30\nSecond Amended and Restated Credit Agreement, dated as of July 1, 2020, by and among CoStar Group, Inc., as borrower, CoStar Realty Information, Inc., as co-borrower, the lenders party thereto and Bank of America, N.A., as administrative agent (Incorporated by reference to Exhibit 10.1 to the Registrant’s Current Report on Form 8-K filed with the Commission on July 1, 2020)\n21.1\nSubsidiaries of the Registrant (filed herewith).\n23.1\nConsent of Ernst & Young LLP, Independent Registered Public Accounting Firm (filed herewith).\n31.1\nCertification of Principal Executive Officer pursuant to Section 302 of the Sarbanes-Oxley Act of 2002 (filed herewith).\n31.2\nCertification of Principal Financial Officer pursuant to Section 302 of the Sarbanes-Oxley Act of 2002 (filed herewith).\n32.1\nCertification of Principal Executive Officer pursuant to 18 U.S.C. Sec. 1350, as adopted pursuant to Section 906 of the Sarbanes-Oxley Act of 2002 (furnished herewith).\n32.2\nCertification of Principal Financial Officer pursuant to 18 U.S.C. Sec. 1350, as adopted pursuant to Section 906 of the Sarbanes-Oxley Act of 2002 (furnished herewith).\n101.INS The following financial statements from the Company’s Annual Report on Form 10-K for the year ended December 31, 2020, formatted in Inline XBRL: (i) Consolidated Statements of Operations; (ii) Consolidated Statements of Comprehensive Income; (iii) Consolidated Balance Sheets; (iv) Consolidated Statements of Cash Flows; and (v) Notes to Consolidated Financial Statements, tagged as blocks of text and including detailed tags.\n101.SCH XBRL Taxonomy Extension Schema Document.\n101.CAL XBRL Taxonomy Extension Calculation Linkbase Document.\n101.DEF XBRL Taxonomy Extension Definition Linkbase Document.\n101.LAB XBRL Taxonomy Extension Label Linkbase Document.\n101.PRE XBRL Taxonomy Extension Presentation Linkbase Document.\n104 The cover page from the Registrant's Annual Report on Form 10-K for the year ended December 31, 2020, formatted in Inline XBRL (included as Exhibit 101).\n* Management Contract or Compensatory Plan or Arrangement.",
    "item_16": "Item 16. Form 10-K Summary\nNone.",
    "stock_ticker": "CSGP"
}