{
    "cik": "1097864",
    "company": "ON SEMICONDUCTOR CORP",
    "filing_type": "10-K",
    "filing_date": "2021-02-16",
    "period_of_report": "2020-12-31",
    "sic": "3674",
    "state_of_inc": "DE",
    "state_location": "AZ",
    "fiscal_year_end": "1231",
    "filing_html_index": "https://www.sec.gov/Archives/edgar/data/1097864/0001628280-21-002219-index.html",
    "htm_filing_link": "https://www.sec.gov/Archives/edgar/data/1097864/000162828021002219/on-20201231.htm",
    "complete_text_filing_link": "https://www.sec.gov/Archives/edgar/data/1097864/0001628280-21-002219.txt",
    "filename": "1097864_10K_2020_0001628280-21-002219.htm",
    "item_1": "Item 1. Business\nBusiness Overview\nON Semiconductor Corporation, together with its wholly and majority-owned subsidiaries (\"ON Semiconductor,\" \"we,\" \"us,\" \"our,\" or the \"Company\"), was incorporated under the laws of the state of Delaware in 1992 under the name Motorola Energy Systems, Inc. Immediately prior to our August 4, 1999 recapitalization, we were a wholly-owned subsidiary of Motorola.\nON Semiconductor is driving innovation in energy-efficient electronics. We believe that our extensive portfolio of sensors, power management, connectivity, custom and SoC, analog, logic, timing and discrete devices helps customers efficiently solve their design challenges in advanced electronic systems and products. Our power management and motor driver semiconductor components control, convert, protect and monitor the supply of power to the different elements within a wide variety of electronic devices. Our custom ASICs and SoC devices use analog, MCU, DSP, mixed-signal and advanced logic capabilities to enable the application and uses of many of our automotive, medical, aerospace/defense, consumer and industrial customers’ products. Our signal management semiconductor components provide high-performance clock management and data flow management for precision computing, communications and industrial systems. Our portfolio of sensors, including image sensors, radar and LiDAR, provide advanced solutions for automotive, industrial and IoT applications. Our high performance Wi-Fi solution creates a strong platform for addressing connectivity solutions for industrial IoT applications. Our standard semiconductor components serve as \"building blocks\" within virtually all types of electronic devices.\nAs of December 31, 2020, we were organized into the following three operating and reportable segments: the Power Solutions Group (\"PSG\"), the Advanced Solutions Group (\"ASG\") and the Intelligent Sensing Group (\"ISG\").\nRecent Business Strategy Developments\nOur primary focus is on gross margin expansion, while at the same time, achieving significant revenue growth in our focused end-markets of automotive, industrial and communication infrastructure as well as being opportunistic in other end-markets.\nIn light of these objectives, we have begun the process of evaluating our current product portfolio. We intend to allocate capital and research and development investments and resources to accelerate growth in high-margin products and end-markets by moving away from non-differentiated products, which have had historically lower gross margins, and in that process, reduce complexity, streamline the organization, and improve operating efficiencies.\nAdditionally, we believe these actions will allow us to transition to a lighter internal fabrication model where our gross margins will be less volatile and not as heavily influenced by our internal manufacturing volumes. As further discussed below, we are also rationalizing our manufacturing footprint to align with our investment priorities and corporate strategy. Our goal is to reduce volatility in our gross margins and maximize return on our manufacturing investments with the intent to have our product strategy drive our manufacturing footprint and capital investments.\nNovel coronavirus disease 2019 (\"COVID-19\")\nIn March 2020, the World Health Organization declared COVID-19 to be a pandemic, which continues to spread throughout the U.S. and the world. Our results of operations were adversely impacted during the majority of 2020 due to the reduced demand from our customers, government-mandated temporary shutdowns of certain of our facilities, supply shortages and other logistical constraints arising from the COVID-19 pandemic.\nWe are unable to accurately predict the full impact that the COVID-19 pandemic will have on us due to a number of uncertainties, including the duration and severity of the outbreak, globally and, in particular, in the markets in which we do business, the impact of the pandemic on our customers' businesses, the imposition of any future government restrictions on staffing and facility operations, supply chain shortages, and other disruptions. Without global containment, it is likely that the pandemic will continue to have a negative impact on our business, results of operations and financial condition for the foreseeable future.\nPending and completed acquisitions\nOn April 22, 2019, we entered into an Asset Purchase Agreement (the \"Asset Purchase Agreement\") with GLOBALFOUNDRIES U.S. Inc. (\"GFUS\") and GLOBALFOUNDRIES Inc. pursuant to which we will acquire GFUS’s East\nFishkill, New York site and fabrication facilities and certain other assets and liabilities on or around December 31, 2022 (the \"Closing Date\"), subject to certain conditions, for an aggregate purchase price of $400.0 million in cash, subject to adjustment as described in the Asset Purchase Agreement (the \"Total Consideration\"). On April 22, 2019, we paid GFUS $70.0 million of the Total Consideration in cash as a non-refundable deposit, which will be applied toward and reduce the Total Consideration.\nOn October 1, 2020, we entered into an amendment to the Asset Purchase Agreement (the \"APA Amendment\") pursuant to which we paid GFUS a non-refundable deposit in the amount of $100.0 million in cash on October 5, 2020 (the \"Additional Deposit\"). The Additional Deposit will be applied toward and reduce the Total Consideration as a non-refundable deposit, and the remaining $230.0 million of the Total Consideration will be paid on or around the Closing Date. Other terms and conditions of the Asset Purchase Agreement remain unchanged.\nWith the expected completion of the acquisition in East Fishkill, New York on or around December 31, 2022, we initiated structural changes to our manufacturing footprint. During February and August 2020, we announced that we were exploring the sales of our six-inch fabrication facilities in Oudenaarde, Belgium and Niigata, Japan, respectively. We could incur accounting charges in the future in connection with the active marketing and sale of these fabrication facilities and for costs to transition the manufacturing activity to other sites in our manufacturing network.\nOn June 19, 2019, we completed our acquisition of Quantenna Communications, Inc. (\"Quantenna\"). Following the acquisition, Quantenna changed its name to ON Semiconductor Connectivity Solutions, Inc. The purchase price totaled $1,039.3 million, and was funded with the proceeds from a $900.0 million draw against our Revolving Credit Facility and cash on hand. We believe the acquisition of Quantenna creates a strong platform for addressing connectivity solutions for industrial IoT by combining our expertise in power management and bluetooth technologies with Quantenna's Wi-Fi technologies and software capabilities.\nSee Note 5: ''Acquisitions, Divestiture and Licensing Transactions'' in the notes to our audited consolidated financial statements included elsewhere in this Form 10-K for additional information.\nRevenue-Generating Activities\nON Semiconductor generates revenue from the sale of our semiconductor products to distributors, OEMs and electronic manufacturing service providers. We also generate revenue, to a much lesser extent, from product development agreements and manufacturing services provided to customers. Our devices are found in a wide variety of end products as noted within the sample applications in the end-markets section below. Our portfolio of devices enables us to offer advanced ICs and the \"building block\" components that deliver system level functionality and design solutions. We offer micro packages, which provide increased performance characteristics while reducing the critical board space inside today's ever shrinking electronic devices and power modules, delivering improved energy efficiency and reliability for a wide variety of medium and high power applications. We believe that our ability to offer a broad range of products, combined with our applications and global manufacturing and logistics network, provides our customers with single source purchasing on a cost-effective and timely basis.\nWe shipped approximately 64.3 billion units in 2020 and approximately 66.2 billion units in 2019, resulting in a period-over-period decrease of approximately 3%. As many of our products are sold into different end-markets, the total revenue reported under PSG, ASG and ISG is not indicative of actual sales in the end-market associated with that segment, but rather is the sum of the revenue from the product lines assigned to that segment. From time to time, we reassess the alignment of our product families and devices to our operating segments and may move product families or individual devices from one operating segment to another.\nThe following table illustrates the product technologies under each of our segments based on our operating strategy:\nProducts and Technology\nThe following provides certain information regarding the products and technologies by each of our operating segments. See Note 3: ''Revenue and Segment Information'' in the notes to our audited consolidated financial statements included elsewhere in this Form 10-K for other information regarding our segments, their revenue and property, plant and equipment and the income derived from each segment.\nPSG\nPSG offers a wide array of analog, discrete, module and integrated semiconductor products that perform multiple application functions, including power switching, power conversion, signal conditioning, circuit protection, signal amplification and voltage regulation functions. The trends driving growth within our end-user markets are primarily higher power efficiency and power density in power applications, the demand for greater functionality in small handheld devices, and faster data transmission rates in all communications. The advancement of existing volt electrical infrastructure, electrification of power train in the form of EV/HEV, higher trench density enabling lower losses in power efficient packages and lower capacitance and integrated signal conditioning products to support faster data transmission rates significantly increase the use of high power semiconductor solutions. The recent increase in the use of WBG MOSFETs and diodes, including SiC and GaN, is further expanding the use of semiconductor products. Certain of PSG's broad portfolio of products and solutions are summarized below:\n•Automotive Electronics\nAEC qualified products, covering the spectrum from discrete to integrated, as well as automotive modules and known good die to support automotive modules. New semiconductor products based upon WBG technologies, including SiC, are rapidly being adopted for EV/HEV traction and charging applications due to the higher efficiencies they provide.\n•Industrial Electronics\nAdvanced power technologies to support high performance power conversion for high-end power supply/UPS, alternative energy and industrial motors.\n•Computing\nMOSFETs and protection devices supporting the latest chipsets. Multichip power solutions and advanced LDOs to support power efficiency requirements in new computing platforms. SiC and GaN technology enables drastic reduction in power adapter size.\n•Communications\nOur smallest packages: DFN MOSFETs, CSP (MOSFET/EEPROMs), EEPROMs and LDOs, and X4DFN 01005 for small signal devices and protection. Low capacitance ESD and common mode filters for high-speed serial interface protection.\nASG\nASG designs and develops analog, mixed-signal, advanced logic, ASSPs and ASICs, Wi-Fi and power solutions for a broad base of end-users in different end-markets. Our product solutions enable industry leading active mode and standby mode efficiency now demanded by regulatory agencies around the world. Additionally, ASG offers trusted foundry and design\nservices for our government customers as well as manufacturing services, which leverage the Company’s broad range of manufacturing, IC design, packaging, and silicon technology offerings to provide turn-key solutions for our customers. Certain of ASG’s broad portfolio of products and solutions are summarized below:\n•Automotive Electronics\nEnergy efficient solutions that reduce emissions, improve fuel economy and safety, enhance lighting and make possible an improved driving experience. Multi-phase DC-DC power conversion for compute-intensive solutions for assisted and autonomous driving is also a focus area.\n•Industrial Electronics\nEfficient power conversion products, sensor interface products and motor control products. Wired and low power RF wireless connectivity for IoT applications. Residential, commercial and industrial-grade circuit breaking products for GFCI and AFCI applications. FDA-compliant assembly and packaging manufacturing services.\n•Computing\nSolutions for a wide range of voltage and current options ranging from multi-phase power conversion for VCORE processors, power stage and point of load. Thermal and battery charging solutions as well as high density AC to DC power conversion solutions are also supported.\n•Communications\nHigh efficiency mixed-signal, power management, Wi-Fi and RF connectivity products that enable our customers to maximize the performance of their products while preserving critical battery life. RF tuning solutions to enhance radio performance. Fast charging, multi-media and ambient awareness system solutions to address increasing customer desire for innovation.\nISG\nISG designs and develops CMOS image sensors, proximity sensors, image signal processors, single photon detectors, including SiPM and SPAD arrays, radar, as well as actuator drivers for autofocus and image stabilization for a broad base of end-users in the different end-markets. Our broad range of product offerings delivers excellent pixel performance, sensor functionality and camera systems capabilities in which high quality visual imagery is becoming increasingly important to our customers and their end-users, particularly in applications powered by AI. Certain of ISG's broad portfolio of products and solutions are summarized below:\n•Automotive Imaging\nA broad portfolio of automotive sensing technologies spanning ultrasonic, imaging, radar and LiDAR, paving the way for high levels of ADAS and automated driving with built in functional safety and cybersecurity processing.\n•Industrial Imaging\nA broad range of CMOS and SiPM sensors with an emphasis on machine vision for factory automation, robotics and logistics, intelligent transportation systems, agriculture, medical, cinematography, scientific and aerospace/defense applications.\n•Wireless and Consumer Electronics\nA broad range of CMOS sensors and driver actuators for high performance AR/VR, drones, mobile phones, PCs, tablets, high-speed video cameras, and various unique consumer applications. Our solutions offer superior image quality, fast frame rates, high definition and low light sensitivity to provide customers with a compelling visual experience, especially in emerging applications in IoT markets for security, surveillance and internet protocol cameras.\nCustomers\nWe sell our products to distributors, OEMs and electronic manufacturing service providers for ultimate use in a variety of end-products in different end-markets. In general, we have maintained long-term relationships with our key customers. Sales agreements with customers are renewable periodically and contain certain terms and conditions with respect to payment, delivery, warranty and supply, but generally do not require minimum purchase commitments. Our distributors generally negotiate pricing terms on a quarterly basis, most of our OEM customers negotiate pricing terms on an annual basis near the end of the calendar year and electronic manufacturing service providers negotiate prices periodically during the year. Pricing terms on product development agreements are negotiated at the beginning of a project. With respect to customers in public sector, the government’s remedies may include suspension or debarment from future government business. In addition, almost\nall of our contracts have default provisions, and certain of our contracts in the public sector are terminable at any time for convenience of the contracting agency.\nWe generally warrant that products sold to our customers will, at the time of shipment, be free from defects in workmanship and materials and conform to our approved specifications. Our standard warranty extends for a period of two years from the date of delivery, except in the case of image sensor products, which are warrantied for one year from the date of delivery. Our customers may cancel orders 30 days prior to shipment for standard products and, generally prior to start of production for custom products without incurring a penalty. For the year ended December 31, 2020, aggregate revenue from our five largest customers for PSG, ASG and ISG, comprised approximately 46%, 36% and 43%, respectively, of the respective segment revenue. The loss of certain of these customers may have a material adverse effect on the operations of the respective segment and our consolidated results of operations.\nDistributors\nSales to distributors accounted for approximately 60% of our revenue in 2020, 57% of our revenue in 2019 and 60% of our revenue in 2018. We had one distributor whose revenue accounted for approximately 11% of the total revenue for the year ended December 31, 2020. Our distributors resell to mid-sized and smaller OEMs and to electronic manufacturing service providers and other companies. Sales to distributors are typically made pursuant to agreements that provide return rights and stock rotation provisions permitting limited levels of product returns.\nOEMs\nSales to OEMs accounted for approximately 34% of our revenue in 2020, 36% of our revenue in 2019 and 34% of our revenue in 2018. OEM customers include a variety of companies in the electronics industry. We focus on three types of OEMs: multi-nationals; selected regional accounts; and target market customers. Large multi-nationals and selected regional accounts, which are significant in specific markets, are our core OEM customers. The target market customers for our end-markets are OEMs that are on the leading edge of specific technologies and provide direction for technology and new product development. Generally, our OEM customers do not have the right to return our products following a sale other than pursuant to our warranty.\nElectronic Manufacturing Service Providers\nSales to electronic manufacturing service providers accounted for approximately 6% of our revenue in 2020, 7% of our revenue in 2019 and 6% of our revenue in 2018. These customers are manufacturers who typically provide contract manufacturing services for OEMs. Many OEMs outsource a large part of their manufacturing to electronic manufacturing service providers in order to focus on their core competencies. Generally, our electronic manufacturing service customers do not have the right to return our products following a sale other than pursuant to our warranty.\nFor additional information regarding agreements with our customers, see \"Markets,\" \"Resources\" and \"Risk Factors - Trends, Risks and Uncertainties Related to Our Business\" included elsewhere in this Form 10-K and Note 2: \"Significant Accounting Policies - Revenue Recognition\" in the notes to our audited consolidated financial statements included elsewhere in this Form 10-K.\nMarkets\nProduct development\nOur new product development efforts continue to be focused on building solutions in areas that appeal to customers in focused market segments and across multiple high-growth applications. We collaborate with our customers to identify desired innovations in electronic systems in each end-market that we serve. This enables us to participate in the fastest growing sectors of the market. We also innovate in advanced packaging technologies to support ongoing size reduction in electronic systems and in advanced thermal packaging to support high performance power conversion applications. It is our practice to regularly re-evaluate our research and development spending, to assess the deployment of resources and to review the funding of high-growth technologies. We deploy people and capital with the goal of maximizing the return for our research and development investments by targeting innovative products and solutions for high growth applications that position us to outperform the industry. Our design expertise in analog, digital, mixed signal and imaging ICs, combined with our extensive portfolio of standard products enable us to offer comprehensive, value-added solutions to our global customers for their electronics systems.\nEnd-Markets\nWe serve a broad base of end-user markets, including automotive, industrial, medical, aerospace/defense, communications, networking, wireless, consumer and computing. The following table sets forth our principal end-markets, the estimated percentage (based in part on information provided by our distributors and electronic manufacturing service providers) of our revenue generated from each end-market during 2020, and sample applications for our products. Our industrial end-market includes the data relating to the medical, aerospace and defense and our communications end-market includes the data relating to the networking and wireless.\nCompetition\nWe face significant competition from major international semiconductor companies, as well as smaller companies focused on specific market niches. Because some of our components are often building block semiconductors that, in some cases, can be integrated into more complex ICs, we also face competition from manufacturers of ICs, ASICs and fully-customized ICs, as well as customers who develop their own IC products. See \"Risk Factors-Trends, Risks and Uncertainties Related to Our Business\" included elsewhere in this Form 10-K for additional information.\nIn comparison, several of our competitors are larger in scale and size, have substantially greater financial and other resources with which to pursue development, engineering, manufacturing, marketing and distribution of their products and may generally be better situated to withstand adverse economic or market conditions. The semiconductor industry has experienced, and may continue to experience, significant consolidation among companies and vertical integration among customers. The following discusses the effects of competition on our three operating segments:\nPSG\nOur competitive strengths include our core competencies of leading edge fabrication technologies, micro packaging expertise, breadth of product line and IP portfolio, high quality cost effective manufacturing and supply chain management which ensures supply to our customers. Our commitment to continual innovation allows us to provide an ever broader range of semiconductor solutions to our customers who differentiate in power density and power efficiency, the key performance characteristics driving our markets.\nThe principal methods of competition in our discrete, module and integrated semiconductor products are through new products and package innovations enabling enhanced performance over existing products. Of particular importance are our power MOSFETs, IGBTs, WBG MOSFETs and diodes, including SiC and GaN rectifiers and power module portfolio for power conversion applications, and ESD portfolio for hi-speed serial interface protection products, where we believe we have significant performance advantages over our competition. PSG's competitors include: Broadcom Limited (\"Broadcom\"), Diodes Incorporated, Infineon Technologies AG (\"Infineon\"), KEC Corporation, Nexperia BV, Rohm Semiconductor USA LLC (\"Rohm\"), Semtech Corporation, STMicroelectronics N.V. (\"STMicroelectronics\"), Texas Instruments Incorporated (\"TI\"), Toshiba Corporation (\"Toshiba\") and Vishay Intertechnology, Inc.\nASG\nASG principally competes on design experience, manufacturing capability, depth and quality of IP, ability to service customer needs from the design phase to the shipping of a completed product, length of design cycle, longevity of technology support and experience of sales and technical support personnel. Our competitive position with respect to the above basis is enhanced by long-standing relationships with leading OEM customers.\nOur ability to compete successfully depends on internal and external variables. These variables include, but are not limited to, the timeliness with which we can develop new products and technologies, product performance and quality, manufacturing yields and availability of supply, customer service, pricing, industry trends and general economic trends. Competitors for certain of ASG's products and solutions include: Infineon, NXP Semiconductors N.V. (\"NXP\"), STMicroelectronics and TI.\nISG\nISG differentiates itself from the competition through deep technical knowledge and close customer relationships to drive leading edge sensing performance for both human and machine vision applications. ISG has significant imaging experience and was one of the earliest to commercialize CMOS active pixel sensors and introduce CMOS technology in many of our markets. ISG has leveraged this expertise into market leading positions in automotive and industrial applications, which allows us to offer technical and end-user applications knowledge to help customers develop innovative sensing solutions across a broad range of end-user needs.\nCompetitors for certain of ISG's products and solutions include: Sony Semiconductor Manufacturing Corporation (\"Sony Semiconductor\"), Samsung Electronics Co., Ltd. (\"Samsung\"), Omnivision, STMicroelectronics and Toshiba for image sensors; Rohm, Renesas Electronics Corporation and Dongwoon Anatech Co., Ltd. for actuator drivers; TI, NXP, and Infineon for radar; and Hamamatsu Photonics K.K., Broadcom and ST Microelectronics for SiPMs and SPADs.\nSales, Marketing and Distribution\nAs of December 31, 2020, our sales and marketing organization consisted of approximately 1,700 professionals servicing customers globally. We support our customers through just-in-time warehouses. We have global distribution centers in China, the Philippines and Singapore. Global and regional distribution channels further support our customers' needs for quick response and service. We offer efficient, cost-effective global applications support from our technical information centers and solution engineering centers, allowing for applications that are developed in one region of the world to be instantaneously available throughout all other regions.\nBacklog\nOur trade sales are made primarily pursuant to orders that are predominantly booked as far as 26 weeks in advance of delivery. Generally, prices and quantities are fixed at the time of booking. Backlog as of a given date consists of existing orders and forecasted demand from our EDI customers, in each case scheduled to be shipped over the 13-week period following such date. Backlog is influenced by several factors, including market demand, pricing and customer order patterns in reaction to product lead times. During 2020, our backlog at the beginning of each quarter represented between 85% and 97% of actual revenue during such quarter, which is slightly higher than the backlog levels in recent prior periods. As manufacturing capacity utilization in the industry increases, customers tend to order products further in advance and, as a result, backlog at the beginning of a period as a percentage of revenue during such period is likely to increase.\nIn the semiconductor industry, backlog quantities and shipment schedules under outstanding purchase orders are frequently revised to reflect changes in customer needs. Agreements calling for the sale of specific quantities are either contractually subject to quantity revisions or, as a matter of industry practice, are often not enforced. Therefore, a significant portion of our order backlog may be cancellable. For these reasons, the amount of backlog as of any particular date may not be an accurate indicator of future results.\nWe sell products to key customers pursuant to contracts that allow us to schedule production capacity in advance and allow the customers to manage their inventory levels consistent with just-in-time principles while shortening the cycle times required for producing ordered products. However, these contracts are typically amended to reflect changes in customer demands and periodic price re-negotiations. We routinely generate inventory based on customers' estimates of end-user demand for their products, which are difficult to predict. See \"Risk Factors-Trends, Risks and Uncertainties Related to Our Business\" located elsewhere in this Form 10-K for additional information regarding the inventory practices within the semiconductor industry.\nResources\nRaw Materials\nOur manufacturing processes use many raw materials, including silicon wafers, SiC wafers, laminate substrates, gold, copper, lead frames, mold compound, ceramic packages and various chemicals and gases as well as other production supplies used in our manufacturing processes. We obtain our raw materials and supplies from a large number of sources, generally on a just-in-time basis, and material agreements with our suppliers that impose minimum or continuing supply obligations are reflected in our contractual obligations table in \"Management's Discussion and Analysis of Financial Condition and Results of Operations-Liquidity and Capital Resources-Contractual Obligations\" included elsewhere in this Form 10-K. From time to time, suppliers may extend lead times, limit supplies or increase prices due to capacity constraints or other factors. Although we believe that supplies of the raw materials we use are currently and will continue to be available, shortages could occur in various essential materials due to interruption of supply as experienced during the COVID-19 pandemic and increased demand in the industry or other factors.\nManufacturing and Design Operations\nWe currently have domestic design operations in Arizona, California, Idaho, New York, Oregon, Pennsylvania, Rhode Island, Texas, Utah and Virginia. We also have foreign design operations in Australia, Belgium, Canada, China, the Czech Republic, France, Germany, India, Ireland, Israel, Italy, Japan, South Korea, the Philippines, Romania, Russia, Singapore, Slovak Republic, Slovenia, Switzerland, Taiwan and the United Kingdom.\nWe operate front-end wafer fabrication facilities in Belgium, the Czech Republic, Japan, South Korea, Malaysia and the United States and back-end assembly and test site facilities in Canada, China, Malaysia, the Philippines, Vietnam and the United States. In addition to these front-end and back-end manufacturing operations, our facility in Rožnov pod Radhoštěm, Czech Republic manufactures silicon wafers that are used by a number of our facilities.\nThe table below sets forth information with respect to the manufacturing facilities we operate either directly or pursuant to joint ventures, the reportable segments that use such facilities, and the approximate gross square footage of each site's building, which includes, among other things, manufacturing, laboratory, warehousing, office, utility, support and unused areas.\n_______________________\n(1)These facilities are leased.\n(2)This facility is used for both front-end and back-end operations.\n(3)These facilities are located on leased land.\n(4)In February and August 2020, we announced that we are exploring the sales of the front-end manufacturing facilities in Oudenaarde, Belgium and Niigata, Japan, respectively.\nSee Note 5: ''Acquisitions, Divestiture and Licensing Transactions'' in the notes to our audited consolidated financial statements included elsewhere in this Form 10-K regarding the pending acquisition of a manufacturing facility in 2022.\nWe operate all of our existing manufacturing facilities directly except our assembly and test operations facility located in Leshan, China, which is owned by Leshan-Phoenix Semiconductor Company Limited, a joint venture company in which we own 80% of the outstanding equity interests (\"Leshan\"). The financial and operating results of Leshan have been consolidated in our financial statements. Our joint venture partner in Leshan, Leshan Radio Company Ltd. (\"Leshan Radio\"), is formerly a state-owned enterprise. Pursuant to the joint venture agreement between us and Leshan Radio, requests for production capacity are made to the board of directors of Leshan by each shareholder of the joint venture. Each request represents a purchase commitment, provided that any shareholder may elect to pay the cost associated with the unused capacity (which is generally equal to the fixed cost of the capacity) in lieu of satisfying the commitment. We committed to purchase 80% of Leshan's production capacity in each of 2020, 2019 and 2018 and are currently committed to purchase approximately 80% of Leshan's expected production capacity in 2021.\nOn April 1, 2020, we acquired the remaining 40% of the equity interest in ON Semiconductor Aizu Co. Ltd., (\"OSA\") from Fujitsu Semiconductor Limited (\"FSL\"), whereby OSA became a wholly-owned subsidiary of the Company. The\nmanufacturing facility located in Aizuwakamatsu, Japan is owned by OSA. The purchase price payable to FSL for the remaining 40% equity, offset by the purchase price adjustment, resulted in us receiving $26.0 million in settlement of the purchase price from FSL. The results of OSA have been consolidated in our financial statements since the fourth quarter of 2018, when we acquired the majority equity interest.\nWe use third-party contractors for some of our manufacturing activities, primarily for wafer fabrication and the assembly and testing of finished goods. Our agreements with these contract manufacturers typically require us to forecast product needs and commit to purchase services consistent with these forecasts. In some cases, longer-term commitments are required in the early stages of the relationship. These contract manufacturers collectively accounted for approximately 33% of our total manufacturing input costs in 2020, 31% in 2019 and 36% in 2018.\nFor information regarding risks associated with our foreign operations, see \"Risk Factors -Trends, Risks and Uncertainties Related to Our Business\" included elsewhere in this Form 10-K.\nPatents, Trademarks, Copyrights and Other Intellectual Property Rights\nWe market our products primarily under our registered trademark ON Semiconductor® and our ON logo, and, in the United States and internationally, we rely primarily on a combination of patents, trademarks, copyrights, trade secrets, employee and non-disclosure agreements and licensing agreements to protect our IP. We acquired or were licensed or sublicensed to a significant amount of IP, including patents and patent applications, in connection with our acquisitions, and we have numerous U.S. and foreign patents issued, allowed and pending. As of December 31, 2020, we held patents with expiration dates ranging from 2021 to 2040, and none of the patents that expire in the next three years materially affect our business. Our policy is to protect our products and processes by asserting our IP rights where appropriate and prudent and by obtaining patents, copyrights and other IP rights used in connection with our business when practicable and appropriate.\nSeasonality\nWe believe our business today is driven more by content gains within applications and secular growth drivers and not solely by macroeconomic and industry cyclicality, as was the case historically. As we did in 2020, we could again experience period-to-period fluctuations in operating results due to general industry or macroeconomic conditions. Although the significant fluctuation experienced during 2020 was mainly due to the COVID-19 pandemic, we continue to employ measures to lower the impact of general industry cyclicality on our results by focusing on product diversification and content gains. For information regarding risks associated with the cyclicality and seasonality of our business, see \"Risk Factors-Trends, Risks and Uncertainties Related to Our Business\" included elsewhere in this Form 10-K.\nGovernment Regulation\nOur manufacturing operations are subject to environmental and worker health and safety laws and regulations. These laws and regulations include those relating to emissions and discharges into the air and water, the management and disposal of hazardous substances, the release of hazardous substances into the environment at or from our facilities and at other sites and the investigation and remediation of contamination. As with other companies engaged in like businesses, the nature of our operations exposes us to the risk of liabilities and claims, regardless of fault, with respect to such matters, including personal injury claims and civil and criminal fines.\nWe believe that our operations are in material compliance with applicable environmental and health and safety laws and regulations. The costs we incurred in complying with applicable environmental regulations for the year ended December 31, 2020 were not material, and we do not expect the cost of complying with existing environmental and health and safety laws and regulations, together with any liabilities for currently known environmental conditions, to have a material adverse effect on the capital expenditures or earnings of ours or our subsidiaries' competitive position. It is possible, however, that future developments, including changes in laws and regulations, government policies, customer specification, personnel and physical property conditions, including currently undiscovered contamination, could lead to material costs, and such costs may have a material adverse effect on our future business or prospects. See Note 13: ''Commitments and Contingencies'' in the notes to our audited consolidated financial statements included elsewhere in this Form 10-K for information on certain environmental matters.\nWe are also subject to numerous United States and foreign laws and regulations, including, without limitation, tariffs, trade sanctions, trade barriers, trade embargoes, regulations relating to import-export control, technology transfer restrictions, the International Traffic in Arms Regulation promulgated under the Arms Export Control Act (\"ITAR\"), the Foreign Corrupt Practices Act (\"FCPA\"), and the anti-boycott provisions of the U.S. Export Administration Act. Additionally, U.S. or China\ngovernmental authorities have taken, and may continue to take, administrative, legislative or regulatory action that could impact our operations.\nWe believe that our operations are in material compliance with applicable trade regulations relating to import-export control, technology transfer restrictions, ITAR, FCPA, the anti-boycott provisions of the U.S. Export Administration Act, and similar applicable laws and regulations. The costs we incurred in complying with applicable trade regulations for the year ended December 31, 2020 were not material, and we do not expect the cost of complying with existing trade laws and regulations to have a material adverse effect on the capital expenditures, or earnings of ours or our subsidiaries' competitive position. It is possible, however, that future developments, including changes in laws and regulations or government policies, could lead to material costs, and such costs may have a material adverse effect on our future business or prospects. For information regarding risks associated with import-export control regulations and similar applicable laws and regulations, see \"Risk Factors-Trends, Risks and Uncertainties Related to Our Business\" included elsewhere in this Form 10-K.\nHuman Capital Resources\nCore Principles\nOur success depends on our ability to attract, train, retain and motivate our employees, particularly highly-skilled engineers involved in the design, development, manufacture and support of new and existing products and services. We are a member of the Responsible Business Alliance (\"RBA\"). The principles of the RBA are fundamental to our corporate culture and core values and are reflected in our commitments to our employees, customers, communities and other stakeholders. These principles include providing a safe and positive work environment to our employees that emphasizes learning and professional development and respect for individuals and ethical conduct.\nHeadcount\nAs of December 31, 2020, we had approximately 31,000 regular full-time employees and approximately 3,500 part-time and temporary employees in facilities located in 34 countries. Approximately 13% of our regular full-time employees are located in the United States and Canada, 13% in Europe and Middle Eastern countries and 74% in Asia Pacific and Japan, with approximately 68% engaged in manufacturing, 3% directly in research and development, 6% in customer service or other aspects of sales and marketing, and 23% in other roles. Approximately 111 of our domestic employees (or approximately 3% of our U.S. based employees) are covered by a collective bargaining agreement. All of these employees are located at our Mountain Top, Pennsylvania manufacturing facility. Certain of our foreign employees are covered by collective bargaining arrangements (e.g., those in China, Vietnam, Japan, the Czech Republic and Belgium) or similar arrangements or are represented by workers councils.\nDiversity, Equity and Inclusion\nWe are consciously expanding the diversity of our workforce, creating growth and development opportunities for our employees, embracing different perspectives and fostering an inclusive work environment. We have organization level and overall Company metrics to monitor for diverse directors and above, diverse new hires and diverse promotions. Our Human Resources organization and the Compensation Committee of the board of directors of the Company (the \"Board of Directors\"), through its charter, provides oversight of our policies, programs and initiatives focusing on workflow equity and workplace inclusion.\nCompensation, Benefits, Health, Safety and Wellness\nOur compensation philosophy is focused on delivering total rewards based on corporate affordability in a way that enables attraction, retention, and recognition of performance delivered in an equitable manner. We provide our employees and their families with access to flexible and convenient health and wellness programs, including benefits that secure them during events that may require time away from work or that impact their financial well-being. Our primary focus during the COVID-19 pandemic has been protecting the health and safety of our employees and the communities in which we operate. In response to the COVID-19 pandemic, we implemented appropriate changes in the best interest of our employees and the communities in which we operate, all in compliance with applicable law. We use a combination of total rewards and other programs (which vary by region and salary grade) to attract and retain our employees, including: annual performance bonuses; stock awards, including an employee stock purchase plan; retirement support; healthcare and insurance benefits; business travel and disability insurance; health savings and flexible spending accounts; flexible work schedules, vacation and paid time off; parental leave; paid counseling assistance; backup child and adult care; education assistance; and on-site services, such as health centers and fitness centers.\nCareer Growth and Development\nWe invest resources in professional development and growth as a means of improving employee motivation, performance and improving retention. Our talent development programs provide employees with the resources they need to help achieve their career goals, build management skills and lead their organizations. We have established a leadership pathway model as a tool for employees to practice and apply learning as part of their development.\nTurnover\nOur voluntary employee turnover rate in 2020 was approximately 9.1%, which rate includes the employees who exited pursuant to the Voluntary Separation Program (\"VSP\") offered during the year. We monitor employee turnover rates by region and the Company as a whole. The average tenure of our employees is approximately seven years and approximately one-fifth of our employees have been employed by us for more than 10 years. We believe our compensation philosophy along with the career growth and development opportunities promotes longer employee tenure and reduces voluntary turnover.\nExecutive Officers of the Registrant\nCertain information concerning our executive officers as of February 16, 2021 is set forth below.\nName Age Position\nHassane S. El-Khoury 41 President, Chief Executive Officer and Director\nBernard Gutmann 61 Executive Vice President, Chief Financial Officer and Treasurer(1)\nThad Trent 53 Executive Vice President, Chief Financial Officer and Treasurer(2)\nGeorge H. Cave 63 Executive Vice President, General Counsel, Chief Compliance Officer, Chief Risk Officer and Secretary\nVincent C. Hopkin 58 Executive Vice President and General Manager, ASG\nRoss F. Jatou 52 Senior Vice President and General Manager, ISG\nSimon Keeton 48 Executive Vice President and General Manager, PSG\nPaul E. Rolls 58 Executive Vice President, Sales and Marketing\n(1)Mr. Gutmann will retire from his position as Executive Vice President, Chief Financial Officer and Treasurer, effective as of the filing of this Form 10-K on February 16, 2021.\n(2)In connection with Mr. Gutmann’s retirement, on January 24, 2021, the Board of Directors approved the appointment of Mr. Trent as Executive Vice President, Chief Financial Officer and Treasurer, effective immediately following the filing of this Form 10-K on February 16, 2021.\nAll of our executive officers are also officers of SCI LLC. The present term of office for the officers named above will generally expire on the earliest of their retirement, resignation or removal. There is no family relationship among our executive officers.\nHassane S. El-Khoury. Mr. El-Khoury was elected as a Director of ON Semiconductor and appointed as President and Chief Executive Officer of ON Semiconductor and SCI LLC in December 2020. Prior to joining ON Semiconductor, he spent 13 years at Cypress Semiconductor Corporation, a semiconductor design and manufacturing company (\"Cypress\"), serving as Chief Executive Officer from August 2016 to April 2020. During his time at Cypress, he held various positions spanning business unit management, product development, applications engineering and business development. Additionally, Mr. El-Khoury currently serves as a member of the board of directors at KeraCel, Inc. He holds a Bachelor of Science in electrical engineering from Lawrence Technological University and a Master's of Engineering Management from Oakland University.\nBernard Gutmann. As previously reported, Mr. Gutmann has announced his retirement as Executive Vice President, Chief Financial Officer and Treasurer of ON Semiconductor and SCI LLC, effective as of February 16, 2021 upon the filing of this Form 10-K. Mr. Gutmann was promoted and appointed Executive Vice President and Chief Financial Officer of ON Semiconductor and SCI LLC in September 2012 and has served as ON Semiconductor's and SCI LLC's Treasurer since January 2013. Before his promotion, he worked with the Company as Vice President, Corporate Analysis & Strategy of SCI LLC, serving in that position from April 2006 to September 2012. In these roles, his responsibilities have included finance integration, financial reporting, restructuring, tax, treasury and financial planning and analysis. From November 2002 to April 2006, Mr. Gutmann served as Vice President, Financial Planning & Analysis and Treasury of SCI LLC. From September 1999\nto November 2002, he held the position of Director, Financial Planning & Analysis of SCI LLC. Prior to joining ON Semiconductor, Mr. Gutmann served in various financial positions with Motorola from 1982 to 1999, including controller of various divisions and an off-shore wafer and backend factory, finance and accounting manager, financial planning manager and financial analyst. He holds a Bachelor of Science in Management Engineering from Worcester Polytechnic Institute in Massachusetts (U.S.). Additionally, he is fluent in English, French and Spanish and is conversant in German.\nThad Trent. Mr. Trent was appointed Executive Vice President, Chief Financial Officer and Treasurer of ON Semiconductor and SCI LLC, effective as of February 16, 2021 immediately following the filing of this Form 10-K. Mr. Trent previously served as the Chief Financial Officer and Executive Vice President of Finance & Administration at Cypress between June 2014 and April 2020. Mr. Trent joined Cypress in 2005 and became a Vice President of Finance at Cypress in 2010. Prior to serving as Chief Financial Officer of Cypress, he led the strategic planning functions for Cypress’ business units and worldwide operations and managed the financial reporting, accounting, and planning and analysis functions for Cypress. Prior to joining Cypress, Mr. Trent held finance leadership roles at publicly-traded companies Wind River Systems, a developer of embedded systems software, and Wyle Electronics, a distributor of high-tech electronic components, as well as two technology startups. Mr. Trent holds a Bachelor of Science degree in business administration and finance from San Diego State University.\nGeorge H. \"Sonny\" Cave. Mr. Cave is the founding General Counsel and Secretary of ON Semiconductor, positions he has held since the 1999 spin-out from Motorola. He is also Executive Vice President, Chief Compliance Officer and Chief Risk Officer of ON Semiconductor and SCI LLC. His extensive legal and business experience spans over 30 years, including seven years with Motorola. For two years prior to ON Semiconductor’s spin-out, he was an ex-patriate stationed in Geneva, Switzerland as Regulatory Affairs Director for Motorola’s Semiconductor Components Group. Before that assignment, he spent five years with Motorola’s Corporate Law Department in Phoenix, Arizona, where he was Senior Counsel for global Environmental Health and Safety. Mr. Cave also practiced law for six years with two large law firms in Denver and Phoenix. He has extensive experience in corporate and commercial law, governance, enterprise risk management and compliance and ethics. He holds a Juris Doctorate degree from the University of Colorado School of Law, a Master of Science degree from Arizona State University and a Bachelor of Science degree cum laude from Duke University.\nVincent C. Hopkin. Mr. Hopkin joined the Company in March 2008 and currently serves as Executive Vice President and General Manager, ASG of ON Semiconductor and SCI LLC. From September 2016 to May 2018, he was Senior Vice President and General Manager of the Digital and DC/DC Solutions Division. He has more than three decades of experience in the electronics industry. During his career, Mr. Hopkin has held various leadership positions within business units, sales and manufacturing. Prior to joining ON Semiconductor in 2008, he successfully managed several businesses including ASIC, military/aerospace, image sensing and foundry services at AMIS. Mr. Hopkin joined AMIS in 1983 and worked in several operations functions. Mr. Hopkin holds a Bachelor of Science degree in management and organizational behavior from Idaho State University.\nRoss F. Jatou. Mr. Jatou joined ON Semiconductor in 2015 as the Vice President and General Manager of the Automotive Solutions Division within the Company’s ISG. In October 2020, he was named Senior Vice President and General Manager, ISG of ON Semiconductor and SCI LLC, assuming leadership of both the divisions within ISG: the Automotive Sensing Division and the Industrial and Consumer Solutions Division. Prior to ON Semiconductor, Mr. Jatou had an extensive career with NVIDIA Corporation of nearly 15 years, where he was the Vice President of Hardware Engineering. His background and experience include product development, engineering management, and automotive design quality and forecasting, and he is an expert in imaging graphics and system interfaces, telecommunications, high performance computing, automotive and embedded solutions. He has a Bachelor of Science degree in electrical engineering and a Master of Applied Science in millimeter wave technology and parallel processing from the University of Toronto. Mr. Jatou completed executive business programs from Stanford University School of Business and Harvard Business School.\nSimon Keeton. Mr. Keeton joined the Company in July 2007 and is currently the Executive Vice President and General Manager, PSG of ON Semiconductor and SCI LLC. During his career, Mr. Keeton has held various management positions within the Company. Before Mr. Keeton’s promotion to his current role on January 1, 2019, he was a Senior Vice President and General Manager of the MOSFET Division. From 2012 to 2016, Mr. Keeton served as Vice President and General Manager of the Integrated Circuit Division under our former Standard Products Group. Prior to that time, he served as Vice President and General Manager of the Consumer Products Division from 2009 to 2012 and as Business Unit Director of our Signals and Interface Business Unit from 2007 to 2009. Before joining the Company, Mr. Keeton served as Strategic Planning Manager of the Digital Enterprise Group of Intel Corporation (\"Intel\") and held various marketing and business management roles at Vitesse Semiconductor Corporation.\nPaul E. Rolls. Mr. Rolls was promoted and appointed Executive Vice President, Sales and Marketing of ON Semiconductor and SCI LLC in July 2013. Before his promotion, he served as Senior Vice President, Japan Sales and Marketing and Senior\nVice President of Global Sales Operations, serving in that position from October 2012 to July 2013. Mr. Rolls has more than 26 years of technology sales, sales management and operations experience, with more than 19 years of sales and sales management experience in the semiconductor industry. Before joining the Company, Mr. Rolls was the Senior Vice President, Worldwide Sales and Marketing at Integrated Device Technology, Inc. from January 2010 to April 2012. From August 1996 to December 2009, he held multiple sales positions at International Rectifier Corp., most recently as Senior Vice President, Global Sales. During his career, he has also held management roles at Compaq Computer Corporation.\nAvailable Information\nWe make our annual report on Form 10-K, quarterly reports on Form 10-Q, current reports on Form 8-K and all amendments to those reports available, free of charge, in the \"Investor Relations\" section of our website as soon as reasonably practicable after we electronically file these materials with, or furnish these materials to the SEC. Our website is www.onsemi.com. Information on or connected to our website is neither part of, nor incorporated by reference into, this Form 10-K or any other report filed with or furnished to the SEC. You will find these materials on the SEC website at www.sec.gov, which contains reports, proxy statements and other information regarding issuers that file electronically with the SEC.",
    "item_1A": "Item 1A. Risk Factors\nForward-Looking Statements\nThis Annual Report on Form 10-K includes \"forward-looking statements,\" as that term is defined in Section 27A of the Securities Act and Section 21E of the Exchange Act. All statements, other than statements of historical facts, included or incorporated in this Form 10-K could be deemed forward-looking statements, particularly statements about our plans, strategies and prospects under the headings \"Management’s Discussion and Analysis of Financial Condition and Results of Operations\" and \"Business.\" Forward-looking statements are often characterized by the use of words such as \"believes,\" \"estimates,\" \"expects,\" \"projects,\" \"may,\" \"will,\" \"intends,\" \"plans,\" \"anticipates,\" \"should\" or similar expressions, or by discussions of strategy, plans or intentions. All forward-looking statements in this Form 10-K are made based on our current expectations, forecasts, estimates and assumptions, and involve risks, uncertainties and other factors that could cause results or events to differ materially from those expressed in the forward-looking statements. Readers are cautioned not to place undue reliance on forward-looking statements. We assume no obligation to update such information, except as may be required by law.\nYou should carefully consider the trends, risks and uncertainties described below and other information in this Form 10-K and subsequent reports filed with or furnished to the SEC before making any investment decision with respect to our securities. If any of the following trends, risks or uncertainties actually occurs or continues, our business, financial condition or operating results could be materially adversely affected, the trading prices of our securities could decline, and you could lose all or part of your investment. All forward-looking statements attributable to us or persons acting on our behalf are expressly qualified in their entirety by this cautionary statement.\nSummary Risk Factors\nAn investment in the Company’s stock involves a certain measure of risk. Some of the factors that could materially and adversely affect our business, financial condition, results of operations, liquidity, and prospects for future growth include, but are not limited to, the following. If any of the factors listed below occurs, the market price of our shares could decline, and you may lose some or all of your investment. You should read this summary together with the more detailed description of each risk factor contained in \"Risk Factors\" in this Annual Report on Form 10-K.\nTrends, Risks and Uncertainties Related to Our Business\n•Changes in, and the regulatory implementation of, tariffs or other government trade policies could reduce demand for our products, limit our ability to sell our products to certain customers or comply with applicable laws and regulations.\n•Many of our facilities and processes are interdependent and an operational disruption at any particular facility could have a material adverse effect on our ability to produce many of our products.\n•The effects of the COVID-19 pandemic have had, and could continue to have, an adverse impact on our business, results of operations and financial condition.\n•We may be unable to identify and make the substantial research and development investments or develop new products required to satisfy customer demands or regulatory requirements as required to remain competitive in our business.\n•A significant portion of our revenue is derived from customers in the automotive, industrial and communications\nindustries, and a downturn or lower sales to customers in one or more of these industries could occur.\n•We may be unable to maintain manufacturing efficiency.\n•We may be unable to successfully implement cost reduction initiatives, including through restructuring activities.\n•Uncertainties regarding the timing and amount of customer orders could lead to excess inventory and write-downs of inventory.\n•The semiconductor industry is highly competitive, and has experienced rapid consolidation, and we may be unable to compete effectively or unable to identify attractive opportunities for consolidation.\n•We are dependent on the services of third-party suppliers and contract manufacturers, and we may experience a disruption in or deterioration of the quality of the services or goods delivered by such third parties.\n•We may be subject to warranty claims, product liability claims and product recalls.\n•Currency fluctuations, changes in foreign exchange regulations and repatriation delays and costs could have a material adverse effect on our results of operations and financial condition.\nTrends, Risks and Uncertainties Related to Intellectual Property\n•Our technologies could be subject to claims of infringement on the IP rights of others.\n•We may be unable to protect the IP we use.\nTrends, Risks and Uncertainties Related to Technology and Data Privacy\n•We may be subject to disruptions or breaches of our secured network.\n•We are subject to governmental laws, regulations and other legal obligations related to privacy and data protection.\nTrends, Risks and Uncertainties Related to Regulation\n•We may be subject to environmental and health and safety liabilities and expenditures.\n•Compliance with regulations regarding the use of \"conflict minerals\" could limit the supply and increase the cost of certain raw materials used in manufacturing our products.\n•If we are unable to comply with anti-corruption laws in the jurisdictions we operate, including the FCPA, it could result in penalties that could harm our reputation.\nTrends, Risks and Uncertainties Related to Our Indebtedness\n•Our debt could materially adversely affect our financial condition and results of operations.\n•If we are unable to meet our obligations under our Amended Credit Agreement, it could materially and adversely affect our business, results of operations and financial condition.\n•The agreements relating to our indebtedness, including the Amended Credit Agreement and the 3.875% Notes, may restrict our ability to operate our business.\n•We may not be able to generate sufficient cash flow to meet our debt service obligations.\n•An event of default under any agreement relating to our outstanding indebtedness could cross default other indebtedness.\n•Our operating subsidiaries have no independent obligation to repay our debt, and may not able to make cash available to us for such repayment.\n•If interest rates increase, our debt service obligations under our variable rate indebtedness could increase significantly.\n•Servicing the 1.625% Notes and the 3.875% Notes may require a significant amount of cash, and we may not have sufficient cash flow or the ability to raise the funds necessary to satisfy our obligations under the 1.625% Notes and the 3.875% Notes in a timely manner.\n•The conditional conversion feature of the 1.625% Notes, if triggered, may adversely affect our financial condition and results of operations and, if we elect to settle the conversion of the 1.625% Notes in common stock, any such settlement could materially dilute the ownership interests of existing stockholders.\n•Note hedge and warrant transactions we have entered into may materially adversely affect the value of our common stock.\n•Counterparty risk with respect to the note hedge transactions, if realized, could have a material adverse impact on our\nresults of operations.\nTrends, Risks and Uncertainties Related to Our Common Stock\n•The stockholders’ rights plan adopted by our Board of Directors may discourage a third party from acquiring us in a manner that might result in a premium price to our stockholders.\n•Provisions in our charter documents may delay or prevent the acquisition of our Company.\nGeneral Risk Factors\n•Downturns or volatility in general economic conditions could have a material adverse effect on our business and results of operations.\n•We may be unable to successfully integrate new strategic acquisitions.\n•Natural disasters, health and safety epidemics and other business disruptions could cause significant harm to our business operations and facilities and could adversely affect our supply chain and our customer base.\n•We could be subject to changes in tax rates or the adoption of new tax legislation or have exposure to additional tax liabilities.\n•We operate a global business through numerous foreign subsidiaries, and there is a risk that tax authorities will challenge our transfer pricing methodologies and/or legal entity structures.\n•We may be unable to attract and retain highly skilled personnel.\n•The failure to comply with the terms and conditions of our contracts could result in, among other things, damages, fines or other liabilities.\n•We are subject to the effects of climate change and the regulatory and legislative developments related to climate change.\n•We may be unable to implement our recent business strategy developments.\n•We may from time to time desire to exit certain product lines or businesses, or to restructure our operations, but may not be successful in doing so.\n•Our operating results depend, in part, on the performance of independent distributors.\nTrends, Risks and Uncertainties Related to Our Business\nChanges in, and the regulatory implementation of, tariffs or other government trade policies could reduce demand for our products, limit our ability to sell our products to certain customers or comply with applicable laws and regulations, which may materially adversely affect our business and results of operations.\nThe imposition of tariffs and trade restrictions as a result of international trade disputes or changes in trade policies may adversely affect our sales and profitability. For example, in recent years, the U.S. government imposed and proposed, among other actions, new or higher tariffs on specified imported products originating from the People's Republic of China (the \"PRC\") in response to what it characterized as unfair trade practices, and the PRC responded by imposing and proposing new or higher tariffs on specified products, including some semiconductors fabricated in the United States and certain transistors, diodes, ICs and other products that we import into the PRC as part of our supply chain. These tariffs, and the related geopolitical uncertainty between the United States and the PRC, may cause decreased end-market demand for our products from distributors and other customers, which could have a material adverse effect on our business and results of operations. Ongoing international trade disputes and changes in trade policies could also impact economic activity and lead to a general contraction of customer demand. In addition, tariffs on components that we import from the PRC or other nations that have imposed, or may in the future impose, tariffs will adversely affect our profitability unless we are able to exclude such components from the tariffs or we raise prices for our products, which may result in our products becoming less attractive relative to products offered by our competitors. Future actions or escalations by either the United States or the PRC that affect trade relations may also impact our business, or that of our suppliers or customers, and we cannot provide any assurances as to whether such actions will occur or the form that they may take. To the extent that our sales or profitability are negatively affected by any such tariffs or other trade actions, our business and results of operations may be materially adversely affected.\nOur international sales and purchases are subject to numerous United States and foreign laws and regulations, including, without limitation, tariffs, trade sanctions, trade barriers, trade embargoes, regulations relating to import-export control, technology transfer restrictions, the International Traffic in Arms Regulation promulgated under the Arms Export Control Act, FCPA and the anti-boycott provisions of the U.S. Export Administration Act. Licenses or proper license exceptions are required\nfor the shipment of our products to certain countries. A determination by the U.S. government or any foreign government that we have failed to comply with trade or export regulations or anti-bribery regulations can result in penalties, including fines, administrative, civil or criminal penalties or other liabilities, seizure of products, or, in the extreme case, denial of export privileges or suspension or debarment from government contracts, which could have a material adverse effect on our sales, business and results of operations.\nAdditionally, U.S. or China governmental authorities have taken, and may continue to take, administrative, legislative or regulatory action that could materially interfere with our ability to make sales to certain of our customers. We could experience unanticipated export bans or other restrictions on our ability to sell to certain customers where sales of products and the provision of services may require export licenses or are prohibited by government action. Export restrictions may also include technical discussions with customers that can impede our ability to pursue design-wins with customers and may impact future sales. In May 2019, the U.S. Department of Commerce added Huawei Technologies Co., Ltd. and certain of its non-U.S. affiliates and subsidiaries (collectively, \"Huawei\") and certain of our other customers to the U.S. Department of Commerce’s Bureau of Industry and Security (the \"BIS\") Entity List (the \"Entity List\"), imposing restrictions on the export and transfer of goods and technologies to such entities. Additionally, in August 2020, the BIS issued final rules that, among other things, further mandated license permissions to ship our products to Huawei and added additional non-U.S. Huawei affiliates to the Entity List. In response to these actions, the PRC has initiated reciprocal actions against the United States as a result of which additional export or other restrictions are anticipated. The terms and duration of any such restrictions may not be known to us in advance and may be subject to ongoing modifications, including modifications that impose more stringent restrictions or conditions on our ability to sell our products and services to certain foreign customers. Even to the extent such restrictions are subsequently modified, lifted or temporarily suspended, any financial or other penalties imposed on affected foreign customers could have a negative impact on future orders. These foreign customers may also respond to sanctions or the threat of sanctions by employing their own solutions to address the impacts of restrictions. The loss or temporary loss of customers as a result of such future regulatory limitations could materially adversely affect our sales, business and results of operations.\nMany of our facilities and processes are interdependent and an operational disruption at any particular facility could have a material adverse effect on our ability to produce many of our products, which could materially adversely affect our business and results of operations\nOur manufacturing platform includes multiple owned and third-party facilities, which may each produce one or more components necessary for the assembly of a single product. As a result of this interdependence, an operational disruption at a facility may have a disproportionate impact on our ability to produce many of our products. In the event of a disruption at any such facility, we may be unable to effectively source replacement components on acceptable terms from qualified third parties, in which case our ability to produce many of our products could be materially disrupted or delayed. Conversely, many of our facilities are single source facilities that only produce one of our end-products, and a disruption at any such facility would materially delay or cease production of the related product. In the event of any such operational disruption, we may experience difficulty in beginning production of replacement components or products at new facilities (for example, due to construction delays) or transferring production to other existing facilities (for example, due to capacity constraints or difficulty in transitioning to new manufacturing processes), any of which could result in a loss of future revenues and materially adversely affect our business and results of operations.\nThe effects of the COVID-19 pandemic have had, and could continue to have, an adverse impact on our business, results of operations and financial condition.\nOur business has been, and is expected to continue to be, adversely impacted by the effects of the COVID-19 pandemic. In addition to global macroeconomic effects, the COVID-19 pandemic and related adverse public health developments have been causing, and are expected to continue to cause, disruption to our domestic and international operations and sales activities. In addition, we and our suppliers, third-party distributors, sub-contractors and customers have been, and are expected to continue to be, disrupted by worker absenteeism, quarantines and restrictions on certain of our employees’ ability to perform their jobs, office and factory closures or restrictions, disruptions to ports and other shipping infrastructure, border closures or other travel or health-related restrictions. Depending on the magnitude of such effects on our manufacturing activities or the operations of our suppliers, third-party distributors or sub-contractors, our supply chain, manufacturing and product shipments could be delayed, which could materially adversely affect our business, results of operations and financial condition. In addition, the COVID-19 pandemic or other disease outbreaks will, in the short-term, and could over the longer term, adversely affect the economies and financial markets of many countries, resulting in an economic downturn or recession that could adversely affect demand for our products and impact our results of operations and financial condition. There can be no assurance that any decrease in sales resulting from the COVID-19 pandemic will be offset by increased sales in subsequent periods. These effects, alone or taken together, could have a material adverse effect on our business, results of operations, legal exposure, or financial condition. The extent of the COVID-19 pandemic’s effect on our operational and financial performance will depend on future\ndevelopments, including the duration, spread and intensity of the pandemic, all of which are uncertain and difficult to predict. Due to the speed with which the situation is developing, we are not able at this time to estimate the long-term effect of these factors on our business, but the adverse impact on our business, results of operations, financial condition and cash flows has been, and could continue to be, material.\nIf we are unable to identify and make the substantial research and development investments or develop new products required to satisfy customer demands or regulatory requirements as required to remain competitive in our business, our business, financial condition and results of operations may be materially adversely affected.\nThe semiconductor industry requires substantial investment in research and development in order to develop and bring to market new and enhanced technologies and products. The development of new products is a complex and time-consuming process and often requires significant capital investment and lead time for development and testing. We cannot assure you that we will have sufficient resources to maintain the level of investment in research and development that is required to remain competitive. In addition, the lengthy development cycle for our products limits our ability to adapt quickly to changes affecting the product markets and requirements of our customers and end-users, and we may be unable to develop innovative responses to our customers’ and end-users’ evolving needs on the timelines they require or at all. There can be no assurance that we will win competitive bid selection processes, known as \"design wins,\" for new products. In addition, design wins do not guarantee that we will make customer sales or that we will generate sufficient revenue to recover design and development investments, as expenditures for technology and product development are generally made before the commercial viability for such developments can be assured. There is no assurance that we will realize a return on the capital expended to develop new products, that a significant investment in new products will be profitable or that we will have margins as high as we anticipate at the time of investment or have experienced historically. To the extent that we underinvest in our research and development efforts, fail to recognize the need for innovation with respect to our products, or that our investments and capital expenditures in research and development do not lead to sales of new products, we may be unable to bring to market technologies and products that are attractive to our customers, and as a result our business, financial condition and results of operations may be materially adversely affected.\nThe semiconductor industry is characterized by rapidly changing technologies, innovation, short product life cycles, evolving regulatory and industry standards and certifications, changing customer needs and frequent new product introductions. Our success is largely dependent on our ability to accurately predict, identify and adapt to changes affecting the requirements of our customers in a timely and cost-effective manner. Products are frequently replaced by more technologically advanced substitutes and, as demand for older technology falls, the price at which such products can be sold drops, in some cases precipitously. If we cannot advance our process technologies or improve our production efficiencies to a degree sufficient to maintain required margins, we will no longer be able to make a profit from the sale of older products. In certain limited cases, we may not be able to cease production of older products, either due to contractual obligations or for customer relationship reasons and, as a result, may be required to bear a loss on such products for a sustained period of time. If reductions in our production costs fail to keep pace with reductions in market prices for the products we sell, our business and results of operations could be materially adversely affected. Additionally, the emergence of new industry or regulatory standards and certification requirements may adversely affect the demand for our products. A fundamental shift in technologies, excess inventory levels for our or our competitors’ products, the regulatory climate or consumption patterns and preferences in our existing product markets or the product markets of our customers or end-users, could result in, or accelerate, price erosion for our products or make them obsolete, prevent or delay the introduction of new products that we planned to make or render our current or new products irrelevant to our customers’ needs. If our new product development efforts fail to align with the needs of our customers, including due to circumstances outside of our control, like a fundamental shift in the product markets of our customers and end-users or regulatory changes, our business and results of operations could be materially adversely affected.\nBecause a significant portion of our revenue is derived from customers in the automotive, industrial and communications industries, a downturn or lower sales to customers in one or more of these industries could materially adversely affect our business and results of operations.\nA significant portion of our sales are to customers within the automotive, industrial (including medical, aerospace and defense) and communications industries (including wireless and networking). Sales into these industries represented approximately 32%, 25%, and 20% of our revenue, respectively, for the year ended December 31, 2020, and those percentages will vary from quarter to quarter. Each of the automotive, industrial and communications industries is cyclical, and, as a result, our customers in these industries are sensitive to changes in general economic conditions, disruptive innovation and end-market preferences, which can adversely affect sales of our products and, correspondingly, our results of operations. Additionally, the quantity and price of our products sold to customers in these industries could decline despite continued growth in their respective end markets. Lower sales to customers in the automotive, industrial or communications industries may have a material adverse effect on our business and results of operations.\nWe may be unable to maintain manufacturing efficiency, which could have a material adverse effect on our results of operations.\nWe believe that our success materially depends on our ability to maintain or improve our current margin levels related to our manufacturing. Semiconductor manufacturing requires advanced equipment and significant capital investment, leading to high fixed costs that include depreciation expense. Manufacturing semiconductor components also involves highly complex processes that we and our competitors are continuously modifying to improve yields and product performance. In addition, impurities, waste or other difficulties in the manufacturing process can lower production yields. Our manufacturing efficiency is and will continue to be an important factor in our future profitability, and we cannot assure you that we will be able to maintain our manufacturing efficiency, increase manufacturing efficiency to the same extent as our competitors, or be successful in our manufacturing rationalization plans. If we are unable to utilize our manufacturing facilities, testing facilities and external manufacturers at expected or minimum purchase obligation levels, or if production capacity increases while revenue does not, the fixed costs and other operating expenses associated with these facilities and arrangements will not be fully absorbed, resulting in higher average unit costs and lower gross profits, which could have a material adverse effect on our results of operations.\nThe failure to successfully implement cost reduction initiatives, including through restructuring activities, could materially adversely affect our business and results of operations.\nFrom time to time, we have implemented cost reduction initiatives, including relocating manufacturing to lower cost regions, transitioning higher-cost external supply to internal manufacturing, working with our material suppliers to lower costs, implementing personnel reductions and voluntary retirement programs, reducing employee compensation, temporary or permanent shutdowns of facilities, and aggressively streamlining our overhead. In addition, we continuously monitor productivity and capital expenditures at our facilities in order to make strategic determinations regarding the temporary or permanent shutdown or disposition of facilities to improve our cost structure. In the past, we have recorded net restructuring charges to cover costs associated with our cost reduction initiatives. These costs have been primarily composed of employee separation costs (including severance payments) and asset impairments. We also often undertake restructuring activities and programs to improve our cost structure in connection with our business acquisitions, which can result in significant charges, including charges for severance payments to terminated employees and asset impairment charges.\nWe cannot assure you that our cost reduction and restructuring initiatives will be successfully or timely implemented or that they will materially and positively impact our profitability. Because our restructuring activities involve changes to many aspects of our business, including but not limited to the location of our production facilities and personnel, the associated cost reductions could materially adversely impact productivity and sales to an extent we have not anticipated. Even if we fully execute and implement these activities and they generate the anticipated cost savings, there may be other unforeseeable and unintended consequences that could materially adversely impact our profitability and business, including unintended employee attrition or harm to our competitive position. Cost reduction measures may also result in reduced compliance budgets, and ultimately, our ability to comply with applicable laws and regulations. If we fail to comply with any such laws or regulations, we may be subject to governmental fines or similar costs. Additionally, our initiatives to reduce our costs may make it difficult for us to attract, motivate and retain our key employees and/or impact the breadth of our IP portfolio, which could have a material adverse effect on our competitive position and on our business. To the extent that we do not achieve the profitability enhancement or other benefits of our cost reduction and restructuring initiatives that we anticipate, our results of operations may be materially adversely effected.\nUncertainties regarding the timing and amount of customer orders could lead to excess inventory and write-downs of inventory that could materially adversely affect our financial condition and results of operations.\nOur sales are typically made pursuant to individual purchase orders or customer agreements, and we generally do not have long-term supply arrangements with our customers requiring a commitment to purchase. Our customers may cancel orders 30 days prior to shipment for standard products and, generally prior to start of production for custom products without incurring a penalty. We routinely generate inventory based on customers’ estimates of end-user demand for their products, which is difficult to predict. In times of under supply for certain products, some customers could respond by inflating their demand signals. As markets level off and supply capacity begins to match actual market demands, we could experience an increased risk of inventory write-downs, which may materially adversely affect our results of operations and our financial condition. In addition, our customers may change their inventory practices on short notice for any reason. Furthermore, short customer lead times are standard in the industry due to overcapacity. The cancellation or deferral of product orders, the return of previously sold products, or overproduction of products due to the failure of anticipated orders to materialize could result in excess obsolete inventory, which could result in write-downs of inventory or the incurrence of significant cancellation penalties under\nour arrangements with our raw materials and equipment suppliers. Unsold inventory, canceled orders and cancellation penalties may materially adversely affect our results of operations, and inventory write-downs, which may materially adversely affect our financial condition.\nThe semiconductor industry is highly competitive, and has experienced rapid consolidation, and if we are unable to compete effectively or are unable to identify attractive opportunities for consolidation, it could materially adversely affect our business and results of operations.\nThe semiconductor industry is highly competitive, and our ability to compete successfully depends on elements both within and outside of our control. We face significant competition within each of our product lines from major global semiconductor companies as well as smaller companies focused on specific market niches. Because our components are often building block semiconductors that, in some cases, are integrated into more complex ICs, we also face competition from manufacturers of ICs, ASICs and fully customized ICs, as well as from customers who develop their own IC products. In addition, companies not currently in direct competition with us may introduce competing products in the future.\nIf we are unable to compete effectively, such inability to compete could have a material adverse effect on our business and results of operations. Products or technologies developed by competitors that are larger and have more substantial research and development budgets, or that are smaller and more targeted in their development efforts, may render our products or technologies obsolete or noncompetitive. We also may be unable to market and sell our products if they are not competitive on the basis of price, quality, technical performance, features, system compatibility, customized design, innovation, availability, delivery timing and reliability. If we fail to compete effectively on developing strategic relationships with customers and customer sales and technical support, our sales and revenue may be materially adversely affected. Competitive pressures may limit our ability to raise prices, and any inability to maintain revenue or raise prices to offset increases in costs could have a significant adverse effect on our gross margin. Reduced sales and lower gross margins would materially adversely affect our business and results of operations.\nThe semiconductor industry has experienced, and may continue to experience, significant consolidation among companies and vertical integration among customers. Larger competitors resulting from consolidations may have certain advantages over us, including, but not limited to: more efficient cost structures; substantially greater financial and other resources with which to withstand adverse economic or market conditions and pursue development, engineering, manufacturing, marketing and distribution of their products; longer independent operating histories; presence in key markets; patent protection; and greater name recognition. In addition, we may be at a competitive disadvantage to our peers if we fail to identify attractive opportunities to acquire companies to expand our business. Consolidation among our competitors and integration among our customers could erode our market share, negatively impact our capacity to compete and require us to restructure our operations, any of which would have a material adverse effect on our business.\nWe are dependent on the services of third-party suppliers and contract manufacturers, and any disruption in or deterioration of the quality of the services or goods delivered by such third parties could materially adversely affect our business and results of operations.\nWe use third-party contractors for certain of our manufacturing activities, primarily wafer fabrication and the assembly and testing of final goods, and for the supply of raw materials. Our agreements with these manufacturers typically require us to commit to purchase services based on forecasted product needs, which may be inaccurate, and, in some cases, require longer-term commitments. We are also dependent upon a limited number of highly specialized third-party suppliers for required components and materials for certain of our key technologies. Arranging for replacement manufacturers and suppliers can be time consuming and costly, and the number of qualified alternative providers can be extremely limited. Our business operations, productivity and customer relations could be materially adversely affected if these contractual relationships were disrupted or terminated, the cost of such services increased significantly, the quality of the services provided deteriorated or our forecasted needs proved to be materially incorrect. Our manufacturing processes rely on many raw materials, including various chemicals and gases, polysilicon, silicon wafers, aluminum, gold, silver, copper, lead frames, mold compound and ceramic packages. Generally, our agreements with suppliers of raw materials impose no minimum or continuing supply obligations, and we obtain our raw materials and supplies from a large number of sources on a just-in-time basis. From time to time, suppliers of raw materials may extend lead times, limit supplies or increase prices due to capacity constraints or other factors beyond our control. Shortages could occur in various essential raw materials due to interruption of supply or increased demand. If we are unable to obtain adequate supplies of raw materials in a timely manner, the costs of our raw materials increases significantly, their quality deteriorates or they give rise to compatibility or performance issues in our products, our results of operations could be materially adversely affected.\nWarranty claims, product liability claims and product recalls could harm our business, results of operations and financial condition.\nManufacturing semiconductors is a highly complex and precise process, requiring production in a tightly controlled, clean environment. Minute impurities in our manufacturing materials, contaminants in the manufacturing environment, manufacturing equipment failures, and other defects can cause our products to be non-compliant with customer requirements or otherwise nonfunctional. We face an inherent business risk of exposure to warranty and product liability claims in the event that our products fail to perform as expected or such failure of our products results, or is alleged to result, in bodily injury or property damage (or both). In addition, if any of our designed products are or are alleged to be defective, we may be required to participate in their recall. As suppliers become more integrally involved in electrical design, OEMs are increasingly expecting them to warrant their products and are increasingly looking to them for contributions when faced with product liability claims or recalls. A successful warranty or product liability claim against us in excess of our available insurance coverage, if any, and established reserves, or a requirement that we participate in a product recall, could have material adverse effects on our business, results of operations and financial condition. Additionally, in the event that our products fail to perform as expected or such failure of our products results in a recall, our reputation may be damaged, which could make it more difficult for us to sell our products to existing and prospective customers and could materially adversely affect our business, results of operations and financial condition.\nSince a defect or failure in our product could give rise to failures in the goods that incorporate them (and claims for consequential damages against our customers from their customers), we may face claims for damages that are disproportionate to the revenue and profits we receive from the products involved. In certain instances, we attempt to limit our liability through our standard terms and conditions of sale and other customer contracts. There is no assurance that such limitations will be effective, and to the extent that we are liable for damages in excess of the revenue and profits we received from the products involved, our results of operations and financial condition could be materially adversely affected.\nCurrency fluctuations, changes in foreign exchange regulations and repatriation delays and costs could have a material adverse effect on our results of operations and financial condition.\nWe have sizeable sales and operations in the Asia/Pacific region and Europe and a significant amount of this business is transacted in currency other than U.S. dollars. In addition, while a significant percentage of our cash is generated outside the U.S., many of our liabilities, including our outstanding indebtedness, and certain other cash payments, such as share repurchases, are payable in the U.S. in U.S. dollars. As a result, currency fluctuations and changes in foreign exchange regulations can have a material adverse effect on our liquidity and financial condition.\nIn addition, repatriation of funds held outside the U.S. could have adverse tax consequences and could be subject to delay due to required local country approvals or local obligations. From time to time, we are required to make cash deposits outside of the U.S. to support bank guarantees of our obligations under certain office leases or amounts we owe to certain vendors and such cash deposits are not available for other uses as long as the related bank guarantees are outstanding. Foreign exchange regulations may also limit our ability to convert or repatriate foreign currency. As a result of having a lower amount of cash and cash equivalents in the U.S., our financial flexibility may be reduced, which could have a material adverse effect on our ability to make interest and principal payments due under our various debt obligations. Restrictions on repatriation or the inability to use cash held abroad to fund our operations in the U.S. may have a material adverse effect on our liquidity and financial condition.\nTrends, Risks and Uncertainties Related to Intellectual Property\nIf our technologies are subject to claims of infringement on the IP rights of others, efforts to address such claims could have a material adverse effect on our results of operations.\nWe may from time to time be subject to claims that we may be infringing the IP rights of others. If necessary or desirable, we may seek licenses under such IP rights. However, we cannot assure you that we will obtain such licenses or that the terms of any offered licenses will be acceptable to us. The failure to obtain a license from a third party for IP we use could cause us to incur substantial liabilities or to suspend the manufacture or shipment of products or our use of processes requiring such technologies. Further, we may be subject to IP litigation, which could cause us to incur significant expense, materially adversely affect sales of the challenged product or technologies and divert the efforts of our technical and management personnel, whether or not such litigation is resolved in our favor. In the event of an adverse outcome or pursuant to the terms of a settlement of any such litigation, we may be required to:\n•pay substantial damages or settlement costs;\n•indemnify customers or distributors;\n•cease the manufacture, use, sale or importation of infringing products;\n•expend significant resources to develop or acquire non-infringing technologies;\n•discontinue the use of processes; or\n•obtain licenses, which may not be available on reasonable terms, to the infringing technologies.\nPlease see Note 13: ''Commitments and Contingencies'' in the notes to our audited consolidated financial statements included elsewhere in this Form 10-K for a more detailed description of the litigation we are currently engaged in. The outcome of IP litigation is inherently uncertain and, if not resolved in our favor, could materially adversely affect our business, financial condition and results of operations.\nIf we are unable to protect the IP we use, our business, results of operations and financial condition could be materially adversely affected.\nThe enforceability of our patents, trademarks, copyrights, software licenses and other IP is uncertain in certain circumstances. Effective IP protection may be unavailable, limited or not applied for in the U.S. and internationally. The various laws and regulations governing our registered and unregistered IP assets, patents, trade secrets, trademarks, mask works and copyrights to protect our products and technologies are subject to legislative and regulatory change and interpretation by courts. With respect to our IP generally, we cannot assure you that:\n•any of the substantial number of U.S. or foreign patents and pending patent applications that we employ in our business will not lapse or be invalidated, circumvented, challenged, abandoned or licensed to others;\n•any of our pending or future patent applications will be issued or have the coverage originally sought;\n•any of the trademarks, copyrights, trade secrets, know-how or mask works that we employ in our business will not lapse or be invalidated, circumvented, challenged, abandoned or licensed to others;\n•any of our pending or future trademark, copyright, or mask work applications will be issued or have the coverage originally sought; or\n•that we will be able to successfully enforce our IP rights in the U.S. or foreign countries.\nWhen we seek to enforce our rights, we are often subject to claims that the IP right is invalid, is otherwise not enforceable or is licensed to the party against whom we are asserting a claim. In addition, our assertion of IP rights often results in the other party seeking to assert alleged IP rights of its own against us, which may materially adversely impact our business. An unfavorable ruling in these sorts of matters could include money damages or an injunction prohibiting us from manufacturing or selling one or more products, which could in turn negatively affect our business, results of operations or cash flows.\nIn addition, some of our products and technologies are not covered by any patents or pending patent applications. We seek to protect our proprietary technologies, including technologies that may not be patented or patentable, in part by confidentiality agreements and, if applicable, inventors’ rights agreements with our collaborators, advisors, employees and consultants. We cannot assure you that these agreements will not be breached, that we will have adequate remedies for any breach or that persons or institutions will not assert rights to IP arising out of our research. Should we be unable to protect our IP, competitors may develop products or technologies that duplicate our products or technologies, benefit financially from innovations for which we bore the costs of development and undercut the sales and marketing of our products, all of which could have a material adverse effect on our business, results of operations and financial condition.\nTrends, Risks and Uncertainties Related to Technology and Data Privacy\nWe may be subject to disruptions or breaches of our secured network that could irreparably damage our reputation and our business, expose us to liability and materially adversely affect our results of operations.\nWe routinely collect and store sensitive data, including confidential and other proprietary information about our business and our customers, suppliers and business partners. The secure processing, maintenance and transmission of this information is critical to our operations and business strategy. We may be subject to disruptions or breaches of our secured network caused by computer viruses, illegal hacking, criminal fraud or impersonation, acts of vandalism or terrorism or employee error. Our security measures and/or those of our third-party service providers and/or customers may not detect or prevent such security breaches. The costs to us to reduce the risk of or alleviate cyber security breaches and vulnerabilities could be significant, and our efforts to address these problems may not be successful and could result in interruptions and delays that may materially impede our sales, manufacturing, distribution or other critical functions. Any such compromise of our information security could result in the misappropriation or unauthorized publication of our confidential business or proprietary information or that of other parties with which we do business, an interruption in our operations, the unauthorized transfer of cash or other of our assets, the unauthorized release of customer or employee data or a violation of privacy or other laws. In addition, computer programmers and hackers also may be able to develop and deploy viruses, worms and other malicious software programs that\nattack our products, or that otherwise exploit any security vulnerabilities, and any such attack, if successful, could expose us to liability to customer claims. Any of the foregoing could irreparably damage our reputation and business, which could have a material adverse effect on our results of operations.\nThe Company is subject to governmental laws, regulations and other legal obligations related to privacy and data protection.\nThe legislative and regulatory framework for privacy and data protection issues worldwide is rapidly evolving and is likely to remain uncertain for the foreseeable future. The Company collects Personally Identifiable Information (\"PII\") and other data as part of its business processes and activities. This data is subject to a variety of U.S. and international laws and regulations, including oversight by various regulatory or other governmental bodies. Many foreign countries and governmental bodies, including the European Union and other relevant jurisdictions where the Company conducts business, have laws and regulations concerning the collection and use of PII and other data obtained from their residents or by businesses operating within their jurisdictions that are currently more restrictive than those in the U.S. Additionally, in May 2016, the European Union adopted the General Data Protection Regulation that imposed more stringent data protection requirements and provided for greater penalties for noncompliance beginning in May 2018. In July 2020, the Court of Justice of the European Union declared the EU-U.S. Privacy Shield, which had been an accepted mechanism to comply with data transfers between the European Union and the United States, invalid. Any inability, or perceived inability, to adequately address privacy and data protection concerns, even if unfounded, or to comply with applicable laws, regulations, policies, industry standards, contractual obligations or other legal obligations, could result in additional cost and liability to the Company or company officials, including substantial monetary fines, and could damage our reputation, inhibit sales and adversely affect our business.\nTrends, Risks and Uncertainties Related to Regulation\nEnvironmental and health and safety liabilities and expenditures could materially adversely affect our results of operations and financial condition.\nOur operations are subject to various environmental, health and safety laws and regulations. For example, our manufacturing operations are subject to laws and regulations relating to the management, disposal and remediation of hazardous substances and the emission and discharge of pollutants into the air, water and ground, and we have been identified as either a primary responsible party or a potentially responsible party at sites where we or our predecessors operated or disposed of waste in the past. Our other operations are also subject to laws and regulations relating to workplace safety and worker health, which, among other requirements, regulate employee exposure to hazardous substances. We have indemnities from third parties for certain environmental and health and safety liabilities for periods prior to our operations at some of our current and past sites, and we have also purchased environmental insurance to cover certain claims related to historical contamination and future releases of hazardous substances. However, we cannot assure you that such indemnification arrangements and insurance will cover any or all of our material environmental costs. In addition, the nature of our operations exposes us to the continuing risk of environmental and health and safety liabilities including:\n•changes in U.S. and international environmental or health and safety laws or regulations, including, but not limited to, future laws or regulations imposed in response to climate change concerns;\n•the manner in which environmental or health and safety laws or regulations will be enforced, administered or interpreted;\n•our ability to enforce and collect under indemnity agreements and insurance policies relating to environmental liabilities;\n•the cost of compliance with future environmental or health and safety laws or regulations or the costs associated with any future environmental claims, including the cost of clean-up of currently unknown environmental conditions; or\n•the cost of fines, penalties or other legal liability, should we fail to comply with environmental or health and safety laws or regulations.\nTo the extent that we face unforeseen environmental or health and safety compliance costs or remediation expenses or liabilities that are not covered by indemnities or insurance, we may bear the full effect of such costs, expenses and liabilities, which could materially adversely affect our results of operations and financial condition.\nCompliance with regulations regarding the use of “conflict minerals” could limit the supply and increase the cost of certain raw materials used in manufacturing our products.\nThe SEC, as mandated by the Dodd-Frank Wall Street Reform and Consumer Protection Act of 2010, adopted disclosure regulations for public companies that manufacture products containing certain minerals that are mined from the Democratic Republic of Congo and adjoining countries and procedures pertaining to a manufacturer’s efforts regarding the source of such minerals. These \"conflict minerals\" are commonly found in metals used in the manufacture of semiconductors. Manufacturers\nare also required to disclose their efforts to prevent the sourcing of such minerals and metals produced from them. The implementation of these requirements could adversely affect the sourcing, availability and pricing of metals used in the manufacture of our products. We may also incur additional costs to comply with the disclosure requirements, including costs related to determining the source of any of the relevant minerals used in our products. We may also face difficulties in satisfying customers who may require that our products be certified as free of \"conflict materials,\" which could harm our relationships with these customers and lead to a loss of revenue.\nWe are subject to anti-corruption laws in the jurisdictions in which we operate, including the FCPA. Our failure to comply with these laws could result in penalties that could harm our reputation and have a material adverse effect on our business, financial condition and results of operations.\nWe are subject to the FCPA, which generally prohibits companies and their intermediaries from making improper payments to foreign officials for the purpose of obtaining or keeping business and/or other benefits, along with various other anti-corruption laws. Although we have implemented policies and procedures designed to ensure that we, our employees and other intermediaries comply with the FCPA and other anti-corruption laws to which we are subject, there is no assurance that such policies or procedures will work effectively all of the time or protect us against liability under the FCPA or other laws for actions taken by our employees and other intermediaries with respect to our business or any businesses that we may acquire. We have significant operations in Asia, which place us in frequent contact with persons who may be considered “foreign officials” under the FCPA, resulting in an elevated risk of potential FCPA violations. If we are not in compliance with the FCPA and other laws governing the conduct of business with government entities (including local laws), we may be subject to criminal and civil penalties and other remedial measures, which could have a material adverse impact on our business, financial condition, results of operations and liquidity. Any investigation of any potential violations of the FCPA or other anti-corruption laws by the U.S. or foreign authorities could harm our reputation and have an adverse impact on our business, financial condition and results of operations.\nTrends, Risks and Uncertainties Related to Our Indebtedness\nOur debt could materially adversely affect our financial condition and results of operations.\nAs of December 31, 2020, we had $3,589.5 million of outstanding indebtedness. We may need to incur additional indebtedness in the future to repay or refinance other outstanding debt, to make acquisitions or for other purposes, and if we incur additional debt, the related risks that we now face could intensify. For example, on March 24, 2020, as a precautionary measure in order to increase our cash position and facilitate financial flexibility in light of uncertainty resulting from the COVID-19 pandemic, we borrowed an additional $1,165.0 million under the Revolving Credit Facility. On August 21, 2020, we used the net proceeds from the issuance of the 3.875% Notes along with cash on hand to repay $1,200.0 million of borrowings under the Revolving Credit Facility. As of December 31, 2020, we have approximately $1,269.0 million available for future borrowings under the Revolving Credit Facility. The degree to which we are leveraged could have important consequences to our potential and current investors, including:\n•our ability to obtain additional financing in the future for working capital, capital expenditures, acquisitions, general corporate purposes or other purposes may be impaired;\n•the timing, amount and execution of our capital allocation policy, including our 2018 Share Repurchase Program (as defined below), could be affected by the degree to which we are leveraged;\n•a significant portion of our cash flow from operating activities must be dedicated to the payment of interest and principal on our debt, which reduces the funds available to us for our operations and may limit our ability to engage in acts that may be in our long-term best interests;\n•some of our debt is and will continue to be at variable rates of interest, which may result in higher interest expense in the event of increases in market interest rates;\n•our debt agreements may contain, and any agreements to refinance our debt likely will contain, financial and restrictive covenants, and our failure to comply with them may result in an event of default which if not cured or waived, could have a material adverse effect on us;\n•our level of indebtedness will increase our vulnerability to, and reduce our flexibility to respond to, general economic downturns and adverse industry and business conditions, including as a result of the COVID-19 pandemic;\n•as our long-term debt ages, we must repay, and may need to renegotiate, such debt or seek additional financing;\n•to the extent the debt we incur requires collateral to secure such indebtedness, our assets could be at risk and our flexibility related to such assets could be limited;\n•our debt service obligations could limit our flexibility in planning for, or reacting to, changes in our business and the semiconductor industry;\n•our ability to deduct interest expense that we may incur may be limited or deferred under U.S. and/or local tax rules, including Section 163(j) of the Code and the Treasury Regulations promulgated thereunder; and\n•our level of indebtedness may place us at a competitive disadvantage relative to less leveraged competitors.\nTo the extent that we continue to maintain or expand our significant indebtedness, our financial condition and results of operations may be materially adversely affected.\nThe inability to meet our obligations under our Amended Credit Agreement could materially and adversely affect us by, among other things, limiting our ability to conduct our operations and reducing our flexibility to respond to changing business and economic conditions.\nOur Amended Credit Agreement provides for our $1.97 billion Revolving Credit Facility and our $2.4 billion Term Loan \"B\" Facility, the proceeds of which have been used, among other things, to fund acquisitions. The obligations under the Amended Credit Agreement are collateralized by a lien on substantially all of the personal property and material real property assets of the Company and most of the Company’s domestic subsidiaries. As a result, if we are unable to satisfy our obligations under the Amended Credit Agreement, the lenders could take possession of and foreclose on the pledged collateral securing the indebtedness, in which case we would be at risk of losing the related collateral, which would have a material adverse effect on our business and operations. In addition, subject to customary exceptions, the Amended Credit Agreement requires mandatory prepayment under certain circumstances, which may result in prepaying outstanding amounts under the Revolving Credit Facility and the Term Loan \"B\" Facility rather than using funds for other business purposes. Our financing could have a material adverse effect on our business and financial condition, including, among other things, our ability to obtain additional financing for working capital, capital expenditures, acquisitions, and other general corporate purposes and could reduce our flexibility to respond to changing business and economic conditions.\nThe agreements relating to our indebtedness, including the Amended Credit Agreement and the 3.875% Notes, may restrict our ability to operate our business, and as a result may materially adversely affect our results of operations.\nOur debt agreements, including the Amended Credit Agreement and the 3.875% Notes, contain, and any future debt agreements may include, a number of restrictive covenants that impose significant operating and financial restrictions on us and our subsidiaries. Such restrictive covenants may significantly limit our ability to:\n•incur additional debt, including issuing guarantees;\n•incur liens;\n•make certain investments;\n•settle a conversion of our 1.625% Notes in whole or in part with cash;\n•redeem, or otherwise perform our obligations under the terms of, our 3.875% Notes;\n•sell or otherwise dispose of assets;\n•make some acquisitions;\n•engage in mergers or consolidations or certain other \"change of control\" transactions;\n•make distributions to our stockholders;\n•engage in restructuring activities;\n•engage in certain sale and leaseback transactions; and\n•issue or repurchase stock or other securities.\nSuch agreements may also require us to satisfy other requirements, including maintaining certain financial ratios and condition tests. Our ability to meet these requirements can be affected by events beyond our control, and we may be unable to meet them. To the extent we fail to meet any such requirements and are in default under our debt obligations, our financial condition may be materially adversely affected. These restrictions may limit our ability to engage in activities that could otherwise benefit us. To the extent that we are unable to engage in activities that support the growth, profitability and competitiveness of our business, our results of operations may be materially adversely affected.\nWe may not be able to generate sufficient cash flow to meet our debt service obligations, and any inability to repay our debt when due would have a material adverse effect on our business, financial condition and results of operations.\nOur ability to generate sufficient cash flow from operating activities to make scheduled payments on our debt obligations will depend on our future financial performance, which will be affected by a range of economic, competitive and business factors, many of which are outside of our control. If we do not generate sufficient cash flow from operating activities and proceeds from sales of assets in the ordinary course of business to satisfy our debt obligations as they come due, we may have to undertake alternative financing plans, such as refinancing or restructuring our debt, selling additional assets, reducing or delaying capital investments or seeking to raise additional capital. We cannot assure you that any refinancing would be possible, that any assets could be sold, or, if sold, of the timing of the sales and the amount of proceeds realized from those sales, or that additional financing could be obtained on acceptable terms, if at all, or would be permitted under the terms of our various debt instruments\nthen in effect. Furthermore, we cannot assure you that, if we were required to repurchase any of our debt securities upon a change of control or other specified event, our assets or cash flow would be sufficient to fully repay borrowings under our outstanding debt instruments or that we would be able to refinance or restructure the payments on those debt securities. If we are unable to repay, refinance or restructure our indebtedness under our collateralized debt, the holders of such debt could proceed against the collateral securing that indebtedness, which could materially negatively impact our results of operations and financial condition. A default under our committed credit facilities, including our Amended Credit Agreement, could also limit our ability to make further borrowings under those facilities, which could materially adversely affect our business and results of operations. In addition, to the extent we are not able to borrow or refinance debt obligations, we may have to issue additional shares of our common stock, which would have a dilutive effect to the current stockholders.\nAn event of default under any agreement relating to our outstanding indebtedness could cross default other indebtedness, which could have a material adverse effect on our business, financial condition and results of operations.\nIf there were an event of default under certain of our agreements relating to our outstanding indebtedness, the holders of the defaulted debt could cause all amounts outstanding with respect to that debt to be due and payable immediately, which default or acceleration of debt could cross default other indebtedness. Any such cross default would put immediate pressure on our liquidity and financial condition and would amplify the risks described above with regards to being unable to repay our indebtedness when due and payable. We cannot assure you that our assets or cash flow would be sufficient to fully repay borrowings under our outstanding debt instruments if accelerated upon an event of default, and, as described above, any inability to repay our debt when due would have a material adverse effect on our business, financial condition and results of operations.\nIf our operating subsidiaries, which may have no independent obligation to repay our debt, are not able to make cash available to us for such repayment, our business, financial condition and results of operations may be adversely affected.\nWe conduct our operations through our subsidiaries. Repayment of our indebtedness is dependent on the generation of cash flow by our subsidiaries and their ability to make such cash available to us, by dividend, debt repayment or otherwise. Unless they are guarantors of our indebtedness, our subsidiaries have no obligation to pay amounts due on such indebtedness or to make funds available for that purpose. Our subsidiaries may not be able to, or may not be permitted to, make distributions to enable us to make payments in respect of our indebtedness. Each subsidiary is a distinct legal entity, and, under certain circumstances, legal, contractual, governmental or regulatory restrictions may limit our ability to obtain cash from our subsidiaries. In the event that we do not receive distributions or payments from our subsidiaries, we may be unable to make required principal and interest payments on our indebtedness and, as described above, any inability to repay our debt when due would have a material adverse effect on our business, financial condition and results of operations.\nIf interest rates increase, our debt service obligations under our variable rate indebtedness could increase significantly, which would have a material adverse effect on our results of operations.\nBorrowings under certain of our facilities from time to time, including under our Amended Credit Agreement, are at variable rates of interest and as a result expose us to interest rate risk. If interest rates were to increase, our debt service obligations on the variable rate indebtedness would increase even though the amount borrowed remained the same, and our net income and cash flows, including cash available for servicing our indebtedness, will correspondingly decrease. During the first quarters of 2017 and 2019 and the second quarter of 2020, we entered into interest rate swaps that involved the exchange of floating for fixed rate interest payments in order to reduce interest rate volatility for a portion of our Term Loan \"B\" Facility and our Revolving Credit Facility through the end of 2022. However, we may not maintain interest rate swaps with respect to all of our variable rate indebtedness, and any swaps we enter into may not fully mitigate our interest rate risk. To the extent the risk materializes and is not fully mitigated, the resulting increase in interest expense could have a material adverse effect on our results of operations.\nSome of our current debt and related agreements, including the Amended Credit Agreement and our interest rate swap agreements, have an interest rate tied to LIBO Rate. While certain of these agreements, such as the Amended Credit Agreement, provide procedures for determining an alternative base rate in the event that LIBO Rate is discontinued, not all do so. On July 27, 2017, the United Kingdom Financial Conduct Authority (\"FCA\"), which regulates the LIBO Rate, announced its intention to stop persuading or compelling banks to submit LIBO Rate quotations by the end of 2021. Further, on November 30, 2020, the Board of Governors of the Federal Reserve System, the Federal Deposit Insurance Corp. and the Office of the Comptroller of the Currency issued a joint statement (the \"Joint Statement\") on LIBO Rate transition, in connection with which ICE Benchmark Administration Limited, in its capacity as administrator of U.S. LIBO Rate, announced its plan to extend the date that most U.S. LIBO Rate values would cease being computed and announced from December 31, 2021 to June 30, 2023. Even though U.S. LIBO Rate would continue to be published through June 30, 2023, the Joint Statement called on banks to cease\nentering into new contracts that use U.S. LIBO Rate as a reference rate by no later than December 31, 2021, and if practicable, as far in advance of that deadline as possible. Regardless, there can be no assurances as to what alternative base rates may be and whether such base rate will be more or less favorable than LIBO Rate and any other unforeseen impacts of the potential discontinuation of LIBO Rate. The Company intends to monitor the developments with respect to the potential phasing out of LIBO Rate and work with its lenders to ensure any transition away from LIBO Rate will have minimal impact on its financial condition, but can provide no assurances that the impact of the discontinuation of LIBO Rate would not have a material adverse effect on our results of operations.\nServicing the 1.625% Notes and the 3.875% Notes may require a significant amount of cash, and we may not have sufficient cash flow or the ability to raise the funds necessary to satisfy our obligations under the 1.625% Notes and the 3.875% Notes in a timely manner.\nIn March 2017, we issued $575.0 million aggregate principal amount of our 1.625% Notes, and in August 2020, we issued $700.0 million aggregate principal amount of our 3.875% Notes. Holders of the 1.625% Notes will have the right to require us to repurchase all or a portion of their 1.625% Notes upon the occurrence of a fundamental change (as defined under the respective indentures governing such notes) at a repurchase price equal to 100% of their principal amount, plus accrued and unpaid interest, if any, accrued prior to, but not including, the fundamental change repurchase date. Holders of the 3.875% Notes will have the right to require us to repurchase all of their 3.875% Notes upon the occurrence of certain change of control triggering events accompanied by certain ratings events (as described in the indenture governing the 3.875% Notes) at a repurchase price equal to 101% of their principal amount, plus accrued and unpaid interest, if any, accrued prior to, but not including, the repurchase date. Moreover, we will be required to repay the 1.625% Notes and the 3.875% Notes in cash at their respective maturity dates, unless earlier repurchased or, in the case of the 1.625% Notes, converted. In addition, upon conversion of the 1.625% Notes to be repurchased, unless we elect to deliver solely shares of our common stock to settle such conversion (other than paying cash in lieu of delivering any fractional shares), we will be required to make cash payments in respect of such 1.625% Notes being converted.\nServicing the 1.625% Notes and the 3.875% Notes may require a significant amount of cash, and we may not have sufficient cash flow or the ability to raise the funds necessary to satisfy our obligations under such notes. Our ability to make cash payments in connection with conversions of the 1.625% Notes, repurchase the 1.625% Notes or the 3.875% Notes in the case of an applicable repurchase-triggering event under the respective indentures or repay such notes at maturity will depend on market conditions and our future performance, which is subject to economic, financial, competitive and other factors beyond our control. If we are unable to make cash payments upon conversion of the 1.625% Notes, we would be required to issue significant amounts of our common stock, which would dilute existing stockholders.\nIn addition, if we do not have sufficient cash to repurchase the 1.625% Notes or the 3.875% Notes following the applicable repurchase-triggering events, we would be in default under the terms of such notes, which could cross default other debt and materially adversely harm our business. In certain circumstances, a takeover of our Company and similar triggering events could also trigger an option of the holders of the 1.625% Notes and the 3.875% Notes to require us to repurchase such notes. This may have the effect of delaying or preventing a takeover of our Company that would otherwise be beneficial to investors in the 1.625% Notes, the 3.875% Notes and our common stock, which could materially decrease the value of such notes and of our common stock.\nThe terms of the Amended Credit Agreement and the terms of the 3.875% Notes limit the amount of future indebtedness secured by liens that we may incur, but the terms of the 1.625% Notes do not contain such limits. If we incur significantly more debt, this could intensify the risks described above. Our decision to use our cash for other purposes, such as to make acquisitions or to repurchase our common stock, could also intensify these risks.\nThe conditional conversion feature of the 1.625% Notes, if triggered, may adversely affect our financial condition and results of operations and, if we elect to settle the conversion of the 1.625% Notes in common stock, any such settlement could materially dilute the ownership interests of existing stockholders.\nIf specified conditions are met, holders of the 1.625% Notes may convert their notes prior to the close of business on the business day immediately preceding July 15, 2023. Unless we elect to satisfy our conversion obligations by delivering solely shares of our common stock (other than paying cash in lieu of delivering any fractional shares), in the event the conditional conversion feature under the 1.625% Notes is triggered, holders electing to convert their notes could require us to settle a portion or all of our conversion obligations through the payment of cash, which could materially adversely affect our liquidity. Additionally, when the conditional conversion feature under the 1.625% Notes is triggered at the end of the reporting period, we are required under applicable accounting rules to reclassify the outstanding principal of such notes as a current rather than long-term liability, which would result in a material reduction of our net working capital. A conditional conversion feature has\nbeen triggered as of December 31, 2020, and we can provide no assurance as to when or whether these conditional conversion features will lapse or be triggered again in the future. Any material decrease in our liquidity or reduction in our net working capital could have a material adverse effect on our financial condition and results of operations. In addition, we may elect to settle the 1.625% Notes solely in common stock to avoid an event of default under our Amended Credit Agreement, and any such issuance of common stock could materially dilute the ownership interests of existing stockholders, including stockholders who previously converted such notes to shares of our common stock.\nNote hedge and warrant transactions we have entered into may materially adversely affect the value of our common stock.\nConcurrently with the issuance of the 1.625% Notes, we entered into note hedge transactions with certain financial institutions, which we refer to as the option counterparties. The convertible note hedges are expected to reduce the potential dilution upon any conversion of the respective series of notes and/or offset any cash payments we are required to make in excess of the principal amount of converted notes of such series, as the case may be. We also entered into warrant transactions with the option counterparties with respect to the 1.625% Notes and the 1.00% Notes. The warrants we entered with option counterparties for the 1.00% Notes are still outstanding. The warrant transactions could separately have a dilutive effect on our common stock to the extent that the market price per share of our common stock exceeds $25.96, with respect to the 1.00% Notes, and $30.70, with respect to the 1.625% Notes. The warrants with respect to the 1.00% Notes can be exercised by holders beginning in March 2021 and expire no later than April 2021. We currently anticipate the holders of the 1.00% Notes to exercise the warrants to purchase up to 37.3 million shares of common stock from us, which will be settled on a net-share basis depending on the average stock price on the day of exercise.\nIn connection with establishing their initial hedge of the convertible note hedges and warrant transactions, the option counterparties or their respective affiliates have purchased shares of our common stock and/or entered into various derivative transactions with respect to our common stock following the pricing of the 1.625% Notes. The option counterparties or their respective affiliates may modify their hedge positions by entering into or unwinding various derivatives contracts with respect to our common stock and/or purchasing or selling our common stock or other securities of ours in secondary market transactions prior to the maturity of 1.625% Notes (and are likely to do so during any observation period related to a conversion of 1.625% Notes following any repurchase of 1.625% Notes by us on any fundamental change repurchase date or otherwise). The potential effect, if any, of these transactions and activities on the market price of our common stock will depend in part on market conditions and cannot be ascertained at this time. Any of these activities could materially adversely affect the value of our common stock.\nCounterparty risk with respect to the note hedge transactions, if realized, could have a material adverse impact on our results of operations.\nThe option counterparties are financial institutions or affiliates of financial institutions, and we are subject to the risk that these option counterparties may default under the note hedge transactions. We can provide no assurances as to the financial stability or viability of any of the option counterparties. Our exposure to the credit risk of the option counterparties is not secured by any collateral. If one or more of the option counterparties to one or more of our note hedge transactions becomes subject to insolvency proceedings, we will become an unsecured creditor in those proceedings with a claim equal to our exposure at the time under those transactions.\nTo the extent the option counterparties do not honor their contractual commitments with us pursuant to the note hedge transactions, we could face a material increase in our exposure to potential dilution upon any conversion of the 1.625% Notes and/or cash payments we are required to make in excess of the principal amount of converted 1.625% Notes, as the case may be. Our exposure will depend on many factors but, generally, the increase in our exposure will be correlated to the increase in the market price of our common stock and in the volatility of the market price of our common stock. In addition, upon a default by one of the option counterparties, we may suffer adverse tax consequences with respect to our common stock. Any such adverse tax consequences or increased cash payments could have a material adverse effect on our results of operations.\nTrends, Risks and Uncertainties Related to Our Common Stock\nThe stockholders’ rights plan adopted by our Board of Directors may discourage a third party from acquiring us in a manner that might result in a premium price to our stockholders.\nOn June 7, 2020, our Board of Directors authorized and declared a dividend of one Right for each outstanding share of common stock. If a person or group of affiliated or associated persons acquires beneficial ownership of 15% or more of our then outstanding common stock, subject to certain exceptions, each Right would entitle its holder (other than the acquiring person or group of affiliated or associated persons) to purchase additional shares of our common stock at a substantial discount to the\npublic market price. In addition, under certain circumstances, we may exchange the Rights (other than Rights beneficially owned by the acquiring person or group of affiliated or associated persons), in whole or in part, for shares of our common stock on a one-for-one basis. The stockholders’ rights plan could make it more difficult for a third party to acquire us or a large block of our common stock without the approval of our Board of Directors, which may discourage a third party from acquiring us in a manner that might result in a premium price to our stockholders.\nProvisions in our charter documents may delay or prevent the acquisition of our Company, which could materially adversely affect the value of our common stock.\nOur certificate of incorporation and by-laws contain provisions that could make it harder for a third party to acquire us without the consent of our Board of Directors. These provisions:\n•establish advance notice requirements for submitting nominations for election to the Board of Directors and for proposing matters that can be acted upon by stockholders at a meeting;\n•authorize the issuance of \"blank check\" preferred stock, which is preferred stock that our Board of Directors can create and issue without prior stockholder approval and that could be issued with voting or other rights or preferences that could impede a takeover attempt; and\n•require the approval by holders of at least 66 2/3% of our outstanding common stock to amend any of these provisions in our certificate of incorporation or by-laws.\nAlthough we believe these provisions make a higher third-party bid more likely by requiring potential acquirers to negotiate with our Board of Directors, these provisions apply even if an initial offer may be considered beneficial by some stockholders. Any delay or prevention of an acquisition of our Company that would have been beneficial to our stockholders could materially decrease the value of our common stock.\nGeneral Risk Factors\nDownturns or volatility in general economic conditions could have a material adverse effect on our business and results of operations.\nIn recent years, worldwide semiconductor industry sales have tracked the impacts of financial crises, subsequent recoveries and persistent economic uncertainty. We believe that the state of global economic conditions are particularly volatile and uncertain, and that an uneven recovery or a renewed global downturn may put pressure on our sales due to reductions in customer demand. Volatile or uncertain economic conditions, as well as continuing political unrest in markets in which we conduct significant business, can adversely impact sales and profitability and make it difficult for us and our competitors to accurately forecast and plan our future business activities.\nHistorically, the semiconductor industry has been highly cyclical and, as a result, subject to significant downturns and upturns in customer demand for semiconductors and related products. We believe our business today is driven more by secular growth drivers and not solely by macroeconomic and industry cyclicality, as was the case historically. However, we could experience period-to-period fluctuations in operating results due to general industry or economic conditions. We cannot accurately predict the timing of future downturns and upturns in the semiconductor industry or how severe and prolonged these conditions might be. Significant downturns can result in reduced product demand, production overcapacity, high inventory levels and accelerated erosion of average selling prices, any of which could materially adversely affect our operating results as a result of: increased operating expenses outpacing decreased revenue, reduced margins, underutilization of our manufacturing capacity and/or asset impairment charges. On the other hand, significant upturns can cause us to be unable to satisfy demand in a timely and cost efficient manner. In the event of such an upturn, we may not be able to expand our workforce and operations in a sufficiently timely manner, procure adequate resources and raw materials, or locate suitable third-party suppliers to respond effectively to changes in demand for our products, and our business and results of operations could be materially and adversely affected.\nWe may be unable to successfully integrate new strategic acquisitions, which could materially adversely affect our business, results of operations and financial condition.\nWe have made, and may continue to make, strategic acquisitions and alliances that involve significant risks and uncertainties. Successful acquisitions and alliances in the semiconductor industry are difficult to accomplish because they require, among other things, efficient integration and aligning of product offerings and manufacturing operations and coordination of sales and marketing and research and development efforts, often in markets or regions in which we have less experience than others. Our decision to pursue an acquisition is based on, among other factors, our estimates of expected future earnings growth and potential cost savings. Risks related to successful integration of an acquisition include, but are not limited to: (1) the ability to integrate information technology and other systems; (2) unidentified issues not discovered in our due diligence; (3) customers\nresponding by changing their existing business relationships with us or the acquired company; (4) diversion of management’s attention from our day to day operations; and (5) loss of key employees due to uncertainty about positions post-integration. In addition, we may incur unexpected costs, such as operating or restructuring costs (including severance payments to departing employees) or taxes resulting from the acquisition or integration of the newly acquired business. In the past, we have recorded goodwill impairment charges related to certain of our acquisitions as a result of such factors as significant underperformance relative to historical or projected future operating results. Missteps or delays in integrating our acquisitions, which could be caused by factors outside of our control, or our failure to realize the expected benefits of the acquisitions on the timeline we anticipate or at all, could materially adversely affect our results of operations and financial condition.\nDepending on the level of our ownership interest in and the extent to which we can exercise control over the acquired business, we may be required by U.S. generally accepted accounting principles (\"GAAP\") and SEC rules and regulations to consolidate newly acquired businesses into our consolidated financial statements. The acquired businesses may not have independent audited financial statements, such statements may not be prepared in accordance with GAAP or the acquired businesses may have financial controls and systems that are not compatible with our financial controls and systems, any of which could materially impair our ability to properly integrate such businesses into our consolidated financial statements on a timely basis. Any revisions to, inaccuracies in or restatements of our consolidated financial statements due to accounting for our acquisitions could have a material adverse effect our financial condition and results of operations.\nNatural disasters, health and safety epidemics and other business disruptions could cause significant harm to our business operations and facilities and could adversely affect our supply chain and our customer base, any of which may materially adversely affect our business, results of operation, and financial condition.\nOur U.S. and international manufacturing facilities and distribution centers, as well as the operations of our third-party suppliers, are susceptible to losses and interruptions caused by floods, hurricanes, earthquakes, typhoons, volcanic eruptions, and similar natural disasters, as well as power outages, telecommunications failures, industrial accidents, health and safety epidemics and similar events. The occurrence of natural disasters in any of the regions in which we operate could severely disrupt the operations of our businesses by negatively impacting our supply chain, our ability to deliver products, and the cost of our products. Such events can negatively impact revenue and earnings and can significantly impact cash flow, both from decreased revenue and from increased costs associated with the event. In addition, these events could cause consumer confidence and spending to decrease or result in increased volatility to the U.S. and worldwide economies. Although we carry insurance to generally compensate for losses of the type noted above, such insurance may not be adequate to cover all losses that may be incurred or continue to be available in the affected area at commercially reasonable rates and terms. To the extent any losses from natural disasters or other business disruptions are not covered by insurance, any costs, write-downs, impairments and decreased revenue can materially adversely affect our business, our results of operations and our financial condition.\nWe could be subject to changes in tax rates or the adoption of new U.S. or international tax legislation or have exposure to additional tax liabilities, which could adversely affect our results of operations and financial condition.\nChanges to, or interpretations of, tax legislation or regulations in the United States and the jurisdictions in which we operate could significantly increase our effective tax rate and ultimately reduce our cash flow from operating activities. In addition, other factors or events, including business combinations, strategy and investment decisions, changes in the valuation of our deferred tax assets and liabilities, adjustments to income taxes upon finalization of various tax returns or as a result of deficiencies asserted by taxing authorities, increases in expenses not deductible for tax purposes, availability of income tax credits and incentives, increasing operations in high tax jurisdictions, and changes in tax rates, could also increase our future effective tax rate and ultimately reduce our cash flow from operating activities.\nWe exercise significant judgment in determining our worldwide income tax provision and resulting income tax accrual. Interpretations of tax legislation or regulations with regard to transactions that occur in or outside the ordinary course of our business, may result in uncertainty regarding the final tax determination. Our tax filings are subject to audit by the Internal Revenue Service (the \"IRS\") and state, local and foreign taxing authorities. The final determination of an audit may be materially different than the determination which was reflected in our worldwide income tax provision and accrual. An assessment of additional taxes because of an audit could have a material adverse effect on our results of operations and financial condition. We are also liable for potential tax liabilities of businesses we acquire.\nThe Organization for Economic Cooperation and Development (\"OECD\") has been working on a Base Erosion and Profit Shifting (\"BEPS\") Project and issued a report in 2015 and an interim report in 2018, and continues to issue guidelines and develop proposals that could change numerous long-standing tax principles, including allocating greater taxing rights to countries where customers are located and establishing a minimum tax on global income. The changes arising from the BEPS\nproject, if adopted by countries in which we do business, could have a material adverse effect on our results of operations and financial condition.\nWe operate a global business through numerous foreign subsidiaries, and there is a risk that tax authorities will challenge our transfer pricing methodologies and/or legal entity structures, which could adversely affect our results of operations and financial condition.\nWe conduct operations worldwide through our foreign subsidiaries and are, therefore, subject to complex transfer pricing regulations in the jurisdictions in which we operate. Transfer pricing regulations generally require that, for tax purposes, transactions between related parties be priced on a basis that would be comparable to an arm’s length transaction between unrelated parties. There is uncertainty and inherent subjectivity in complying with these rules. To the extent that any foreign tax authorities disagree with our transfer pricing policies, we could become subject to significant tax liabilities and penalties. The ultimate outcome of a tax examination could differ materially from our income tax accrual and could have a material adverse effect on our results of operations and financial condition.\nOur legal organizational structure and the domicile of our entities that own our IP could result in unanticipated unfavorable tax or other consequences that could have a material adverse effect on our results of operations and financial condition. Changes in tax legislation, future jurisdictional profitability of our subsidiaries, and related regulatory interpretations in the countries in which we operate may impact the taxes we pay or income tax accrual we record, which could have a material adverse effect on our results of operations and financial condition.\nWe may be unable to attract and retain highly skilled personnel.\nOur success depends on our ability to attract, motivate and retain highly skilled personnel, including technical, marketing, management and staff personnel, both in the U.S. and internationally. In the semiconductor industry, the competition for qualified personnel, particularly experienced design engineers and other technical employees, is intense, particularly when the business cycle is improving. During such periods, competitors may try to recruit our most valuable technical employees. Additionally, we have entered into employment agreements with certain senior executives, but we do not have employment agreements with most of our employees. Many of these employees could leave our company with little or no prior notice and would be free to work for a competitor. While we devote a great deal of our attention to designing competitive compensation programs aimed at attracting and retaining personnel, specific elements of our compensation programs may not be competitive with those of our competitors, and there can be no assurance that we will be able to retain our current personnel or recruit the key personnel we require. If one or more of our senior executives or other key personnel are unable or unwilling to continue in their present positions, we may not be able to replace them easily or at all and other senior management may be required to divert attention from other aspects of our business. Loss of the services of, or failure to effectively recruit, qualified personnel, including senior managers, could have a material adverse effect on our competitive position and on our business.\nThe failure to comply with the terms and conditions of our contracts could result in, among other things, damages, fines or other liabilities.\nWe have a diverse customer base consisting of both private sector clients and public sector clients, including the U.S. government. Sales to our private sector clients are generally based on stated contractual terms, the terms and conditions on our website or terms contained in purchase orders on a transaction-by-transaction basis. Sales to our public sector clients are generally derived from sales to federal, state and local governmental departments and agencies through various contracts and programs that may require compliance with regulations covering many areas of our operations, including, but not limited to, accounting practices, IP rights, information handling, and security. Noncompliance with contract terms, particularly with respect to highly-regulated public sector clients, or with government procurement regulations could result in fines or penalties against us, termination of such contracts or civil, criminal and administrative liability to the Company. With respect to public sector clients, the government’s remedies may also include suspension or debarment from future government business. In addition, almost all of our contracts have default provisions, and certain of our contracts in the public sector are terminable at any time for convenience of the contracting agency. The effect of any of these possible actions or the adoption of new or modified procurement regulations or practices could materially adversely affect our business, financial position and results of operations.\nClimate change, and the regulatory and legislative developments related to climate change, may materially adversely affect our business and financial condition.\nThe potential physical impacts of climate change on our operations are highly uncertain and would be particular to the geographic circumstances in areas in which we operate. These may include changes in rainfall and storm patterns and\nintensities, water shortages, changing sea levels and changing temperatures. The impacts of climate change may materially and adversely impact the cost, production and financial performance of our operations. Further, any impacts to our business and financial condition as a result of climate change are likely to occur over a sustained period of time and are therefore difficult to quantify with any degree of specificity. For example, extreme weather events may result in adverse physical effects on portions of our infrastructure, which could disrupt our supply chain and ultimately our business operations. In addition, disruption of transportation and distribution systems could result in reduced operational efficiency and customer service interruption. Climate-related events have the potential to disrupt our business, including the business of our customers, and may cause us to experience higher attrition, losses and additional costs to resume operations.\nA number of governments or governmental bodies have introduced or are contemplating legislative and regulatory changes in response to various climate change interest groups and the potential impact of climate change. Legislation and increased regulation regarding climate change could impose significant costs on us and our suppliers, including costs related to increased energy requirements, capital equipment, environmental monitoring and reporting, and other costs to comply with such regulations. Any future climate change regulations could also negatively impact our ability to compete with companies situated in areas not subject to such limitations. Given the political significance and uncertainty around the impact of climate change and how it should be addressed, we cannot predict how legislation and regulation will affect our financial condition, operating performance and ability to compete. Furthermore, even without such regulation, increased awareness and any adverse publicity in the global marketplace about potential impacts on climate change by us or other companies in our industry could harm our reputation. Any of the foregoing could result in a material adverse effect on our business and financial condition.\nWe may be unable to implement our recent business strategy developments, which could have a material adverse effect on our business operations.\nWe believe our recent business strategy developments will help us remain competitive. However, we may face difficulties, delays and increased expenses as we transition our business to implement this strategy and may not be able to effectively manage such transitions or efficiently implement this strategy, all of which could have a material adverse effect on our business operations. In addition, implementation of a new business strategy may lead to the disruption of our existing business operations, including distracting management from current operations. Results of operations from new activities may be lower than our existing activities, and, if a strategy is unsuccessful, we may not recoup our investments in that strategy. Failure to successfully and timely realize the anticipated benefits of these transactions or strategies could have a material adverse effect on our financial condition or results of operations.\nWe may from time to time desire to exit certain facilities, product lines or businesses, or to restructure our operations, but may not be successful in doing so.\nFrom time to time, we may decide to divest certain product lines and businesses or restructure our operations. We have, in recent years, exited several of our product lines and businesses, and we have closed several of our manufacturing and research facilities. We may continue to do so in the future. However, our ability to successfully exit product lines and businesses, or to close or consolidate operations, depends on a number of factors, many of which are outside of our control. For example, if we are seeking a buyer for a particular business line, none may be available, or we may not be successful in negotiating satisfactory terms with prospective buyers.\nOur operating results depend, in part, on the performance of independent distributors.\nA portion of our sales occurs through independent global and regional distributors that are not under our control. We rely on distributors to grow and develop their customer base and anticipate customer needs, and any lack of such actions by our distributors may adversely affect our results of operations. In particular, revenue from one of our distributors accounted for approximately 11% of the Company’s total consolidated revenue for the year ended December 31, 2020. If the business relationship with such distributor is terminated, whether through industry consolidation or otherwise, and we are unable to find a suitable replacement, our operations and operating results could be materially adversely affected. These independent distributors also generally represent product lines offered by several companies and are not subject to any minimum sales requirements or obligation to market our products to their customers. In turn, distributors could reduce their sales efforts for our products or choose to terminate their representation of us. Additionally, we rely on our distributors to provide accurate and timely sales reports in order for us to be able to generate financial reports that accurately represent distributor sales of our products during any given period. Any inaccuracies or untimely reports could adversely affect our ability to produce accurate and timely financial reports and recognize revenue.",
    "item_1B": "Item 1B. Unresolved Staff Comments\nNone.",
    "item_1C": "",
    "item_2": "Item 2. Properties\nOur corporate headquarters, as well as certain design center and research and development operations, are located in approximately 600,000 square feet of building space on property that we own in Phoenix, Arizona. We also own and lease properties around the world for use as sales offices, design centers, research and development labs, warehouses, logistic centers, trading offices and manufacturing support. The size and location of these properties, which are used by all of our reportable segments, change from time to time based on business requirements. We operate distribution centers, which are leased or contracted through a third-party, in locations throughout Asia, Europe and the Americas. See \"Business-Resources\" included elsewhere in this Form 10-K for information on properties used in our manufacturing operations. While these facilities are primarily used in manufacturing operations, they also include office, utility, laboratory, warehouse and unused space. Additionally, we own and lease research and development facilities located in Australia, Belgium, Canada, China, the Czech Republic, France, Germany, India, Ireland, Israel, Italy, Japan, the Philippines, Singapore, South Korea, Romania, Russia, the Slovak Republic, Slovenia, Switzerland, Taiwan, the United Kingdom and the United States. Our joint venture in Leshan, China also owns manufacturing, warehouse, laboratory, office and other unused space. We believe that our facilities around the world, whether owned or leased, are well-maintained.\nCertain of our properties are subject to encumbrances such as mortgages and liens. See Note 9: ''Long-Term Debt'' in the notes to our audited consolidated financial statements included elsewhere in this Form 10-K for further information. In addition, due to local law restrictions, the land upon which our facilities are located in certain foreign locations is subject to varying long-term leases. See \"Business-Resources\" included elsewhere in this Form 10-K for further details on our properties and \"Business-Governmental Regulation\" for further details on environmental regulation of our properties.",
    "item_3": "Item 3. Legal Proceedings\nSee Note 13: ''Commitments and Contingencies'' under the heading \"Legal Matters\" in the notes to our audited consolidated financial statements included elsewhere in this Form 10-K for a description of legal proceedings and related matters.",
    "item_4": "Item 4. Mine Safety Disclosure\nNot applicable.\nPART II",
    "item_5": "Item 5. Market for Registrant's Common Equity, Related Stockholder Matters and Issuer Purchases of Equity Securities\nOur common stock is traded under the symbol \"ON\" on the Nasdaq Global Select Market. The stock price details can be obtained from the Nasdaq website at www.nasdaq.com. As of February 10, 2021, there were approximately 209 holders of record of our common stock and 411,881,071 shares of common stock outstanding.\nWe have neither declared nor paid any cash dividends on our common stock since our initial public offering. Our future dividend policy with respect to our common stock will depend upon our earnings, capital requirements, financial condition, debt restrictions and other factors deemed relevant by our Board of Directors in its sole discretion.\nOur outstanding debt facilities may limit the amount of dividends we are permitted to pay and the amount we are permitted to buy back shares under the 2018 Share Repurchase Program (as defined below). So long as no default has occurred and is continuing or results therefrom, our Amended Credit Agreement permits us to pay cash dividends to our common stockholders, buy back shares under the 2018 Share Repurchase Program, or a combination thereof, in an amount up to $100.0 million. Additionally, we may pay dividends and buy back shares under the 2018 Share Repurchase Program in an unlimited amount so long as, after giving effect thereto, the consolidated total net leverage ratio (calculated in accordance with our Amended Credit Agreement) does not exceed 2.50 to 1.00. See Note 9: ''Long-Term Debt'' in the notes to the audited consolidated financial statements included elsewhere in this Form 10-K for further discussion of our Amended Credit Agreement.\nIssuer Purchases of Equity Securities\nThe following table provides information regarding repurchases of our common stock during the quarter ended December 31, 2020:\n(1)The periods represent our fiscal month start and end dates for the fourth quarter of 2020.\n(2)The number of shares purchased represents shares of common stock held by employees who tendered owned shares of common stock to the Company to satisfy the employee withholding taxes due upon the vesting of RSUs and shares purchased under the previously disclosed share repurchase program pursuant to the Capital Allocation Policy (the \"2018 Share Repurchase Program\"). Also included in the November 28, 2020 - December 30, 2020 period is an aggregate of 11,823,348 shares that were repurchased on December 1, 2020 pursuant to bond hedges for which no cash was exchanged. See Note 9: ''Long-Term Debt'' in the notes to the audited consolidated financial statements included elsewhere in this Form 10-K for additional information on this transaction.\n(3)The price per share is based on the fair market value at the time of tender or repurchase, as applicable.\n(4)On November 15, 2018, we announced the 2018 Share Repurchase Program for up to $1.5 billion of our common stock, exclusive of any fees, commissions or other expenses, subject to certain contingencies, that became effective on December 1, 2018 and expires on December 31, 2022.\nShare Repurchase Program\nWe repurchased approximately 3.6 million shares of common stock for $65.3 million under the 2018 Share Repurchase Program during the year ended December 31, 2020.\nUnder the 2018 Share Repurchase Program, we may repurchase our common stock from time to time in privately negotiated transactions or open market transactions, including pursuant to a trading plan in accordance with Rule 10b5-1 and Rule 10b-18 of the Exchange Act, or by any combination of such methods or other methods. The timing of any repurchases and the actual number of shares repurchased will depend on a variety of factors, including our stock price, corporate and regulatory requirements, restrictions under our debt obligations, and other market and economic conditions. The 2018 Share Repurchase Program does not require us to purchase any particular amount of common stock and is subject to a variety of factors including the Board’s discretion. As of December 31, 2020, the authorized amount remaining under the 2018 Share Repurchase Program was $1,295.8 million.\nSee Note 10: ''Earnings Per Share and Equity'' of the notes to our audited consolidated financial statements included elsewhere in this Form 10-K for further information on shares of common stock tendered to the Company by employees to satisfy applicable employee withholding taxes due upon vesting of RSUs and the 2018 Share Repurchase Program.",
    "item_6": "Item 6. Selected Financial Data\nThe following table sets forth certain of our selected financial data for the periods indicated. The consolidated statements of operations and balance sheet data set forth below are derived from our audited consolidated financial statements. The table below includes consolidated results, including our recent acquisitions, thus comparability will be materially affected. See Note 4: ''Recent Accounting Pronouncements'', Note 5: ''Acquisitions, Divestitures and Licensing Transactions'' and Note 13: ''Commitments and Contingencies'' in the notes to our audited consolidated financial statements included elsewhere in this Form 10-K for further information.\nYou should read this information in conjunction with \"Management's Discussion and Analysis of Financial Condition and Results of Operations\" and our audited consolidated financial statements, including the notes thereto, included elsewhere in this Form 10-K.",
    "item_7": "Item 7. Management’s Discussion and Analysis of Financial Condition and Results of Operations\nYou should read the following discussion in conjunction with our audited historical consolidated financial statements, including the notes thereto, which are included elsewhere in this Form 10-K. Management's Discussion and Analysis of Financial Condition and Results of Operations contains statements that are forward-looking. These statements are based on current expectations and assumptions that are subject to risk, uncertainties, and other factors. Actual results could differ materially because of the factors discussed in \"Risk Factors\" included elsewhere in this Form 10-K.\nExecutive Overview\nThis executive overview presents summarized information regarding our business and operating trends only. For further information relating to the information summarized herein, see \"Management's Discussion and Analysis of Financial Condition and Results of Operations\" in its entirety.\nRecent ON Semiconductor Results\nOur revenue for the year ended December 31, 2020 was $5,255.0 million, a decrease of 4.8% from $5,517.9 million for the year ended December 31, 2019. The decrease was attributable to reduced demand for our products across PSG, ASG and ISG primarily due to the negative impact from the COVID-19 pandemic. During 2020, while we reported net income attributable to ON Semiconductor of $234.2 million compared to $211.7 million in 2019, our operating income during 2020 was $348.7 million compared to $432.7 million during 2019. While the decrease in operating income was primarily due to the pervasive macroeconomic impacts of the COVID-19 pandemic, the increase in net income attributable to ON Semiconductor was due to the income tax benefit recorded during the year. Our gross margin decreased by approximately 310 basis points to 32.7% in 2020 from 35.8% in 2019. See discussion under \"Results of Operations\" for further discussion on the reasons for the fluctuations year over year.\nBusiness and Macroeconomic Environment\nThe COVID-19 pandemic has had, and is expected to continue to have, a significant adverse impact on global economic activity, including creating supply chain and market disruption. While certain measures enacted in 2020 to contain the spread of the COVID-19 pandemic have since been relaxed in many jurisdictions, the extent to which the pandemic will impact demand for our products depends on future developments, which are highly uncertain and difficult to predict, including new information that may emerge concerning the severity and longevity of the pandemic, and actions to contain and treat its impact.\nWe historically have pursued, and expect to continue to pursue, cost-saving initiatives to align our overall cost structure, capital investments and other expenditures with our expected revenue, spending and capacity levels based on our current sales and manufacturing projections. We have taken, and continue to take, significant cost containment efforts, including, but not limited to, workforce reductions, reducing discretionary spending, furloughs, and mandatory vacations. While all our global\nmanufacturing sites are currently operational, our facilities could be required to temporarily curtail production levels or temporarily cease operations based on government mandates. There can be no assurances that we will adequately forecast the impact of adverse economic conditions on our business or that we will effectively align our cost structure, capital investments and other expenditures with our revenue, spending and capacity levels in the future.\nSee Note 7: ''Restructuring, Asset Impairments and Other Charges, net'' in the notes to our audited consolidated financial statements included elsewhere in this Form 10-K for information relating to our most recent cost-saving initiatives.\nThe Impact of the COVID-19 Pandemic on our Business\nIn an effort to protect the health and safety of our employees, we have taken proactive, aggressive actions to adopt social distancing policies at our locations around the world, including reducing the number of people in our sites at any one time, encouraging our employees to work from home where possible, limiting the number of employees attending meetings and significantly reducing employee travel. In our role as responsible corporate citizens, we have taken actions to support our global communities by providing personal protective equipment to hospitals and health workers. We will continue to actively monitor implications of the COVID-19 pandemic on our business and may take further actions to adjust our business operations if deemed necessary, or as required by federal, state, or local law.\nDuring the majority of 2020, our results of operations were adversely impacted due to the reduced demand from our customers, government-mandated temporary shutdowns of certain of our facilities, supply shortages and other logistical constraints arising from the COVID-19 pandemic. However, towards the end of 2020, we experienced a meaningful improvement in the demand for most of our products, specifically products in the automotive sector that had been significantly impacted by the pandemic. However, current demand levels have yet to reach levels achieved before the pandemic. While we believe that our business has stabilized from the impact of the pandemic, a possible resurgence or another wave of the pandemic could alter the business and economic landscape again. We expect volatility in demand to continue in varying duration and severity until such time as the COVID-19 pandemic is effectively contained globally. Our long-term fundamentals remain strong as we believe that we are well-positioned for growth as business conditions continue to improve. We believe that secular trends in the automotive, industrial, and cloud-power end-markets, which are our primary areas of focus, will continue to drive long-term growth in the semiconductor industry.\nResults of Operations\nOur results of operations for the year ended December 31, 2020 includes the full year results, and our results of operations for the year ended December 31, 2019 includes partial year results of Quantenna, which we acquired on June 19, 2019.\nFor a discussion and comparison of the results of our operations for the year ended December 31, 2019 with the year ended December 31, 2018, refer to \"Management's Discussion and Analysis of Financial Conditions and Results of Operations\" in our Form 10-K for the year ended December 31, 2019 filed with the SEC on February 19, 2020.\nOperating Results\nThe following table summarizes certain information relating to our operating results that has been derived from our audited consolidated financial statements (in millions):\nRevenue\nRevenue was $5,255.0 million and $5,517.9 million for 2020 and 2019, respectively. The decrease from 2019 to 2020 of $262.9 million, or 4.8%, was primarily attributable to a 6.5%, 3.1% and 2.5% decrease in revenue in PSG, ASG and ISG, respectively, which is further explained below. We had one customer, a distributor, whose revenue accounted for approximately 11% of the total revenue for the year ended December 31, 2020.\nRevenue by operating and reportable segments was as follows (dollars in millions):\n_______________________\n(1) Certain of the amounts may not total due to rounding of individual amounts.\nRevenue from PSG\nRevenue from PSG decreased by $182.2 million, or approximately 7%, during 2020 compared to 2019. The revenue from our Advanced Power Division and Protection and Signal Division decreased by $116.8 million and $49.1 million, respectively. The decreases were due to a combination of a general decline in demand for these products due to economic conditions caused by the COVID-19 pandemic, and was exacerbated by internal delays in fulfilling certain customer orders due to our factories in China, the Philippines and Malaysia, which operated at significantly reduced capacity levels during portions of the first half of 2020 as a result of the COVID-19 pandemic.\nRevenue from ASG\nRevenue from ASG decreased by $61.9 million, or approximately 3%, during 2020 compared to 2019. The revenue from our Automotive Division and Mobile, Computing and Cloud Division decreased by $47.4 million and $39.6 million, respectively, and was partially offset by an increase in revenue of $34.1 million in our Wireless Connectivity Solutions Division, which included the acquired Quantenna business. The decreases in demand for the products in these divisions was primarily due to the economic conditions as a result of the COVID-19 pandemic, and specifically the automotive industry during the first half of the year, which has started to experience a meaningful recovery during the fourth quarter. Similar to PSG, this decrease was exacerbated by delays in fulfilling certain customer orders due to our factories in China, the Philippines and Malaysia, which operated at a significantly reduced capacity levels during portions of the first half of 2020 as a result of the COVID-19 pandemic.\nRevenue from ISG\nRevenue from ISG decreased by $18.8 million, or 2.5%, during 2020 compared 2019, which was primarily due to the decrease in revenue from our Automotive Sensing Division of $20.0 million, which was due to decreased demand and delays in fulfilling certain customer orders due to supply chain constraints during the first half of 2020 as a result of the COVID-19 pandemic.\nRevenue by Geographic Location\nRevenue by geographic location, based on sales billed from the respective country or regions, are as follows (dollars in millions):\n_______________________\n(1) Certain of the amounts may not total due to rounding of individual amounts.\nGross Profit and Gross Margin (exclusive of amortization of acquisition-related intangible assets)\nOur gross profit by operating and reportable segment was as follows (dollars in millions):\n___________________\n(1) Certain of the amounts may not total due to rounding of individual amounts.\n(2) Unallocated manufacturing costs are presented as a percentage of total revenue (2019 includes expensing of the fair market value step-up of inventory of $19.6 million acquired from Quantenna).\nOur gross profit was $1,715.8 million during 2020 compared to $1,973.6 million during 2019 representing a decrease of $257.8 million, or approximately 13%. Our gross margin decreased to 32.7% during 2020 compared to 35.8% during 2019. The decrease in gross profit and gross margin were attributable to a significant decline in sales volume due to the COVID-19 pandemic and a decline in average selling prices.\nWhile the improving business conditions during the second half of 2020 positively impacted our gross margins, we incurred additional expenses for freight, transportation and cleaning costs to operate our facilities in compliance with local government regulations that had an adverse impact on our gross margin.\nOperating Expenses\nResearch and Development\nResearch and development expenses were $642.9 million and $640.9 million, or approximately 12% of revenue during each of 2020 and 2019, representing an increase of $2.0 million, or approximately 0.3% year-over-year. While there was a decrease in the cost of external consultants and travel-related expenses due to the cost-saving measures and travel restrictions implemented in response to the COVID-19 pandemic, these decreases were offset due to the payroll expenses for Quantenna employees for the entire year in 2020.\nSelling and Marketing\nSelling and marketing expenses were $278.7 million and $301.0 million, or approximately 5% of revenue during each of 2020 and 2019, representing a decrease of $22.3 million, or approximately 7.4% year-over-year. The decrease was primarily related to a significant decrease in travel-related expenses due to the cost-saving measures and travel restrictions implemented in response to the COVID-19 pandemic and nominal decreases in payroll expenses as a result of furloughs and the VSP and Involuntary Separation Program (\"ISP\") offered during 2020. Please see Note 7: ''Restructuring, Asset Impairments and Other Charges, net'' in the notes to our audited consolidated financial statements included elsewhere in this Form 10-K for a more detailed description of the VSP and the ISP.\nGeneral and Administrative\nGeneral and administrative expenses were $258.7 million and $284.0 million, or approximately 5% of revenue during each of 2020 and 2019, representing a decrease of $25.3 million, or approximately 9% year-over-year. This decrease was primarily attributable to a decrease in stock compensation expense, travel-related expenses due to the cost-saving measures and travel restrictions implemented in response to the COVID-19 pandemic and certain other categories due to the general cost-saving measures.\nLitigation Settlement\nDuring 2019, we reached a litigation settlement with Power Integrations, Inc. (\"PI\"). In connection with the settlement, we incurred an expense of $169.5 million, and ultimately paid $175.0 million in cash, pursuant to which all outstanding legal and administrative disputes were withdrawn by both the parties. No such expenses were incurred during 2020. See Note 13: ''Commitments and Contingencies'' in the notes to our audited consolidated financial statements included elsewhere in this Form 10-K for additional information with respect to the litigation settlement with PI.\nAmortization of Acquisition-Related Intangible Assets\nAmortization of acquisition-related intangible assets was $120.3 million and $115.2 million for 2020 and 2019, respectively. The increase of $5.1 million, or approximately 4.4%, was primarily due to the amortization of intangible assets acquired from Quantenna.\nSee Note 5: ''Acquisitions, Divestiture and Licensing Transactions'' and Note 6: ''Goodwill and Intangible Assets'' in the notes to our audited consolidated financial statements included elsewhere in this Form 10-K for additional information with respect to the acquired intangible assets.\nRestructuring, Asset Impairments and Other Charges, net\nRestructuring, asset impairments and other charges, net was $65.2 million and $28.7 million for 2020 and 2019, respectively. Amounts incurred during 2020 related to the VSP, ISP and other restructuring programs, primarily through workforce reductions. Included in 2020 were also asset impairment charges amounting to $17.5 million. Amounts incurred during 2019 related to the post-Quantenna acquisition related restructuring program as well as certain restructuring actions undertaken by us aimed at cost savings, primarily through workforce reductions.\nFor additional information, see Note 7: ''Restructuring, Asset Impairments and Other Charges, net'' in the notes to our audited consolidated financial statements included elsewhere in this Form 10-K.\nIntangible Asset Impairment\nIntangible asset impairment charges were $1.3 million and $1.6 million for 2020 and 2019, respectively, related to the cancellation and abandonment of certain IPRD projects during the year.\nSee Note 6: ''Goodwill and Intangible Assets'' in the notes to our audited consolidated financial statements included elsewhere in this Form 10-K for additional information.\nOther Income and Expenses\nInterest Expense\nInterest expense increased by $20.1 million, or approximately 14%, to $168.4 million during 2020 compared to $148.3 million in 2019, primarily due to an increase in the outstanding balances of long-term debt as a result of the borrowings under the Revolving Credit Facility (which was subsequently repaid) and our issuance of the 3.875% Notes, offset partially by the repayment of our 1.00% Notes. We recorded amortization of debt discount to interest expense of $38.2 million and $37.8 million for 2020 and 2019, respectively. Our average gross amount of long-term debt balance (including current maturities) during 2020 and 2019 was $3,669.4 million and $3,344.1 million, respectively. Our weighted average interest rate on our gross amount of long-term debt (including current maturities) was 4.6% and 4.4% per annum in 2020 and 2019, respectively.\nSee \"Liquidity and Capital Resources-Key Financing and Capital Events\" below and Note 9: ''Long-Term Debt'' in the notes to our audited consolidated financial statements included elsewhere in this Form 10-K for a description of our indebtedness and our refinancing activities.\nLoss on Debt Refinancing and Prepayment\nWe recorded loss on debt refinancing and prepayment of $6.2 million during 2019 related to the activity under the Amended Credit Agreement. No such expenses were incurred during 2020.\nOther Income (Expense)\nOther expense decreased by $3.2 million, or approximately 27%, from 2019 to 2020. The decrease was primarily attributable to a decrease of $11.6 million in actuarial losses on our pension obligations during 2020 compared to 2019, offset by the recognition of an indemnification gain of $7.8 million primarily attributable to the resolution of a foreign tax dispute and other IP related claims during 2019.\nIncome Tax Provision\nWe recorded an income tax benefit of $59.8 million and a provision of $62.7 million in 2020 and 2019, respectively.\nThe income tax benefit for the year ended December 31, 2020 consisted of discrete benefits of $63.0 million primarily due to the recognition of certain deferred tax assets, net of deferred tax liabilities, related to the domestication of certain foreign subsidiaries and a benefit of $49.4 million related to the release of valuation allowance against certain state deferred tax assets. These benefits were partially offset by a provision of $43.9 million for income and withholding taxes of certain of our foreign and domestic operations, a $2.3 million discrete provision relating to prior year uncertain tax positions, a discrete provision of $5.5 million relating to additional foreign valuation allowance, and $0.9 million of other discrete items.\nThe income tax provision for the year ended December 31, 2019 consisted primarily of $66.4 million for income and withholding taxes of certain of our foreign and domestic operations, $6.0 million relating to the resolution of a foreign tax dispute and $3.3 million of new reserves and interest on existing reserves for uncertain tax positions in foreign jurisdictions and $2.1 million of prior year adjustments. These amounts were offset by discrete benefits of $9.2 million relating to the release of reserves and interest for uncertain tax positions in foreign jurisdictions related to prior years and $5.9 million relating to equity award excess tax benefits.\nFor additional information, see Note 16: ''Income Taxes'' in the notes to the audited consolidated financial statements included elsewhere in this Form 10-K.\nLiquidity and Capital Resources\nThis section includes a discussion and analysis of our cash requirements, off-balance sheet arrangements, contingencies, sources and uses of cash, operations, working capital and long-term assets and liabilities.\nContractual Obligations\nOur principal outstanding contractual obligations relate to our long-term debt, operating lease liabilities and purchase obligations. The following table summarizes our contractual obligations at December 31, 2020 and the effect such obligations are expected to have on our liquidity and cash flow in the future (in millions):\n_______________________\n(1)The table above excludes approximately $45.1 million of liabilities related to unrecognized tax benefits because we are unable to reasonably estimate the timing of the settlement of such liabilities.\n(2)Includes interest payments at applicable rates as of December 31, 2020.\n(3)These represent our off-balance sheet arrangements (See \"Liquidity and Capital Resources - Off-Balance Sheet Arrangements\" for further information).\n(4)During 2019, we incurred additional commitments relating to the pending acquisition of a manufacturing facility, of which, $170.0 million has been deposited with the seller already. The remaining commitment of $230.0 million will be owed on or around December 31, 2022. See Note 5: ''Acquisitions, Divestiture and Licensing Transactions'' in the notes to our audited consolidated financial statements included elsewhere in this Form 10-K for additional information.\nThe table also excludes our pension obligations. We expect to make cash contributions to comply with local funding requirements and required benefit payments of approximately $22.1 million and $7.0 million, respectively, in 2021. This future payment estimate assumes we continue to meet our statutory funding requirements. The timing and amount of contributions may be impacted by a number of factors, including the funded status of the plans. Beyond 2021, the actual amounts required to be contributed are dependent upon, among other things, interest rates, underlying asset returns and the impact of legislative or regulatory actions related to pension funding obligations. See Note 12: ''Employee Benefit Plans'' in the notes to our audited consolidated financial statements included elsewhere in this Form 10-K for more information on our pension obligations.\nOur balance of cash and cash equivalents was $1,080.7 million as of December 31, 2020. We believe that our cash flows from operations, coupled with our existing cash and cash equivalents, and cash available from our Revolving Credit Facility, will be adequate to fund our operating, debt repayment and capital needs for at least the next 12 months. Total cash and cash equivalents at December 31, 2020 include approximately $489.1 million available in the United States. We require a substantial\namount of cash in the United States for operating requirements, debt service, debt repayments and acquisitions. While we hold a significant amount of cash and cash equivalents outside the United States in various foreign subsidiaries, we have the ability to obtain cash in the United States in order to cover our domestic needs, through distributions from our foreign subsidiaries, by utilizing existing credit facilities or through new bank loans or debt obligations.\nSee Note 9: ''Long-Term Debt,'' in the notes to our audited consolidated financial statements included elsewhere in this Form 10-K for a discussion of our long-term debt. See \"Market for Registrant's Common Equity, Related Stockholder Matters and Issuer Purchases of Equity Securities\" included elsewhere in this Form 10-K for a discussion of restrictions on our ability to pay dividends and our stock repurchase activities.\nOff-Balance Sheet Arrangements\nIn the ordinary course of business, we provide standby letters of credit or other guarantee instruments to certain parties in connection with certain transactions including, but not limited to: material purchase commitments, agreements to mitigate collection risk, leases, utilities or customs guarantees. As of December 31, 2020, our Revolving Credit Facility included $15.0 million available for the issuance of letters of credit. There were $0.9 million letters of credit outstanding under our Revolving Credit Facility as of December 31, 2020, which reduced our borrowing capacity dollar-for-dollar. As of December 31, 2020, we also had outstanding guarantees and letters of credit outside of our Revolving Credit Facility in the amount of $9.7 million.\nAs part of securing financing in the ordinary course of business, we have issued guarantees related to certain of our subsidiaries', which totaled $0.9 million as of December 31, 2020. Based on historical experience and information currently available, we believe that we will not be required to make payments under the standby letters of credit or guarantee arrangements for the foreseeable future.\nWe have not recorded any liability in connection with these letters of credit and guarantee arrangements. See Note 9: ''Long-Term Debt,'' and Note 13: ''Commitments and Contingencies'' in the notes to our audited consolidated financial statements found elsewhere in this Form 10-K for additional information.\nContingencies\nWe are a party to a variety of agreements entered into in the ordinary course of business pursuant to which we may be obligated to indemnify other parties for certain liabilities that arise out of or relate to the subject matter of the agreements. Some of the agreements entered into by us require us to indemnify the other party against losses, including, but not limited to, losses due to IP infringement, environmental contamination and other property damage, personal injury, our failure to comply with applicable laws, our negligence or willful misconduct or our breach of representations, warranties or covenants related to such matters as title to sold assets.\nWe face risk of exposure to warranty and product liability claims in the event that our products fail to perform as expected or such failure of our products results, or is alleged to result, in economic damage, bodily injury or property damage. In addition, if any of our designed products are alleged to be defective, we may be required to participate in their recall. Depending on the significance of any particular customer and other relevant factors, we may agree to provide more favorable rights to such customer for valid defective product claims.\nWe maintain directors’ and officers’ insurance policies that indemnify our directors and officers against various liabilities, including certain liabilities under the Exchange Act that might be incurred by any director or officer in his or her capacity as such.\nThe agreement and plan of merger relating to the acquisition of Fairchild Semiconductor International Inc. (the \"Fairchild Agreement\") provides for indemnification and insurance rights in favor of Fairchild’s then current and former directors, officers and employees. Specifically, we have agreed that, for no fewer than six years following the Fairchild acquisition, we will: (a) indemnify and hold harmless each such indemnitee against losses and expenses (including advancement of attorneys’ fees and expenses) in connection with any proceeding asserted against the indemnified party in connection with such person’s servings as a director, officer, employee or other fiduciary of Fairchild or its subsidiaries prior to the effective time of the acquisition; (b) maintain in effect all provisions of the certificate of incorporation or bylaws of Fairchild or any of its subsidiaries or any other agreements of Fairchild or any of its subsidiaries with any indemnified party regarding elimination of liability, indemnification of officers, directors and employees and advancement of expenses in existence on the date of the Fairchild Agreement for acts or omissions occurring prior to the effective time of the acquisition and; (c) subject to certain qualifications, provide to Fairchild’s then current directors and officers an insurance and indemnification policy that provides\ncoverage for events occurring prior to the effective time of the acquisition that is no less favorable than Fairchild’s then-existing policy, or, if insurance coverage that is no less favorable is unavailable, the best available coverage.\nSimilarly, the agreement and plan of merger relating to the acquisition of Quantenna (the \"Quantenna Agreement\") provides for indemnification and insurance rights in favor of Quantenna’s then current and former directors, officers, employees and agents. Specifically, we have agreed that, for no fewer than six years following the Quantenna acquisition, we will: (a) indemnify and hold harmless each such indemnified party to the fullest extent permitted by Delaware law in the event of any threatened or actual claim suit, action, proceeding or investigation against the indemnified party based in whole or in part on, or pertaining to, such person’s serving as a director, officer, employee or agent of Quantenna or its subsidiaries or predecessors prior to the effective time of the acquisition or in connection with the Quantenna Agreement; (b) maintain in effect provisions of the certificate of incorporation and bylaws of Quantenna and each of its subsidiaries regarding the elimination of liability of directors and indemnification of officers, directors and employees that are no less advantageous to the intended beneficiaries than the corresponding provisions in the certificate of incorporation and bylaws of Quantenna and each of its subsidiaries in existence on the date of the Quantenna Agreement; and (c) obtain and fully pay the premium for a non-cancelable extension of directors’ and officers’ liability coverage of Quantenna’s directors’ and officers’ policies and Quantenna’s fiduciary liability insurance policies in effect as of the date of the Quantenna Agreement.\nWhile our future obligations under certain agreements may contain limitations on liability for indemnification, other agreements do not contain such limitations and under such agreements it is not possible to predict the maximum potential amount of future payments due to the conditional nature of our obligations and the unique facts and circumstances involved in each particular agreement. Historically, payments made by us under any of these indemnities have not had a material effect on our business, financial condition, results of operations or cash flows, and we do not believe that any amounts that we may be required to pay under these indemnities in the future will be material to our business, financial condition, results of operations or cash flows.\nSee Note 13: ''Commitments and Contingencies'' in the notes to our audited consolidated financial statements included elsewhere in this Form 10-K for possible contingencies related to legal matters. See also \"Business-Government Regulation\" for information on certain environmental matters.\nSources and Uses of Cash\nOur balance of cash and cash equivalents was $1,080.7 million as of December 31, 2020. We require cash to fund our operating expenses, working capital requirements, outlays for strategic acquisitions and investments, for debt service including principal and interest, for research and development, for capital expenditures, and to repurchase our common stock. As part of our business strategy, we review acquisition and divestiture opportunities on a regular basis. During 2019, we entered into an agreement on the pending acquisition of a manufacturing facility and completed the acquisition of Quantenna.\nWe believe that the key factors that could affect our internal and external sources of cash include:\n•Geopolitical and macroeconomic factors caused by the COVID-19 pandemic which has had, and is expected to continue to have, negative impacts on the economies of the majority of countries and industries. While there has been a nominal recovery during the second half of 2020, the ultimate effect of the COVID-19 pandemic and the responses of various governmental entities and industries thereto, the duration and severity and the possibility of the re-emergence of the pandemic in future months and the anticipated recovery period is uncertain.\n•Factors that affect our results of operations and cash flows, including the impact on our business and operations as a result of changes in demand for our products, including as a result of the COVID-19 pandemic, competitive pricing pressures, effective management of our manufacturing capacity, our ability to achieve further reductions in operating expenses, the impact of our restructuring programs on our production and cost efficiency and our ability to make the research and development expenditures required to remain competitive in our business; and\n•Factors that affect our access to bank financing and the debt and equity capital markets that could impair our ability to obtain needed financing on acceptable terms or to respond to business opportunities and developments as they arise, including interest rate fluctuations, macroeconomic conditions, including as a result of the COVID-19 pandemic, sudden reductions in the general availability of lending from banks or the related increase in cost to obtain bank financing and our ability to maintain compliance with covenants under our debt agreements in effect from time to time.\nThe following are some of the significant sources and uses of cash during 2020 outside of our operating activities and regular capital expenditures:\n•Borrowing of $1,165.0 million under the Revolving Credit Facility on March 24, 2020 and repayment of $1,200.0 million of such borrowings using the net proceeds from the issuance of the 3.875% Notes and cash on hand on August 21, 2020.\n•Issuance of $700.0 million of 3.875% Notes on August 21, 2020, the net proceeds of which were used to repay a portion of the outstanding borrowings under the Revolving Credit Facility.\n•Additional deposit of $100.0 million for the pending acquisition of GFUS’s East Fishkill, New York site and fabrication facilities and certain other assets and liabilities on October 5, 2020.\n•Repayment upon maturity of the principal portion of the 1.00% Notes amounting to $690.0 million on December 1, 2020.\n•Repayment of $65.0 million of the outstanding borrowings under the Revolving Credit Facility on December 31, 2020.\n•Repurchase of 3.6 million shares of common stock for an aggregate purchase price of approximately $65.3 million under the 2018 Share Repurchase Program\nOur ability to service our long-term debt, including our 3.875% Notes, 1.625% Notes, Revolving Credit Facility and Term Loan \"B\" Facility, to remain in compliance with the various covenants contained in our debt agreements and to fund working capital, capital expenditures and business development efforts will depend on our ability to generate cash from operating activities, which is subject to, among other things, our future operating performance, timing of the full economic recovery from the COVID-19 pandemic, as well as to financial, competitive, legislative, regulatory and other conditions, some of which may be beyond our control.\nIf we fail to generate sufficient cash from operations, we may need to raise additional equity or borrow additional funds to achieve our longer-term objectives. There can be no assurance that such equity or borrowings will be available or, if available, will be at rates or prices acceptable to us. We believe that cash flow from operating activities coupled with existing cash and cash equivalents and existing credit facilities will be adequate to fund our operating, debt repayment and capital needs, as well as enable us to maintain compliance with our various debt agreements, through at least the next 12 months. To the extent that results or events differ from our financial projections or business plans, our liquidity may be adversely impacted.\nDuring the ordinary course of business, we evaluate our cash requirements and, if necessary, adjust our expenditures for inventory, operating expenditures and capital expenditures to reflect the current market conditions and our projected sales and demand. Our capital expenditures are primarily directed towards manufacturing equipment. Our capital expenditure levels can materially influence our available cash for other initiatives. For example, during 2020, we paid approximately $383.6 million for capital expenditures, while in 2019 we paid approximately $534.6 million. While our capital expenditures have historically been approximately 6% to 7% of annual revenue, we incurred capital expenditures of approximately 7% and 10% of annual revenue in 2020 and 2019, respectively. We expect to incur capital expenditures in the range of 7% to 8% of revenue in 2021 to further improve our manufacturing cost structure. Future capital expenditures are expected to be lower, however, may be impacted by events and transactions that are not currently forecasted.\nAs of December 31, 2020, there was $1,614.5 million outstanding under the Term Loan \"B\" Facility and $700.0 million outstanding under the Revolving Credit Facility, in addition to the 3.875% Notes for $700.0 million and 1.625% Notes for $575.0 million, of which the 1.625% Notes net of unamortized discount and issuance costs has been reclassified as a current portion of long-term debt. The associated interest expense related to this indebtedness will continue to have a significant impact on our results of operations.\nSee Note 5: ''Acquisitions, Divestiture and Licensing Transactions'' and Note 9: ''Long-Term Debt'' in the notes to our audited consolidated financial statements included elsewhere in this Form 10-K for additional information.\nCash Management\nOur ability to manage cash is limited, as our primary cash inflows and outflows are dictated by the terms of our sales and supply agreements, contractual obligations, debt instruments and legal and regulatory requirements. While we have some flexibility with respect to the timing of capital equipment purchases, we must invest in capital equipment on a timely basis to allow us to maintain our manufacturing efficiency and support our platforms for new products.\nPrimary Cash Flow Sources\nOur long-term cash generation is dependent on the ability of our operations to generate cash. Our cash flows from operating activities were $884.3 million, $694.7 million, and $1,274.2 million for the years ended December 31, 2020, 2019 and 2018, respectively. Our operating cash flows for the year ended December 31, 2020 increased by $189.6 million, or 27.3%, compared to the year ended December 31, 2019, which was primarily due to the payment of $175.0 million in 2019 to PI relating to a litigation settlement, which decreased our cash flows during 2019. Although, there was a significant decrease in operating income and income before income taxes in 2020 due to decreased demand for our products as a result of the COVID-19 pandemic, the negative impact on the cash flows provided from operating activities were offset by effective working capital management.\nOur ability to maintain positive operating cash flows is dependent on, among other factors, our success in achieving our\nrevenue goals and manufacturing and operating cost targets. Our management of our assets and liabilities, including both working capital and long-term assets and liabilities, also influences our operating cash flows, and each of these components is discussed below.\nWorking Capital\nWorking capital, calculated as total current assets less total current liabilities, fluctuates depending on end-market demand and our effective management of certain items such as receivables, inventory and payables. In times of escalating demand, our working capital requirements may be affected as we purchase additional manufacturing materials and increase production. Our working capital may also be affected by restructuring programs, which may require us to use cash for severance payments, asset transfers and contract termination costs. In addition, our working capital may be affected by acquisitions and transactions involving our convertible notes and other debt instruments. Although investments made to fund working capital will reduce our cash balances, these investments are necessary to support business and operating initiatives.\nOur working capital, excluding cash and cash equivalents and the current portion of long-term debt, was $960.5 million as of December 31, 2020 and has fluctuated between $879.3 million and $1,057.1 million at the end of each of our last eight fiscal quarters. Our working capital, including cash and cash equivalents and the current portion of long-term debt, was $1,509.6 million as of December 31, 2020 and has fluctuated between $1,071.4 million and $2,379.8 million at the end of each of our last eight fiscal quarters. The significant fluctuation was due to the additional borrowings under the Revolving Credit Facility during 2020 in light of the COVID-19 pandemic. For the year ended December 31, 2020, there was not a significant impact to our working capital as we tried to manage our business conservatively in light of the negative impact from the COVID-19 pandemic.\nLong-Term Assets and Liabilities\nOur long-term assets consist primarily of property, plant and equipment, intangible assets, deferred taxes and goodwill. Our manufacturing rationalization plans have included efforts to utilize our existing manufacturing assets and supply arrangements more efficiently. We believe that near-term access to additional manufacturing capacity, should it be required, could be readily obtained on reasonable terms through manufacturing agreements with third parties. We will continue to look for opportunities to make strategic purchases in the future for additional capacity.\nOur long-term liabilities, excluding long-term debt and deferred taxes, consist of liabilities under our foreign defined benefit pension plans, operating lease liabilities and contingent tax reserves. In regard to our foreign defined benefit pension plans, our annual funding of these obligations is equal to the minimum amount legally required in each jurisdiction in which the plans operate. This annual amount is dependent upon numerous actuarial assumptions. For additional information, see Note 12: ''Employee Benefit Plans'', \"Note 8: ''Balance Sheet Information'' and Note 16: ''Income Taxes'' in the notes to our audited consolidated financial statements included elsewhere in this Form 10-K.\nKey Financing and Capital Events\nOverview\nFor the past several years, we have undertaken various measures to secure liquidity to pursue acquisitions, repurchase shares of our common stock, reduce interest costs, amend existing key financing arrangements and, in some cases, extend a portion of our debt maturities to continue to provide us additional operating flexibility. Certain of these measures continued in 2020. Set forth below is a summary of certain key financing events affecting our capital structure during the last three years. For further discussion of our debt instruments, see Note 9: ''Long-Term Debt'' and for further discussion on the 2018 Share Repurchase Program and the 2014 Share Repurchase Program (as defined below), see Note 10: ''Earnings Per Share and Equity'' in the notes to our audited consolidated financial statements included elsewhere in this Form 10-K.\n2020 Financing Events\nMaturity and Settlement of 1.00% Notes due 2020\nThe 1.00% Notes matured on December 1, 2020. The maturity of the notes resulted in us paying $690.0 million in cash, representing the principal portion of the 1.00% Notes, to holders of the 1.00% Notes using our available cash and cash equivalents.\nThe excess over the principal amount was settled by issuing shares of common stock held in treasury. At the time of issuance of\nthe 1.00% Notes, we concurrently entered into hedge transactions with certain of the initial purchasers of the 1.00% Notes, and accordingly, repurchased an equivalent number of shares of our common stock at fair market value, to effectively offset the issuance of shares.\nAlso at the time of issuance of the 1.00% Notes, we sold warrants to certain bank counterparties whereby the holders of the warrants have the option to purchase from us, the equivalent number of shares of our common stock at a price of $25.96 per share. These warrants can be exercised by the holders beginning in March 2021 and expire no later than April 2021. We currently anticipate the holders to exercise the warrants to purchase up to 37.3 million shares of common stock from us, which will be settled on a net-share basis depending on the average stock price on the day of exercise.\nIssuance of 3.875% Notes\nOn August 21, 2020, we completed a private offering of $700.0 million aggregate principal amount of the 3.875% Notes. The 3.875% Notes were offered in the United States to qualified institutional buyers pursuant to Rule 144A under the Securities Act and outside the United States pursuant to Regulation S under the Securities Act. The 3.875% Notes are fully and unconditionally guaranteed, on a joint and several basis, by each of our subsidiaries that is a borrower or guarantor under the Amended Credit Agreement and will also be fully and unconditionally guaranteed by any our subsidiaries that becomes a borrower or guarantees any indebtedness under the Amended Credit Agreement in the future.\nThe 3.875% Notes and the guarantees thereof are ours' and the guarantors' general unsecured obligations, respectively, and (i) rank equally in right of payment with all of ours' and the guarantors’ existing and future senior indebtedness (including the 1.625% Notes); (ii) rank senior to any subordinated indebtedness that we or the guarantors may incur; (iii) are effectively subordinated to all of ours' or the guarantors’ existing and future secured indebtedness (including indebtedness under the Amended Credit Agreement), in each case, to the extent of the value of the assets securing such indebtedness; and (iv) are structurally subordinated in right of payment to all existing and future obligations of our subsidiaries that are not guarantors of the 3.875% Notes.\nThe 3.875% Notes bear interest at a rate of 3.875% per year, payable semi-annually on March 1 and September 1 of each year, beginning on March 1, 2021, and will mature on September 1, 2028, unless earlier redeemed or repurchased by us. In connection with the issuance, we incurred original issue discount and debt issuance costs amounting to $9.4 million, which has been capitalized and will be amortized to interest expense through the maturity date of September 1, 2028. The net proceeds from the issuance of the 3.875% Notes were used entirely to repay borrowings under the Revolving Credit Facility.\nBorrowing and repayment under the Revolving Credit Facility\nOn March 24, 2020, we borrowed $1,165.0 million under the Revolving Credit Facility as a precautionary measure in order to increase the Company’s cash position and provide financial flexibility in light of the uncertainty resulting from the impact of the COVID-19 pandemic. Due to better macroeconomic and business conditions, on August 21, 2020, we used the net proceeds from the issuance of the 3.875% Notes along with cash on hand to repay $1,200.0 million of outstanding borrowings. Additionally, on December 31, 2020, we repaid $65.0 million of outstanding borrowings under the Revolving Credit Facility. As of December 31, 2020, approximately $1,269.0 million was available for future borrowings under the Revolving Credit Facility.\nAmendments to the Amended Credit Agreement\nOn June 23, 2020, we entered into the Eighth Amendment (\"Eighth Amendment\") to the Amended Credit Agreement with the subsidiary guarantors party thereto, Deutsche Bank AG New York Branch, as administrative agent and collateral agent, and certain Lenders party thereto constituting the Required Lenders (as defined in the Amended Credit Agreement). The Eighth Amendment provided for, among other things, (i) replacing the defined term \"Capital Lease Obligations\" with a new defined term \"Finance Lease Obligations,\" providing that such obligations only include property classified as finance leases under U.S. GAAP and (ii) making certain amendments in connection with the proposed domestication of ON Management Ltd. and Quantenna Ltd., each of which is our subsidiary that is not a Loan Party (as defined in the Amended Credit Agreement) and both of which hold economic rights in certain intellectual property, from Bermuda entities to Delaware entities, including, among other things, (a) permitting Investments (as defined in the Amended Credit Agreement) by any Loan Party in any Foreign Subsidiary (as defined in the Amended Credit Agreement) if the proceeds of such Investments are used for Capital Expenditures (as defined in the Amended Credit Agreement) (\"Capital Expenditure Investments\") and (b) increasing the amount of certain permitted intercompany Investments by any Loan Party in any subsidiary that is not a Loan Party by an amount (which shall not be less than zero) equal to (A) Net Royalties (as defined in the Amended Credit Agreement) minus (B) the aggregate amount of Capital Expenditure Investments.\n2018 Share Repurchase Program\nDuring 2020, we repurchased 3.6 million shares of our common stock for an aggregate purchase price of $65.3 million pursuant to the 2018 Share Repurchase Program.\n2019 Financing Events\nAmendments to the Amended Credit Agreement\nOn June 12, 2019, we entered into the Fifth Amendment to the Amended Credit Agreement (the \"Fifth Amendment\"), with the subsidiary guarantors party thereto, Deutsche Bank AG New York Branch, as administrative agent, collateral agent and issuing lender, the \"2019 Incremental Revolving Lenders\" (as defined in the Fifth Amendment) party thereto, and the \"New Required Lenders\" (as defined in the Fifth Amendment) party thereto. The Fifth Amendment provided for, among other things, modifications to the Amended Credit Agreement to: (i) increase the amount that may be borrowed pursuant to the Revolving Credit Facility by $900.0 million to $1.9 billion; (ii) extend the maturity date of borrowings under the Revolving Credit Facility to the later of (x) December 30, 2022 or (y) June 12, 2024, so long as the borrowings under the Term Loan \"B\" Facility have been fully repaid or otherwise redeemed, discharged or defeased on or prior to December 30, 2022, or if the maturity date of borrowings under the Term Loan \"B\" Facility has been extended prior to December 30, 2022, to a date no earlier than June 12, 2024; and (iii) amend certain financial covenants, including deleting the minimum Interest Coverage Ratio and increasing the maximum Consolidated Total Net Leverage Ratio (as such terms are defined in the Amended Credit Agreement) from 4.00 to 1.00 to 4.50 to 1.00 during any period of four consecutive fiscal quarters commencing after a Permitted Acquisition (as defined in the Amended Credit Agreement) with consideration in excess of $250.0 million. On June 19, 2019, we drew $900.0 million of the Revolving Credit Facility to partially fund the acquisition of Quantenna.\nOn August 15, 2019, we entered into the Sixth Amendment to the Amended Credit Agreement (the \"Sixth Amendment\"), which increased amounts that may be borrowed under the Revolving Credit Facility by $70.0 million to $1.97 billion.\nOn September 19, 2019, we entered into the Seventh Amendment to the Amended Credit Agreement (the \"Seventh Amendment\"). The Seventh Amendment provided for, among other things, modifications to the Amended Credit Agreement to (i) increase the amount that may be borrowed pursuant to the Term Loan \"B\" Facility by approximately $500.5 million, up to an aggregate principal amount of $1.635 billion; (ii) extend the maturity date of borrowings under the Term Loan \"B\" Facility to September 19, 2026; (iii) for any interest period ending after the date of the Seventh Amendment, increase the interest rate for borrowings under the Term Loan \"B\" Facility to (a) with respect to eurocurrency loans, a base rate per annum equal to the Adjusted LIBO Rate (as defined in the Amended Credit Agreement) plus an applicable margin of 2.00% and (b) with respect to alternate base rate loans, a base rate per annum equal to the Alternate Base Rate (as defined in the Amended Credit Agreement) plus an applicable margin equal to 1.00%; and (iv) make certain amendments providing for the determination of an alternate interest rate to the Adjusted LIBO Rate and/or the LIBO Rate (as defined in the Amended Credit Agreement) in the event of certain circumstances that result in the inability to adequately and reasonably determine such rates or such rates no longer adequately and fairly reflecting the cost of the applicable loans. In addition, pursuant to the Fifth Amendment (defined above), as a result of the extension described in (ii) above, the maturity date of borrowings under the Revolving Credit Facility was extended to June 12, 2024. We utilized the additional borrowings pursuant to the Seventh Amendment to repay $500.0 million of the outstanding balance under the Revolving Credit Facility.\n2018 Share Repurchase Program\nDuring 2019, we repurchased 7.8 million shares of our common stock for an aggregate purchase price of $138.9 million pursuant to the 2018 Share Repurchase Program.\n2018 Financing Events\nAmendments to the Amended Credit Agreement\nOn May 31, 2018, we, the Guarantors (as defined in the Amended Credit Agreement), the several lenders party thereto and the Agent (as defined in the Amended Credit Agreement) entered into the Fourth Amendment to the Amended Credit Agreement (the “Fourth Amendment”). Pursuant to the Fourth Amendment, for any interest period ending after the date of the Fourth Amendment, Eurocurrency Loans (as defined in the Amended Credit Agreement) will accrue interest at (i) a base rate per annum equal to the Adjusted LIBO Rate (as defined in the Amended Credit Agreement) plus (ii) an applicable margin equal to (x) 1.25% with respect to borrowings under the Revolving Credit Facility (with step-downs and step-ups as set forth in the Amended Credit Agreement) or (y) 1.75% with respect to borrowings under the Term Loan “B” Facility.\nPursuant to the Fourth Amendment, ABR Loans (as defined in the Amended Credit Agreement) will accrue interest at (i) a base rate per annum equal to the highest of (x) the federal funds rate plus 0.50%, (y) the prime commercial lending rate announced by the Agent from time to time as its prime lending rate and (z) the Adjusted LIBO Rate (as defined in the Amended Credit Agreement) for a one month interest period (or if such day is not a business day, the immediately preceding business day) (determined after giving effect to any applicable “floor”) plus 1.00%; provided that, the Adjusted LIBO Rate for any day shall be based on the LIBO Rate (as defined in the Amended Credit Agreement), subject to the interest rate floors set forth in the Amended Credit Agreement, plus (ii) an applicable margin equal to (x) 0.25% with respect to borrowings under the Revolving Credit Facility (with step-ups as set forth in the Amended Credit Agreement) or (y) 0.75% with respect to borrowings under the Term Loan \"B\" Facility.\nDuring the year ended December 31, 2018, we prepaid $70.0 million of borrowings under the Term Loan \"B\" Facility.\n2014 Share Repurchase Program\nDuring 2018, we repurchased 16.8 million shares of our common stock for an aggregate purchase price of $315.0 million under the 2014 Share Repurchase Program (as defined below).\nDebt Guarantees and Related Covenants\nAs of December 31, 2020, we were in compliance with the indentures relating to our 3.875% Notes and 1.625% Notes and with covenants relating to our Term Loan \"B\" Facility and Revolving Credit Facility. Our 3.875% Notes and 1.625% Notes are senior to the existing and future subordinated indebtedness of ON Semiconductor and our guarantor subsidiaries and rank equally in right of payment to all of our existing and future senior debt and as unsecured obligations and are subordinated to all of our existing and future secured debt to the extent of the assets securing such debt. See Note 9: ''Long-Term Debt'' in the notes to our audited consolidated financial statements included elsewhere in this Form 10-K for additional information.\nCritical Accounting Policies and Estimates\nThe accompanying discussion and analysis of our financial condition and results of operations is based upon our audited consolidated financial statements, which have been prepared in accordance with accounting principles generally accepted in the United States. We believe certain of our accounting policies are critical to understanding our financial position and results of operations. We utilize the following critical accounting policies in the preparation of our financial statements.\nUse of Estimates. The preparation of financial statements in accordance with GAAP requires us to make estimates and assumptions that affect the reported amount of assets and liabilities at the date of the financial statements and the reported amount of revenue and expenses during the reporting period. We evaluate these estimates and judgments on an ongoing basis and base our estimates on experience, current and expected future conditions, third-party evaluations and various other assumptions that we believe are reasonable under the circumstances. Significant estimates have been used by management in conjunction with the following: (i) future payouts for customer incentives and amounts subject to allowances and returns; (ii) valuation and obsolescence relating to inventories; (iii) variable and share-based compensation; and (iv) measurement of valuation allowances against deferred tax assets, and evaluations of uncertain tax positions. Additionally, during periods where it becomes applicable, significant estimates will be used by management in determining the future cash flows used to assess and test for impairment of indefinite-lived intangible assets, long-lived assets and goodwill and in assumptions used in connection with business combinations. Actual results may differ from the estimates and assumptions used in the consolidated financial statements.\nRevenue. We generate revenue from sales of our semiconductor products to OEMs, electronic manufacturing service providers and distributors. We also generate revenue, to a much lesser extent, from product development agreements and manufacturing services provided to customers. We recognize revenue when we satisfy a performance obligation in an amount reflecting the consideration to which we expect to be entitled. For sales agreements, we have identified the promise to transfer products, each of which is distinct, to be the performance obligation. For product development agreements, we have identified the completion of a service defined in the agreement to be the performance obligation. We apply a five-step approach in determining the amount and timing of revenue to be recognized: (1) identifying the contract with a customer; (2) identifying the performance obligations in the contract; (3) determining the transaction price; (4) allocating the transaction price to the performance obligations in the contract; and (5) recognizing revenue when the performance obligation is satisfied. We allocate the transaction price to each distinct product based on its relative stand-alone selling price. In determining the transaction price, we evaluate whether the price is subject to refund or adjustment to determine the net consideration to which we expect to be entitled. Substantially all of our revenue is recognized at the time control of the products transfers to the customer.\nSales to certain distributors, primarily those with ship and credit rights, can be subject to price adjustment on certain products. We develop an estimate of their expected claims under the ship and credit program based on the historical claims data submitted by product and customer and expected future claims, which requires the use of estimates and assumptions related to the amount of each claim as well as the historical period used to develop the estimate.\nOur OEM customers do not have the right to return products, other than pursuant to the provisions of our standard warranty. Sales to distributors, however, are typically made pursuant to agreements that provide return rights and stock rotation provisions permitting limited levels of product returns. Provisions for discounts and rebates to customers, estimated returns and allowances, ship and credit claims and other adjustments are provided for in the same period the related revenue are recognized, and are netted against revenue. For non-quality related returns, we recognize a related asset for the right to recover returned products with a corresponding reduction to cost of goods sold. We record a reserve for cash discounts as a reduction to accounts receivable and a reduction to revenue, based on the experience with each customer.\nInventories. We carry our inventories at the lower of standard cost (which approximates actual cost on a first-in, first-out basis) or net realizable value and record provisions for potential excess and obsolete inventories based upon a regular analysis of inventory on hand compared to historical and projected end-user demand. The determination of projected end-user demand requires the use of estimates and assumptions related to projected unit sales for each product. These provisions can influence our results from operations. For example, when demand falls for a given part, all or a portion of the related inventory that is considered to be in excess of anticipated demand is reserved, impacting our cost of revenue and gross profit. The majority of product inventory that has been previously reserved is ultimately discarded. However, we do sell some products that have previously been written down, such sales have historically been consistently insignificant and the related impact on our margins has also been insignificant.\nVariable and Share-Based Compensation. We record compensation expense for all share-based payment awards, including RSUs and shares issued under the ESPP, and measure them at the grant date, based on the estimated fair value of the award, and we recognize each such award as an expense over the performance measurement period and/or employee's requisite service period. We have outstanding awards with service, performance, and market-based vesting conditions. Determining the amount of share-based compensation requires us to develop estimates and use valuation models in calculating the grant-date fair value of the award. Additionally, employees are compensated on a variable basis during periods when we are profitable and certain performance goals are achieved. Determining the amount of variable compensation expense requires us to estimate future profitability and achievement of performance goals, which involves judgment.\nIncome Taxes. Income taxes are accounted for using the asset and liability method. Under this method, deferred income tax assets and liabilities are recognized for the future tax consequences attributable to temporary differences between the financial statement carrying amounts of existing assets and liabilities and their respective tax bases. Deferred income tax assets and liabilities are measured using enacted tax rates expected to apply to taxable income in the years in which these temporary differences are expected to be recovered or settled. The effect on deferred tax assets and liabilities of a change in tax rates is recognized in income in the period that includes the enactment date. A valuation allowance is provided for those deferred tax assets for which we cannot conclude that it is more likely than not that such deferred tax assets will be realized.\nIn determining the amount of the valuation allowance, estimated future taxable income, feasible tax planning strategies, future reversals of existing temporary differences and taxable income in prior carryback years, if a carryback is permitted are considered. If we determine it is more likely than not that all or a portion of the remaining deferred tax assets will not be realized, the valuation allowance will be increased with a charge to income tax expense. Conversely, if we determine it is more likely than not to be able to utilize all or a portion of the deferred tax assets for which a valuation allowance has been provided, the related portion of the valuation allowance will be recorded as a reduction to income tax expense.\nWe recognize and measure benefits for uncertain tax positions using a two-step approach. The first step is to evaluate the tax position taken or expected to be taken in a tax return by determining if the weight of available evidence indicates that is it more likely than not that the tax positions will be sustained upon audit, including resolution of any related appeals or litigation processes. For tax positions that are more likely than not to be sustained upon audit, the second step is to measure the tax benefit as the largest amount that is more than 50% likely to be realized upon settlement. No tax benefit is recognized for tax positions that are not more likely than not to be sustained. Our practice is to recognize interest and/or penalties related to income tax matters in income tax expense. Significant judgment is required to evaluate uncertain tax positions. Evaluations are based upon a number of factors, including changes in facts or circumstances, changes in tax law, correspondence with tax authorities during the course of tax audits and effective settlement of audit issues. Changes in the recognition or measurement of uncertain tax positions could result in material increases or decreases in income tax expense in the period in which the change is made, which could have a material impact to our effective tax rate.\nBusiness Combination. We use significant estimates and assumptions in allocating the purchase price of acquired business by utilizing established valuation techniques appropriate for the technology industry to record the acquired assets and liabilities at fair value. We utilize the income approach, cost approach or market approach, depending upon which approach is the most appropriate based on the nature and reliability of available data. If the income approach is used, the fair value determination is predicated upon the value of the future cash flows that an asset is expected to generate over its economic life and involves significant assumptions as to cash flows, associated expenses, long-term growth rates and discount rates. The cost approach takes into account the cost to replace (or reproduce) the asset and involves assumptions relating to the asset's value of physical, functional and/or economic obsolescence that has occurred with respect to the asset. The market approach is used to estimate value from an analysis of actual transactions or offerings for economically comparable assets available as of the valuation date. Determining the fair value of acquired technology assets is judgmental in nature and requires the use of significant estimates and assumptions, including the discount rate, revenue growth rates, projected gross margins, and estimated research and development expenses.\nImpairment of Goodwill, Indefinite-lived Intangible Assets and Long-Lived Assets. We evaluate our goodwill for potential impairment annually during the fourth quarter and whenever events or changes in circumstances indicate the carrying value of goodwill may not be recoverable. Our impairment evaluation consists of a qualitative assessment, and if deemed necessary, a quantitative test is performed which compares the fair value of a reporting unit with its carrying amount, including goodwill.\nDetermining the fair value of our reporting units is subjective in nature and involves the use of significant estimates and assumptions, including projected net cash flows, discount and long-term growth rates. We determine the fair value of our reporting units based on an income approach, whereby the fair value of the reporting unit is derived from the present value of estimated future cash flows. The assumptions about estimated cash flows include factors such as future revenue, gross profit, operating expenses, and industry trends. We consider historical rates and current market conditions when determining the discount and long-term growth rates to use in its analysis. We consider other valuation methods, such as the cost approach or market approach, if it is determined that these methods provide a more representative approximation of fair value.\nWe are required to test our IPRD assets for impairment annually using the guidance for indefinite-lived intangible assets. Our impairment evaluation consists of first assessing qualitative factors, and if deemed necessary, we calculate the fair value of the IPRD asset and record an impairment charge if the carrying amount exceeds fair value. We determine the fair value based on an income approach, which is calculated as the present value of the estimated future cash flows of the IPRD asset. The assumptions about estimated cash flows include factors such as future revenue, gross profit, operating expenses, and industry trends.\nWe evaluate the recoverability of the carrying amount of our property, plant and equipment and intangible assets (excluding IPRD), whenever events or changes in circumstances indicate that the carrying amount of an asset group may not be fully recoverable. Impairment is first assessed when the undiscounted expected cash flows derived for an asset group are less than its carrying amount. Impairment losses, if applicable, are measured as the amount by which the carrying value of an asset group exceeds its fair value and are recognized in operating results. We continually apply our best judgment when applying these impairment rules to determine the timing of the impairment test, the undiscounted cash flows used to assess impairments and the fair value of an impaired asset group. The dynamic economic environment in which we operate and the resulting assumptions used to estimate future cash flows impact the outcome of our impairment tests.\nContingencies. We are involved in a variety of legal matters that arise in the normal course of business. Based on the available information, we evaluate the relevant range and likelihood of potential outcomes and we record the appropriate liability when the amount is deemed probable and reasonably estimable.\nFor a further listing and discussion of our accounting policies, see Note 2: ''Significant Accounting Policies'' in the notes to our audited consolidated financial statements included elsewhere in this Form 10-K.\nRecent Accounting Pronouncements\nFor a discussion of recent accounting pronouncements, see Note 4: ''Recent Accounting Pronouncements'' in the notes to our audited consolidated financial statements included elsewhere in this Form 10-K.",
    "item_7A": "Item 7A. Quantitative and Qualitative Disclosures About Market Risk\nWe are exposed to financial market risks, including changes in interest rates and foreign currency exchange rates. To mitigate these risks, we utilize derivative financial instruments. We do not use derivative financial instruments for speculative or trading\npurposes.\nAs of December 31, 2020, our gross long-term debt (including current maturities) totaled $3,589.5 million. We have no interest rate exposure to rate changes on our fixed rate debt, which totaled $2,775.0 million. We do have interest rate exposure with respect to the $814.5 million balance of our variable interest rate debt outstanding as of December 31, 2020. A 50 basis point increase in interest rates would impact our expected annual interest expense for the next 12 months by approximately $4.1 million. However, some of this impact would be offset by additional interest earned on our cash and cash equivalents should rates on deposits and investments also increase. Our interest rate swaps hedge the majority of the risk of variability in cash flows resulting from future interest payments on our variable interest rate debt.\nWhile we have recently begun to observe stabilization in the capital markets impacted by the COVID-19 pandemic, there can be no assurance that equity or borrowings will be available when we access the capital markets again or, if available, will be at rates or prices acceptable to us.\nTo ensure the adequacy and effectiveness of our foreign exchange hedge positions, we continually monitor our foreign exchange forward positions, both on a stand-alone basis and in conjunction with their underlying foreign currency exposures, from an accounting and economic perspective. However, given the inherent limitations of forecasting and the anticipatory nature of exposures intended to be hedged, we cannot provide any assurances that such programs will offset more than a portion of the adverse financial impact resulting from unfavorable movements in foreign exchange rates.\nWe are subject to risks associated with transactions that are denominated in currencies other than our functional currencies, as well as the effects of translating amounts denominated in a foreign currency to the U.S. Dollar as a normal part of the reporting process. Some of our Japanese operations utilize Japanese Yen as the functional currency, which results in a translation adjustment that is included as a component of accumulated other comprehensive income.\nWe enter into forward foreign currency contracts that economically hedge the gains and losses generated by the re-measurement of certain recorded assets and liabilities in a non-functional currency. Changes in the fair value of these undesignated hedges are recognized in other income and expense immediately as an offset to the changes in the fair value of the assets or liabilities being hedged. The notional amount of foreign exchange contracts at December 31, 2020 and 2019 was $263.4 million and $183.3 million, respectively. Our policies prohibit speculation on financial instruments, trading in currencies for which there are no underlying exposures, or entering into trades for any currency to intentionally increase the underlying exposure.\nSubstantially all of our revenue is transacted in U.S. Dollars. However, a significant amount of our operating expenditures and capital purchases are transacted in local currencies, including Chinese Renminbi, Czech Koruna, Euros, Japanese Yen, Korean Won, Malaysian Ringgit, Philippine Peso and Vietnamese Dong. Due to the materiality of our transactions in these local currencies, our results are impacted by changes in currency exchange rates measured against the U.S. Dollar. For example, we determined that based on a hypothetical weighted-average change of 10% in currency exchange rates, our results would have impacted our income before taxes by approximately $129.7 million for the year ended December 31, 2020, assuming no offsetting hedge position or correlated activities.\nSee Note 15: ''Financial Instruments'' in the notes to the audited consolidated financial statements included elsewhere in this Form 10-K for further information with respect to our hedging activity.",
    "item_8": "Item 8. Financial Statements and Supplementary Data\nOur consolidated Financial Statements listed in the index appearing under Part IV, Item 15(a)(1) of this Form 10-K and the Financial Statement Schedule listed in the index appearing under Part IV, Item 15(a)(2) of this Form 10-K are filed as part of this Form 10-K and are incorporated herein by reference in this Item 8.",
    "item_9": "Item 9. Changes in and Disagreements with Accountants on Accounting and Financial Disclosure\nNone.",
    "item_9A": "Item 9A. Controls and Procedures\nEvaluation of Disclosure Controls and Procedures.\nWe carried out an evaluation, under the supervision and with the participation of our management, including our Chief Executive Officer and Chief Financial Officer, of the effectiveness of our disclosure controls and procedures (as defined in\nRules 13a-15(e) and 15d-15(e) of the Exchange Act). Based upon that evaluation, our Chief Executive Officer and Chief Financial Officer concluded that, as of the end of the period covered in this Form 10-K, our disclosure controls and procedures were effective to ensure that information required to be disclosed in reports filed or submitted under the Exchange Act is recorded, processed, summarized and reported within the required time periods and is accumulated and communicated to our management, including our Chief Executive Officer and Chief Financial Officer, as appropriate, to allow timely decisions regarding required disclosure.\nChanges in Internal Control Over Financial Reporting.\nWe also carried out an evaluation, under the supervision and with the participation of our management, including our Chief Executive Officer and Chief Financial Officer, of changes to our internal control over financial reporting (as defined in Rules 13a-15(f) and 15d-15(f) of the Exchange Act) that occurred during the fiscal quarter ended December 31, 2020.\nThere have been no changes to our internal control over financial reporting (as defined in Exchange Act Rules 13a-15(f) and 15d-15(f)) that occurred during the fiscal quarter ended December 31, 2020 which have materially affected, or are reasonably likely to materially affect, our internal control over financial reporting.\nManagement's Report on Internal Control Over Financial Reporting.\nOur management is responsible for establishing and maintaining adequate internal control over financial reporting (as defined in Exchange Act Rules 13a-15(f) and 15d-15(f)). Because of its inherent limitations, internal control over financial reporting may not prevent or detect misstatements. Also, projections of any evaluation of effectiveness to future periods are subject to the risk that controls may become inadequate because of changes in conditions, or that the degree of compliance with the policies and procedures may deteriorate.\nOur management assessed the effectiveness of our internal control over financial reporting as of December 31, 2020. In making this assessment, we used the criteria set forth by the Committee of Sponsoring Organizations of the Treadway Commission in Internal Control-Integrated Framework 2013. Based on this assessment, management has concluded that our internal control over financial reporting was effective as of December 31, 2020.\nThe effectiveness of our internal control over financial reporting as of December 31, 2020 has been audited by PricewaterhouseCoopers LLP, an independent registered public accounting firm, as stated in their report which appears in \"Exhibits and Financial Statement Schedules\" of this Form 10-K.",
    "item_9B": "Item 9B. Other Information\nNone.\nPART III",
    "item_9C": "",
    "item_10": "Item 10. Directors, Executive Officers and Corporate Governance\nThe information under the heading \"Executive Officers of the Registrant\" in this Form 10-K is incorporated by reference into this section. Information concerning directors and persons nominated to become directors and executive officers is incorporated by reference from the text under the captions \"Management Proposals-Proposal No. 1: Election of Directors,\" \"The Board of Directors and Corporate Governance,\" \"Section 16(a) Reporting Compliance\" and \"Miscellaneous Information-Stockholder Nominations and Proposals\" in our Proxy Statement to be filed pursuant to Regulation 14A within 120 days after our fiscal year ended December 31, 2020 in connection with our 2021 Annual Meeting of Stockholders (\"Proxy Statement\").\nCode of Business Conduct\nInformation concerning our Code of Business Conduct is incorporated by reference from the text under the caption \"The Board of Directors and Corporate Governance-Code of Business Conduct\" in our Proxy Statement.",
    "item_11": "Item 11. Executive Compensation\nInformation concerning executive compensation is incorporated by reference from the text under the captions \"The Board of Directors and Corporate Governance-2020 Compensation of Directors,\" \"Compensation of Executive Officers,\" \"Compensation Committee Report,\" \"Compensation Discussion and Analysis,\" \"ON Semiconductor 2020 Pay Ratio\nDisclosure\" and \"Compensation Committee Interlocks and Insider Participation\" in our Proxy Statement.\nThe information incorporated by reference under the caption \"Compensation Committee Report\" in our Proxy Statement shall be deemed furnished, and not filed, in this Form 10-K and shall not be deemed incorporated by reference into any filing under the Securities Act or the Exchange Act as a result of this furnishing, except to the extent that we specifically incorporate it by reference.",
    "item_12": "Item 12. Security Ownership of Certain Beneficial Owners and Management and Related Stockholder Matters\nInformation concerning security ownership of certain beneficial owners and management is incorporated by reference from the text under the captions \"Principal Stockholders,\" \"Share Ownership of Directors and Officers\" and \"Share-Based Compensation Plan Information\" in our Proxy Statement.",
    "item_13": "Item 13. Certain Relationships and Related Transactions, and Director Independence\nInformation concerning certain relationships and related transactions involving us and certain others is incorporated by reference from the text under the captions \"Management Proposals-Proposal No. 1: Election of Directors,\" \"The Board of Directors and Corporate Governance,\" and \"Relationships and Related Transactions\" in our Proxy Statement.",
    "item_14": "Item 14. Principal Accountant Fees and Services\nInformation concerning principal accounting fees and services is incorporated by reference from the text under the caption \"Audit and Related Fees\" in our Proxy Statement.\nPART IV",
    "item_15": "Item 15. Exhibits and Financial Statement Schedules\n(a) The following documents are filed as part of this Annual Report on Form 10-K:\n(1) Consolidated Financial Statements:\nON Semiconductor Corporation Consolidated Financial Statements:\nReport of Independent Registered Public Accounting Firm 68\nConsolidated Balance Sheets as of December 31, 2020 and December 31, 2019\nConsolidated Statements of Operations and Comprehensive Income for the years ended December 31, 2020, 2019 and 2018\nConsolidated Statements of Stockholders' Equity for the years ended December 31, 2020, 2019 and 2018\nConsolidated Statements of Cash Flows for the years ended December 31, 2020, 2019 and 2018\nNotes to Consolidated Financial Statements 75\n(2) Consolidated Financial Statement Schedule:\nSchedule II - Valuation and Qualifying Accounts for the years ended December 31, 2020, 2019 and 2018\nAll other schedules are omitted because they are not applicable or the required information is shown in the financial statements or related notes\n(3) Exhibits:\nEXHIBIT INDEX*\nExhibit No. Exhibit Description\n2.1 Asset Purchase Agreement, dated as of March 11, 1997, between Fairchild Semiconductor Corporation and National Semiconductor Corporation (incorporated by reference to Exhibit 2.02 to Fairchild Semiconductor Corporation’s Registration Statement filed with the Commission on May 12, 1997 (File No. 333-26897))†\n2.2 Reorganization Agreement, dated as of May 11, 1999, among Motorola, Inc., SCG Holding Corporation and Semiconductor Components Industries, LLC (incorporated by reference to Exhibit 2.1 to the Company’s Registration Statement filed with the Commission on November 5, 1999 (File No. 333-90359))†\n2.3(a) Agreement and Plan of Recapitalization and Merger, as amended, dated as of May 11, 1999, among SCG Holding Corporation, Semiconductor Components Industries, LLC, Motorola, Inc., TPG Semiconductor Holdings LLC, and TPG Semiconductor Acquisition Corp. (incorporated by reference to Exhibit 2.2 to the Company’s Registration Statement filed with the Commission on November 5, 1999 (File No. 333-90359))†\n2.3(b) Amendment No. 1 to Agreement and Plan of Recapitalization and Merger, dated as of July 28, 1999, among SCG Holding Corporation, Semiconductor Components Industries, LLC, Motorola, Inc., TPG Semiconductor Holdings LLC, and TPG Semiconductor Acquisition Corp. (incorporated by reference to Exhibit 2.3 to the Company’s Registration Statement filed with the Commission on November 5, 1999 (File No. 333-90359))†\n2.4(a) Purchase Agreement by and among ON Semiconductor Corporation, Semiconductor Components Industries, LLC and SANYO Electric Co., Ltd. dated July 15, 2010 (incorporated by reference to Exhibit 2.1 to the Company’s Quarterly Report on Form 10-Q filed with the Commission on November 4, 2010)†\n2.4(b) Amendment No. 1 to Purchase Agreement by and among ON Semiconductor Corporation, Semiconductor Components Industries, LLC and SANYO Electric Co., Ltd. dated November 30, 2010 (incorporated by reference to Exhibit 2.2 to the Company’s Current Report on Form 8-K filed with the Commission on January 6, 2011)†\n2.5 Agreement and Plan of Merger by and among ON Semiconductor Benelux B.V., Alpine Acquisition Sub, Aptina, Inc. and Fortis Advisors LLC, as Equityholder Representative, dated as of June 9, 2014 (incorporated by reference to Exhibit 2.1 to the Company’s Quarterly Report on Form 10-Q filed with the Commission on August 1, 2014)†\n2.6 Agreement and Plan of Merger, dated November 18, 2015, by and among Fairchild Semiconductor International, Inc., ON Semiconductor Corporation and Falcon Operations Sub, Inc. (incorporated by reference to Exhibit 2.1 to the Company’s Current Report on Form 8-K filed with the Commission on November 18, 2015)†\n2.7 Agreement and Plan of Merger, dated March 27, 2019, by and among Quantenna Communications, Inc., ON Semiconductor Corporation and Raptor Operations Sub, Inc. (incorporated by reference to Exhibit 2.1 to the Company’s Current Report on Form 8-K filed with the Commission on March 27, 2019)†\n3.1(a) Certificate of Incorporation of ON Semiconductor Corporation, as further amended through March 26, 2008 (incorporated by reference to Exhibit 3.1 to the Company’s Quarterly Report on Form 10-Q filed with the Commission on May 7, 2008)\n3.1(b) Certificate of Amendment to the Amended and Restated Certificate of Incorporation (incorporated by reference to Exhibit 3.1 to the Company’s Current Report on Form 8-K filed with the Commission on June 3, 2014)\n3.1(c) Certificate of Amendment to the Amended and Restated Certificate of Incorporation, dated May 17, 2017 (incorporated by reference to Exhibit 3.1 to the Company’s Quarterly Report on Form 10-Q filed with the Commission on August 7, 2017)\n3.2 By-Laws of ON Semiconductor Corporation as Amended and Restated on November 21, 2013 (incorporated by reference to Exhibit 3.1 to the Company’s Current Report on Form 8-K filed with the Commission on November 25, 2013)\n3.3 Certificate of Designations of Series B Junior Participating Preferred Stock of ON Semiconductor Corporation (incorporated by reference to Exhibit 3.1 to the Company’s Current Report on Form 8-K filed with the Commission on June 8, 2020)\n4.1 Specimen of share certificate of Common Stock, par value $0.01, ON Semiconductor Corporation (incorporated by reference to Exhibit 4.1 to the Company’s Annual Report on Form 10-K filed with the Commission on March 10, 2004)\n4.2(a) Indenture regarding the 1.625% Convertible Senior Notes due 2023, dated as of March 31, 2017 among ON Semiconductor Corporation, the guarantors party thereto and Wells Fargo Bank, National Association, as trustee (incorporated by reference to Exhibit 4.1 to the Company’s Current Report on Form 8-K filed with the Commission on April 3, 2017)\n4.2(b) Form of Global 1.625% Convertible Senior Note due 2023 (included in Exhibit 4.2(a))\n4.2(c) First Supplemental Indenture to the Indenture regarding the 1.625% Convertible Senior Notes due 2023, dated as of January 7, 2020 among ON Semiconductor Corporation, the guarantors party thereto and Wells Fargo Bank, National Association, as trustee\n4.3(a) Indenture, dated as of August 21, 2020, among ON Semiconductor Corporation, the guarantors party thereto and Wells Fargo Bank, National Association (incorporated by reference to Exhibit 4.1 to the Company’s Current Report on Form 8-K filed with the Commission on August 21, 2020) Semiconductor Corporation, the guarantors party thereto and Wells Fargo Bank, National Association (incorporated by reference to Exhibit 4.1 to the Company’s Current Report on Form 8-K filed with the Commission on August 21, 2020)\n4.3(b) Form of Global 3.875% Senior Note due 2028 (included in Exhibit 4.3(a))\n4.4 Description of the Registrant’s Securities Registered under Section 12 of the Securities Exchange Act of 1934, as amended(1)\n4.5 Rights Agreement, dated as of June 8, 2020, between ON Semiconductor Corporation and Computershare Trust Company, N.A., as Rights Agent (incorporated by reference to Exhibit 4.1 to the Company’s Current Report on Form 8-K filed with the Commission on June 8, 2020)\n10.1 Amended and Restated Intellectual Property Agreement, dated August 4, 1999, among Semiconductor Components Industries, LLC and Motorola, Inc. (incorporated by reference to Exhibit 10.5 to Amendment No. 1 to the Company’s Registration Statement filed with the Commission on January 11, 2000 (File No. 333-90359))\n10.2 Lease for 52nd Street property, dated July 31, 1999, among Semiconductor Components Industries, LLC as Lessor, and Motorola, Inc. as Lessee (incorporated by reference to Exhibit 10.16 to the Company’s Registration Statement filed with the Commission on November 5, 1999 (File No. 333-90359))\n10.3 Declaration of Covenants, Easement of Restrictions and Options to Purchase and Lease, dated July 31, 1999, among Semiconductor Components Industries, LLC and Motorola, Inc. (incorporated by reference to Exhibit 10.17 to the Company’s Registration Statement filed with the Commission on November 5, 1999 (File No. 333-90359))\n10.4(a) Joint Venture Contract for Leshan-Phoenix Semiconductor Company Limited, amended and restated on April 20, 2006 between SCG (China) Holding Corporation (a subsidiary of ON Semiconductor Corporation) and Leshan Radio Company Ltd. (incorporated by reference to Exhibit 10.3 to the Company’s Quarterly Report on Form 10-Q filed with the Commission on July 28, 2006)\n10.4(b) Amendment Agreement, dated September 29, 2014, to Joint Venture Contract for Leshan-Phoenix Semiconductor Company Limited between ON Semiconductor (China) Holding, LLC (a subsidiary of ON Semiconductor Corporation) and Leshan Radio Company Ltd. (incorporated by reference to Exhibit 10.5(b) to the Company’s Annual Report on Form 10-K filed with the Commission on February 27, 2015)\n10.5(a) Credit Agreement, dated April 15, 2016, among ON Semiconductor Corporation, as borrower, the several lenders party thereto, Deutsche Bank AG New York Branch, as administrative agent and collateral agent, Deutsche Bank Securities Inc., Merrill Lynch, Pierce, Fenner & Smith Incorporated, BMO Capital Markets Corp., HSBC Securities (USA) Inc. and Sumitomo Mitsui Banking Corporation, as joint lead arrangers and joint bookrunners, Barclays Bank PLC, Compass Bank, The Bank of Tokyo-Mitsubishi UFJ, Ltd., Morgan Stanley Senior Funding, Inc., BOKF, NA and KBC Bank N.V., as co-managers, and HSBC Bank USA, N.A. and Sumitomo Mitsui Banking Corporation, as co-documentation agents (incorporated by reference to Exhibit 10.1 to the Company’s Current Report on Form 8-K filed with the Commission on April 15, 2016)\n10.5(b) Guarantee and Collateral Agreement, dated April 15, 2016, made by ON Semiconductor Corporation and the other signatories thereto in favor of Deutsche Bank AG New York Branch, as administrative agent and collateral agent (incorporated by reference to Exhibit 10.2 to the Company’s Current Report on Form 8-K filed with the Commission on April 15, 2016)\n10.5(c) Escrow Agreement, dated April 15, 2016, among ON Semiconductor Corporation, MUFG Union Bank, N.A., as escrow agent, and Deutsche Bank AG New York Branch, as administrative agent and collateral agent (incorporated by reference to Exhibit 10.3 to the Company’s Current Report on Form 8-K filed with the Commission on April 15, 2016)\n10.5(d) Joinder to Amended and Restated Guaranty, dated March 15, 2016, among the guarantors party thereto (incorporated by reference to Exhibit 10.1 to the Company’s Current Report on Form 8-K filed with the Commission on March 17, 2016)\n10.5(e) Joinder to Amended and Restated Guaranty, dated April 14, 2016, among the guarantors party thereto (incorporated by reference to Exhibit 10.4 to the Company’s Current Report on Form 8-K filed with the Commission on April 15, 2016)\n10.5(f) Assumption Agreement, dated September 19, 2016, by and between ON Semiconductor (China) Holdings, LLC and Deutsche Bank AG New York Branch (incorporated by reference to Exhibit 10.1 to the Company’s Current Report on Form 8-K filed with the Commission on September 23, 2016)\n10.5(g) Pledge Supplement, dated September 19, 2016, by ON Semiconductor (China) Holdings, LLC (incorporated by reference to Exhibit 10.2 to the Company’s Current Report on Form 8-K filed with the Commission on September 23, 2016)\n10.5(h) Assumption Agreement, dated September 19, 2016, by and among Fairchild Semiconductor International, Inc., Fairchild Semiconductor Corporation, Fairchild Semiconductor Corporation of California, Giant Holdings, Inc., Fairchild Semiconductor West Corporation, Kota Microcircuits, Inc., Silicon Patent Holdings, Giant Semiconductor Corporation, Micro-Ohm Corporation, Fairchild Energy, LLC and Deutsche Bank AG New York Branch (incorporated by reference to Exhibit 10.3 to the Company’s Current Report on Form 8-K filed with the Commission on September 23, 2016)\n10.5(i) Pledge Supplement, dated September 19, 2016, by Fairchild Semiconductor International, Inc., Fairchild Semiconductor Corporation, Fairchild Semiconductor Corporation of California, Giant Holdings, Inc., Fairchild Semiconductor West Corporation, Kota Microcircuits, Inc., Silicon Patent Holdings, Giant Semiconductor Corporation, Micro-Ohm Corporation and Fairchild Energy, LLC (incorporated by reference to Exhibit 10.4 to the Company’s Current Report on Form 8-K filed with the Commission on September 23, 2016)\n10.5(j) First Amendment to Credit Agreement, dated September 30, 2016, among ON Semiconductor Corporation, as borrower, certain subsidiaries thereof, as guarantors, the several lenders party thereto, and Deutsche Bank AG New York Branch, as administrative agent and collateral agent (incorporated by reference to Exhibit 10.1 to the Company’s Current Report on Form 8-K filed with the Commission on September 30, 2016)\n10.5(k) Second Amendment to Credit Agreement, dated March 31, 2017, among ON Semiconductor Corporation, as borrower, certain subsidiaries thereof, as guarantors, the several lenders party thereto, and Deutsche Bank AG New York Branch, as administrative agent and collateral agent (incorporated by reference to Exhibit 10.1 to the Company’s Current Report on Form 8-K filed with the Commission on April 3, 2017)\n10.5(l) Third Amendment to Credit Agreement, dated November 30, 2017, among ON Semiconductor Corporation, as borrower, certain subsidiaries thereof, as guarantors, the several lenders party thereto, and Deutsche Bank AG New York Branch, as administrative agent and collateral agent (incorporated by reference to Exhibit 10.1 to the Company’s Current Report on Form 8-K filed with the Commission on December 4, 2017)\n10.5(m) Fourth Amendment to Credit Agreement, dated May 31, 2018, among ON Semiconductor Corporation, as borrower, certain subsidiaries thereof, as guarantors, the several lenders party thereto, and Deutsche Bank AG New York Branch, as administrative agent and collateral agent (incorporated by reference to Exhibit 10.1 to the Company’s Quarterly Report on Form 10-Q filed with the Commission on July 30, 2018)\n10.5(n) Fifth Amendment to Credit Agreement, dated June 12, 2019, among ON Semiconductor Corporation, as borrower, certain subsidiaries thereof, as guarantors, the several lenders party thereto, and Deutsche Bank AG New York Branch, as administrative agent and collateral agent (incorporated by reference to Exhibit 10.1 to the Company’s Current Report on Form 8-K filed with the Commission on June 17, 2019)\n10.5(o) Sixth Amendment to Credit Agreement, dated August 15, 2019, among ON Semiconductor Corporation, as borrower, certain subsidiaries thereof, as guarantors, the several lenders party thereto, and Deutsche Bank AG New York Branch, as administrative agent and collateral agent (incorporated by reference to Exhibit 10.1 to the Company’s Quarterly Report on Form 10-Q filed with the Commission on October 28, 2019)\n10.5(p) Seventh Amendment to Credit Agreement, dated September 19, 2019, among ON Semiconductor Corporation, as borrower, certain subsidiaries thereof, as guarantors, the several lenders party thereto, and Deutsche Bank AG New York Branch, as administrative agent and collateral agent (incorporated by reference to Exhibit 10.1 to the Current Report on Form 8-K filed with the Commission on September 20, 2019)\n10.5(q) Eighth Amendment to Credit Agreement, dated as of June 23, 2020, among ON Semiconductor Corporation, as borrower, certain subsidiaries thereof, as guarantors, the several lenders party thereto, and Deutsche Bank AG New York Branch, as administrative agent and collateral agent (incorporated by reference to Exhibit 10.1 to the Company’s Current Report on Form 8-K filed with the Commission on June 24, 2020)\n10.6(a) Form of Convertible Note Hedge and Warrant Transactions (incorporated by reference to Exhibit 10.1 to the Company’s Current Report on Form 8-K filed with the Commission on June 8, 2015)\n10.6(b) Form of Warrant Confirmation (incorporated by reference to Exhibit 10.2 to the Company’s Current Report on Form 8-K filed with the Commission on June 8, 2015)\n10.7(a) ON Semiconductor Corporation 2000 Stock Incentive Plan, as amended and restated May 19, 2004 (incorporated by reference to Exhibit 10.7 to the Company’s Quarterly Report on Form 10-Q filed with the Commission on August 6, 2004)(2)\n10.7(b) Amendment to the ON Semiconductor Corporation 2000 Stock Incentive Plan, dated May 16, 2007 (incorporated by reference to Exhibit 10.2 to the Company’s Quarterly Report on Form 10-Q filed with the Commission on August 1, 2007)(2)\n10.7(c) Non-qualified Stock Option Agreement for the ON Semiconductor Corporation 2000 Stock Incentive Plan (incorporated by reference to Exhibit 10.35(d) to Amendment No. 1 to the Company’s Registration Statement filed with the Commission on March 24, 2000 (File No. 333-30670))(2)\n10.7(d) ON Semiconductor Corporation Amended and Restated Stock Incentive Plan (incorporated by reference to Exhibit 4.1 to the Company’s Registration Statement filed with the Commission on May 19, 2010 (File No. 333-166958))(2)\n10.7(e) First Amendment to the ON Semiconductor Corporation Amended and Restated Stock Incentive Plan (incorporated by reference to Exhibit 10.2 to the Company’s Quarterly Report on Form 10-Q filed with the Commission on August 3, 2012)(2)\n10.7(f) Second Amendment to the ON Semiconductor Corporation Amended and Restated Stock Incentive Plan, effective May 20, 2015 (incorporated by reference to Exhibit 10.5 to the Company’s Quarterly Report on Form 10-Q filed with the Commission on August 3, 2015)(2)\n10.7(g) Third Amendment to the ON Semiconductor Corporation Amended and Restated Stock Incentive Plan, effective May 17, 2017 (incorporated by reference to Exhibit 10.1 to the Company’s Quarterly Report on Form 10-Q filed with the Commission on August 7, 2017)(2)\n10.7(h) Non-qualified Stock Option Agreement for Senior Vice Presidents and Above for the ON Semiconductor Corporation Amended and Restated Stock Incentive Plan (form of standard agreement) (incorporated by reference to Exhibit 10.3 to the Company’s Quarterly Report on Form 10-Q filed with the Commission on August 5, 2010)(2)\n10.7(i) Restricted Stock Units Award Agreement for Senior Vice Presidents and Above for the ON Semiconductor Corporation Amended and Restated Stock Incentive Plan (form of standard agreement) (incorporated by reference to Exhibit 10.4 to the Company’s Quarterly Report on Form 10-Q filed with the Commission on August 5, 2010)(2)\n10.7(j) Stock Grant Award Agreement for Directors under the ON Semiconductor Corporation Amended and Restated Stock Incentive Plan (form of standard Stock Grant Award for Non-employee Directors) (incorporated by reference to Exhibit 10.1 to the Company’s Quarterly Report on Form 10-Q filed with the Commission on May 6, 2011)(2)\n10.7(k) Performance-Based Restricted Stock Units Award Agreement under the ON Semiconductor Corporation Amended and Restated Stock Incentive Plan (2017 form of Performance-Based Award for Senior Vice Presidents and Above) (incorporated by reference to Exhibit 10.3 to the Company’s Quarterly Report on Form 10-Q filed with the Commission on August 7, 2017)(2)\n10.7(l) Performance-Based Restricted Stock Units Award Agreement under the ON Semiconductor Corporation Amended and Restated Stock Incentive Plan (2018 form of Performance-Based Award for Senior Vice Presidents and Above) (incorporated by reference to Exhibit 10.1 to the Company’s Quarterly Report on Form 10-Q filed with the Commission on April 30, 2018)(2)\n10.7(m) Restricted Stock Units Award Agreement under the ON Semiconductor Corporation Amended and Restated Stock Incentive Plan (2018 form agreement for Senior Vice Presidents and Above) (incorporated by reference to Exhibit 10.2 to the Company’s Quarterly Report on Form 10-Q filed with the Commission on April 30, 2018)(2)\n10.7(n) Restricted Stock Units Award Agreement under the ON Semiconductor Corporation Amended and Restated Stock Incentive Plan (2019 form agreement for Section 16 Officers) (incorporated by reference to Exhibit 10.1 to the Company’s Current Report on Form 8-K filed with the Commission on February 19, 2019)(2)\n10.7(o) Performance-Based Restricted Stock Units Award Agreement under the ON Semiconductor Corporation Amended and Restated Stock Incentive Plan (2019 form agreement for Senior Vice Presidents and Above) (incorporated by reference to Exhibit 10.2 to the Company’s Current Report on Form 8-K filed with the Commission on February 19, 2019)(2)\n10.7(p) Performance-Based Restricted Stock Units Upside Award Agreement under the ON Semiconductor Corporation Amended and Restated Stock Incentive Plan (2019 form agreement for Senior Vice Presidents and Above) (incorporated by reference to Exhibit 10.3 to the Company’s Current Report on Form 8-K filed with the Commission on February 19, 2019)(2)\n10.7(q) 2020 Form of Performance-Based Restricted Stock Units Award for Senior Vice Presidents and Above (Upside) under the ON Semiconductor Corporation Amended and Restated Stock Incentive Plan (incorporated by reference to Exhibit 10.1 to the Company’s Current Report on Form 8-K/A filed with the Commission on March 5, 2020)(2)\n10.7(r) Restricted Stock Units Award Agreement under the ON Semiconductor Corporation Amended and Restated Stock Incentive Plan for Hassane S. El-Khoury, dated December 7, 2020(1)(2)\n10.7(s) Performance-Based Restricted Stock Units Award Agreement under the ON Semiconductor Corporation Amended and Restated Stock Incentive Plan for Hassane S. El-Khoury, dated December 7, 2020(1)(2)\n10.8(a) ON Semiconductor Corporation 2000 Employee Stock Purchase Plan, as amended and restated as of May 20, 2009 (incorporated by reference to Exhibit 4.1 to the Registration Statement on Form S-8 No. 333-159381 filed with the Commission on May 21, 2009)(2)\n10.8(b) Amendment to the ON Semiconductor Corporation 2000 Employee Stock Purchase Plan, as amended as of May 15, 2013 (incorporated by reference to Exhibit 10.1 of the Company’s Quarterly Report on Form 10-Q filed with the Commission on August 2, 2013)(2)\n10.8(c) Amendment to the ON Semiconductor Corporation 2000 Employee Stock Purchase Plan, as amended as of May 20, 2015 (incorporated by reference to Exhibit 10.6 to the Company’s Quarterly Report on Form 10-Q filed with the Commission on August 3, 2015)(2)\n10.8(d) Amendment to the ON Semiconductor Corporation 2000 Employee Stock Purchase Plan, as amended as of May 17, 2017 (incorporated by reference to Exhibit 10.2 to the Company’s Quarterly Report on Form 10-Q filed with the Commission on August 7, 2017)(2)\n10.9 Amended and Restated Employment Agreement, effective June 1, 2017, by and between Semiconductor Components Industries, LLC and Keith Jackson (incorporated by reference to Exhibit 10.1 to the Company’s Current Report on Form 8-K filed with the Commission on June 2, 2017)(2)\n10.10 Amended and Restated Employment Agreement, effective June 1, 2017, by and between Semiconductor Components Industries, LLC and George H. Cave (incorporated by reference to Exhibit 10.12 to the Company’s Annual Report on Form 10-K filed with the Commission on February 21, 2018)(2)\n10.11(a) Employment Agreement by and between Semiconductor Components Industries, LLC and Bernard Gutmann, dated as of September 26, 2012 (incorporated by reference to Exhibit 10.1 to the Company’s Current Report on Form 8-K filed with the Commission on September 27, 2012)(2)\n10.11(b) Amendment No. 1 to Employment Agreement by and between Semiconductor Components Industries, LLC and Bernard Gutmann, dated as of June 1, 2017 (incorporated by reference to Exhibit 10.2 to the Company’s Current Report on Form 8-K filed with the Commission on June 2, 2017)(2)\n10.12(a) Employment Agreement between Semiconductor Components Industries, LLC and William Schromm dated as of August 25, 2014 (incorporated by reference to Exhibit 10.1 to the Company’s Current Report on Form 8-K filed with the Commission on August 25, 2014)(2)\n10.12(b) Amendment No. 1 to Employment Agreement by and between Semiconductor Components Industries, LLC and William Schromm, dated as of June 1, 2017 (incorporated by reference to Exhibit 10.4 to the Company’s Current Report on Form 8-K filed with the Commission on June 2, 2017)(2)\n10.13(a) Employment Agreement between Semiconductor Components Industries, LLC and Paul Rolls dated as of July 14, 2013 (incorporated by reference to Exhibit 10.1 to the Company’s Quarterly Report on Form 10-Q filed with the Commission on May 4, 2015)(2)\n10.13(b) Amendment No. 1 to Employment Agreement by and between Semiconductor Components Industries, LLC and Paul Rolls, effective June 1, 2017 (incorporated by reference to Exhibit 10.21(b) to the Company’s Annual Report on Form 10-K filed with the Commission on February 21, 2018)(2)\n10.14 Employment Agreement by and between Semiconductor Components Industries, LLC and Vincent C. Hopkin, dated as of May 11, 2018 (incorporated by reference to Exhibit 10.2 to the Company’s Quarterly Report on Form 10-Q filed with the Commission on July 30, 2018)(2)\n10.15 Employment Agreement by and between Semiconductor Components Industries, LLC and Simon Keeton, dated January 1, 2019 (incorporated by reference to Exhibit 10.20 to the Company's Annual Report on Form 10-K filed with the Commission on February 20, 2019)(2)\n10.16 Employment Agreement by and between Semiconductor Components Industries, LLC and Hassane S. El-Khoury, dated December 7, 2020(1)(2)\n10.17 Key Officer Severance and Change in Control Agreement by and between Semiconductor Components Industries, LLC and Ross F. Jatou, dated as of October 1, 2020 (1)(2)\n10.18 Form of Indemnification Agreement with Directors and Officers (incorporated by reference to Exhibit 10.1 to the Company’s Current Report on Form 8-K filed with the Commission on February 25, 2016)(2)\n10.19(a) Environmental Side Letter, dated March 11, 1997, between National Semiconductor Corporation and Fairchild Semiconductor Corporation (incorporated by reference to Exhibit 10.19 to Fairchild Semiconductor Corporation’s Registration Statement filed with the Commission on May 12, 1997 (File No. 333-26897))\n10.19(b) Intellectual Property License Agreement, dated April 13, 1999, between Samsung Electronics Co., Ltd. and Fairchild Korea Semiconductor, Ltd. (incorporated by reference to Exhibit 10.41 to Fairchild Semiconductor International, Inc.’s Registration Statement filed with the Commission on June 30, 1999 (File No. 333-78557))\n10.19(c) Fairchild Benefit Restoration Plan (incorporated by reference to Exhibit 10.23 to Fairchild Semiconductor Corporation’s Registration Statement filed with the Commission on May 12, 1997 (File No. 333-26897))(2)\n10.19(d) Technology Licensing and Transfer Agreement, dated March 11, 1997, between National Semiconductor Corporation and Fairchild Semiconductor Corporation (incorporated by reference to Amendment No. 3 to Fairchild Semiconductor Corporation’s Registration Statement on Form S-4, filed with the Commission on July 9, 1997 (File No. 333-28697))\n10.19(e) Intellectual Property Assignment and License Agreement, dated December 29, 1997, between Raytheon Semiconductor, Inc. and Raytheon Company (incorporated by reference to Fairchild Semiconductor International, Inc.’s Current Report on Form 8-K, dated December 31, 1997, filed with the Commission on January 13, 1998. (File No. 333-26897))\n10.20(a) Asset Purchase Agreement, dated as of April 22, 2019, between GLOBALFOUNDRIES U.S. Inc. and Semiconductor Components Industries, LLC (incorporated by reference to Exhibit 10.1 to the Company’s Quarterly Report on Form 10-Q filed with the Commission on August 5, 2019)†\n10.20(b) Amendment No. 1 to Asset Purchase Agreement, dated October 1, 2020, by and among Semiconductor Components Industries, LLC, GLOBALFOUNDRIES U.S. Inc., and GLOBALFOUNDRIES Inc. (incorporated by reference to Exhibit 10.1 to the Company’s Current Report on Form 8-K filed with the Commission on October 7, 2020)\n10.21 Settlement Agreement, dated October 19, 2019, by and between ON Semiconductor Corporation and Settlement Agreement, dated October 19, 2019, by and between ON Semiconductor Corporation and Power Integrations, Inc. (incorporated by reference to Exhibit 10.20 to the Company's Annual Report on Form 10-K filed with the Commission on February 19, 2020)\n14.1 ON Semiconductor Corporation Code of Business Conduct effective as of August 16, 2016 (incorporated by reference to Exhibit 14.1 to the Company’s Current Report on Form 8-K filed with the Commission on August 24, 2016)\n21.1 List of Significant Subsidiaries(1)\n23.1 Consent of Independent Registered Public Accounting Firm-PricewaterhouseCoopers LLP(1)\n24.1 Powers of Attorney(1)\n31.1 Certification by CEO pursuant to Rule 13a-14(a) or 15d-14(a) of the Securities Exchange Act of 1934, as adopted pursuant to Section 302 of the Sarbanes-Oxley Act of 2002(1)\n31.2 Certification by CFO pursuant to Rule 13a-14(a) or 15d-14(a) of the Securities Exchange Act of 1934, as adopted pursuant to Section 302 of the Sarbanes-Oxley Act of 2002(1)\n32 Certification by CEO and CFO pursuant to 18 U.S.C. Section 1350, as adopted pursuant to Section 906 of the Sarbanes-Oxley Act of 2002(3)\n101.INS XBRL Instance Document\n101.SCH XBRL Taxonomy Extension Schema Document\n101.CAL XBRL Taxonomy Extension Calculation Linkbase Document\n101.DEF XBRL Taxonomy Extension Definition Linkbase Document\n101.LAB XBRL Taxonomy Extension Label Linkbase Document\n101.PRE XBRL Taxonomy Extension Presentation Linkbase Document\n104 Cover Page Interactive Data File - the cover page XBRL tags are embedded within the Inline XBRL document.\n* Reports filed under the Securities Exchange Act (Form 10-K, Form 10-Q and Form 8-K) are filed under File No. 000-30419 and File No. 001-39317.\n(1) Filed herewith.\n(2) Management contract or compensatory plan, contract or arrangement.\n(3) Furnished herewith.\n† Schedules or other attachments to these exhibits not filed herewith shall be furnished to the Commission upon request.",
    "item_16": "Item 16. Form 10-K Summary\nNone.",
    "stock_ticker": "ON"
}