{
    "cik": "1097864",
    "company": "ON SEMICONDUCTOR CORP",
    "filing_type": "10-K",
    "filing_date": "2020-02-19",
    "period_of_report": "2019-12-31",
    "sic": "3674",
    "state_of_inc": "DE",
    "state_location": "AZ",
    "fiscal_year_end": "1231",
    "filing_html_index": "https://www.sec.gov/Archives/edgar/data/1097864/0001193125-20-041751-index.html",
    "htm_filing_link": "https://www.sec.gov/Archives/edgar/data/1097864/000119312520041751/d864442d10k.htm",
    "complete_text_filing_link": "https://www.sec.gov/Archives/edgar/data/1097864/0001193125-20-041751.txt",
    "filename": "1097864_10K_2019_0001193125-20-041751.htm",
    "item_1": "Item 1. Business\nBusiness Overview\nON Semiconductor Corporation, together with its wholly and majority-owned subsidiaries (\"ON Semiconductor, \"we,\" \"us,\" \"our,\" or the \"Company\"), was incorporated under the laws of the state of Delaware in 1992 under the name Motorola Energy Systems, Inc. Immediately prior to our August 4, 1999 recapitalization, we were a wholly-owned subsidiary of Motorola.\nON Semiconductor is driving innovation in energy-efficient electronics. Our extensive portfolio of sensors, power management, connectivity, custom and SoC, analog, logic, timing and discrete devices helps customers efficiently solve their design challenges in advanced electronic systems and products. Our power management and motor driver semiconductor components control, convert, protect and monitor the supply of power to the different elements within a wide variety of electronic devices. Our custom ASICs and SoC devices use analog, MCU, DSP, mixed-signal and advanced logic capabilities to enable the application and uses of many of our automotive, medical, aerospace/defense, consumer and industrial customers’ products. Our signal management semiconductor components provide high-performance clock management and data flow management for precision computing, communications and industrial systems. Our growing portfolio of sensors, including image sensors, radar and LiDAR, provide advanced solutions for automotive, industrial and IoT applications. Our high performance Wi-Fi solution creates a strong platform for addressing connectivity solutions for industrial IoT. Our standard semiconductor components serve as “building blocks” within virtually all types of electronic devices. These various products fall into the logic, analog, discrete, image sensors, IoT and memory categories used by the WSTS group.\nWe serve a broad base of end-user markets, including automotive, communications, computing, consumer, medical, industrial, networking, telecom and aerospace/defense. Our devices are found in a wide variety of end products, including automobiles, smartphones, data center and enterprise servers, wearable medical devices, PCs, industrial building and home automation systems, factory automation, consumer white goods, security and surveillance systems, machine vision and robotics, LED lighting, power supplies, networking and telecom equipment, medical diagnostics, imaging, wireless routers and hearing health.\nOur portfolio of devices enables us to offer advanced ICs and the \"building block\" components that deliver system level functionality and design solutions. We shipped approximately 66.2 billion units in 2019, and approximately 75.7 billion units in 2018. We offer micro packages, which provide increased performance characteristics while reducing the critical board space inside today's ever shrinking electronic devices and power modules, delivering improved energy efficiency and reliability for a wide variety of medium and high power applications. We believe that our ability to offer a broad range of products, combined with our applications and global manufacturing and logistics network, provides our customers with single source purchasing on a cost-effective and timely basis.\nFrom time to time, we reassess the alignment of our product families and devices to our operating segments and may move product families or individual devices from one operating segment to another. As of December 31, 2019, we were organized into the following three operating and reportable segments: the Power Solutions Group (\"PSG\"), the Advanced Solutions Group (\"ASG\") and the Intelligent Sensing Group (\"ISG\"). We changed the name of our Analog Solutions Group to the Advanced Solutions Group and the name of our Image Sensor Group to the Intelligent Sensing Group in December 2019 and December 2018, respectively. The following table illustrates the product technologies under each of our segments based on our operating strategy:\nWe currently have domestic design operations in Arizona, California, Idaho, New York, Oregon, Pennsylvania, Rhode Island, Texas and Utah. We also have foreign design operations in Australia, Belgium, Canada, China, the Czech Republic, France, Germany, India, Ireland, Israel, Italy, Japan, South Korea, the Philippines, Romania, Russia, Singapore, Slovak Republic, Slovenia, Switzerland, Taiwan and the United Kingdom. Additionally, we currently operate domestic manufacturing facilities in Idaho, Maine, Pennsylvania, New York and Oregon and have foreign manufacturing facilities in Belgium, Canada, China, the Czech Republic, Japan, South Korea, Malaysia, the Philippines and Vietnam. We also have global distribution centers in China, the Philippines and Singapore.\nCompany Highlights for the year ended December 31, 2019\n•Total revenue of $5,517.9 million\n•Gross margin of 35.8%\n•Acquired Quantenna Communications, Inc. (\"Quantenna\") for $1,039.3 million\n•Settled litigation with Power Integrations, Inc. (\"PI\")\n•Net income of $0.51 per diluted share\n•Cash and cash equivalents of $894.2 million\nCompleted Acquisitions\nOn June 19, 2019, we completed our acquisition of Quantenna pursuant to the definitive Agreement and Plan of Merger with each of Quantenna and Raptor Operations Sub, Inc., our wholly-owned subsidiary (“Raptor”), which provided for the merger of Quantenna with Raptor, whereby Quantenna continued as the surviving corporation and our wholly-owned subsidiary. Following the acquisition, Quantenna changed its name to ON Semiconductor Connectivity Solutions, Inc. The purchase price totaled $1,039.3 million, of which $1,026.6 million was paid in cash during the year ended December 31, 2019, with the proceeds from a $900.0 million draw against our Revolving Credit Facility and cash on hand. We believe the acquisition of Quantenna creates a strong platform for addressing connectivity solutions for industrial IoT by combining our expertise in power management and bluetooth technologies with Quantenna's Wi-Fi technologies and software capabilities.\nOn May 8, 2018, we acquired 100% of the outstanding shares of SensL, a company specializing in SiPM, SPAD and LiDAR sensing products for the automotive, medical, industrial and consumer markets, for $71.6 million, funded with cash on hand. This acquisition positions us to extend our products in automotive sensing applications for ADAS and autonomous driving by adding LiDAR capabilities to our existing capabilities in imaging and radar.\nSee Note 5: ''Acquisitions, Divestitures and Licensing Transactions'' in the notes to our audited consolidated financial statements included elsewhere in this Form 10-K for additional information.\nProducts and Technology\nThe following provides certain information regarding the products and technologies by each of our operating segments. See \"Business Overview\" above and Note 3: ''Revenue and Segment Information'' in the notes to our audited consolidated financial statements included elsewhere in this Form 10-K for other information regarding our segments and their revenue and property, plant and equipment and the income derived from each segment.\nPSG\nPSG offers a wide array of analog, discrete, module and integrated semiconductor products that perform multiple application functions, including power switching, power conversion, signal conditioning, circuit protection, signal amplification and voltage regulation functions. The trends driving growth within our end-user markets are primarily higher power efficiency and power density in power applications, the demand for greater functionality in small handheld devices, and faster data transmission rates in all communications. The advancement of existing volt electrical infrastructure, electrification of power train in the form of EV/HEV, higher trench density enabling lower losses in power efficient packages and lower capacitance and integrated signal conditioning products to support faster data transmission rates significantly increase the use of high power semiconductor solutions. The recent increase in the use of WBG MOSFETs and diodes, including SiC and GaN, is further expanding the use of semiconductor products. Certain of PSG's broad portfolio of products and solutions are summarized below:\n•Automotive Electronics\nAEC qualified products, covering the spectrum from discrete to integrated, as well as automotive modules and known good die to support automotive modules. New semiconductor products based upon WBG technologies, including SiC, are rapidly being adopted for EV/HEV traction and charging applications due to the higher efficiencies, they provide.\n•Industrial Electronics\nAdvanced power technologies to support high performance power conversion for high-end power supply/UPS, alternative energy and industrial motors.\n•Computing\nMOSFETs and protection devices supporting the latest chipsets. Multichip power solutions and advanced LDOs to support power efficiency requirements in new computing platforms. SiC and GaN technology enables drastic reduction in power adaptor size.\n•Communications\nOur smallest packages: DFN MOSFETs, CSP (MOSFET/EEPROMs), EEPROMs and LDOs, and X4DFN 01005 for small signal devices and protection. Low capacitance ESD and common mode filters for high-speed serial interface protection.\nASG\nASG designs and develops analog, mixed-signal, advanced logic, ASSPs and ASICs, WiFi and power solutions for a broad base of end-users in the automotive, consumer, computing, industrial, communications, medical and aerospace/defense markets. Our product solutions enable industry leading active mode and standby mode efficiency now being demanded by regulatory agencies around the world. Additionally, ASG offers trusted foundry and design services for our government customers as well as manufacturing services, which leverage the Company’s broad range of manufacturing, IC design, packaging, and silicon technology offerings to provide turn-key solutions for our customers. Certain of ASG’s broad portfolio of products and solutions are summarized below:\n•Automotive Electronics\nEnergy efficient solutions that reduce emissions, improve fuel economy and safety, enhance lighting and make possible an improved driving experience. Multi-phase DC-DC power conversion for compute-intensive solutions for assisted and autonomous driving is also a focus area.\n•Industrial Electronics\nEfficient power conversion products, sensor interface products and motor control products. Wired and low power RF wireless connectivity for IoT applications. Residential, commercial and industrial-grade circuit breaking products for GFCI and AFCI applications. FDA-compliant assembly and packaging manufacturing services.\n•Computing\nSolutions for a wide range of voltage and current options ranging from multi-phase power conversion for VCORE processors, power stage and point of load. Thermal and battery charging solutions as well as high density AC to DC power conversion solutions are also supported.\n•Communications\nHigh efficiency mixed-signal, power management, WiFi and RF connectivity products that enable our customers to\nmaximize the performance of their products while preserving critical battery life. RF tuning solutions to enhance radio performance. Fast charging, multi-media and ambient awareness system solutions to address increasing customer desire for innovation.\nISG\nISG designs and develops CMOS and CCD image sensors, proximity sensors, image signal processors, single photon detectors, including SiPM and SPAD arrays, radar, as well as actuator drivers for autofocus and image stabilization for a broad base of end-users in the automotive, industrial, consumer, wireless, medical and aerospace/defense markets. Our broad range of product offerings delivers excellent pixel performance, sensor functionality and camera systems capabilities in which high quality visual imagery is becoming increasingly important to our customers and their end-users, particularly in applications powered by AI. Certain of ISG's broad portfolio of products and solutions are summarized below:\n•Automotive Imaging\nA broad portfolio of automotive sensing technologies spanning ultrasonic, imaging, radar and LiDAR paving the way to high levels of driver assistance (ADAS) and automated driving with built in functional safety and cybersecurity processing.\n•Industrial Imaging\nA broad range of CMOS, CCD and SiPM sensors with an emphasis on machine vision for factory automation, robotics and logistics, intelligent transportation systems, agriculture, medical, cinematography, scientific and aerospace/defense applications.\n•Wireless and Consumer Electronics\nA broad range of CMOS sensors and driver actuators for high performance AR/VR, drones, mobile phones, PCs, tablets, high-speed video cameras, and various unique consumer applications. Our solutions offer superior image quality, fast frame rates, high definition and low light sensitivity to provide customers with a compelling visual experience, especially in emerging applications in IoT markets for security, surveillance and internet protocol cameras.\nCustomers\nIn general, we have maintained long-term relationships with our key customers. Sales agreements with customers are renewable periodically and contain certain terms and conditions with respect to payment, delivery, warranty and supply, but generally do not require minimum purchase commitments. Most of our OEM customers negotiate pricing terms with us on an annual basis near the end of the calendar year, our distributors generally negotiate pricing terms on a quarterly basis, and electronic manufacturing service providers negotiate prices periodically during the year. Although payment terms may vary, most distributor agreements require payment within 30 days. Pricing terms on product development agreements are negotiated at the beginning of a project. Our products are ultimately purchased for use in a variety of end-markets, including computing, automotive, consumer, industrial, communications, networking, aerospace/defense and medical. With respect to public sector clients, the government’s remedies may include suspension or debarment from future government business. In addition, almost all of our contracts have default provisions, and certain of our contracts in the public sector are terminable at any time for convenience of the contracting agency.\nFor the year ended December 31, 2019, aggregate revenue from our five largest customers for PSG, ASG and ISG, comprised approximately 41%, 35% and 48%, respectively, of the respective segment revenue. The loss of certain of these customers may have a material adverse effect on the operations of the respective segment and our consolidated results of operations.\nWe generally warrant that products sold to our customers will, at the time of shipment, be free from defects in workmanship and materials and conform to our approved specifications. Our standard warranty extends for a period of two years from the date of delivery, except in the case of image sensor products, which are warrantied for one year from the date of delivery. Our customers may cancel orders 30 days prior to shipment for standard products and, generally prior to start of production for custom products without incurring a penalty. For additional information regarding agreements with our customers, see \"End-Markets for Our Products,\" \"Manufacturing and Operations,\" and \"Backlog and Inventory,\" below, “Risk Factors - Trends, Risks and Uncertainties Related to Our Business” included elsewhere in this Form 10-K and Note 2: “Significant Accounting Policies - Revenue Recognition” in the notes to our audited consolidated financial statements included elsewhere in this Form 10-K.\nEnd-Markets for Our Products\nThe following table sets forth our principal end-markets, the estimated percentage (based in part on information provided by our distributors and electronic manufacturing service providers) of our revenue generated from each end-market during 2019, and sample applications for our products. Our Industrial end-market includes the data relating to the Medical, Aerospace and Defense and our Communications end-market includes the data relating to the Networking and Wireless.\nDistributors Sales to distributors accounted for approximately 57% of our revenue in 2019 and 60% of our revenue in each of 2018 and 2017. Our distributors resell to mid-sized and smaller OEMs and to electronic manufacturing service providers and other companies. Sales to distributors are typically made pursuant to agreements that provide return rights and stock rotation provisions permitting limited levels of product returns.\nOEMs Sales to OEMs accounted for approximately 36% of our revenue in 2019 and 34% of our revenue in each of 2018 and 2017. OEM customers include a variety of companies in the electronics industry. We focus on three types of OEMs: multi-nationals; selected regional accounts; and target market customers. Large multi-nationals and selected regional accounts, which are significant in specific markets, are our core OEM customers. The target market customers for our end-markets are OEMs that are on the leading edge of specific technologies and provide direction for technology and new product development. Generally, our OEM customers do not have the right to return our products following a sale other than pursuant to our warranty.\nElectronic Manufacturing Service Providers Sales to electronic manufacturing service providers accounted for approximately 7% of our revenue in 2019 and 6% of our revenue in each of 2018 and 2017. These customers are manufacturers who typically provide contract manufacturing services for OEMs. Many OEMs outsource a large part of their manufacturing to electronic manufacturing service providers in order to focus on their core competencies. Generally, our electronic manufacturing service customers do not have the right to return our products following a sale other than pursuant to our warranty.\nManufacturing Operations\nWe operate front-end wafer fabrication facilities in Belgium, the Czech Republic, Japan, South Korea, Malaysia and the United States and back-end assembly and test site facilities in Canada, China, Japan, Malaysia, the Philippines, Vietnam and the United States. In addition to these front-end and back-end manufacturing operations, our facility in Rožnov pod Radhoštěm, Czech Republic manufactures silicon wafers that are used by a number of our facilities.\nThe table below sets forth information with respect to the manufacturing facilities we operate either directly or pursuant to joint ventures, the reportable segments that use such facilities, and the approximate gross square footage of each site's building, which includes, among other things, manufacturing, laboratory, warehousing, office, utility, support and unused areas.\n_______________________\n(1)These facilities are leased.\n(2)This facility is used for both front-end and back-end operations.\n(3)These facilities are located on leased land.\n(4)One building owned and a portion of another leased. We intend to close this facility in 2020 and eventually market it for sale.\n(5)In February 2020, we announced that we are exploring the sale of this facility and are looking for partners for an orderly transition.\nSee Note 5: ''Acquisitions, Divestitures and Licensing Transactions'' in the notes to our audited consolidated financial statements included elsewhere in this Form 10-K regarding the pending acquisition of a manufacturing facility in 2022. We operate all of our existing manufacturing facilities directly except our assembly and test operations facility located in Leshan, China, which is owned by Leshan-Phoenix Semiconductor Company Limited, a joint venture company in which we own a majority of the outstanding equity interests (\"Leshan\") and our manufacturing facility located in Aizuwakamatsu, Japan, which is owned by ON Semiconductor Aizu Co., Ltd., a joint venture company in which we own a majority of the outstanding equity interests (\"OSA\"). Our investments in Leshan and OSA have been consolidated in our financial statements.\nOur joint venture partner in Leshan, Leshan Radio Company Ltd., is formerly a state-owned enterprise. Pursuant to the joint venture agreement, requests for production capacity are made to the board of directors of Leshan by each shareholder of the joint venture. Each request represents a purchase commitment by the requesting shareholder, provided that the shareholder may\nelect to pay the cost associated with the unused capacity (which is generally equal to the fixed cost of the capacity) in lieu of satisfying the commitment. We committed to purchase 80% of Leshan's production capacity in each of 2019, 2018 and 2017 and are currently committed to purchase approximately 80% of Leshan's expected production capacity in 2020.\nOur joint venture partner in OSA is Fujitsu Semiconductor Limited (“FSL”), a Japanese corporation. Pursuant to a foundry agreement, on a quarterly basis, ON and FSL are required to allocate the capacity of OSA and provide a rolling twenty-four month forecast consistent with the capacity allocated to each joint venture partner. We have committed to purchase 60% of OSA’s production capacity, and our committed capacity is scheduled to increase gradually through April 1, 2020, when, subject to the fulfillment of certain conditions, we are required to increase our ownership in OSA to 100%.\nWe use third-party contractors for some of our manufacturing activities, primarily for wafer fabrication and the assembly and testing of finished goods. Our agreements with these contract manufacturers typically require us to forecast product needs and commit to purchase services consistent with these forecasts. In some cases, longer-term commitments are required in the early stages of the relationship. These contract manufacturers collectively accounted for approximately 31% of our manufacturing costs in 2019 and 36% of our manufacturing costs in each of 2018 and 2017. The decrease in contract manufacturing costs in 2019 is due to the consolidation of the financial results of OSA after acquiring the majority of the outstanding equity interests during the fourth quarter of 2018.\nFor information regarding risks associated with our foreign operations, see \"Risk Factors -Trends, Risks and Uncertainties Related to Our Business\" included elsewhere in this Form 10-K.\nRaw Materials\nOur manufacturing processes use many raw materials, including silicon wafers, SiC wafers, gold, copper, lead frames, mold compound, ceramic packages and various chemicals and gases as well as other production supplies used in our manufacturing processes. We obtain our raw materials and supplies from a large number of sources, generally on a just-in-time basis, and material agreements with our suppliers that impose minimum or continuing supply obligations are reflected in our contractual obligations table in \"Management's Discussion and Analysis of Financial Condition and Results of Operations-Liquidity and Capital Resources-Contractual Obligations\" included elsewhere in this Form 10-K. From time to time, suppliers may extend lead times, limit supplies or increase prices due to capacity constraints or other factors. Although we believe that supplies of the raw materials we use are currently and will continue to be available, shortages could occur in various essential materials due to interruption of supply, increased demand in the industry or other factors.\nSales, Marketing and Distribution\nAs of December 31, 2019, our sales and marketing organization consisted of approximately 1,800 professionals servicing customers globally. We support our customers through logistics organizations and just-in-time warehouses. Global and regional distribution channels further support our customers' needs for quick response and service. We offer efficient, cost-effective global applications support from our technical information centers and solution engineering centers, allowing for applications which are developed in one region of the world to be instantaneously available throughout all other regions.\nPatents, Trademarks, Copyrights and Other Intellectual Property Rights\nWe market our products primarily under our registered trademark ON Semiconductor® and our ON logo, and, in the United States and internationally, we rely primarily on a combination of patents, trademarks, copyrights, trade secrets, employee and non-disclosure agreements and licensing agreements to protect our IP. We acquired or were licensed or sublicensed to a significant amount of IP, including patents and patent applications, in connection with our acquisitions, and we have numerous U.S. and foreign patents issued, allowed and pending. As of December 31, 2019, we held patents with expiration dates ranging from 2020 to 2039, and none of the patents that expire in the next three years materially affect our business. Our policy is to protect our products and processes by asserting our IP rights where appropriate and prudent and by obtaining patents, copyrights and other IP rights used in connection with our business when practicable and appropriate.\nSeasonality\nWe believe our business today is driven more by content gains within applications and secular growth drivers and not solely by macroeconomic and industry cyclicality, as was the case historically. As experienced in 2019, we could again experience period-to-period fluctuations in operating results due to general industry or economic conditions. For information regarding risks associated with the cyclicality and seasonality of our business, see “Risk Factors-Trends, Risks and Uncertainties Related to Our Business” included elsewhere in this Form 10-K.\nBacklog and Inventory\nOur trade sales are made primarily pursuant to orders that are predominantly booked as far as 26 weeks in advance of delivery. Generally, prices and quantities are fixed at the time of booking. Backlog as of a given date consists of existing orders and forecasted demand from our EDI customers, in each case scheduled to be shipped over the 13-week period following such date. Backlog is influenced by several factors, including market demand, pricing and customer order patterns in reaction to product lead times. During 2019, our backlog at the beginning of each quarter represented between 85% and 87% of actual revenue during such quarter, which is consistent with backlog levels in recent prior periods. As manufacturing capacity utilization in the industry increases, customers tend to order products further in advance and, as a result, backlog at the beginning of a period as a percentage of revenue during such period is likely to increase.\nIn the semiconductor industry, backlog quantities and shipment schedules under outstanding purchase orders are frequently revised to reflect changes in customer needs. Agreements calling for the sale of specific quantities are either contractually subject to quantity revisions or, as a matter of industry practice, are often not enforced. Therefore, a significant portion of our order backlog may be cancelable. For these reasons, the amount of backlog as of any particular date may not be an accurate indicator of future results.\nWe sell products to key customers pursuant to contracts that allow us to schedule production capacity in advance and allow the customers to manage their inventory levels consistent with just-in-time principles while shortening the cycle times required for producing ordered products. However, these contracts are typically amended to reflect changes in customer demands and periodic price renegotiations. We routinely generate inventory based on customers' estimates of end-user demand for their products, which are difficult to predict. See \"Risk Factors-Trends, Risks and Uncertainties Related to Our Business\" located elsewhere in this Form 10-K for additional information regarding the inventory practices within the semiconductor industry.\nCompetition\nWe face significant competition within each of our product lines from major international semiconductor companies, as well as smaller companies focused on specific market niches. Because some of our components are often building block semiconductors that, in some cases, can be integrated into more complex ICs, we also face competition from manufacturers of ICs, ASICs and fully-customized ICs, as well as customers who develop their own IC products. See \"Risk Factors-Trends, Risks and Uncertainties Related to Our Business\" included elsewhere in this Form 10-K for additional information.\nIn comparison, several of our competitors are larger in scale and size, have substantially greater financial and other resources with which to pursue development, engineering, manufacturing, marketing and distribution of their products and may generally be better situated to withstand adverse economic or market conditions. The semiconductor industry has experienced, and may continue to experience, significant consolidation among companies and vertical integration among customers. The following discusses the effects of competition on our three operating segments:\nPSG\nPSG is a leading provider of power semiconductors to the automotive, industrial, wireless and mass markets. Our competitive strengths include our core competencies of leading edge fabrication technologies, micro packaging expertise, breadth of product line and IP portfolio, high quality cost effective manufacturing and supply chain management which ensures supply to our customers. Our commitment to continual innovation allows us to provide an ever broader range of semiconductor solutions to our customers who differentiate in power density and power efficiency, the key performance characteristics driving our markets.\nThe principal methods of competition in our discrete, module and integrated semiconductor products are through new products and package innovations enabling enhanced performance over existing products. Of particular importance are our power MOSFETs, IGBTs, WBG MOSFETs and diodes, including SiC and GaN rectifiers and power module portfolio for power conversion applications, and ESD portfolio for hi-speed serial interface protection products, where we believe we have significant performance advantages over our competition. PSG's competitors include: Broadcom Limited (\"Broadcom\"), Diodes Incorporated, Infineon Technologies AG (\"Infineon\"), KEC Corporation, Nexperia BV, Rohm Semiconductor USA LLC, Semtech Corporation, STMicroelectronics N.V. (\"STMicroelectronics\"), Texas Instruments Incorporated, Toshiba Corporation and Vishay Intertechnology, Inc.\nASG\nThe principal bases for competition in ASG are design experience, manufacturing capability, depth and quality of IP, ability to service customer needs from the design phase to the shipping of a completed product, length of design cycle, longevity of technology support and experience of sales and technical support personnel. Our competitive position is also enhanced by long-standing relationships with leading OEM customers.\nOur ability to compete successfully depends on internal and external variables, both inside and outside of our control. These variables include, but are not limited to, the timeliness with which we can develop new products and technologies, product performance and quality, manufacturing yields and availability of supply, customer service, pricing, industry trends and general economic trends. Competitors for certain of ASG's products and solutions include: Infineon, Maxim Integrated Products, Inc., NXP Semiconductors N.V. (\"NXP\"), Renesas Electronics Corporation, STMicroelectronics and Texas Instruments Incorporated.\nISG\nISG differentiates itself from the competition through deep technical knowledge and close customer relationships to drive leading edge sensing performance for both human and machine vision applications. ISG has over four decades of imaging experience, was the first to commercialize CMOS active pixel sensors and was also the first to introduce CMOS technology into many of our markets. ISG has leveraged this expertise into market leading positions in automotive and industrial applications, which allows us to offer a wealth of technical and end-user applications knowledge to help customers develop innovative sensing solutions across a broad range of end-user needs. Competitors for certain of ISG's products and solutions include: Sony Semiconductor Manufacturing Corporation (\"Sony Semiconductor\"), Samsung Electronics Co., Ltd. (\"Samsung\"), Omnivision, STMicroelectronics and Toshiba Corporation for image sensors; Rohm Semiconductor, Renesas Electronics Corporation and Dongwoon Anatech Co., Ltd. for actuator drivers; Texas Instruments Incorporated, NXP, and Infineon for radar; and Hamamatsu Photonics K.K., Broadcom and ST Microelectronics for SiPMs and SPADs.\nGovernment Regulation\nOur manufacturing operations are subject to environmental and worker health and safety laws and regulations. These laws and regulations include those relating to emissions and discharges into the air and water, the management and disposal of hazardous substances, the release of hazardous substances into the environment at or from our facilities and at other sites and the investigation and remediation of contamination. As with other companies engaged in like businesses, the nature of our operations exposes us to the risk of liabilities and claims, regardless of fault, with respect to such matters, including personal injury claims and civil and criminal fines.\nWe believe that our operations are in material compliance with applicable environmental and health and safety laws and regulations. The costs we incurred in complying with applicable environmental regulations for the year ended December 31, 2019 were not material, and we do not expect the cost of complying with existing environmental and health and safety laws and regulations, together with any liabilities for currently known environmental conditions, to have a material adverse effect on the capital expenditures, earnings or competitive position of the Company or its subsidiaries. It is possible, however, that future developments, including changes in laws and regulations, government policies, customer specification, personnel and physical property conditions, including currently undiscovered contamination, could lead to material costs, and such costs may have a material adverse effect on our future business or prospects. See Note 13: ''Commitments and Contingencies'' in the notes to our audited consolidated financial statements included elsewhere in this Form 10-K for information on certain environmental matters.\nEmployees\nAs of December 31, 2019, we had approximately 34,800 employees worldwide, of which approximately 4,600 employees were in the United States. None of our employees in the United States are covered by collective bargaining agreements, except for approximately 117 of our employees (or approximately 2.6% of our U.S.-based employees) at the Mountain Top, Pennsylvania manufacturing facility. Certain of our foreign employees are covered by collective bargaining arrangements (e.g., those in China, South Korea, Japan and Belgium) or similar arrangements or are represented by workers councils. For information regarding employee risk associated with our international operations, see \"Risk Factors-Trends, Risks and Uncertainties Related to Our Business\" included elsewhere in this Form 10-K. Of the total number of our employees as of December 31, 2019, approximately 28,600 were engaged in manufacturing, approximately 3,300 were engaged in research and development, approximately 1,800 were engaged in customer service or other aspects of sales and marketing, and approximately 1,100 were engaged in administration.\nExecutive Officers of the Registrant\nCertain information concerning our executive officers as of February 13, 2020 is set forth below.\nName\nAge\nPosition\nKeith D. Jackson\nPresident, Chief Executive Officer and Director\nBernard Gutmann\nExecutive Vice President, Chief Financial Officer and Treasurer\nGeorge H. Cave\nExecutive Vice President, General Counsel, Chief Compliance Officer, Chief Risk Officer, Chief Privacy Officer and Corporate Secretary\nVincent C. Hopkin\nExecutive Vice President and General Manager, ASG\nSimon Keeton\nExecutive Vice President and General Manager, PSG\nTaner Ozcelik\nSenior Vice President and General Manager, ISG\nPaul E. Rolls\nExecutive Vice President, Sales and Marketing\nWilliam A. Schromm\nExecutive Vice President and Chief Operating Officer\nAll of our executive officers are also officers of SCI LLC. The present term of office for the officers named above will generally expire on the earliest of their retirement, resignation or removal. There is no family relationship among our executive officers.\nKeith D. Jackson. Mr. Jackson was elected as a Director of ON Semiconductor and appointed as President and Chief Executive Officer of ON Semiconductor and SCI LLC in November 2002. Mr. Jackson has more than 40 years of semiconductor industry experience. Before joining ON Semiconductor, he was with Fairchild, serving as Executive Vice President and General Manager, Analog, Mixed Signal, and Configurable Products Groups, beginning in 1998, and, more recently, was head of its Integrated Circuits Group. From 1996 to 1998, he served as President and a member of the board of directors of Tritech Microelectronics in Singapore, a manufacturer of analog and mixed signal products. From 1986 to 1996, Mr. Jackson worked for National Semiconductor Corporation, most recently as Vice President and General Manager of the Analog and Mixed Signal division. He also held various positions at Texas Instruments Incorporated, including engineering and management positions, from 1973 to 1986. Mr. Jackson has served on the board of directors of Veeco Instruments, Inc. since February 2012. Mr. Jackson has served on the board of directors of the Semiconductor Industry Association since 2008 and in 2019, after serving a term as Vice Chair, was elected Chair of the board. In February 2014, Mr. Jackson became a National Association of Corporate Directors Board Leadership Fellow, the highest level of credentialing for corporate directors and corporate governance professionals.\nBernard Gutmann. Mr. Gutmann was promoted and appointed Executive Vice President and Chief Financial Officer of ON Semiconductor and SCI LLC in September 2012 and has served as ON Semiconductor's and SCI LLC's Treasurer since January 2013. Before his promotion, he worked with the Company as Vice President, Corporate Analysis & Strategy of SCI LLC, serving in that position from April 2006 to September 2012. In these roles, his responsibilities have included finance integration, financial reporting, restructuring, tax, treasury and financial planning and analysis. From November 2002 to April 2006, Mr. Gutmann served as Vice President, Financial Planning & Analysis and Treasury of SCI LLC. From September 1999 to November 2002, he held the position of Director, Financial Planning & Analysis of SCI LLC. Prior to joining ON Semiconductor, Mr. Gutmann served in various financial positions with Motorola from 1982 to 1999, including controller of various divisions and an off-shore wafer and backend factory, finance and accounting manager, financial planning manager and financial analyst. He holds a Bachelor of Science in Management Engineering from Worcester Polytechnic Institute in\nMassachusetts (U.S.). Additionally, he is fluent in English, French and Spanish and is conversant in German.\nGeorge H. \"Sonny\" Cave. Mr. Cave is the founding General Counsel and Corporate Secretary of ON Semiconductor, positions he has held since the 1999 spin-out from Motorola. He is also Executive Vice President, Chief Compliance Officer, Chief Risk Officer and Chief Privacy Officer of ON Semiconductor and SCI LLC. His extensive legal and business experience spans over 30 years, including seven years with Motorola. For two years prior to ON Semiconductor’s spin-out, he was an ex-patriate stationed in Geneva, Switzerland as Regulatory Affairs Director for Motorola’s Semiconductor Components Group. Before that assignment, he spent five years with Motorola’s Corporate Law Department in Phoenix, Arizona, where he was Senior Counsel for global Environmental Health and Safety. Mr. Cave also practiced law for six years with two large law firms in Denver and Phoenix. He has extensive experience in corporate and commercial law, governance, enterprise risk management and compliance and ethics. He holds a Juris Doctorate degree from the University of Colorado School of Law, a Master of Science degree from Arizona State University and a Bachelor of Science degree cum laude from Duke University.\nVincent C. Hopkin. Mr. Hopkin joined the Company in March 2008 and currently serves as Executive Vice President and General Manager of ASG for ON Semiconductor and SCI LLC. From September 2016 to May 2018, he was Senior Vice President and General Manager of the Digital and DC/DC Solutions Division. He has more than three decades of experience in the electronics industry. During his career, Mr. Hopkin has held various leadership positions within business units, sales and manufacturing. Prior to joining ON Semiconductor in 2008, he successfully managed several businesses including ASIC, military/aerospace, image sensing and foundry services at AMIS. Mr. Hopkin joined AMIS in 1983 and worked in several operations functions. Mr. Hopkin holds a Bachelor of Science degree in management and organizational behavior from Idaho State University.\nSimon Keeton. Mr. Keeton joined the Company in July 2007 and is currently the Executive Vice President and General Manager of PSG of ON Semiconductor and SCI LLC. During his career, Mr. Keeton has held various management positions within the Company. Before Mr. Keeton’s promotion to his current role on January 1, 2019, he was a Senior Vice President and General Manager of the MOSFET Division. From 2012 to 2016, Mr. Keeton served as Vice President and General Manager of the Integrated Circuit Division under our former Standard Products Group. Prior to that time, he served as Vice President and General Manager of the Consumer Products Division from 2009 to 2012 and as Business Unit Director of our Signals and Interface Business Unit from 2007 to 2009. Before joining the Company, Mr. Keeton served as Strategic Planning Manager of the Digital Enterprise Group of Intel Corporation and held various marketing and business management roles at Vitesse Semiconductor Corporation.\nTaner Ozcelik. Mr. Ozcelik joined ON Semiconductor in August 2014 as the Senior Vice President of the Aptina Imaging Business, and on February 20, 2015, he was named the Senior Vice President and General Manager of ISG of ON Semiconductor and SCI LLC. Mr. Ozcelik has served at the intersection of semiconductors, consumer electronics, computing and automotive industries for more than two decades. Before joining ON Semiconductor in August 2014, he served as Senior Vice President of Aptina’s Automotive and Embedded business. Prior to this, Mr. Ozcelik served as Vice President and General Manager of the NVIDIA Corporation (\"NVIDIA\") automotive business from 2012 to 2014, and as General Manager of the Avionics, Automotive and Embedded Business of NVIDIA from 2006 to 2012. While at NVIDIA, he developed several award winning firsts in automotive, which spanned a variety of applications including infotainment systems, digital instrument clusters, automotive tablets and ADAS, which are now featured in cars worldwide. During his career, Mr. Ozcelik has also held positions as President and CEO at MobileSmarts, Inc. and as Vice President and General Manager at Sony Semiconductor for its Digital Home Platform Division. Mr. Ozcelik holds a Masters of Business Administration degree from the Wharton School of the University of Pennsylvania, a Ph.D. in Electrical Engineering from Northwestern University and a Bachelor of Science in Electrical Engineering from Bogazici University, Turkey. He is listed as an inventor on 23 U.S. patents.\nPaul E. Rolls. Mr. Rolls was promoted and appointed Executive Vice President, Sales and Marketing of ON Semiconductor and SCI LLC in July 2013. Before his promotion, he served as Senior Vice President, Japan Sales and Marketing and Senior Vice President of Global Sales Operations, serving in that position from October 2012 to July 2013. Mr. Rolls has more than 26 years of technology sales, sales management and operations experience, with more than 19 years of sales and sales management experience in the semiconductor industry. Before joining the Company, Mr. Rolls was the Senior Vice President, Worldwide Sales and Marketing at Integrated Device Technology, Inc. from January 2010 to April 2012. From August 1996 to December 2009, he held multiple sales positions at International Rectifier Corp., most recently as Senior Vice President, Global Sales. During his career, he has also held management roles at Compaq Computer Corporation.\nWilliam A. Schromm. Mr. Schromm has more than 30 years of semiconductor industry experience, has been with the Company since August 1999 and has served as Executive Vice President and Chief Operating Officer of ON Semiconductor and SCI LLC since August 2014. Prior to becoming Chief Operating Officer, he was a Senior Vice President responsible for quality, external manufacturing, manufacturing under our former System Solutions Group segment, global supply chain, information technology, and corporate program management. Prior to this role, Mr. Schromm served as Senior Vice President and General Manager of the Company's former Computing and Consumer Products Group from June 2006 through September 2012. During his tenure with the Company, he has held various positions. From August 2004 through May 2006, he served as the Vice President and General Manager of the Company's former High Performance Analog Division and also led the Company's former Analog Products Group. Beginning in January 2003, he served as Vice President of the Clock and Data Management business and continued in that role with additional product responsibilities when this business became the High Performance Analog Division in August 2004. Prior to that, he served as the Vice President of Tactical Marketing from July 2001 through December 2002, after leading the Company's Standard Logic Division since August 1999. From April 2015 to August 2019, Mr. Schromm served on the board of directors of II-VI, Inc. Mr. Schromm earned a Bachelor of Science degree from Boston College and a Master of Business Administration degree from the University of Phoenix.\nGeographical Information\nFor certain geographic operating information, see Note 3: ''Revenue and Segment Information'' and Note 16: ''Income Taxes'' in the notes to our audited consolidated financial statements and “Management's Discussion and Analysis of Financial Condition and Results of Operations,” in each case as included elsewhere in this Form 10-K. For information regarding other risks associated with our foreign operations, see \"Risk Factors-Trends, Risks and Uncertainties Related to Our Business\" included elsewhere in this Form 10-K.\nAvailable Information\nWe make our annual report on Form 10-K, quarterly reports on Form 10-Q, current reports on Form 8-K and all amendments to those reports available, free of charge, in the \"Investor Relations\" section of our website as soon as reasonably practicable after we electronically file these materials with, or furnish these materials to the SEC. Our website is www.onsemi.com. Information on or connected to our website is neither part of, nor incorporated by reference into, this Form 10-K or any other report filed with or furnished to the SEC. You will find these materials on the SEC website at www.sec.gov, which contains reports, proxy statements and other information regarding issuers that file electronically with the SEC.",
    "item_1A": "Item 1A. Risk Factors\nForward-Looking Statements\nThis Annual Report on Form 10-K includes “forward-looking statements,” as that term is defined in Section 27A of the Securities Act and Section 21E of the Exchange Act. All statements, other than statements of historical facts, included or incorporated in this Form 10-K could be deemed forward-looking statements, particularly statements about our plans, strategies and prospects under the heading “Management’s Discussion and Analysis of Financial Condition and Results of Operations” and “Business.” Forward-looking statements are often characterized by the use of words such as “believes,” “estimates,” “expects,” “projects,” “may,” “will,” “intends,” “plans,” or “anticipates,” or by discussions of strategy, plans or intentions. All forward-looking statements in this Form 10-K are made based on our current expectations, forecasts, estimates and assumptions, and involve risks, uncertainties and other factors that could cause results or events to differ materially from those expressed in the forward-looking statements. Among these factors are our revenue and operating performance; economic conditions and markets (including current financial conditions); risk related to changes in tariffs or other government trade policies, including between the U.S. and China; risks related to our ability to meet our assumptions regarding outlook for revenue and gross margin as a percentage of revenue; effects of exchange rate fluctuations; the cyclical nature of the semiconductor industry; changes in demand for our products; changes in inventories at our customers and distributors; risks associated with restructuring actions and workforce reductions; technological and product development risks; risks that our products may be accused of infringing the IP rights of others; enforcement and protection of our IP rights and related risks; risks related to the security of our information systems and secured network; availability of raw materials, electricity, gas, water and other supply chain uncertainties; our ability to effectively shift production to other facilities when required in order to maintain supply continuity for our customers; variable demand and the aggressive pricing environment for semiconductor products; our ability to successfully manufacture in increasing volumes on a cost-effective basis and with acceptable quality for our current products; risks associated with our acquisitions and dispositions generally, including our ability to realize the anticipated benefits of our acquisitions and dispositions, including our acquisition of Quantenna; risks that acquisitions or dispositions may disrupt our current plans and operations, the risk of unexpected costs, charges or expenses resulting from acquisitions or dispositions and difficulties arising from integrating and consolidating acquired businesses, our timely filing of financial information with the SEC for acquired businesses and our ability to accurately predict the future financial performance\nof acquired businesses; competitor actions, including the adverse impact of competitor product announcements; pricing and gross profit pressures; risks associated with the addition of Huawei Technologies Co., Ltd. and its non-U.S. affiliates and subsidiaries, and other customers, to the U.S. Departments of Commerce, Bureau of Industry Security Entity List; loss of key customers; order cancellations or reduced bookings; changes in manufacturing yields; control of costs and expenses and realization of cost savings and synergies from restructurings; the costs to defend against or pursue litigation and the potential significant costs associated with adverse litigation outcomes; risks associated with decisions to expend cash reserves for various uses in accordance with our capital allocation policy such as debt prepayment, stock repurchases or acquisitions rather than to retain such cash for future needs; risks associated with our substantial leverage and restrictive covenants in our debt agreements that may be in place from time to time; risks associated with our worldwide operations, including changes in trade policies, foreign employment and labor matters associated with unions and collective bargaining arrangements, continuing political unrest in markets in which we do significant business, including Hong Kong, as well as man-made and/or natural disasters affecting our operations or financial results; the threat or occurrence of international armed conflict and terrorist activities both in the United States and internationally; risks of changes in U.S. or international tax rates or legislation; risks and costs associated with increased and new regulation of corporate governance and disclosure standards; risks related to new legal requirements; risks related to the potential impact of climate change and regulations related thereto on our operations; and risks and expenses involving environmental or other governmental regulation. Readers are cautioned not to place undue reliance on forward-looking statements. We assume no obligation to update such information, except as may be required by law.\nYou should carefully consider the trends, risks and uncertainties described below and other information in this Form 10-K and subsequent reports filed with or furnished to the SEC before making any investment decision with respect to our securities. If any of the following trends, risks or uncertainties actually occurs or continues, our business, financial condition or operating results could be materially adversely affected, the trading prices of our securities could decline, and you could lose all or part of your investment. All forward-looking statements attributable to us or persons acting on our behalf are expressly qualified in their entirety by this cautionary statement.\nTrends, Risks and Uncertainties Related to Our Business\nChanges in tariffs or other government trade policies may materially adversely affect our business and results of operations, including by reducing demand for our products.\nThe imposition of tariffs and trade restrictions as a result of international trade disputes or changes in trade policies may adversely affect our sales and profitability. For example, in 2018 and 2019, the U.S. government imposed and proposed, among other actions, new or higher tariffs on specified imported products originating from China in response to what it characterizes as unfair trade practices, and China has responded by imposing and proposing new or higher tariffs on specified products, including some semiconductors fabricated in the United States and certain transistors, diodes, ICs and other products that we import into China as part of our supply chain. Although the United States and China announced an initial “phase one” trade agreement in December 2019, the result of which may roll back or delay the imposition of additional tariffs, details have not yet been released, and there can be no assurance that a broader trade agreement will be successfully negotiated between the United States and China to reduce or eliminate these tariffs. These tariffs, and the related geopolitical uncertainty between the United States and China, may cause decreased end-market demand for our products from distributors and other customers, which could have a material adverse effect on our business and results of operations. For example, certain of our foreign customers may respond to the imposition of tariffs or threat of tariffs on products we produce by delaying purchase orders, purchasing products from our competitors or developing their own products. Ongoing international trade disputes and changes in trade policies could also impact economic activity and lead to a general contraction of customer demand. In addition, tariffs on components that we import from China or other nations that have imposed, or may in the future impose, tariffs will adversely affect our profitability unless we are able to exclude such components from the tariffs or we raise prices for our products, which may result in our products becoming less attractive relative to products offered by our competitors. Future actions or escalations by either the United States or China that affect trade relations may also impact our business, or that of our suppliers or customers, and we cannot provide any assurances as to whether such actions will occur or the form that they may take. To the extent that our sales or profitability are negatively affected by any such tariffs or other trade actions, our business and results of operations may be materially adversely affected.\nChanges in government trade policies could limit our ability to sell our products to certain customers, which may materially adversely affect our sales and results of operations.\nThe U.S. Congress or U.S. regulatory authorities may take administrative, legislative or regulatory action that could materially interfere with our ability to make sales to certain of our customers, particularly in China. We could experience unanticipated restrictions on our ability to sell to certain foreign customers where sales of products and the provision of services may require export licenses or are prohibited by government action. Export restrictions may also include technical discussions with customers that can impede our ability to pursue design-wins with customers and thus may impact future sales. For example, in May 2019, the U.S. Department of Commerce added Huawei Technologies Co., Ltd. and its non-U.S. affiliates and subsidiaries, and certain other customers, to the U.S. Department of Commerce’s Bureau of Industry and Security’s Entity List, imposing significant restrictions on the export and transfer of U.S. goods and technologies to such entities, and the U.S. may ban the export of U.S. products, goods and technologies to additional foreign customers. The terms and duration of any such restrictions may not be known to us in advance and may be subject to ongoing modifications. Even to the extent such restrictions are subsequently lifted or temporarily suspended, any financial or other penalties imposed on affected foreign customers could have a negative impact on future orders. Such foreign customers may also respond to sanctions or the threat of sanctions by employing their own solutions to address the impacts of restrictions. The loss or temporary loss of customers as a result of such future regulatory limitations could materially adversely affect our sales, business and results of operations.\nDownturns or volatility in general economic conditions could have a material adverse effect on our business and results of operations.\nIn recent years, worldwide semiconductor industry sales have tracked the impact of the financial crisis, subsequent recovery and persistent economic uncertainty. We believe that the state of global economic conditions is particularly uncertain due to recent and expected shifts in political, legislative and regulatory conditions concerning, among other matters, international trade and taxation, and that an uneven recovery or a renewed global downturn may put pressure on our sales due to reductions in customer demand as well as customers deferring purchases. Volatile or uncertain economic conditions, as well as continuing political unrest in markets in which we conduct significant business, including Hong Kong, can adversely impact sales and profitability and make it difficult for us and our competitors to accurately forecast and plan our future business activities.\nHistorically, the semiconductor industry has been highly cyclical and, as a result, subject to significant downturns and upturns in customer demand for semiconductors and related products. We believe our business today is driven more by secular growth drivers and not solely by macroeconomic and industry cyclicality, as was the case historically. As experienced in 2019, we could again experience period-to-period fluctuations in operating results due to general industry or economic conditions. We cannot accurately predict the timing of future downturns and upturns in the semiconductor industry or how severe and prolonged these conditions might be. Significant downturns often occur in connection with, or in anticipation of, maturing product cycles (for semiconductors and for the end-user products in which they are used) or declines in general economic conditions and can result in reduced product demand, production overcapacity, high inventory levels and accelerated erosion of average selling prices, any of which could materially adversely affect our operating results as a result of increased operating expenses outpacing decreased revenue, reduced margins, underutilization of our manufacturing capacity and/or asset impairment charges. On the other hand, significant upturns can cause us to be unable to satisfy demand in a timely and cost efficient manner. In the event of such an upturn, we may not be able to expand our workforce and operations in a sufficiently timely manner, procure adequate resources and raw materials, or locate suitable third-party suppliers to respond effectively to changes in demand for our existing products or to the demand for new products requested by our customers, and our business and results of operations could be materially and adversely affected.\nTo the extent we incorrectly plan for favorable economic conditions that do not materialize or take longer to materialize than expected, we may face oversupply of our products relative to customer demand. In the past, reduced customer spending has driven us, and may in the future drive us and our competitors, to reduce product pricing, which results in a negative effect on gross profit. Moreover, volatility in revenue as a result of unpredictable economic conditions may alter our anticipated working capital needs and interfere with our short-term and long-term strategies. To the extent that our sales, profitability and strategies are negatively affected by downturns or volatility in general economic conditions, our business and results of operations may be materially adversely affected.\nThe loss of one of our largest customers, or a significant reduction in the revenue we generate from these customers, could materially adversely affect our revenue, profitability, and results of operations.\nProduct sales to our ten largest end-customers, which excludes distributors, have historically accounted for a significant amount of our business. For instance, for the year ended December 31, 2019, revenue from our 10 largest end-customers collectively represented approximately 27% of our total revenue. Many of our customers operate in cyclical industries, and, in the past, we have experienced significant fluctuations from period to period in the volume of our products ordered. Generally, our agreements with our customers impose no minimum or continuing obligations to purchase our products. We cannot assure you that our largest customers will not cease purchasing products from us in favor of products produced by other suppliers, significantly reduce orders or seek price reductions in the future, and any such event could have a material adverse effect on our revenue, profitability, and results of operations.\nBecause a significant portion of our revenue is derived from customers in the automotive, industrial and communications industries, a downturn or lower sales to customers in either industry could materially adversely affect our business and results of operations.\nA significant portion of our sales are to customers within the automotive, industrial (including medical, aerospace and defense) and communications industries (including wireless and networking). Sales into these industries represented approximately 33%, 26%, and 19% of our revenue, respectively, for the year ended December 31, 2019, and those percentages will vary from quarter to quarter. Each of the automotive, industrial and communications industries is cyclical, and, as a result, our customers in these industries are sensitive to changes in general economic conditions, disruptive innovation and end-market preferences, which can adversely affect sales of our products and, correspondingly, our results of operations. Additionally, the quantity and price of our products sold to customers in these industries could decline despite continued growth in their respective end markets. Lower sales to customers in the automotive, industrial or communications industry may have a material adverse effect on our business and results of operations.\nShortages or increased prices of raw materials could materially adversely affect our results of operations.\nOur manufacturing processes rely on many raw materials, including various chemicals and gases, polysilicon, silicon wafers, aluminum, gold, silver, copper, lead frames, mold compound and ceramic packages. Generally, our agreements with suppliers of raw materials impose no minimum or continuing supply obligations, and we obtain our raw materials and supplies from a large number of sources on a just-in-time basis. From time to time, suppliers of raw materials may extend lead times, limit supplies or increase prices due to capacity constraints or other factors beyond our control. Shortages could occur in various essential raw materials due to interruption of supply or increased demand. If we are unable to obtain adequate supplies of raw materials in a timely manner, the costs of our raw materials increases significantly, their quality deteriorates or they give rise to compatibility or performance issues in our products, our results of operations could be materially adversely affected.\nMany of our facilities and processes are interdependent and an operational disruption at any particular facility could have a material adverse effect on our ability to produce many of our products, which could materially adversely affect our business and results of operations.\nWe utilize an integrated manufacturing platform in which multiple facilities may each produce one or more components necessary for the assembly of a single product. As a result of the necessary interdependence within our network of manufacturing facilities, an operational disruption at a facility toward the front-end of our manufacturing process may have a disproportionate impact on our ability to produce many of our products. For example, our facility in Rožnov pod Radhoštěm, Czech Republic, manufactures silicon wafers used by a number of our facilities, and ISG relies predominantly on one third-party for manufacturing at the front-end of its manufacturing process, and any operational disruption, natural or man-made disaster or other extraordinary event that impacted either of those facilities would have a material adverse effect on our ability to produce a number of our products worldwide. In the event of a disruption at any such facility, we may be unable to effectively source replacement components on acceptable terms from qualified third parties, in which case our ability to produce many of our products could be materially disrupted or delayed. Conversely, many of our facilities are single source facilities that only produce one of our end-products, and a disruption at any such facility would materially delay or cease production of the related product. In the event of any such operational disruption, we may experience difficulty in beginning production of replacement components or products at new facilities (for example, due to construction delays) or transferring production to other existing facilities (for example, due to capacity constraints or difficulty in transitioning to new manufacturing processes), any of which could result in a loss of future revenues and materially adversely affect our business and results of operations.\nIf our technologies are subject to claims of infringement on the IP rights of others, efforts to address such claims could have a material adverse effect on our results of operations.\nWe may from time to time be subject to claims that we may be infringing the IP rights of others. If necessary or desirable, we may seek licenses under such IP rights. However, we cannot assure you that we will obtain such licenses or that the terms of any offered licenses will be acceptable to us. The failure to obtain a license from a third-party for IP we use could cause us to incur substantial liabilities or to suspend the manufacture or shipment of products or our use of processes requiring such technologies. Further, we may be subject to IP litigation, which could cause us to incur significant expense, materially adversely affect sales of the challenged product or technologies and divert the efforts of our technical and management personnel, whether or not such litigation is resolved in our favor. In the event of an adverse outcome or pursuant to the terms of a settlement of any such litigation, we may be required to:\n•pay substantial damages or settlement costs;\n•indemnify customers or distributors;\n•cease the manufacture, use, sale or importation of infringing products;\n•expend significant resources to develop or acquire non-infringing technologies;\n•discontinue the use of processes; or\n•obtain licenses, which may not be available on reasonable terms, to the infringing technologies.\nPlease see Note 13: ''Commitments and Contingencies'' in the notes to our audited consolidated financial statements included elsewhere in this Form 10-K for a more detailed description of the litigation we are currently engaged in. The outcome of IP litigation is inherently uncertain and, if not resolved in our favor, could materially and adversely affect our business, financial condition and results of operations.\nIf we are unable to protect the IP we use, our business, results of operations and financial condition could be materially adversely affected.\nThe enforceability of our patents, trademarks, copyrights, software licenses and other IP is uncertain in certain circumstances. Effective IP protection may be unavailable, limited or not applied for in the U.S. and internationally. The various laws and regulations governing our registered and unregistered IP assets, patents, trade secrets, trademarks, mask works and copyrights to protect our products and technologies are subject to legislative and regulatory change and interpretation by courts. With respect to our IP generally, we cannot assure you that:\n•any of the substantial number of U.S. or foreign patents and pending patent applications that we employ in our business will not lapse or be invalidated, circumvented, challenged, abandoned or licensed to others;\n•any of our pending or future patent applications will be issued or have the coverage originally sought;\n•any of the trademarks, copyrights, trade secrets, know-how or mask works that we employ in our business will not lapse or be invalidated, circumvented, challenged, abandoned or licensed to others;\n•any of our pending or future trademark, copyright, or mask work applications will be issued or have the coverage originally sought; or\n•that we will be able to successfully enforce our IP rights in the U.S. or foreign countries.\nWhen we seek to enforce our rights, we are often subject to claims that the IP right is invalid, is otherwise not enforceable or is licensed to the party against whom we are asserting a claim. In addition, our assertion of IP rights often results in the other party seeking to assert alleged IP rights of its own against us, which may materially adversely impact our business. An unfavorable ruling in these sorts of matters could include money damages or an injunction prohibiting us from manufacturing or selling one or more products, which could in turn negatively affect our business, results of operations or cash flows.\nIn addition, some of our products and technologies are not covered by any patents or pending patent applications. We seek to protect our proprietary technologies, including technologies that may not be patented or patentable, in part by confidentiality agreements and, if applicable, inventors’ rights agreements with our collaborators, advisors, employees and consultants. We cannot assure you that these agreements will not be breached, that we will have adequate remedies for any breach or that persons or institutions will not assert rights to IP arising out of our research. Should we be unable to protect our IP, competitors may develop products or technologies that duplicate our products or technologies, benefit financially from innovations for which we bore the costs of development and undercut the sales and marketing of our products, all of which could have a material adverse effect on our business, results of operations and financial condition.\nIf we are unable to identify and make the substantial research and development investments required to remain competitive in our business, our business, financial condition and results of operations may be materially adversely affected.\nThe semiconductor industry requires substantial investment in research and development in order to develop and bring to market new and enhanced technologies and products. The development of new products is a complex and time-consuming process and often requires significant capital investment and lead time for development and testing. We cannot assure you that we will have sufficient resources to maintain the level of investment in research and development that is required to remain competitive. In addition, the lengthy development cycle for our products limits our ability to adapt quickly to changes affecting the product markets and requirements of our customers and end-users, and we may be unable to develop innovative responses to our customers’ and end-users’ evolving needs on the timelines they require or at all. There can be no assurance that we will win competitive bid selection processes, known as “design wins,” for new products. In addition, design wins do not guarantee that we will make customer sales or that we will generate sufficient revenue to recover design and development investments, as expenditures for technology and product development are generally made before the commercial viability for such developments can be assured. There is no assurance that we will realize a return on the capital expended to develop new products, that a significant investment in new products will be profitable or that we will have margins as high as we anticipate at the time of investment or have experienced historically. To the extent that we underinvest in our research and development efforts, fail to recognize the need for innovation with respect to our products, or that our investments and capital expenditures in research and development do not lead to sales of new products, we may be unable to bring to market technologies and products that are attractive to our customers, and as a result our business, financial condition and results of operations may be materially adversely affected.\nWe may be unable to successfully integrate new strategic acquisitions, which could materially adversely affect our business, results of operations and financial condition.\nWe have made, and may continue to make, strategic acquisitions and alliances that involve significant risks and uncertainties. Successful acquisitions and alliances in the semiconductor industry are difficult to accomplish because they require, among other things, efficient integration and aligning of product offerings and manufacturing operations and coordination of sales and marketing and research and development efforts, often in markets or regions in which we have less experience than others. Our decision to pursue an acquisition is based on, among other factors, our estimates of expected future earnings growth and potential cost savings. For example, we may anticipate rationalization of a combined infrastructure and savings through integration of a newly acquired business into our business, and our estimates could turn out to be incorrect. Risks related to successful integration of an acquisition include, but are not limited to: (1) the ability to integrate information technology and other systems; (2) unidentified issues not discovered in our due diligence; (3) customers responding by changing their existing business relationships with us or the acquired company; (4) diversion of management’s attention from our day to day operations; and (5) loss of key employees due to uncertainty about positions post-integration. In addition, we may incur unexpected costs, such as operating or restructuring costs (including severance payments to departing employees) or taxes resulting from the acquisition or integration of the newly acquired business. In the past, we have recorded goodwill impairment charges related to certain of our acquisitions as a result of such factors as significant underperformance relative to historical or projected future operating results. Missteps or delays in integrating our acquisitions, which could be caused by factors outside of our control, or our failure to realize the expected benefits of the acquisitions on the timeline we anticipate or at all, could materially adversely affect our results of operations and financial condition.\nDepending on the level of our ownership interest in and the extent to which we can exercise control over the acquired business, we may be required by U.S. generally accepted accounting principles (“GAAP”) and SEC rules and regulations to consolidate newly acquired businesses into our consolidated financial statements. The acquired businesses may not have independent audited financial statements, such statements may not be prepared in accordance with GAAP or the acquired businesses may have financial controls and systems that are not compatible with our financial controls and systems, any of which could materially impair our ability to properly integrate such businesses into our consolidated financial statements on a timely basis. Any revisions to, inaccuracies in or restatements of our consolidated financial statements due to accounting for our acquisitions could have a material adverse effect our financial condition and results of operations.\nWe may be unable to maintain manufacturing efficiency, which could have a material adverse effect on our results of operations.\nWe believe that our success materially depends on our ability to maintain or improve our current margin levels related to our manufacturing. Semiconductor manufacturing requires advanced equipment and significant capital investment, leading to high fixed costs which include depreciation expense. Manufacturing semiconductor components also involves highly complex processes that we and our competitors are continuously modifying to improve yields and product performance. In addition, impurities, waste or other difficulties in the manufacturing process can lower production yields. Our manufacturing efficiency is\nand will continue to be an important factor in our future profitability, and we cannot assure you that we will be able to maintain our manufacturing efficiency, increase manufacturing efficiency to the same extent as our competitors, or be successful in our manufacturing rationalization plans. If we are unable to utilize our manufacturing and testing facilities at expected levels, or if production capacity increases while revenue does not, the fixed costs and other operating expenses associated with these facilities will not be fully absorbed, resulting in higher average unit costs and lower gross profits, which could have a material adverse effect on our results of operations.\nThe failure to successfully implement cost reduction initiatives, including through restructuring activities, could materially adversely affect our business and results of operations.\nFrom time to time, we have implemented cost reduction initiatives in response to significant downturns in our industry, including relocating manufacturing to lower cost regions, transitioning higher-cost external supply to internal manufacturing, working with our material suppliers to lower costs, implementing personnel reductions and voluntary retirement programs, reducing employee compensation, temporary shutdowns of facilities with mandatory vacation and aggressively streamlining our overhead. In addition, we continuously monitor productivity and capital expenditures at our facilities in order to make strategic determinations regarding the temporary or permanent shutdown or disposition of facilities to improve our cost structure. In the past, we have recorded net restructuring charges to cover costs associated with our cost reduction initiatives. These costs have been primarily composed of employee separation costs (including severance payments) and asset impairments. We also often undertake restructuring activities and programs to improve our cost structure in connection with our business acquisitions, which can result in significant charges, including charges for severance payments to terminated employees and asset impairment charges.\nWe cannot assure you that our cost reduction and restructuring initiatives will be successfully or timely implemented or that they will materially and positively impact our profitability. Because our restructuring activities involve changes to many aspects of our business, including but not limited to the location of our production facilities and personnel, the associated cost reductions could materially adversely impact productivity and sales to an extent we have not anticipated. Even if we fully execute and implement these activities and they generate the anticipated cost savings, there may be other unforeseeable and unintended consequences that could materially adversely impact our profitability and business, including unintended employee attrition or harm to our competitive position. To the extent that we do not achieve the profitability enhancement or other benefits of our cost reduction and restructuring initiatives that we anticipate, our results of operations may be materially adversely effected.\nWe may be unable to develop new products to satisfy changing customer demands or regulatory requirements, which may materially adversely affect our business and results of operations.\nThe semiconductor industry is characterized by rapidly changing technologies, evolving regulatory and industry standards and certifications, changing customer needs and frequent new product introductions. Our success is largely dependent on our ability to accurately predict, identify and adapt to changes affecting the requirements of our customers in a timely and cost-effective manner. Additionally, the emergence of new industry or regulatory standards and certification requirements may adversely affect the demand for our products. We focus our independent new product development efforts on market segments and applications that we anticipate will experience growth, but there can be no assurance that we will be successful in identifying high-growth areas or develop products that meet industry standards or certification requirements in a timely manner. A fundamental shift in technologies, the regulatory climate or consumption patterns and preferences in our existing product markets or the product markets of our customers or end-users could make our current products obsolete, prevent or delay the introduction of new products that we planned to make or render our current or new products irrelevant to our customers’ needs. If our new product development efforts fail to align with the needs of our customers, including due to circumstances outside of our control like a fundamental shift in the product markets of our customers and end users or regulatory changes, our business and results of operations could be materially adversely affected.\nUncertainties regarding the timing and amount of customer orders could lead to excess inventory and write-downs of inventory that could materially adversely affect our financial condition and results of operations.\nOur sales are typically made pursuant to individual purchase orders or customer agreements, and we generally do not have long-term supply arrangements with our customers requiring a commitment to purchase. Our customers may cancel orders 30 days prior to shipment for standard products and, generally prior to start of production for custom products without incurring a penalty. We routinely generate inventory based on customers’ estimates of end-user demand for their products, which is difficult to predict. This difficulty may be compounded when we sell to OEMs indirectly through distributors or contract manufacturers, or both, as our forecasts for demand are then based on estimates provided by multiple parties, which may vary significantly. In times of under supply for certain products, some customers could respond by inflating their demand signals. As\nmarkets level off and supply capacity begins to match actual market demands, we could experience an increased risk of inventory write-downs, which may materially adversely affect our results of operations and our financial condition. In addition, our customers may change their inventory practices on short notice for any reason. Furthermore, short customer lead times are standard in the industry due to overcapacity. The cancellation or deferral of product orders, the return of previously sold products, or overproduction of products due to the failure of anticipated orders to materialize could result in excess obsolete inventory, which could result in write-downs of inventory or the incurrence of significant cancellation penalties under our arrangements with our raw materials and equipment suppliers. Unsold inventory, canceled orders and cancellation penalties may materially adversely affect our results of operations, and inventory write-downs, which may materially adversely affect our financial condition.\nIf we do not have access to capital on favorable terms, on the timeline we anticipate, or at all, our financial condition and results of operations could be materially adversely affected.\nWe require a substantial amount of capital to meet our operating requirements and remain competitive. We routinely incur significant costs to implement new manufacturing and information technologies, to increase our productivity and efficiency, to upgrade equipment and to expand production capacity, and there can be no assurance that we will realize a return on the capital expended. We have incurred and may continue to incur material amounts of debt to fund these requirements. Significant volatility or disruption in the global financial markets may result in us not being able to obtain additional financing on favorable terms, on the timeline we anticipate, or at all, and we may not be able to refinance, if necessary, any outstanding debt when due, all of which could have a material adverse effect on our financial condition. Any inability to obtain additional funding on favorable terms, on the timeline we anticipate, or at all, may cause us to curtail our operations significantly, reduce planned capital expenditures and research and development, or obtain funds through arrangements that management does not currently anticipate, including disposing of our assets and relinquishing rights to certain technologies, the occurrence of any of which may significantly impair our ability to remain competitive. If our operating results falter, our cash flow or capital resources prove inadequate, or if interest rates increase significantly, we could face liquidity problems that could materially and adversely affect our results of operations and financial condition.\nThe semiconductor industry is highly competitive, and our inability to compete effectively could materially adversely affect our business and results of operations.\nThe semiconductor industry is highly competitive, and our ability to compete successfully depends on elements both within and outside of our control. We face significant competition within each of our product lines from major global semiconductor companies as well as smaller companies focused on specific market niches. Because our components are often building block semiconductors that, in some cases, are integrated into more complex ICs, we also face competition from manufacturers of ICs, ASICs and fully customized ICs, as well as from customers who develop their own IC products. In addition, companies not currently in direct competition with us may introduce competing products in the future.\nOur inability to compete effectively could materially adversely affect our business and results of operations. Products or technologies developed by competitors that are larger and have more substantial research and development budgets, or that are smaller and more targeted in their development efforts, may render our products or technologies obsolete or noncompetitive. We also may be unable to market and sell our products if they are not competitive on the basis of price, quality, technical performance, features, system compatibility, customized design, innovation, availability, delivery timing and reliability. If we fail to compete effectively on developing strategic relationships with customers and customer sales and technical support, our sales and revenue may be materially adversely affected. Competitive pressures may limit our ability to raise prices, and any inability to maintain revenue or raise prices to offset increases in costs could have a significant adverse effect on our gross margin. Reduced sales and lower gross margins would materially adversely affect our business and results of operations.\nThe semiconductor industry has experienced rapid consolidation and our inability to compete with large competitors or failure to identify attractive opportunities to consolidate may materially adversely affect our business.\nThe semiconductor industry is characterized by the high costs associated with developing marketable products and manufacturing technologies as well as high levels of investment in production capabilities. As a result, the semiconductor industry has experienced, and may continue to experience, significant consolidation among companies and vertical integration among customers. Larger competitors resulting from consolidations may have certain advantages over us, including, but not limited to: substantially greater financial and other resources with which to withstand adverse economic or market conditions and pursue development, engineering, manufacturing, marketing and distribution of their products; longer independent operating histories; presence in key markets; patent protection; and greater name recognition. In addition, we may be at a competitive disadvantage to our peers if we fail to identify attractive opportunities to acquire companies to expand our business. Consolidation among our competitors and integration among our customers could erode our market share, negatively impact\nour capacity to compete and require us to restructure our operations, any of which would have a material adverse effect on our business.\nNatural disasters, health and safety epidemics and other business disruptions could cause significant harm to our business operations and facilities and could adversely affect our supply chain and our customer base, any of which may materially adversely affect our business, results of operation, and financial condition.\nOur U.S. and international manufacturing facilities and distribution centers, as well as the operations of our third-party suppliers, are susceptible to losses and interruptions caused by floods, hurricanes, earthquakes, typhoons, and similar natural disasters, as well as power outages, telecommunications failures, industrial accidents, health and safety epidemics and similar events. The occurrence of natural disasters in any of the regions in which we operate could severely disrupt the operations of our businesses by negatively impacting our supply chain, our ability to deliver products, and the cost of our products. For example, as a result of the outbreak of the Coronavirus in the first quarter of 2020, we and/or certain of our third party vendors may experience decreased production in our facilities in China and elsewhere, which may lead to interruptions in our supply chain, delays in delivery of or inability to deliver products on expected timeframes or at all, and/or loss of customers. Such events can negatively impact revenue and earnings and can significantly impact cash flow, both from decreased revenue and from increased costs associated with the event. In addition, these events could cause consumer confidence and spending to decrease or result in increased volatility to the U.S. and worldwide economies. Although we carry insurance to generally compensate for losses of the type noted above, such insurance may not be adequate to cover all losses that may be incurred or continue to be available in the affected area at commercially reasonable rates and terms. To the extent any losses from natural disasters or other business disruptions are not covered by insurance, any costs, write-downs, impairments and decreased revenue can materially adversely affect our business, our results of operations and our financial condition.\nWe are dependent on the services of third-party suppliers and contract manufacturers, and any disruption in or deterioration of the quality of the services delivered by such third parties could materially adversely affect our business and results of operations.\nWe use third-party contractors for certain of our manufacturing activities, primarily wafer fabrication and the assembly and testing of final goods. Our agreements with these manufacturers typically require us to commit to purchase services based on forecasted product needs, which may be inaccurate, and, in some cases, require longer-term commitments. We are also dependent upon a limited number of highly specialized third-party suppliers for required components and materials for certain of our key technologies. Arranging for replacement manufacturers and suppliers can be time consuming and costly, and the number of qualified alternative providers can be extremely limited. Our business operations, productivity and customer relations could be materially adversely affected if these contractual relationships were disrupted or terminated, the cost of such services increased significantly, the quality of the services provided deteriorated or our forecasted needs proved to be materially incorrect.\nWe could be subject to changes in tax rates or the adoption of new U.S. or international tax legislation or have exposure to additional tax liabilities, which could adversely affect our results of operations or financial condition.\nChanges to tax or other applicable laws or regulations in the United States and the jurisdictions in which we operate, or in the interpretation of such laws or regulations, could, under our existing tax structure, significantly increase our effective tax rate and ultimately reduce our cash flow from operating activities, result in us having to restructure and otherwise have a material adverse effect on our financial condition. In addition, other factors or events, including business combinations and investment transactions, changes in the valuation of our deferred tax assets and liabilities, adjustments to income taxes upon finalization of various tax returns or as a result of deficiencies asserted by taxing authorities, increases in expenses not deductible for tax purposes, changes in available tax credits, increasing operations in high tax jurisdictions, and changes in tax rates, could also increase our future effective tax rate.\nOur tax filings are subject to review or audit by the Internal Revenue Service (the \"IRS\") and state, local and foreign taxing authorities. We exercise significant judgment in determining our worldwide provision for income taxes and, in the ordinary course of our business, there may be transactions and calculations where the ultimate tax determination is uncertain. We are also liable for potential tax liabilities of businesses we acquire. The final determination in an audit may be materially different than the treatment reflected in our historical income tax provisions and accruals. An assessment of additional taxes because of an audit could have a material adverse effect on our business, financial condition, results of operations and cash flows.\nFurther changes in the tax laws of foreign jurisdictions could arise as a result of the base erosion and profit shifting (“BEPS”) project that was undertaken by the Organization for Economic Co-operation and Development (“OECD”). The OECD, which represents a coalition of member countries, recommended changes to numerous long-standing tax principles. The changes arising from the BEPS project, if adopted by countries in which we do business, could increase tax uncertainty and may\nadversely affect our provision for income taxes, which could, ultimately, materially adversely affect our financial condition, results of operations and cash flows.\nThe impact of U.S. tax legislation is uncertain and could have a material adverse impact on our cash flows and results of operations.\nOn December 22, 2017, the U.S. enacted comprehensive tax legislation, H.R.1, commonly referred to as the Tax Cuts and Jobs Act (the “Tax Act”). The Tax Act made broad and complex changes to the U.S. tax code. Some of the changes still require additional guidance, including through the issuance of final Treasury Regulations, which could lessen or increase certain adverse impacts of the Tax Act. Our analysis and interpretation of the Tax Act and proposed Treasury Regulations are ongoing and may include judgments and interpretations that could change based on final Treasury Regulations or other guidance or due to actions that the Company may take in response to such regulatory change. As a result, the impact of the Tax Act on our results of operations and cash flows may differ from our estimates, possibly materially.\nThe Tax Act could have a material benefit or material adverse impact and could result in volatility in our effective tax rate, tax expense and cash flow. Any benefit associated with the lower U.S. corporate tax rate could be reduced or outweighed by the cost of compliance or other adverse regulatory changes related to the Tax Act or final Treasury Regulations.\nWe operate a global business through numerous foreign subsidiaries, and there is a risk that tax authorities will challenge our transfer pricing methodologies and/or legal entity structures, which could adversely affect our operating results and financial condition.\nWe conduct operations worldwide through our foreign subsidiaries and are, therefore, subject to complex transfer pricing regulations in the jurisdictions in which we operate. Transfer pricing regulations generally require that, for tax purposes, transactions between related parties be priced on a basis that would be comparable to an arm’s length transaction between unrelated parties. There is uncertainty and inherent subjectivity in complying with these rules. To the extent that any foreign tax authorities disagree with our transfer pricing policies, we could become subject to significant tax liabilities and penalties. The ultimate outcome of a tax examination could differ materially from our provisions and could have a material adverse effect on our business, financial condition, results or operations and cash flows.\nOur legal organizational structure and the domicile of our entities that own our IP could result in unanticipated unfavorable tax or other consequences which could have a material adverse effect on our financial condition, results of operations and cash flows. Changes in laws, regulations, future jurisdictional profitability of us and our subsidiaries, and related regulatory interpretations in the countries in which we operate may impact the taxes we pay or tax provision we record, which could have a material adverse effect on our results of operations. In addition, any challenges to how our entities are structured or realigned or their business purpose by taxing authorities could result in us becoming subject to significant tax liabilities and penalties which could have a material adverse effect on our business, financial condition, results of operations and cash flows.\nCurrency fluctuations, changes in foreign exchange regulations and repatriation delays and costs could have a material adverse effect on our results of operations and financial condition.\nWe have sizeable sales and operations in the Asia/Pacific region and Europe and a significant amount of this business is transacted in currency other than U.S. dollars. In addition, while a significant percentage of our cash and cash equivalents is held outside the U.S., many of our liabilities, including our outstanding indebtedness, and certain other cash payments, such as share repurchases, are payable in U.S. dollars. As a result, currency fluctuations and changes in foreign exchange regulations can have a material adverse effect on our liquidity and financial condition.\nIn addition, repatriation of funds held outside the U.S. could have adverse tax consequences and could be subject to delay due to required local country approvals or local obligations. From time to time, we are required to make cash deposits outside of the U.S. to support bank guarantees of our obligations under certain office leases or amounts we owe to certain vendors and such cash deposits are not available for other uses as long as the related bank guarantees are outstanding. Foreign exchange regulations may also limit our ability to convert or repatriate foreign currency. As a result of having a lower amount of cash and cash equivalents in the U.S., our financial flexibility may be reduced, which could have a material adverse effect on our ability to make interest and principal payments due under our various debt obligations. Restrictions on repatriation or the inability to use cash held abroad to fund our operations in the U.S. may have a material adverse effect on our liquidity and financial condition.\nRapid innovation and short product life cycles in the semiconductor industry can result in price erosion of older products, which may materially adversely affect our business and results of operations.\nThe semiconductor industry is characterized by rapid innovation and short product life cycles, which often results in price erosion, especially with respect to products containing older technology. Products are frequently replaced by more technologically advanced substitutes and, as demand for older technology falls, the price at which such products can be sold drops, in some cases precipitously. In addition, our and our competitors’ excess inventory levels can accelerate general price erosion.\nIn order to continue to profitably supply older products, we must offset lower prices by reducing production costs, typically through improvements in process technology and production efficiencies. If we cannot advance our process technologies or improve our production efficiencies to a degree sufficient to maintain required margins, we will no longer be able to make a profit from the sale of older products. Moreover, in certain limited cases, we may not be able to cease production of older products, either due to contractual obligations or for customer relationship reasons and, as a result, may be required to bear a loss on such products for a sustained period of time. If reductions in our production costs fail to keep pace with reductions in market prices for the products we sell, our business and results of operations could be materially adversely affected.\nWe may be unable to attract and retain highly skilled personnel.\nOur success depends on our ability to attract, motivate and retain highly skilled personnel, including technical, marketing, management and staff personnel, both in the U.S. and internationally. In the semiconductor industry, the competition for qualified personnel, particularly experienced design engineers and other technical employees, is intense, particularly when the business cycle is improving. During such periods, competitors may try to recruit our most valuable technical employees. While we devote a great deal of our attention to designing competitive compensation programs aimed at attracting and retaining personnel, specific elements of our compensation programs may not be competitive with those of our competitors, and there can be no assurance that we will be able to retain our current personnel or recruit the key personnel we require. Loss of the services of, or failure to effectively recruit, qualified personnel, including senior managers, could have a material adverse effect on our competitive position and on our business.\nIf we must reduce our use of equity awards to compensate our employees, our competitiveness in the employee marketplace could be adversely affected and our results of operations could vary as a result of changes in our stock-based compensation programs.\nWe have issued in the past, and expect to continue to issue, RSUs with time-based vesting, performance-based awards and common stock options that generally have exercise prices at the market value at the time of the grant and that are subject to vesting over time as compensation tools. While this is a routine practice in many parts of the world, foreign exchange and income tax regulations in some countries make this practice more and more difficult. Such regulations tend to diminish the value of equity compensation to our employees in those countries. Our current practice is to seek stockholder approval of new, or amendments to existing, equity compensation plans. If these proposals do not receive stockholder approval, we may not be able to grant equity awards to employees at the same levels as in the past, which could materially adversely affect our ability to attract, retain and motivate qualified personnel, thereby materially adversely affecting our business. In addition, changes in forecasted stock-based compensation expense could cause our results of operations to vary by impacting our gross margin percentage, research and development expenses, marketing, general and administrative expenses and our tax rate.\nDisruptions caused by labor disputes or organized labor activities could materially harm our business and reputation.\nLabor disputes could lead to disruption from time to time in our union and non-union facilities. Disputes with the current labor union or new union organizing activities could lead to production slowdowns or stoppages and make it difficult or impossible for us to meet scheduled delivery times for product shipments to our customers, which could result in a loss of business and material damage to our reputation. In addition, union activity and compliance with international labor standards could result in higher labor costs, which could have a material adverse effect on our financial position and results of operations.\nEnvironmental and health and safety liabilities and expenditures could materially adversely affect our results of operations and financial condition.\nOur operations are subject to various environmental, health and safety laws and regulations. For example, our manufacturing operations are subject to laws and regulations relating to the management, disposal and remediation of hazardous substances and the emission and discharge of pollutants into the air, water and ground, and we have been identified as either a primary responsible party or a potentially responsible party at sites where we or our predecessors operated or disposed of waste in the\npast. Our other operations are also subject to laws and regulations relating to workplace safety and worker health, which, among other requirements, regulate employee exposure to hazardous substances. We have indemnities from third parties for certain environmental and health and safety liabilities for periods prior to our operations at some of our current and past sites, and we have also purchased environmental insurance to cover certain claims related to historical contamination and future releases of hazardous substances. However, we cannot assure you that such indemnification arrangements and insurance will cover any or all of our material environmental costs. In addition, the nature of our operations exposes us to the continuing risk of environmental and health and safety liabilities including:\n•changes in U.S. and international environmental or health and safety laws or regulations, including, but not limited to, future laws or regulations imposed in response to climate change concerns;\n•the manner in which environmental or health and safety laws or regulations will be enforced, administered or interpreted;\n•our ability to enforce and collect under indemnity agreements and insurance policies relating to environmental liabilities;\n•the cost of compliance with future environmental or health and safety laws or regulations or the costs associated with any future environmental claims, including the cost of clean-up of currently unknown environmental conditions; or\n•the cost of fines, penalties or other legal liability, should we fail to comply with environmental or health and safety laws or regulations.\nTo the extent that we face unforeseen environmental or health and safety compliance costs or remediation expenses or liabilities that are not covered by indemnities or insurance, we may bear the full effect of such costs, expense and liabilities, which could materially adversely affect our results of operations and financial condition.\nWe are exposed to increased costs and risks associated with complying with increasing and new regulation of corporate governance and disclosure standards.\nLike most publicly traded companies, we incur significant cost and spend a significant amount of management time and internal resources to comply with changing laws, regulations and standards relating to corporate governance and public disclosure, which requires management’s annual review and evaluation of our internal control over financial reporting and attestations of the effectiveness of these systems by our management and by our independent registered public accounting firm. As we continue to make strategic acquisitions, mergers and alliances, the integration of these businesses increases the complexity of our systems of controls. While we devote significant resources and time to comply with the internal control over financial reporting requirements under Section 404 of the Sarbanes-Oxley Act of 2002 (“SOX”), we cannot be certain that these measures will ensure that we design, implement and maintain adequate control over our financial process and reporting in the future.\nThere can be no assurance that we or our independent registered public accounting firm will not identify a material weakness in the combined company’s internal control over financial reporting in the future. Failure to comply with SOX, including delaying or failing to successfully integrate our acquisitions into our internal control over financial reporting or the identification and reporting of a material weakness, may cause investors to lose confidence in our consolidated financial statements or even in our ability to recognize the anticipated synergies and benefits of such transactions, and the trading price of our common stock or other securities may decline. In addition, if we fail to remedy any material weakness, our investors and others may lose confidence in our financial statements, our financial statements may be materially inaccurate, our access to capital markets may be restricted and the trading price of our common stock may decline.\nWarranty claims, product liability claims and product recalls could harm our business, results of operations and financial condition.\nManufacturing semiconductors is a highly complex and precise process, requiring production in a tightly controlled, clean environment. Minute impurities in our manufacturing materials, contaminants in the manufacturing environment, manufacturing equipment failures, and other defects can cause our products to be non-compliant with customer requirements or otherwise nonfunctional. We face an inherent business risk of exposure to warranty and product liability claims in the event that our products fail to perform as expected or such failure of our products results, or is alleged to result, in bodily injury or property damage (or both). In addition, if any of our designed products are or are alleged to be defective, we may be required to participate in their recall. As suppliers become more integrally involved in electrical design, OEMs are increasingly expecting them to warrant their products and are increasingly looking to them for contributions when faced with product liability claims or recalls. A successful warranty or product liability claim against us in excess of our available insurance coverage, if any, and established reserves, or a requirement that we participate in a product recall, could have material adverse effects on our business, results of operations and financial condition. Additionally, in the event that our products fail to perform as expected or such failure of our products results in a recall, our reputation may be damaged, which could make it more difficult for us to sell\nour products to existing and prospective customers and could materially adversely affect our business, results of operations and financial condition.\nSince a defect or failure in our product could give rise to failures in the goods that incorporate them (and claims for consequential damages against our customers from their customers), we may face claims for damages that are disproportionate to the revenue and profits we receive from the products involved. In certain instances, we attempt to limit our liability through our standard terms and conditions of sale and other customer contracts. There is no assurance that such limitations will be effective, and to the extent that we are liable for damages in excess of the revenue and profits we received from the products involved, our results of operations and financial condition could be materially adversely affected.\nWe may be subject to disruptions or breaches of our secured network that could irreparably damage our reputation and our business, expose us to liability and materially adversely affect our results of operations.\nWe routinely collect and store sensitive data, including confidential and other proprietary information about our business and our customers, suppliers and business partners. The secure processing, maintenance and transmission of this information is critical to our operations and business strategy. We may be subject to disruptions or breaches of our secured network caused by computer viruses, illegal hacking, criminal fraud or impersonation, acts of vandalism or terrorism or employee error. Our security measures and/or those of our third-party service providers and/or customers may not detect or prevent such security breaches. The costs to us to reduce the risk of or alleviate cyber security breaches and vulnerabilities could be significant, and our efforts to address these problems may not be successful and could result in interruptions and delays that may materially impede our sales, manufacturing, distribution or other critical functions. Any such compromise of our information security could result in the misappropriation or unauthorized publication of our confidential business or proprietary information or that of other parties with which we do business, an interruption in our operations, the unauthorized transfer of cash or other of our assets, the unauthorized release of customer or employee data or a violation of privacy or other laws. In addition, computer programmers and hackers also may be able to develop and deploy viruses, worms and other malicious software programs that attack our products, or that otherwise exploit any security vulnerabilities, and any such attack, if successful, could expose us to liability to customer claims. Any of the foregoing could irreparably damage our reputation and business, which could have a material adverse effect on our results of operations.\nSales through distributors and other third parties expose us to risks that, if realized, could have a material adverse effect on our results of operations.\nWe face risks related to our sale of a significant, and increasing, portion of our products through distributors. Distributors may sell products that compete with our products, and we may need to provide financial and other incentives to focus distributors on the sale of our products. We may rely on one or more key distributors for a product, and the loss of these distributors could reduce our revenue. Distributors may face financial difficulties, including bankruptcy, which could harm our collection of accounts receivable and financial results. Violations of the FCPA or similar laws by distributors or other third-party intermediaries could have a material impact on our business. Failure to manage risks related to our use of distributors may reduce sales, increase expenses, and weaken our competitive position, any of which could have a material adverse effect on our results of operations.\nThe failure to comply with the terms and conditions of our contracts could result in, among other things, damages, fines or other liabilities.\nWe have a diverse customer base consisting of both private sector clients and public sector clients, including the U.S. government. Sales to our private sector clients are generally based on stated contractual terms, the terms and conditions on our website or terms contained in purchase orders on a transaction-by-transaction basis. Sales to our public sector clients are generally derived from sales to federal, state and local governmental departments and agencies through various contracts and programs which may require compliance with regulations covering many areas of our operations, including, but not limited to, accounting practices, IP rights, information handling, and security. Noncompliance with contract terms, particularly with respect to highly-regulated public sector clients, or with government procurement regulations could result in fines or penalties against us, termination of such contracts or civil, criminal and administrative liability to the Company. With respect to public sector clients, the government’s remedies may also include suspension or debarment from future government business. In addition, almost all of our contracts have default provisions, and certain of our contracts in the public sector are terminable at any time for convenience of the contracting agency. The effect of any of these possible actions or the adoption of new or modified procurement regulations or practices could materially adversely affect our business, financial position and results of operations.\nThe Company is subject to governmental laws, regulations and other legal obligations related to privacy and data protection.\nThe legislative and regulatory framework for privacy and data protection issues worldwide is rapidly evolving and is likely to remain uncertain for the foreseeable future. The Company collects personally identifiable information (“PII”) and other data as part of its business processes and activities. This data is subject to a variety of U.S. and international laws and regulations, including oversight by various regulatory or other governmental bodies. Many foreign countries and governmental bodies, including the European Union and other relevant jurisdictions where the Company conducts business, have laws and regulations concerning the collection and use of PII and other data obtained from their residents or by businesses operating within their jurisdictions that are currently more restrictive than those in the U.S. Additionally, in May 2016, the European Union adopted the General Data Protection Regulation that imposed more stringent data protection requirements and provided for greater penalties for noncompliance beginning in May 2018. In addition, among other applicable laws, California adopted significant new consumer privacy laws in June 2018 that became effective on January 1, 2020 and Thailand adopted the Personal Data Protection Act B.E. 2562 in May 2019. In addition, from time to time our global operations may require importing, exporting or transferring data across international borders in compliance with both U.S. customs and export control regulations, including the Export Administration Regulations and the International Traffic in Arms Regulations. Any inability, or perceived inability, to adequately address privacy and data protection concerns, even if unfounded, or to comply with applicable laws, regulations, policies, industry standards, contractual obligations or other legal obligations, could result in additional cost and liability to the Company or company officials, including substantial monetary fines, and could damage our reputation, inhibit sales and adversely affect our business.\nExpectations of the Company relating to environmental, social and governance factors may impose additional costs and expose us to new risks.\nThere is an increasing focus from certain investors, employees and other stakeholders concerning corporate social responsibility (\"CSR\"), specifically related to environmental, social and governance factors. Some investors may use these factors to guide their investment strategies and, in some cases, may choose not to invest in us if they believe our policies relating to CSR are inadequate. Third-party providers of CSR ratings and reports on companies have increased to meet growing investor demand for measurement of CSR performance. In addition, the criteria by which companies’ CSR practices are assessed may change, which could result in greater expectations of us and cause us to undertake costly initiatives to satisfy such new criteria. Alternatively, if we elect not to or are unable to satisfy such new criteria, investors may conclude that our policies with respect to CSR are inadequate. We may face reputational damage in the event that our CSR procedures or standards do not meet the standards set by various constituencies. Furthermore, if our competitors’ CSR performance is perceived to be greater than ours, potential or current investors may elect to invest with our competitors instead. In addition, in the event that we communicate certain initiatives and goals regarding environmental, social and governance matters, we could fail, or be perceived to fail, in our achievement of such initiatives or goals, or we could be criticized for the scope of such initiatives or goals. If we fail to satisfy the expectations of investors, employees and other stakeholders or our initiatives are not executed as planned, our reputation and financial results could be materially and adversely affected.\nClimate change, and the regulatory and legislative developments related to climate change, may materially adversely affect our business and financial condition.\nThe potential physical impacts of climate change on our operations are highly uncertain and would be particular to the geographic circumstances in areas in which we operate. These may include changes in rainfall and storm patterns and intensities, water shortages, changing sea levels and changing temperatures. The impacts of climate change may materially and adversely impact the cost, production and financial performance of our operations. Further, any impacts to our business and financial condition as a result of climate change are likely to occur over a sustained period of time and are therefore difficult to quantify with any degree of specificity. For example, extreme weather events may result in adverse physical effects on portions of our infrastructure, which could disrupt our supply chain and ultimately our business operations. In addition, disruption of transportation and distribution systems could result in reduced operational efficiency and customer service interruption. Climate-related events have the potential to disrupt our business, including the business of our customers, and may cause us to experience higher attrition, losses and additional costs to resume operations.\nA number of governments or governmental bodies have introduced or are contemplating legislative and regulatory changes in response to various climate change interest groups and the potential impact of climate change. Legislation and increased regulation regarding climate change could impose significant costs on us and our suppliers, including costs related to increased energy requirements, capital equipment, environmental monitoring and reporting, and other costs to comply with such regulations. Any future climate change regulations could also negatively impact our ability to compete with companies situated in areas not subject to such limitations. Given the political significance and uncertainty around the impact of climate change and how it should be addressed, we cannot predict how legislation and regulation will affect our financial condition, operating performance and ability to compete. Furthermore, even without such regulation, increased awareness and any adverse publicity\nin the global marketplace about potential impacts on climate change by us or other companies in our industry could harm our reputation. Any of the foregoing could result in a material adverse effect on our business and financial condition.\nTrends, Risks and Uncertainties Relating to Our Indebtedness\nOur substantial debt could materially adversely affect our financial condition and results of operations.\nAs of December 31, 2019, we had $3,749.2 million of outstanding indebtedness. We may need to incur additional indebtedness in the future to repay or refinance other outstanding debt, to make acquisitions or for other purposes, and if we incur additional debt, the related risks that we now face could intensify. The degree to which we are leveraged could have important consequences to our potential and current investors, including:\n•our ability to obtain additional financing in the future for working capital, capital expenditures, acquisitions, general corporate purposes or other purposes may be impaired;\n•the timing, amount and execution of our capital allocation policy, including our 2018 Share Repurchase Program, could be affected by the degree to which we are leveraged;\n•a significant portion of our cash flow from operating activities must be dedicated to the payment of interest and principal on our debt, which reduces the funds available to us for our operations and may limit our ability to engage in acts that may be in our long-term best interests;\n•some of our debt is and will continue to be at variable rates of interest, which may result in higher interest expense in the event of increases in market interest rates;\n•our debt agreements may contain, and any agreements to refinance our debt likely will contain, financial and restrictive covenants, and our failure to comply with them may result in an event of default which if not cured or waived, could have a material adverse effect on us;\n•our level of indebtedness will increase our vulnerability to, and reduce our flexibility to respond to, general economic downturns and adverse industry and business conditions;\n•as our long-term debt ages, we must repay, and may need to renegotiate, such debt or seek additional financing;\n•to the extent the debt we incur requires collateral to secure such indebtedness, our assets could be at risk and our flexibility related to such assets could be limited;\n•our debt service obligations could limit our flexibility in planning for, or reacting to, changes in our business and the semiconductor industry;\n•our substantial leverage could place us at a competitive disadvantage vis-à-vis our competitors who may have less leverage relative to their overall capital structures; and\n•our level of indebtedness may place us at a competitive disadvantage relative to less leveraged competitors.\nTo the extent that we continue to maintain or expand our significant indebtedness, our financial condition and results of operations may be materially adversely affected.\nThe inability to meet our obligations under our Amended Credit Agreement could materially and adversely affect us by, among other things, limiting our ability to conduct our operations and reducing our flexibility to respond to changing business and economic conditions.\nOur Amended Credit Agreement provides for our $1.97 billion Revolving Credit Facility and our $2.4 billion Term Loan “B” Facility, the proceeds of which have been used, among other things, to fund acquisitions. The obligations under the Amended Credit Agreement are collateralized by a lien on substantially all of the personal property and material real property assets of the Company and most of the Company’s domestic subsidiaries. As a result, if we are unable to satisfy our obligations under the Amended Credit Agreement, the lenders could take possession of and foreclose on the pledged collateral securing the indebtedness, in which case we would be at risk of losing the related collateral, which would have a material adverse effect on our business and operations. In addition, subject to customary exceptions, the Amended Credit Agreement requires mandatory prepayment under certain circumstances, which may result in prepaying outstanding amounts under the Revolving Credit Facility and the Term Loan “B” Facility rather than using funds for other business purposes. Our acquisition-related financing could have a material adverse effect on our business and financial condition, including, among other things, our ability to obtain additional financing for working capital, capital expenditures, acquisitions, and other general corporate purposes and could reduce our flexibility to respond to changing business and economic conditions.\nThe agreements relating to our indebtedness, including the Amended Credit Agreement, may restrict our ability to operate our business, and as a result may materially adversely affect our results of operations.\nOur debt agreements, including the Amended Credit Agreement, contain, and any future debt agreements may include, a number of restrictive covenants that impose significant operating and financial restrictions on us and our subsidiaries. Such restrictive covenants may significantly limit our ability to:\n•incur additional debt, including issuing guarantees;\n•incur liens;\n•make certain investments;\n•settle a conversion of our 1.00% and 1.625% Notes in whole or in part with cash;\n•sell or otherwise dispose of assets;\n•make some acquisitions;\n•engage in mergers or consolidations or certain other “change of control” transactions;\n•make distributions to our stockholders;\n•engage in restructuring activities;\n•engage in certain sale and leaseback transactions; and\n•issue or repurchase stock or other securities.\nSuch agreements may also require us to satisfy other requirements, including maintaining certain financial ratios and condition tests. Our ability to meet these requirements can be affected by events beyond our control, and we may be unable to meet them. To the extent we fail to meet any such requirements and are in default under our debt obligations, our financial condition may be materially adversely affected. These restrictions may limit our ability to engage in activities that could otherwise benefit us. To the extent that we are unable to engage in activities that support the growth, profitability and competitiveness of our business, our results of operations may be materially adversely affected.\nWe may not be able to generate sufficient cash flow to meet our debt service obligations, and any inability to repay our debt when due would have a material adverse effect on our business, financial condition and results of operations.\nOur ability to generate sufficient cash flow from operating activities to make scheduled payments on our debt obligations will depend on our future financial performance, which will be affected by a range of economic, competitive and business factors, many of which are outside of our control. If we do not generate sufficient cash flow from operating activities and proceeds from sales of assets in the ordinary course of business to satisfy our debt obligations as they come due, we may have to undertake alternative financing plans, such as refinancing or restructuring our debt, selling additional assets, reducing or delaying capital investments or seeking to raise additional capital. We cannot assure you that any refinancing would be possible, that any assets could be sold, or, if sold, of the timing of the sales and the amount of proceeds realized from those sales, or that additional financing could be obtained on acceptable terms, if at all, or would be permitted under the terms of our various debt instruments then in effect. Furthermore, we cannot assure you that, if we were required to repurchase any of our debt securities upon a change of control or other specified event, our assets or cash flow would be sufficient to fully repay borrowings under our outstanding debt instruments or that we would be able to refinance or restructure the payments on those debt securities. If we are unable to repay, refinance or restructure our indebtedness under our collateralized debt, the holders of such debt could proceed against the collateral securing that indebtedness, which could materially negatively impact our results of operations and financial condition. A default under our committed credit facilities, including our Amended Credit Agreement, could also limit our ability to make further borrowings under those facilities, which could materially adversely affect our business and results of operations. In addition, to the extent we are not able to borrow or refinance debt obligations, we may have to issue additional shares of our common stock, which would have a dilutive effect to the current stockholders.\nAn event of default under any agreement relating to our outstanding indebtedness could cross default other indebtedness, which could have a material adverse effect on our business, financial condition and results of operations.\nIf there were an event of default under certain of our agreements relating to our outstanding indebtedness, the holders of the defaulted debt could cause all amounts outstanding with respect to that debt to be due and payable immediately, which default or acceleration of debt could cross default other indebtedness. Any such cross default would put immediate pressure on our liquidity and financial condition and would amplify the risks described above with regards to being unable to repay our indebtedness when due and payable. We cannot assure you that our assets or cash flow would be sufficient to fully repay borrowings under our outstanding debt instruments if accelerated upon an event of default, and, as described above, any inability to repay our debt when due would have a material adverse effect on our business, financial condition and results of operations.\nIf our operating subsidiaries, which may have no independent obligation to repay our debt, are not able to make cash available to us for such repayment, our business, financial condition and results of operations may be adversely affected.\nWe conduct our operations through our subsidiaries. Repayment of our indebtedness is dependent on the generation of cash flow by our subsidiaries and their ability to make such cash available to us, by dividend, debt repayment or otherwise. Unless they are guarantors of our indebtedness, our subsidiaries have no obligation to pay amounts due on such indebtedness or to make funds available for that purpose. Our subsidiaries may not be able to, or may not be permitted to, make distributions to enable us to make payments in respect of our indebtedness. Each subsidiary is a distinct legal entity, and, under certain circumstances, legal and contractual restrictions may limit our ability to obtain cash from our subsidiaries. In the event that we do not receive distributions or payments from our subsidiaries, we may be unable to make required principal and interest payments on our indebtedness and, as described above, any inability to repay our debt when due would have a material adverse effect on our business, financial condition and results of operations.\nIf interest rates increase, our debt service obligations under our variable rate indebtedness could increase significantly, which would have a material adverse effect on our results of operations.\nBorrowings under certain of our facilities from time to time, including under our Amended Credit Agreement, are at variable rates of interest and as a result expose us to interest rate risk. If interest rates were to increase, our debt service obligations on the variable rate indebtedness would increase even though the amount borrowed remained the same, and our net income and cash flows, including cash available for servicing our indebtedness, will correspondingly decrease. During the first quarters of 2017 and 2019, we entered into interest rate swaps that involved the exchange of floating for fixed rate interest payments in order to reduce interest rate volatility for a portion of our Term Loan \"B\" Facility through the end of 2021. However, we may not maintain interest rate swaps with respect to all of our variable rate indebtedness, and any swaps we enter into may not fully mitigate our interest rate risk. To the extent the risk materializes and is not fully mitigated, the resulting increase in interest expense could have a material adverse effect on our results of operations.\nA number of our current debt agreements, including the Amended Credit Agreement, have an interest rate tied to LIBO Rate, which is expected to be discontinued after 2021. While some of our debt agreements provide procedures for determining an alternative base rate in the event that LIBO Rate is discontinued, not all do so. Regardless, there can be no assurances as to what alternative base rates may be and whether such base rate will be more or less favorable than LIBO Rate and any other unforeseen impacts of the potential discontinuation of LIBO Rate. The Company intends to monitor the developments with respect to the potential phasing out of LIBO Rate after 2021 and work with its lenders to ensure any transition away from LIBO Rate will have minimal impact on its financial condition, but can provide no assurances that the impact of the discontinuation of LIBO Rate would not have a material adverse effect on our results of operations.\nServicing the 1.00% Notes and 1.625% Notes may require a significant amount of cash, and we may not have sufficient cash flow or the ability to raise the funds necessary to satisfy our obligations under the 1.00% Notes and 1.625% Notes in a timely manner.\nIn June 2015, we issued $690.0 million aggregate principal amount of our 1.00% Notes, and in March 2017, we issued $575.0 million aggregate principal amount of our 1.625% Notes. Holders of the 1.00% Notes and the 1.625% Notes will have the right to require us to repurchase all or a portion of their notes upon the occurrence of a fundamental change (as defined under the respective indentures governing such notes) at a repurchase price equal to 100% of their principal amount, plus accrued and unpaid interest, if any, to, but not including, the fundamental change repurchase date. In addition, upon conversion of the 1.00% Notes and/or the 1.625% Notes to be repurchased, unless we elect to deliver solely shares of our common stock to settle such conversion (other than paying cash in lieu of delivering any fractional shares), we will be required to make cash payments in respect of such 1.00% Notes and/or 1.625% Notes being converted. Moreover, we will be required to repay the 1.00% Notes and the 1.625% Notes in cash at their maturity, unless earlier converted or repurchased. Servicing the 1.00% Notes and the1.625% Notes may require a significant amount of cash, and we may not have sufficient cash flow or the ability to raise the funds necessary to satisfy our obligations under the 1.00% Notes and the 1.625% Notes. Our ability to make cash payments in connection with conversions of the 1.00% Notes and/or the 1.625% Notes, repurchase the 1.00% Notes and/or the 1.625% Notes in the event of a fundamental change or repay such notes at maturity will depend on market conditions and our future performance, which is subject to economic, financial, competitive and other factors beyond our control. If we are unable to make cash payments upon conversion of the 1.00% Notes and/or the 1.625% Notes, we would be required to issue significant amounts of our common stock, which would dilute existing stockholders. In addition, if we do not have sufficient cash to repurchase the 1.00% Notes and/or the 1.625% Notes following a fundamental change, we would be in default under the terms of such notes, which could cross default other debt and materially, adversely harm our business. The terms of the Amended Credit Agreement limit the amount of future indebtedness we may incur, but the terms of the 1.00% Notes and the 1.625% Notes do not limit the amount of future indebtedness we may incur. If we incur significantly more debt, this could intensify the\nrisks described above. Our decision to use our cash for other purposes, such as to make acquisitions or to repurchase our common stock, could also intensify these risks.\nThe conditional conversion feature of the 1.00% Notes or the 1.625% Notes, if triggered, may adversely affect our financial condition and results of operations and, if we elect to settle the conversion of the 1.00% Notes or the 1.625% Notes in common stock, any such settlement could materially dilute the ownership interests of existing stockholders.\nIf specified conditions are met, holders of the 1.00% Notes may convert their notes prior to the close of business on the business day immediately preceding September 1, 2020 and holders of the 1.625% Notes may convert their notes prior to the close of business on the business day immediately preceding July 15, 2023. Unless we elect to satisfy our conversion obligations by delivering solely shares of our common stock (other than paying cash in lieu of delivering any fractional shares), in the event the conditional conversion feature under either the 1.00% Notes or the 1.625% Notes is triggered, holders electing to convert their notes could require us to settle a portion or all of our conversion obligations through the payment of cash, which could materially adversely affect our liquidity. Alternatively, if the conditional conversion feature under either the 1.00% Notes or the 1.625% Notes is triggered, and holders do not elect to convert their notes, we could be required under applicable accounting rules to reclassify all or a portion of the outstanding principal of such notes as a current rather than long-term liability, which would result in a material reduction of our net working capital. Any material decrease in our liquidity or reduction in our net working capital could have a material adverse effect on our financial condition and results of operations. In addition, we may elect to settle a conversion of the 1.00% Notes or the 1.625% Notes solely in common stock to avoid an event of default under our Amended Credit Agreement, and any such issuance of common stock could materially dilute the ownership interests of existing stockholders, including stockholders who previously converted such notes to shares of our common stock.\nThe fundamental change repurchase feature of our 1.00% Notes and 1.625% Notes may delay or prevent an otherwise beneficial attempt to take over our Company.\nThe terms of our 1.00% Notes and 1.625% Notes require us to repurchase such notes in the event of a fundamental change (as defined under the respective indentures governing such notes). In certain circumstances, a takeover of our Company could trigger an option of the holders of the 1.00% Notes and the 1.625% Notes to require us to repurchase such notes. This may have the effect of delaying or preventing a takeover of our Company that would otherwise be beneficial to investors in the 1.00% Notes and the 1.625% Notes and our common stock, which could materially decrease the value of such notes and of our common stock.\nNote hedge and warrant transactions we have entered into may materially adversely affect the value of our common stock.\nConcurrently with the issuance of the 1.00% Notes and the 1.625% Notes, we entered into note hedge transactions with certain financial institutions, which we refer to as the option counterparties. The convertible note hedges are expected to reduce the potential dilution upon any conversion of the respective series of notes and/or offset any cash payments we are required to make in excess of the principal amount of converted notes of such series, as the case may be. We also entered into warrant transactions with the option counterparties. However, the warrant transactions could separately have a dilutive effect on our common stock to the extent that the market price per share of our common stock exceeds $25.96, with respect to the 1.00% Notes, and $30.70, with respect to the 1.625% Notes, which would trigger the conditional conversion feature under such notes. For example, in the first quarter of 2018, the conditional conversion feature was triggered with respect to the 1.00% Notes, as a result of which holders were permitted to convert their 1.00% Notes into shares of common stock, cash or a combination thereof at our election for a three-month period. We can provide no assurance as to when or whether these conditional conversion features will be triggered again in the future.\nIn connection with establishing their initial hedge of the convertible note hedges and warrant transactions, the option counterparties or their respective affiliates have purchased shares of our common stock and/or entered into various derivative transactions with respect to our common stock following the pricing of the 1.00% Notes and the 1.625% Notes, respectively. The option counterparties or their respective affiliates may modify their hedge positions by entering into or unwinding various derivatives contracts with respect to our common stock and/or purchasing or selling our common stock or other securities of ours in secondary market transactions prior to the maturity of the 1.00% Notes and the 1.625% Notes, respectively (and are likely to do so during any observation period related to a conversion of 1.00% Notes or 1.625% Notes following any repurchase of the 1.00% Notes or 1.625% Notes by us on any fundamental change repurchase date or otherwise). The potential effect, if any, of these transactions and activities on the market price of our common stock will depend in part on market conditions and cannot be ascertained at this time. Any of these activities could materially adversely affect the value of our common stock.\nCounterparty risk with respect to the note hedge transactions, if realized, could have a material adverse impact on our results of operations.\nThe option counterparties are financial institutions or affiliates of financial institutions, and we are subject to the risk that these option counterparties may default under the note hedge transactions. We can provide no assurances as to the financial stability or viability of any of the option counterparties. Our exposure to the credit risk of the option counterparties is not secured by any collateral. If one or more of the option counterparties to one or more of our note hedge transactions becomes subject to insolvency proceedings, we will become an unsecured creditor in those proceedings with a claim equal to our exposure at the time under those transactions.\nTo the extent the option counterparties do not honor their contractual commitments with us pursuant to the note hedge transactions, we could face a material increase in our exposure to potential dilution upon any conversion of the 1.00% Notes or the 1.625% Notes and/or cash payments we are required to make in excess of the principal amount of converted 1.00% Notes or 1.625% Notes, as the case may be. Our exposure will depend on many factors but, generally, the increase in our exposure will be correlated to the increase in the market price of our common stock and in the volatility of the market price of our common stock. In addition, upon a default by one of the option counterparties, we may suffer adverse tax consequences with respect to our common stock. Any such adverse tax consequences or increased cash payments could have a material adverse effect on our results of operations.\nTrends, Risks and Uncertainties Relating to Our Common Stock\nFluctuations in our quarterly operating results may cause the market price of our common stock to decline.\nGiven the nature of the markets in which we participate, we cannot reliably predict future revenue and profitability, and unexpected changes may impact the value of our common stock. A large portion of our costs are fixed, due in part to our significant sales, research and development and manufacturing costs. Thus, small declines in revenue could negatively affect our operating results in any given quarter. In addition to the other factors described above, factors that could affect our quarterly operating results include:\n•the timing and size of orders from our customers, including cancellations and reschedulings;\n•the timing of introduction of new products;\n•the gain or loss of significant customers, including as a result of industry consolidation or as a result of our acquisitions;\n•seasonality in some of our target markets;\n•changes in the mix of products we sell;\n•changes in demand by the end-users of our customers’ products;\n•market acceptance of our current and future products;\n•variability of our customers’ product life cycles;\n•availability of supplies and manufacturing services;\n•changes in manufacturing yields or other factors affecting the cost of goods sold, such as the cost and availability of raw materials and the extent of utilization of manufacturing capacity;\n•changes in the prices of our products, which can be affected by the level of our customers’ and end-users’ demand, technological change, product obsolescence, competition or other factors;\n•cancellations, changes or delays of deliveries to us by our third-party manufacturers, including as a result of the availability of manufacturing capacity and the proposed terms of manufacturing arrangements;\n•our liquidity and access to capital; and\n•our research and development activities and the funding thereof.\nAn adverse change or development in any of the above factors could cause the market price of common stock to materially decline.\nThe market price of our common stock may be volatile, which could result in substantial losses for investors.\nThe stock markets in general, and the markets for high technology stocks in particular, have experienced extreme volatility that has often been unrelated to the operating performance of particular companies. These broad market fluctuations may adversely affect the trading price of our common stock.\nThe market price of the common stock may also fluctuate significantly in response to the following factors, among others, some of which are beyond our control:\n•variations in our quarterly operating results;\n•declines in our gross margins;\n•the issuance or repurchase of shares of our common stock;\n•changes in securities analysts’ estimates of our financial performance;\n•changes in market valuations of similar companies;\n•announcements by us or our competitors of significant contracts, acquisitions, strategic partnerships, joint ventures, capital commitments, new products or product enhancements;\n•loss of a major customer or failure to complete significant transactions; and\n•additions or departures of key personnel.\nThe trading price of our common stock in the past has had significant volatility, and we cannot accurately predict every potential risk that may materially and adversely affect our stock price.\nProvisions in our charter documents may delay or prevent the acquisition of our Company, which could materially adversely affect the value of our common stock.\nOur certificate of incorporation and by-laws contain provisions that could make it harder for a third-party to acquire us without the consent of our board of directors. These provisions:\n•establish advance notice requirements for submitting nominations for election to the board of directors and for proposing matters that can be acted upon by stockholders at a meeting;\n•authorize the issuance of “blank check” preferred stock, which is preferred stock that our board of directors can create and issue without prior stockholder approval and that could be issued with voting or other rights or preferences that could impede a takeover attempt; and\n•require the approval by holders of at least 66 2/3% of our outstanding common stock to amend any of these provisions in our certificate of incorporation or by-laws.\nAlthough we believe these provisions make a higher third-party bid more likely by requiring potential acquirers to negotiate with our board of directors, these provisions apply even if an initial offer may be considered beneficial by some stockholders. Any delay or prevention of an acquisition of our Company that would have been beneficial to our stockholders could materially decrease the value of our common stock.",
    "item_1B": "Item 1B. Unresolved Staff Comments\nNone.",
    "item_1C": "",
    "item_2": "Item 2. Properties\nOur corporate headquarters as well as certain design center and research and development operations are located in approximately 600,000 square feet of building space on property that we own in Phoenix, Arizona. We also own and lease properties around the world for use as sales offices, design centers, research and development labs, warehouses, logistic centers, trading offices and manufacturing support. The size and location of these properties, which are used by all of our reportable segments, change from time to time based on business requirements. We operate distribution centers, which are leased or contracted through a third-party, in locations throughout Asia, Europe and the Americas. See \"Business-Manufacturing Operations\" included elsewhere in this Form 10-K for information on properties used in our manufacturing operations. While these facilities are primarily used in manufacturing operations, they also include office, utility, laboratory, warehouse and unused space. Additionally, we own and lease research and development facilities located in Australia, Belgium, Canada, China, the Czech Republic, France, Germany, Hong Kong, India, Japan, Singapore, South Korea, Romania, Russia, the Slovak Republic, Switzerland, Taiwan, the United Kingdom and the United States. Our joint ventures in Leshan, China and in Aizuwakamatsu, Japan also own manufacturing, warehouse, laboratory, office and other unused space. We believe that our facilities around the world, whether owned or leased, are well-maintained.\nCertain of our properties are subject to encumbrances such as mortgages and liens. See Note 9: ''Long-Term Debt'' in the notes to our audited consolidated financial statements included elsewhere in this Form 10-K for further information. In addition, due to local law restrictions, the land upon which our facilities are located in certain foreign locations is subject to varying long-term leases.\nSee “Business-Manufacturing Operations\" and \"Sales, Marketing and Distribution” included elsewhere in this Form 10-K for\nfurther details on our properties and \"Business-Governmental Regulation\" for further details on environmental regulation of our properties.",
    "item_3": "Item 3. Legal Proceedings\nSee Note 13: ''Commitments and Contingencies'' under the heading “Legal Matters” in the notes to our audited consolidated financial statements included elsewhere in this Form 10-K for a description of legal proceedings and related matters.",
    "item_4": "Item 4. Mine Safety Disclosure\nNot applicable.\nPART II",
    "item_5": "Item 5. Market for Registrant's Common Equity, Related Stockholder Matters and Issuer Purchases of Equity Securities\nOur common stock is traded under the symbol “ON” on the Nasdaq Global Select Market. The stock price details can be obtained from the Nasdaq website at www.nasdaq.com. As of February 13, 2020, there were approximately 222 holders of record of our common stock and 411,065,636 shares of common stock outstanding.\nWe have neither declared nor paid any cash dividends on our common stock since our initial public offering. Our future dividend policy with respect to our common stock will depend upon our earnings, capital requirements, financial condition, debt restrictions and other factors deemed relevant by our board of directors in its sole discretion.\nOur outstanding debt facilities may limit the amount of dividends we are permitted to pay and the amount we are permitted to buy back shares under the 2018 Share Repurchase Program (as defined below). So long as no default has occurred and is continuing or results therefrom, our Amended Credit Agreement permits us to pay cash dividends to our common stockholders, buy back shares under the 2018 Share Repurchase Program, or a combination thereof, in an amount up to $100.0 million. Additionally, we may pay dividends and buy back shares under the 2018 Share Repurchase Program in an unlimited amount so long as, after giving effect thereto, the consolidated total net leverage ratio (calculated in accordance with our Amended Credit Agreement) does not exceed 2.50 to 1.00. See Note 9: ''Long-Term Debt'' in the notes to the audited consolidated financial statements included elsewhere in this Form 10-K for further discussion of our Amended Credit Agreement.\nIssuer Purchases of Equity Securities\nThe following table provides information regarding repurchases of our common stock during the quarter ended December 31, 2019:\n(1) These time periods represent our fiscal month start and end dates for the fourth quarter of 2019.\n(2) The number of shares purchased represents shares of common stock held by employees who tendered owned shares of common stock to the Company to satisfy the employee withholding taxes due upon the vesting of RSUs.\n(3) The price per share is based on the fair market value at the time of tender or repurchase, respectively.\n(4) On November 15, 2018, we announced a new share repurchase program pursuant to the Capital Allocation Policy (the “2018 Share Repurchase Program” for up to $1.5 billion of our common stock, effective from December 1, 2018, exclusive of any fees, commissions or other expenses. The 2018 Share Repurchase Program expires on December 31, 2022.\nShare Repurchase Program\nWe repurchased approximately 7.8 million shares of common stock for $138.9 million under the 2018 Share Repurchase Program during the year ended December 31, 2019. Of the total amount authorized, $1,361.1 million remained unutilized as of December 31, 2019.\nUnder the 2018 Share Repurchase Program, we may repurchase up to $1.5 billion (exclusive of fees, commissions and other expenses) of our common stock from December 1, 2018 through December 31, 2022, subject to certain contingencies. We may repurchase our common stock from time to time in privately negotiated transactions or open market transactions, including pursuant to a trading plan in accordance with Rule 10b5-1 and Rule 10b-18 of the Exchange Act, or by any combination of such methods or other methods. The timing of any repurchases and the actual number of shares repurchased will depend on a variety of factors, including our stock price, corporate and regulatory requirements, restrictions under our debt obligations, other market and economic conditions. The 2018 Share Repurchase Program does not require us to purchase any particular amount of common stock and is subject to a variety of factors including the Board’s discretion.\nSee Note 10: ''Earnings Per Share and Equity'' of the notes to our audited consolidated financial statements included elsewhere in this Form 10-K for further information on shares of common stock tendered to the Company by employees to satisfy applicable employee withholding taxes due upon vesting of RSUs and the 2018 Share Repurchase Program.",
    "item_6": "Item 6. Selected Financial Data\nThe following table sets forth certain of our selected financial data for the periods indicated. The statement of operations and balance sheet data set forth below are derived from our audited consolidated financial statements. The table below includes consolidated results, including our recent acquisitions, thus comparability will be materially affected. See Note 4: ''Recent Accounting Pronouncements'', Note 5: ''Acquisitions, Divestitures and Licensing Transactions'' and Note 13: ''Commitments and Contingencies'' in the notes to our audited consolidated financial statements included elsewhere in this Form 10-K for further information.\nYou should read this information in conjunction with \"Management's Discussion and Analysis of Financial Condition and Results of Operations\" and our audited consolidated financial statements, including the notes thereto, included elsewhere in this Form 10-K.\n_______________________\n(1)Increased in 2016 primarily due to the acquisition of Fairchild.",
    "item_7": "Item 7. Management’s Discussion and Analysis of Financial Condition and Results of Operations\nYou should read the following discussion in conjunction with our audited historical consolidated financial statements, including the notes thereto, which are included elsewhere in this Form 10-K. Management's Discussion and Analysis of Financial Condition and Results of Operations contains statements that are forward-looking. These statements are based on current expectations and assumptions that are subject to risk, uncertainties, and other factors. Actual results could differ materially because of the factors discussed in \"Risk Factors\" included elsewhere in this Form 10-K.\nExecutive Overview\nThis executive overview presents summarized information regarding our industry, markets, business, and operating trends only. For further information relating to the information summarized herein, see \"Management's Discussion and Analysis of Financial Condition and Results of Operations\" in its entirety.\nIndustry Overview\nAccording to WSTS (an industry research firm), worldwide semiconductor industry sales were $412.1 billion in 2019, a decrease of approximately 12.1% from $468.8 billion in 2018. We participate in unit and revenue surveys and use data summarized by WSTS to evaluate overall semiconductor market trends and to track our progress against the market in the areas we provide semiconductor components. The following table sets forth total worldwide semiconductor industry revenue since 2015:\n_______________________\n(1)Based on shipment information published by WSTS. We believe the data provided by WSTS is reliable, but we have not independently verified it. WSTS periodically revises its information. We assume no obligation to update such information.\nAs indicated above, worldwide semiconductor sales increased from $335.2 billion in 2015 to $412.1 billion in 2019. The decrease of 12.1% from 2018 to 2019 was the result of decreased demand for semiconductor products. Our revenue decreased by $360.4 million, or 6.1%, from 2018 to 2019.\nON Semiconductor Overview\nOur new product development efforts continue to be focused on building solutions in product areas that appeal to customers in focused market segments and across multiple high-growth applications. We collaborate with our customers to identify desired innovations in electronic systems in each end-market that we serve. This enables us to participate in the fastest growing sectors of the market. We also innovate in advanced packaging technologies to support ongoing size reduction in electronic systems and in advanced thermal packaging to support high performance power conversion applications. It is our practice to regularly re-evaluate our research and development spending, to assess the deployment of resources and to review the funding of high-growth technologies. We deploy people and capital with the goal of maximizing our investment in research and development in order to facilitate continued growth by targeting innovative products and solutions for high growth applications that position us to outperform the industry. Our design expertise in analog, digital, mixed signal and imaging ICs, combined with our extensive portfolio of standard products enable the company to offer comprehensive, value-added solutions to our global customers for their electronics systems.\nWe believe that some of the key factors and trends affecting our current and future results of operations include, but not limited to:\n•Macroeconomic conditions affecting the semiconductor industry;\n•The cyclicality and seasonality of the semiconductor industry;\n•The global economic climate;\n•Our significant indebtedness, including the indebtedness incurred for the acquisition of Fairchild and Quantenna;\n•The impact of U.S. corporate tax reform and an uncertain corporate tax environment abroad;\n•An uncertain political climate and related impacts on global trade, such as tariffs on imports into the U.S. from China;\n•The effects of trends in the automotive and industrial end-markets on our revenue;\n•Competitive conditions, and in particular, consolidation, within our industry; and\n•Underutilization of installed capacity and competitive pricing environment.\nAcquisition of Quantenna\nOn June 19, 2019, we completed our acquisition of Quantenna pursuant to the definitive Agreement and Plan of Merger with each of Quantenna and Raptor Operations Sub, Inc., our wholly-owned subsidiary (“Raptor”), which provided for the merger of Quantenna with Raptor, whereby Quantenna continued as the surviving corporation and our wholly-owned subsidiary. Following the acquisition, Quantenna changed its name to ON Semiconductor Connectivity Solutions, Inc. The purchase price totaled $1,039.3 million, of which $1,026.6 million was paid through December 31, 2019, with the proceeds from a $900.0 million draw against our Revolving Credit Facility and cash on hand. We believe the acquisition of Quantenna creates a strong platform for addressing connectivity solutions for industrial IoT by combining our expertise in power management and bluetooth technologies with Quantenna's Wi-Fi technologies and software capabilities.\nRecent ON Semiconductor Results\nOur total revenue for the year ended December 31, 2019 was $5,517.9 million, a decrease of 6.1% from $5,878.3 million from the year ended December 31, 2018. The decrease was primarily attributable to reduced demand for our products across PSG, ASG and ISG. During 2019, we reported net income attributable to ON Semiconductor of $211.7 million compared to $627.4 million in 2018. The decrease was primarily due to the impact of reduced demand and a one-time litigation settlement charge. Our gross margin decreased by approximately 230 basis points to 35.8% in 2019 from 38.1% in 2018. The decrease in gross margin was primarily due to a competitive pricing environment and decreased demand for our products.\nBusiness and Macroeconomic Environment Influence on Cost Savings and Restructuring Activities\nThe semiconductor industry has traditionally been highly cyclical, has often experienced significant downturns in connection with, or in anticipation of, declines in general economic conditions, and may experience significant uncertainty and volatility in the future. We believe our business today is driven more by secular growth drivers and not solely by macroeconomic and industry cyclicality, as was the case historically. As experienced in 2019, we could again experience period-to-period fluctuations in operating results due to general industry or economic conditions.\nDuring the year ended December 31, 2019, geopolitical and macroeconomic factors continued to adversely impact product demand in the semiconductor industry. In light of these factors, we expect that such demand for our products could be adversely affected in the short-term. We also believe, however, that secular megatrends in the automotive, industrial, and cloud-power end-markets will continue to drive long-term growth in the semiconductor industry.\nIn response to the above industry trends, we are investing and taking other measures to further strengthen our position in the automotive, industrial, and cloud-power end-markets. In an effort to mitigate adverse demand trends in the semiconductor industry, we have historically pursued, and expect to continue to pursue, cost-saving initiatives to align our overall cost structure, capital investments and other expenditures with our expected revenue, spending and capacity levels based on our current sales and manufacturing projections. We have recognized efficiencies from previously implemented restructuring activities and programs and continue to implement profitability enhancement programs to improve our cost structure. We have historically taken significant actions to align our overall cost structure with our expectations of market conditions by focusing on synergies-related cost reductions arising from each of our acquisitions. However, there can be no assurances that we will adequately forecast economic conditions or that we will effectively align our cost structure, capital investments and other expenditures with our revenue, spending and capacity levels in the future.\nSee Note 7: ''Restructuring, Asset Impairments and Other Charges, net'' in the notes to our audited consolidated financial statements included elsewhere in this Form 10-K for information relating to our most recent cost-saving initiatives.\nResults of Operations\nOur results of operations for the year ended December 31, 2019 includes the partial year results from Quantenna, which we acquired on June 19, 2019.\nFor a discussion and comparison of the results of our operations for the year ended December 31, 2018 with the year ended December 31, 2017, refer to \"Management's Discussion and Analysis of Financial Conditions and Results of Operations\" in our Form 10-K for the year ended December 31, 2018 filed with the SEC on February 20, 2019.\nOperating Results\nThe following table summarizes certain information relating to our operating results that has been derived from our audited consolidated financial statements (in millions):\nRevenue\nRevenue was $5,517.9 million and $5,878.3 million for 2019 and 2018, respectively. The decrease of $360.4 million, or 6.1% was primarily attributable to an 8.2%, 4.8% and 1.5% decrease in revenue in PSG, ASG and ISG, respectively, which is further explained below.\nRevenue by reportable segment for each were as follows (dollars in millions):\n_______________________\n(1) Certain of the amounts may not total due to rounding of individual amounts.\nRevenue from PSG\nRevenue from PSG decreased by $249.9 million, or approximately 8%, which was due to a combination of a decrease in volume of products sold and a competitive pricing environment. The revenue in our Protection and Signal Division, Integrated Circuits Division, and High Power Division, decreased by $106.5 million, $96.6 million and $91.5 million, respectively. This was partially offset by an increase in revenue of $30.1 million and $15.0 million from our Foundry Services and Power Mosfet Division, respectively.\nRevenue from ASG\nRevenue from ASG decreased by $98.9 million, or approximately 5%, which was also due to a combination of a decrease in volume of products sold and a competitive pricing environment. The revenue in our Industrial and Offline Power Division and our Signal Processing, Wireless and Medical Division, decreased by $100.5 million and $56.4 million, respectively. This was partially offset by $84.8 million of revenue from Quantenna, which was acquired during 2019.\nRevenue from ISG\nRevenue from ISG decreased by $11.6 million, or 1.5%, which was due to a decrease in our Industrial Sensing Division revenue of $20.8 million, primarily due to decreased demand, which was partially offset by an increase in revenue in other divisions.\nRevenue by Geographic Location\nRevenue by geographic location, including local sales made by operations within each area, based on sales billed from the respective country, are as follows (dollars in millions):\n_______________________\n(1) Certain of the amounts may not total due to rounding of individual amounts.\nGross Profit and Gross Margin (exclusive of amortization of acquisition-related intangible assets described below)\nOur gross profit by reportable segment was as follows (dollars in millions):\n_______________________\n(1) Certain of the amounts may not total due to rounding of individual amounts.\n(2) Unallocated manufacturing costs are presented as a percentage of total revenue (includes expensing of the fair market value step-up of inventory of $19.6 million during 2019 and $1.0 million during 2018).\nThe decrease in gross profit of $265.1 million, or approximately 12%, was primarily due to the impact of the decrease in sales volume, higher fixed costs due to the expansion in our manufacturing capacity as well as the expensing of $19.6 million excess over book value of inventory, commonly referred to as the fair market value step-up, from the Quantenna acquisition.\nGross margin decreased to 35.8% during 2019 compared to 38.1% during 2018. The decrease was due to a competitive pricing environment resulting in a decline in average selling prices, higher demand for lower margin products, increased manufacturing costs due to a higher mix of external manufacturing and decreased demand for our products, as explained in the revenue section.\nOperating Expenses\nResearch and Development\nResearch and development expenses were $640.9 million and $650.7 million for 2019 and 2018, respectively, representing approximately 12% of revenue in 2019 and 11% of revenue for 2018. The decrease in research and development expenses of $9.8 million, or approximately 2%, was primarily related to a decrease in variable compensation in 2019, which was partially offset by expenses in Quantenna.\nSelling and Marketing\nSelling and marketing expenses were $301.0 million and $324.7 million for 2019 and 2018, respectively, representing approximately 5% of revenue in 2019 and 6% of revenue in 2018. The decrease in selling and marketing expenses of $23.7 million, or approximately 7%, was primarily related to a decrease in variable compensation in 2019, which was partially offset by expenses in Quantenna.\nGeneral and Administrative\nGeneral and administrative expenses were $284.0 million and $293.3 million, representing approximately 5%, of revenue for 2019 and 2018, respectively. The decrease in general and administrative expenses of $9.3 million, or approximately 3%, was due to a decrease in variable compensation in 2019, which was partially offset by an increase in acquisition-related expenses and the expenses in Quantenna.\nLitigation Settlement\nLitigation settlement expense was $169.5 million for 2019, compared to zero for 2018. On October 19, 2019, we entered into the Settlement Agreement with PI pursuant to which the parties agreed to withdraw all outstanding legal and administrative disputes. Pursuant to the Settlement Agreement, we paid PI $175.0 million in cash on October 22, 2019, of which $5.5 million was previously accrued.\nAmortization of Acquisition-Related Intangible Assets\nAmortization of acquisition-related intangible assets was $115.2 million and $111.7 million for 2019 and 2018, respectively. The increase of $3.5 million, or approximately 3%, during 2019 compared to 2018 was primarily due to the amortization of our technology-related intangible assets acquired from the SensL acquisition, which began in 2019, along with the amortization of intangible assets acquired from Quantenna.\nSee Note 5: ''Acquisitions, Divestitures and Licensing Transactions'' and Note 6: ''Goodwill and Intangible Assets'' in the notes to our audited consolidated financial statements included elsewhere in this Form 10-K for additional information with respect to the acquired intangible assets.\nRestructuring, Asset Impairments and Other Charges, Net\nRestructuring, asset impairments and other charges, net was $28.7 million and $4.3 million for 2019 and 2018, respectively. The information below summarizes the major activities in each year.\nDuring 2019, we recorded $28.7 million of restructuring charges primarily related to the post-Quantenna acquisition related restructuring program as well as certain restructuring actions undertaken by us aimed at cost savings, primarily through workforce reductions.\nDuring 2018, we recorded approximately $4.3 million of net charges attributable to the asset impairments and severance charges relating to the restructuring programs in effect during the period, offset by gain on sale of certain assets.\nFor additional information, see Note 7: ''Restructuring, Asset Impairments and Other Charges, net'' in the notes to our audited consolidated financial statements included elsewhere in this Form 10-K.\nGoodwill and Intangible Asset Impairment\nGoodwill and intangible asset impairments were $1.6 million and $6.8 million for 2019 and 2018, respectively. The information below summarizes the major activities in each year.\nDuring 2019, we abandoned two of our previously capitalized IPRD projects and recorded intangible asset impairment charges of $1.6 million.\nDuring 2018, we recorded $3.3 million of goodwill impairment charges and $3.5 million relating to the impairment in the value of one project as a result of the indefinite-lived impairment test performed during the fourth quarter of 2018.\nSee Note 6: ''Goodwill and Intangible Assets'' in the notes to our audited consolidated financial statements included elsewhere in this Form 10-K for additional information.\nOther Income and Expenses\nInterest Expense\nInterest expense increased by $20.1 million, or approximately 16%, to $148.3 million during 2019 compared to $128.2 million in 2018, primarily due to an increase in the outstanding long-term debt balance incurred relating to the acquisition of Quantenna. We recorded amortization of debt discount to interest expense of $37.8 million and $36.1 million for 2019 and 2018, respectively. Our average gross amount of long-term debt balance (including current maturities) during 2019 and 2018 was $3,344.1 million and $3,057.0 million, respectively. Our weighted average interest rate on our gross amount of long-term\ndebt (including current maturities) was 4.4% and 4.2% per annum in 2019 and 2018, respectively. See “Liquidity and Capital Resources-Key Financing and Capital Events” below and Note 9: ''Long-Term Debt'' in the notes to our audited consolidated financial statements included elsewhere in this Form 10-K for a description of our indebtedness and our refinancing activities.\nLoss on Debt Refinancing and Prepayment\nLoss on debt refinancing and prepayment increased by $1.6 million, or approximately 35%, from $4.6 million in 2018 to $6.2 million in 2019. During 2019, we recorded a loss on debt refinancing and prepayment of $5.8 million related to the Seventh Amendment and $0.4 million related to the Fifth Amendment.\nWe recorded a debt extinguishment charge of $2.6 million related to refinancing of the Term Loan \"B\" Facility and expensed $2.0 million of unamortized debt discount and issuance costs attributable to the partial pay-down of the Term Loan \"B\" Facility during 2018.\nSee Note 9: ''Long-Term Debt'' in the notes to our audited consolidated financial statements included elsewhere in this Form 10-K for additional information.\nGain on Divestiture of Business\nGain on divestiture of business was zero in 2019, compared to $5.0 million for 2018. During 2018, we divested the transient voltage suppressing diodes business we acquired from Fairchild to TSC America, Inc. and recorded a gain of $4.6 million. For additional information, see Note 5: ''Acquisitions, Divestitures and Licensing Transactions'' in the notes to our audited consolidated financial statements included elsewhere in this Form 10-K.\nLicensing Income\nLicensing income was zero in 2019 compared to $36.6 million for 2018. The 2018 licensing income was primarily due to the achievement of the established criteria based on which income was recognized under the various licensing agreements. We completed recognizing all licensing income under existing agreements as of December 31, 2018.\nSee Note 5: ''Acquisitions, Divestitures and Licensing Transactions'' in the notes to our audited consolidated financial statements included elsewhere in this Form 10-K for more information.\nOther Income (Expense)\nOther expense increased by $4.7 million, or approximately 66%, from expense of $7.1 million in 2018 to expense of $11.8 million in 2019. The increase in other expense is attributed to an increase in recognized actuarial loss of $9.8 million, which was partially offset by $7.8 million of indemnification gain relating to the resolution of a foreign tax dispute and other IP related claims recognized in 2019.\nIncome Tax Provision\nWe recorded an income tax provision of $62.7 million and $125.1 million in 2019 and 2018, respectively.\nThe income tax provision for the year ended December 31, 2019 consisted primarily of $66.4 million for income and withholding taxes of certain of our foreign and domestic operations, $6.0 million relating to the resolution of a foreign tax dispute and $3.3 million of new reserves and interest on existing reserves for uncertain tax positions in foreign jurisdictions and $2.1 million of prior year adjustments. These amounts were offset by discrete benefits of $9.2 million relating to the release of reserves and interest for uncertain tax positions in foreign jurisdictions related to prior years and $5.9 million relating to equity award excess tax benefits.\nThe income tax provision for the year ended December 31, 2018 consisted primarily of $180.0 million for income and withholding taxes of certain of our foreign and domestic current year operations and $35.2 million related to the finalization of the Company's tax impacts of U.S. tax reform. These expenses were offset by a one-time benefit of $48.2 million related to U.S. tax method changes made during the year that impacted the Company’s Global Intangible Low Tax Income (“GILTI”) inclusion, a benefit of $17.1 million relating to an increase in deferred tax assets expected to be realized in the foreseeable future due to the liquidation of a foreign subsidiary, a benefit of $14.0 million relating to the lapse of the statute of limitations on certain unrecognized tax benefits, a benefit of $7.6 million relating to equity award excess tax benefits and a benefit of $3.2 million relating to changes in valuation allowance.\nIn line with the OECD’s BEPS conclusions and changes to tax laws in the United States and certain countries in the European Union, we are considering simplifying our corporate structure by repatriating the economic rights to our intellectual property to the United States during the second half of 2020. The impact of such repatriation may have a material impact on our 2020 effective tax rate.\nWe expect our effective tax rate, before discrete items or the impact mentioned above from the proposed repatriation of the economic rights to our intellectual property, to be between 22% and 26% until we fully utilize all of our U.S. federal net operating losses. The primary difference between our effective tax rate and the federal statutory rate of 21% is due to foreign taxes for which the Company will not receive a U.S. tax credit as a result of U.S. tax reform until our U.S. federal net operating losses are fully utilized. Once our U.S. federal net operating losses are fully utilized, we expect our future effective tax rate, before discrete items, to approximate, or be lower than, the federal statutory rate of 21%. We anticipate our U.S. federal net operating losses and credits will be substantially utilized by 2021.\nOur cash tax, as a percentage of income before income taxes (“Cash Tax Rate”), has historically been significantly lower than our effective tax rate due to the current utilization of our U.S. federal net operating losses and credits. During 2019, our Cash Tax Rate approximated our effective tax rate primarily due to the litigation settlement with PI. We expect our future Cash Tax Rate to be lower than our effective tax rate until our U.S. federal net operating losses and credits are fully utilized.\nWe continue to maintain a full valuation allowance on our U.S. state deferred tax assets and a valuation allowance on foreign net operating losses and tax credits in certain other foreign jurisdictions, a substantial portion of which relate to Japan net operating losses which are projected to expire prior to utilization.\nFor additional information, see Note 16: ''Income Taxes'' in the notes to the audited consolidated financial statements included elsewhere in this Form 10-K.\nLiquidity and Capital Resources\nThis section includes a discussion and analysis of our cash requirements, off-balance sheet arrangements, contingencies, sources and uses of cash, operations, working capital and long-term assets and liabilities.\nContractual Obligations\nOur principal outstanding contractual obligations relate to our long-term debt, operating leases and purchase obligations. The following table summarizes our contractual obligations at December 31, 2019 and the effect such obligations are expected to have on our liquidity and cash flow in the future (in millions):\n_______________________\n(1)The table above excludes approximately $28.1 million of liabilities related to unrecognized tax benefits because we are unable to reasonably estimate the timing of the settlement of such liabilities.\n(2)Includes interest payments at applicable rates as of December 31, 2019.\n(3)These represent our off-balance sheet arrangements (See “Liquidity and Capital Resources-Off-Balance Sheet Arrangements” for a description of our off-balance sheet arrangements).\n(4)During 2019, we incurred additional commitments of $330.0 million relating to the pending acquisition of a manufacturing facility which is included in the contractual obligations table. See Note 5: ''Acquisitions, Divestitures and Licensing Transactions'' in the notes to our audited consolidated financial statements included elsewhere in this Form 10-K for more information.\nThe table also excludes our pension obligations. We expect to make cash contributions to comply with local funding requirements and required benefit payments of approximately $17.3 million and $5.0 million, respectively, in 2020. This future payment estimate assumes we continue to meet our statutory funding requirements. The timing and amount of contributions may be impacted by a number of factors, including the funded status of the plans. Beyond 2020, the actual amounts required to be contributed are dependent upon, among other things, interest rates, underlying asset returns and the impact of legislative or regulatory actions related to pension funding obligations. See Note 12: ''Employee Benefit Plans'' in the notes to our audited consolidated financial statements included elsewhere in this Form 10-K for more information on our pension obligations.\nOur balance of cash and cash equivalents was $894.2 million as of December 31, 2019. We believe that our cash flows from operations, coupled with our existing cash and cash equivalents, and cash available from our Revolving Credit Facility, will be adequate to fund our operating and capital needs for at least the next 12 months. Total cash and cash equivalents at December 31, 2019 include approximately $371.9 million available in the United States. We require a substantial amount of cash in the United States for operating requirements, debt service, debt repayments and acquisitions. While we hold a significant amount of cash and cash equivalents outside the United States in various foreign subsidiaries, we have the ability to obtain cash in the United States in order to cover our domestic needs, through distributions from our foreign subsidiaries, by utilizing existing credit facilities or through new bank loans or debt obligations.\nSee Note 9: ''Long-Term Debt,'' in the notes to our audited consolidated financial statements included elsewhere in this Form 10-K for a discussion of our long-term debt. See \"Market for Registrant's Common Equity, Related Stockholder Matters and Issuer Purchases of Equity Securities\" included elsewhere in this Form 10-K for a discussion of restrictions on our ability to pay dividends and our stock repurchase activities.\nOff-Balance Sheet Arrangements\nIn the ordinary course of business, we provide standby letters of credit or other guarantee instruments to certain parties in connection with certain transactions including, but not limited to: material purchase commitments, agreements to mitigate collection risk, leases, utilities or customs guarantees. As of December 31, 2019, our Revolving Credit Facility included $15.0 million of availability for the issuance of letters of credit. There were $1.0 million letters of credit outstanding under our Revolving Credit Facility as of December 31, 2019, which reduces our borrowing capacity dollar-for-dollar. As of December 31, 2019, we also had outstanding guarantees and letters of credit outside of our Revolving Credit Facility in the amount of $11.7 million.\nAs part of securing financing in the ordinary course of business, we issued guarantees related to certain of our subsidiaries' finance lease obligations, equipment financing, lines of credit and real estate mortgages, which totaled $1.8 million as of December 31, 2019. Based on historical experience and information currently available, we believe that we will not be required to make payments under the standby letters of credit or guarantee arrangements for the foreseeable future.\nWe have not recorded any liability in connection with these letters of credit and guarantee arrangements. See Note 9: ''Long-Term Debt,'' and Note 13: ''Commitments and Contingencies'' in the notes to our audited consolidated financial statements found elsewhere in this Form 10-K for additional information.\nContingencies\nWe are a party to a variety of agreements entered into in the ordinary course of business pursuant to which we may be obligated to indemnify other parties for certain liabilities that arise out of or relate to the subject matter of the agreements. Some of the agreements entered into by us require us to indemnify the other party against losses due to IP infringement, environmental contamination and other property damage, personal injury, our failure to comply with applicable laws, our negligence or willful misconduct or our breach of representations, warranties or covenants related to such matters as title to sold assets.\nWe face risk of exposure to warranty and product liability claims in the event that our products fail to perform as expected or such failure of our products results, or is alleged to result, in economic damage, bodily injury or property damage. In addition, if any of our designed products are alleged to be defective, we may be required to participate in their recall. Depending on the significance of any particular customer and other relevant factors, we may agree to provide more favorable rights to such customer for valid defective product claims.\nWe maintain directors’ and officers’ insurance policies that indemnify our directors and officers against various liabilities, including certain liabilities under the Exchange Act, that might be incurred by any director or officer in his or her capacity as such.\nThe Fairchild acquisition agreement provides for indemnification and insurance rights in favor of Fairchild’s then current and former directors, officers and employees. Specifically, we have agreed that, for no fewer than six years following the Fairchild acquisition, we will: (a) indemnify and hold harmless each such indemnitee against losses and expenses (including advancement of attorneys’ fees and expenses) in connection with any proceeding asserted against the indemnified party in connection with such person’s servings as a director, officer, employee or other fiduciary of Fairchild or its subsidiaries prior to the effective time of the acquisition; (b) maintain in effect all provisions of the certificate of incorporation or bylaws of Fairchild or any of its subsidiaries or any other agreements of Fairchild or any of its subsidiaries with any indemnified party regarding elimination of liability, indemnification of officers, directors and employees and advancement of expenses in existence on the date of the Fairchild Agreement for acts or omissions occurring prior to the effective time of the acquisition and; (c) subject to certain qualifications, provide to Fairchild’s then current directors and officers an insurance and indemnification policy that provides coverage for events occurring prior to the effective time of the acquisition that is no less favorable than Fairchild’s then-existing policy, or, if insurance coverage that is no less favorable is unavailable, the best available coverage.\nSimilarly, the Quantenna Agreement provides for indemnification and insurance rights in favor of Quantenna’s then current and former directors, officers, employees and agents. Specifically, the Company has agreed that, for no fewer than six years following the Quantenna acquisition, the Company will: (a) indemnify and hold harmless each such indemnified party to the fullest extent permitted by Delaware law in the event of any threatened or actual claim suit, action, proceeding or investigation against the indemnified party based in whole or in part on, or pertaining to, such person’s serving as a director, officer, employee or agent of Quantenna or its subsidiaries or predecessors prior to the effective time of the acquisition or in connection with the Quantenna Agreement; (b) maintain in effect provisions of the certificate of incorporation and bylaws of Quantenna and each of its subsidiaries regarding the elimination of liability of directors and indemnification of officers, directors and\nemployees that are no less advantageous to the intended beneficiaries than the corresponding provisions in the certificate of incorporation and bylaws of Quantenna and each of its subsidiaries in existence on the date of the Quantenna Agreement; and (c) obtain and fully pay the premium for a non-cancelable extension of directors’ and officers’ liability coverage of Quantenna’s directors’ and officers’ policies and Quantenna’s fiduciary liability insurance policies in effect as of the date of the Quantenna Agreement.\nWhile our future obligations under certain agreements may contain limitations on liability for indemnification, other agreements do not contain such limitations and under such agreements it is not possible to predict the maximum potential amount of future payments due to the conditional nature of our obligations and the unique facts and circumstances involved in each particular agreement. Historically, payments made by us under any of these indemnities have not had a material effect on our business, financial condition, results of operations or cash flows, and we do not believe that any amounts that we may be required to pay under these indemnities in the future will be material to our business, financial condition, results of operations or cash flows.\nSee \"Legal Proceedings\" and Note 13: ''Commitments and Contingencies'' in the notes to our audited consolidated financial statements included elsewhere in this Form 10-K for possible contingencies related to legal matters. See also \"Business-Government Regulation\" for information on certain environmental matters.\nSources and Uses of Cash\nWe require cash to fund our operating expenses and working capital requirements, including outlays for strategic acquisitions and investments, for research and development, to make capital expenditures, to repurchase our common stock and other Company securities, and to pay debt service, including principal and interest and finance lease payments. We expect interest expense to remain significant in future periods as we continue to service our debt. Our principal sources of liquidity are cash on hand, cash generated from operations and funds from external borrowings and equity issuances. In the near term, we expect to fund our primary cash requirements through cash generated from operations and with cash and cash equivalents on hand. We also have the ability to utilize our Revolving Credit Facility.\nAs part of our business strategy, we review acquisition and divestiture opportunities and proposals on a regular basis. During 2019, we completed the acquisition of Quantenna. See Note 5: ''Acquisitions, Divestitures and Licensing Transactions'' in the notes to our audited consolidated financial statements included elsewhere in this Form 10-K for additional information.\nWe believe that the key factors that could affect our internal and external sources of cash include:\n•Factors that affect our results of operations and cash flows, including the impact on our business and operations as a result of changes in demand for our products, competitive pricing pressures, effective management of our manufacturing capacity, our ability to achieve further reductions in operating expenses, the impact of our restructuring programs on our production and cost efficiency and our ability to make the research and development expenditures required to remain competitive in our business; and\n•Factors that affect our access to bank financing and the debt and equity capital markets that could impair our ability to obtain needed financing on acceptable terms or to respond to business opportunities and developments as they arise, including interest rate fluctuations, macroeconomic conditions, sudden reductions in the general availability of lending from banks or the related increase in cost to obtain bank financing, and our ability to maintain compliance with covenants under our debt agreements in effect from time to time.\nOur ability to service our long-term debt, including our 1.625% Notes, 1.00% Notes, Revolving Credit Facility and Term Loan \"B\" Facility, to remain in compliance with the various covenants contained in our debt agreements and to fund working capital, capital expenditures and business development efforts will depend on our ability to generate cash from operating activities, which is subject to, among other things, our future operating performance, as well as to general economic, financial, competitive, legislative, regulatory and other conditions, some of which may be beyond our control.\nIf we fail to generate sufficient cash from operations, we may need to raise additional equity or borrow additional funds to achieve our longer term objectives. There can be no assurance that such equity or borrowings will be available or, if available, will be at rates or prices acceptable to us. We believe that cash flow from operating activities coupled with existing cash and cash equivalents and existing credit facilities will be adequate to fund our operating and capital needs, as well as enable us to maintain compliance with our various debt agreements, through at least the next 12 months. To the extent that results or events differ from our financial projections or business plans, our liquidity may be adversely impacted.\nDuring the ordinary course of business, we evaluate our cash requirements and, if necessary, adjust our expenditures for inventory, operating expenditures and capital expenditures to reflect the current market conditions and our projected sales and\ndemand. Our capital expenditures are primarily directed toward production equipment and capacity expansion. Our capital expenditure levels can materially influence our available cash for other initiatives. For example, during 2019, we paid approximately $534.6 million for capital expenditures, while in 2018 we paid approximately $514.8 million. While our capital expenditures have historically been approximately 6% to 7% of annual revenue, we incurred capital expenditures of approximately 10% and 9% of annual revenue in 2019 and 2018, respectively, and expect to incur capital expenditures of approximately 8% of revenue in 2020 to further improve our manufacturing cost structure. Future capital expenditures are expected to be lower, however, may be impacted by events and transactions that are not currently forecasted.\nOn March 31, 2017, we completed the private unregistered offering of $575.0 million aggregate principal amount of the 1.625% Notes, which amount includes the full exercise of the initial purchasers’ option to purchase additional 1.625% Notes. The net proceeds from the offering of the 1.625% Notes were used to repay $562.1 million of borrowings outstanding under the Term Loan “B” Facility.\nOn November 30, 2017, we entered into the Third Amendment (as defined below) pursuant to which, among other things, we increased the amount that may be borrowed under the Revolving Credit Facility to $1.0 billion. In connection with the Third Amendment, we prepaid $400.0 million of borrowings under the Term Loan “B” Facility.\nOn June 12, 2019, the Company entered into the Fifth Amendment (as defined below) to the Amended Credit Agreement. The Fifth Amendment provided for, among other things, modifications to the Amended Credit Agreement to increase the amount that may be borrowed pursuant to the Revolving Credit Facility by $900.0 million to $1.9 billion. The $900.0 million was drawn to partially fund the acquisition of Quantenna on June 19, 2019.\nOn August 15, 2019, the Company entered into the Sixth Amendment (as defined below) to the Amended Credit Agreement, which increased amounts that may be borrowed under the Revolving Credit Facility by $70.0 million to $1.97 billion.\nOn September 19, 2019, the Company entered into the Seventh Amendment (as defined below) to the Amended Credit Agreement. The Seventh Amendment provided for, among other things, modifications to the Amended Credit Agreement to increase the amount that may be borrowed pursuant to the Term Loan “B” Facility by approximately $500.5 million, up to an aggregate principal amount of $1.635 billion. We utilized the additional borrowings under the Term Loan \"B\" Facility to repay $500.0 million of outstanding balance under the Revolving Credit Facility.\nAs of December 31, 2019, there was $1,630.9 million outstanding under the Term Loan “B” Facility and $800.0 million outstanding under the Revolving Credit Facility. The associated interest expense related to the Term Loan “B” Facility and Revolving Credit Facility has had, and will continue to have, a material impact on our results of operations throughout the term of the Amended Credit Agreement.\nDuring the year ended December 31, 2019, we repurchased 7.8 million shares of common stock worth approximately $138.9 million under the 2018 Share Repurchase Program.\nCash Management\nOur ability to manage cash is limited, as our primary cash inflows and outflows are dictated by the terms of our sales and supply agreements, contractual obligations, debt instruments and legal and regulatory requirements. While we have some flexibility with respect to the timing of capital equipment purchases, we must invest in capital equipment on a timely basis to allow us to maintain our manufacturing efficiency and support our platforms of new products.\nPrimary Cash Flow Sources\nOur long-term cash generation is dependent on the ability of our operations to generate cash. Our cash flows from operating activities were $694.7 million, $1,274.2 million, and $1,094.2 million for the years ended December 31, 2019, 2018 and 2017, respectively.\nOur cash flows provided by operating activities for the year ended December 31, 2019 decreased by $579.5 million, or 45.5%, compared to the year ended December 31, 2018. The decrease was primarily attributable to a reduction in net income resulting in lower cash flows, payment of variable compensation for prior year and litigation settlement payments. Our ability to maintain positive operating cash flows is dependent on, among other factors, our success in achieving our revenue goals and manufacturing and operating cost targets.\nOur management of our assets and liabilities, including both working capital and long-term assets and liabilities, also influences our operating cash flows, and each of these components is discussed below.\nWorking Capital\nWorking capital, calculated as total current assets less total current liabilities, fluctuates depending on end-market demand and our effective management of certain items such as receivables, inventory and payables. In times of escalating demand, our working capital requirements may be affected as we purchase additional manufacturing materials and increase production. Our working capital may also be affected by restructuring programs, which may require us to use cash for severance payments, asset transfers and contract termination costs. In addition, our working capital may be affected by acquisitions and transactions involving our convertible notes and other debt instruments. Our working capital, excluding cash and cash equivalents and the current portion of long-term debt, was $1,043.4 million as of December 31, 2019 and has fluctuated between $767.4 million and $1,043.4 million at the end of each of our last eight fiscal quarters. Our working capital, including cash and cash equivalents and the current portion of long-term debt, was $1,201.6 million as of December 31, 2019 and has fluctuated between $1,022.0 million and $1,797.4 million at the end of each of our last eight fiscal quarters.\nAlthough investments made to fund working capital will reduce our cash balances, these investments are necessary to support business and operating initiatives. For the year ended December 31, 2019, our working capital was most significantly impacted by our payments for variable compensation, litigation settlement payments and capital expenditures. See Note 9: ''Long-Term Debt'' and Note 10: ''Earnings Per Share and Equity'' in the notes to our audited consolidated financial statements included elsewhere in this Form 10-K for additional information.\nLong-Term Assets and Liabilities\nOur long-term assets consist primarily of property, plant and equipment, intangible assets, deferred taxes and goodwill.\nOur manufacturing rationalization plans have included efforts to utilize our existing manufacturing assets and supply arrangements more efficiently. We believe that near-term access to additional manufacturing capacity, should it be required, could be readily obtained on reasonable terms through manufacturing agreements with third parties. We will continue to look for opportunities to make strategic purchases in the future for additional capacity.\nOur long-term liabilities, excluding long-term debt and deferred taxes, consist of liabilities under our foreign defined benefit pension plans, operating lease liabilities and contingent tax reserves. In regard to our foreign defined benefit pension plans, our annual funding of these obligations is equal to the minimum amount legally required in each jurisdiction in which the plans operate. This annual amount is dependent upon numerous actuarial assumptions. For additional information, see Note 12: ''Employee Benefit Plans'', \"Note 8: ''Balance Sheet Information'' and Note 16: ''Income Taxes'' in the notes to our audited consolidated financial statements included elsewhere in this Form 10-K.\nKey Financing and Capital Events\nOverview\nFor the past several years, we have undertaken various measures to secure liquidity to pursue acquisitions, repurchase shares of our common stock, reduce interest costs, amend existing key financing arrangements and, in some cases, extend a portion of our debt maturities to continue to provide us additional operating flexibility. Certain of these measures continued in 2019. Set forth below is a summary of certain key financing events affecting our capital structure during the last three years. For further discussion of our debt instruments, see Note 9: ''Long-Term Debt'' and for further discussion on Share Repurchase Programs, see Note 10: ''Earnings Per Share and Equity'' in the notes to our audited consolidated financial statements included elsewhere in this Form 10-K.\nRecent Events\n2019 Financing Events\nAmendments to the Amended Credit Agreement\nOn June 12, 2019, the Company entered into the Fifth Amendment to the Amended Credit Agreement (the “Fifth Amendment”), with the subsidiary guarantors party thereto, Deutsche Bank AG New York Branch, as administrative agent, collateral agent and issuing lender, the “2019 Incremental Revolving Lenders” party thereto, and the “New Required Lenders” party thereto. The Fifth Amendment provided for, among other things, modifications to the Amended Credit Agreement to: (i) increase the amount that may be borrowed pursuant to the Revolving Credit Facility by $900.0 million to $1.9 billion; (ii) extend the maturity date of borrowings under the Revolving Credit Facility to the later of (x) December 30, 2022 or (y) June 12, 2024 so long as the borrowings under the Term Loan “B” Facility have been fully repaid or otherwise redeemed, discharged or defeased on or prior to December 30, 2022, or if the maturity date of borrowings under the Term Loan “B” Facility has been extended prior to December 30, 2022, to a date no earlier than June 12, 2024; and (iii) amend certain financial covenants, including deleting the minimum Interest Coverage Ratio and increasing the maximum Consolidated Total Net Leverage Ratio (as such terms are defined in the Amended Credit Agreement) from 4.00 to 1.00 to 4.50 to 1.00 during any period of four consecutive fiscal quarters commencing after a Permitted Acquisition (as defined in the Amended Credit Agreement) with consideration in excess of $250.0 million. On June 19, 2019, the Company drew $900.0 million of the Revolving Credit Facility to partially fund the acquisition of Quantenna.\nOn August 15, 2019, the Company entered into the Sixth Amendment to the Amended Credit Agreement (the “Sixth Amendment”), which increased amounts that may be borrowed under the Revolving Credit Facility by $70.0 million to $1.97 billion.\nOn September 19, 2019, the Company entered into the Seventh Amendment to the Amended Credit Agreement (the “Seventh Amendment”). The Seventh Amendment provided for, among other things, modifications to the Amended Credit Agreement to (i) increase the amount that may be borrowed pursuant to the Term Loan “B” Facility by approximately $500.5 million, up to an aggregate principal amount of $1.635 billion; (ii) extend the maturity date of borrowings under the Term Loan “B” Facility to September 19, 2026; (iii) for any interest period ending after the date of the Seventh Amendment, increase the interest rate for borrowings under the Term Loan “B” Facility to (a) with respect to eurocurrency loans, a base rate per annum equal to the Adjusted LIBO Rate (as defined in the Amended Credit Agreement) plus an applicable margin of 2.00% and (b) with respect to alternate base rate loans, a base rate per annum equal to the Alternate Base Rate (as defined in the Amended Credit Agreement) plus an applicable margin equal to 1.00%; and (iv) make certain amendments providing for the determination of an alternate interest rate to the Adjusted LIBO Rate and/or the LIBO Rate (as defined in the Amended Credit Agreement) in the event of certain circumstances that result in the inability to adequately and reasonably determine such rates or such rates no longer adequately and fairly reflecting the cost of the applicable loans. In addition, pursuant to the Fifth Amendment (defined above), as a result of the extension described in (ii) above, the maturity date of borrowings under the Revolving Credit Facility was extended to June 12, 2024.\nThe Company utilized the additional borrowings pursuant to the Seventh Amendment to repay $500.0 million of the outstanding balance under the Revolving Credit Facility.\nShare Repurchase Program\nDuring the year ended December 31, 2019, we repurchased 7.8 million shares of our common stock for an aggregate purchase\nprice of $138.9 million pursuant to the 2018 Share Repurchase Program.\n2018 Financing Events\nAmendments to the Amended Credit Agreement\nOn May 31, 2018, the Company, the Guarantors, the several lenders party thereto and the Agent entered into the Fourth Amendment to the Amended Credit Agreement (the “Fourth Amendment”). Pursuant to the Fourth Amendment, for any interest period ending after the date of the Fourth Amendment, Eurocurrency Loans will accrue interest at (i) a base rate per annum equal to the Adjusted LIBO Rate (as defined in the Amended Credit Agreement) plus (ii) an applicable margin equal to (x) 1.25% with respect to borrowings under the Revolving Credit Facility (with step-downs and step-ups as set forth in the Amended Credit Agreement) or (y) 1.75% with respect to borrowings under the Term Loan “B” Facility.\nPursuant to the Fourth Amendment, ABR Loans will accrue interest at (i) a base rate per annum equal to the highest of (x) the Federal funds rate plus 0.50%, (y) the prime commercial lending rate announced by the Agent from time to time as its prime lending rate and (z) the Adjusted LIBO Rate for a one month interest period (or if such day is not a business day, the immediately preceding business day) (determined after giving effect to any applicable “floor”) plus 1.00%; provided that, the Adjusted LIBO Rate for any day shall be based on the LIBO Rate (as defined in the Amended Credit Agreement), subject to the interest rate floors set forth in the Amended Credit Agreement, plus (ii) an applicable margin equal to (x) 0.25% with respect to borrowings under the Revolving Credit Facility (with step-ups as set forth in the Amended Credit Agreement) or (y) 0.75% with respect to borrowings under the Term Loan “B” Facility.\nDuring the year ended December 31, 2018 we prepaid $70.0 million of borrowings under the Term Loan “B” Facility.\nShare Repurchase Program\nDuring the year ended December 31, 2018, we repurchased 16.8 million shares of our common stock for an aggregate purchase price of $315.0 million under the 2014 Share Repurchase Program.\n2017 Financing Events\nAmendments to the Amended Credit Agreement\nOn April 15, 2016, we and the Guarantors entered into the Amended Credit Agreement. On March 31, 2017, we and the Guarantors entered into the Second Amendment to the Amended Credit Agreement (the \"Second Amendment\"), which among other things, reduced the interest rates payable under the Term Loan \"B\" Facility.\nOn November 30, 2017, we and the Guarantors entered into the Third Amendment to the Amended Credit Agreement (the “Third Amendment”). The Third Amendment provided for, among other things, modifications to the Amended Credit Agreement to reduce the interest rate payable under the Term Loan “B” Facility and to increase the amount that may be borrowed pursuant to the Revolving Credit Facility to $1.0 billion.\nIn connection with the Third Amendment, we prepaid $400.0 million of borrowings under the Term Loan “B” Facility, using the proceeds from the borrowings under the Revolving Credit Facility. Additionally, we also prepaid $200.0 million of borrowings under the Term Loan \"B\" Facility during 2017.\nIssuance of 1.625% Notes\nOn March 31, 2017, we completed a private placement of $575.0 million of our 1.625% Notes to qualified institutional buyers pursuant to Rule 144A under the Securities Act. The 1.625% Notes are governed by an indenture (the “1.625% Indenture”) between the Company, the guarantors party thereto, and Wells Fargo Bank, National Association, as trustee. The net proceeds from the offering of the 1.625% Notes were used to repay $562.1 million of borrowings outstanding under the Term Loan “B” Facility. The 1.625% Notes bear interest at the rate of 1.625% per year from the date of issuance, payable semiannually in arrears on April 15 and October 15 of each year, beginning on October 15, 2017. The 1.625% Notes are fully and unconditionally guaranteed, on a joint and several basis, by each of our subsidiaries that is a borrower or guarantor under our Amended Credit Agreement.\nShare Repurchase Program\nDuring the year ended December 31, 2017, we repurchased approximately 1.6 million shares of our common stock for an aggregate purchase price of $25.0 million pursuant to the 2014 Share Repurchase Program in connection with the offering of the 1.625% Notes.\nDebt Guarantees and Related Covenants\nAs of December 31, 2019, we were in compliance with the indentures relating to our 1.00% Notes and 1.625% Notes and with covenants relating to our Term Loan “B” Facility, Revolving Credit Facility and our other debt agreements. Our 1.00% Notes are senior to the existing and future subordinated indebtedness of ON Semiconductor and its guarantor subsidiaries. Our 1.625% Notes rank equally in right of payment to all of our existing and future senior debt and as unsecured obligations are subordinated to all of our existing and future secured debt. See Note 9: ''Long-Term Debt'' in the notes to our audited consolidated financial statements included elsewhere in this Form 10-K for additional information.\nCritical Accounting Policies and Estimates\nThe accompanying discussion and analysis of our financial condition and results of operations is based upon our audited consolidated financial statements, which have been prepared in accordance with accounting principles generally accepted in the United States. We believe certain of our accounting policies are critical to understanding our financial position and results of operations. We utilize the following critical accounting policies in the preparation of our financial statements.\nUse of Estimates. The preparation of financial statements in accordance with GAAP requires us to make estimates and assumptions that affect the reported amount of assets and liabilities at the date of the financial statements and the reported amount of revenue and expenses during the reporting period. We evaluate these estimates and judgments on an ongoing basis and base our estimates on experience, current and expected future conditions, third-party evaluations and various other assumptions that we believe are reasonable under the circumstances. Significant estimates have been used by management in conjunction with the following: (i) future payouts for customer incentives and amounts subject to allowances, returns and warranties; (ii) measurement of valuation allowances relating to inventories; (iii) assumptions used in business combinations; (iv) fair values of share-based compensation and (v) measurement of valuation allowances against deferred tax assets, and evaluations of unrecognized tax benefits. Additionally, during periods where it becomes applicable, significant estimates will be used by management in determining the future cash flows used to assess and test for impairment of goodwill, indefinite-lived intangible assets and long-lived assets. Actual results may differ from the estimates and assumptions used in the consolidated financial statements and related notes.\nRevenue. We generate revenue from sales of our semiconductor products to OEMs, electronic manufacturing service providers and distributors. We also generate revenue, to a much lesser extent, from product development agreements and manufacturing services provided to customers. We recognize revenue when we satisfy a performance obligation in an amount reflecting the consideration to which we expect to be entitled. For sales agreements, we have identified the promise to transfer products, each of which is distinct, to be the performance obligation. For product development agreements, we have identified the completion of a service defined in the agreement to be the performance obligation. We apply a five step approach in determining the amount and timing of revenue to be recognized: (1) identifying the contract with a customer; (2) identifying the performance obligations in the contract; (3) determining the transaction price; (4) allocating the transaction price to the performance obligations in the contract; and (5) recognizing revenue when the performance obligation is satisfied. We allocate the transaction price to each distinct product based on its relative stand-alone selling price. In determining the transaction price, we evaluate whether the price is subject to refund or adjustment to determine the net consideration to which we expect to be entitled. Substantially all of our revenue is recognized at the time control of the products transfers to the customer.\nSales to certain distributors, primarily those with ship and credit rights, can be subject to price adjustment on certain products. We develop an estimate of their expected claims under the ship and credit program based on the historical claims data submitted by product and customer and expected future claims, which requires the use of estimates and assumptions related to the amount of each claim as well as the historical period used to develop the estimate.\nOur OEM customers do not have the right to return products, other than pursuant to the provisions of the Company’s standard warranty. Sales to distributors, however, are typically made pursuant to agreements that provide return rights and stock rotation provisions permitting limited levels of product returns. Provisions for discounts and rebates to customers, estimated returns and allowances, ship and credit claims and other adjustments are provided for in the same period the related revenue are recognized, and are netted against revenue. For returns, we recognize a related asset for the right to recover returned products with a corresponding reduction to cost of goods sold. We record a reserve for cash discounts as a reduction to accounts receivable and\na reduction to revenue, based on the experience with each customer. Although payment terms vary, most distributor agreements require payment within 30 days. In addition, the Company offers cash discounts to certain customers for payments received within an agreed upon time, generally 10 days after shipment.\nInventories. We carry our inventories at the lower of standard cost (which approximates actual cost on a first-in, first-out basis) or net realizable value and record provisions for potential excess and obsolete inventories based upon a regular analysis of inventory on hand compared to historical and projected end-user demand. The determination of projected end-user demand requires the use of estimates and assumptions related to projected unit sales for each product. These provisions can influence our results from operations. For example, when demand falls for a given part, all or a portion of the related inventory that is considered to be in excess of anticipated demand is reserved, impacting our cost of revenue and gross profit. If demand recovers and the parts previously reserved are sold, we will generally recognize a higher than normal margin. However, the majority of product inventory that has been previously reserved is ultimately discarded. Although we do sell some products that have previously been written down, such sales have historically been relatively consistent over the period and the related impact on our margins has not been significant.\nShare-Based Compensation. We record compensation expense for all share-based payment awards including RSUs and ESPPs and measure them at the grant date, based on the estimated fair value of the award, recognized as an expense over the employee’s requisite service period. Determining the amount of share-based compensation to be recorded requires us to develop estimates to be used in calculating the grant-date fair value of the award. We calculate the grant-date fair value of the award using valuation models, which are based on historical information and judgment regarding market factors and trends. For the past several years, we have utilized RSUs as our primary equity incentive compensation for employees. We have outstanding awards with service, performance, and market-based vesting provisions.\nIncome Taxes. Income taxes are accounted for using the asset and liability method. Under this method, deferred income tax assets and liabilities are recognized for the future tax consequences attributable to temporary differences between the financial statement carrying amounts of existing assets and liabilities and their respective tax bases. Deferred income tax assets and liabilities are measured using enacted tax rates expected to apply to taxable income in the years in which these temporary differences are expected to be recovered or settled. The effect on deferred tax assets and liabilities of a change in tax rates is recognized in income in the period that includes the enactment date. A valuation allowance is provided for those deferred tax assets for which we cannot conclude that it is more likely than not that such deferred tax assets will be realized.\nIn determining the amount of the valuation allowance, estimated future taxable income, as well as feasible tax planning strategies for each taxing jurisdiction, are considered. If we determine it is more likely than not that all or a portion of the remaining deferred tax assets will not be realized, the valuation allowance will be increased with a charge to income tax expense. Conversely, if we determine it is more likely than not to be able to utilize all or a portion of the deferred tax assets for which a valuation allowance has been provided, the related portion of the valuation allowance will be recorded as a reduction to income tax expense.\nWe recognize and measure benefits for uncertain tax positions using a two-step approach. The first step is to evaluate the tax position taken or expected to be taken in a tax return by determining if the weight of available evidence indicates that is it more likely than not that the tax positions will be sustained upon audit, including resolution of any related appeals or litigation processes. For tax positions that are more likely than not to be sustained upon audit, the second step is to measure the tax benefit as the largest amount that is more than 50% likely to be realized upon settlement. Our practice is to recognize interest and/or penalties related to income tax matters in income tax expense. Significant judgment is required to evaluate uncertain tax positions. Evaluations are based upon a number of factors, including changes in facts or circumstances, changes in tax law, correspondence with tax authorities during the course of tax audits and effective settlement of audit issues. Changes in the recognition or measurement of uncertain tax positions could result in material increases or decreases in income tax expense in the period in which the change is made, which could have a material impact to our effective tax rate.\nBusiness Combination. We use significant estimates and assumptions in allocating the purchase price of acquired business by utilizing established valuation techniques appropriate for the technology industry to record the acquired assets and liabilities at fair value. We utilize the income approach, cost approach or market approach, depending upon which approach is the most appropriate based on the nature and reliability of available data. If the income approach is used, the fair value determination is predicated upon the value of the future cash flows that an asset is expected to generate over its economic life and involves significant assumptions as to cash flows, associated expenses, long-term growth rates and discount rates. The cost approach takes into account the cost to replace (or reproduce) the asset and involves assumptions relating to the asset's value of physical, functional and/or economic obsolescence that has occurred with respect to the asset. The market approach is used to estimate value from an analysis of actual transactions or offerings for economically comparable assets available as of the valuation date. Determining the fair value of acquired technology assets is judgmental in nature and requires the use of significant estimates\nand assumptions, including the discount rate, revenue growth rates, projected gross margins, and estimated research and development expenses.\nImpairment of Goodwill, Indefinite-lived Intangible Assets and Long-Lived Assets. We evaluate our goodwill for potential impairment annually during the fourth quarter and whenever events or changes in circumstances indicate the carrying value of goodwill may not be recoverable. Our impairment evaluation consists of a qualitative assessment, and if deemed necessary, a quantitative test is performed which compares the fair value of a reporting unit with its carrying amount, including goodwill.\nIf the fair value of the reporting unit exceeds the carrying value of the net assets associated with that unit, goodwill is not considered impaired. If the carrying value of the net assets associated with the reporting unit exceeds the fair value of the reporting unit, goodwill is considered impaired and will be determined as the amount by which the reporting units carrying value exceeds its fair value, not to exceed the carrying amount of goodwill. Determining the fair value of our reporting units is subjective in nature and involves the use of significant estimates and assumptions, including projected net cash flows, discount and long-term growth rates. We determine the fair value of our reporting units based on an income approach, whereby the fair value of the reporting unit is derived from the present value of estimated future cash flows. The assumptions about estimated cash flows include factors such as future revenue, gross profit, operating expenses, and industry trends. We consider historical rates and current market conditions when determining the discount and long-term growth rates to use in its analysis. We consider other valuation methods, such as the cost approach or market approach, if it is determined that these methods provide a more representative approximation of fair value.\nWe are required to test our IPRD assets for impairment annually using the guidance for indefinite-lived intangible assets. An IPRD asset is considered to be impaired when the asset’s carrying amount is greater than its fair value. Our impairment evaluation consists of first assessing qualitative factors, and if deemed necessary, we calculate the fair value of the IPRD asset and record an impairment charge if the carrying amount exceeds fair value. We determine the fair value based on an income approach, which is calculated as the present value of the estimated future cash flows of the IPRD asset. The assumptions about estimated cash flows include factors such as future revenue, gross profit, operating expenses, and industry trends.\nWe evaluate the recoverability of the carrying amount of our property, plant and equipment and intangible assets (excluding IPRD), whenever events or changes in circumstances indicate that the carrying amount of an asset group may not be fully recoverable. Impairment is first assessed when the undiscounted expected cash flows derived for an asset group are less than its carrying amount. Impairment losses, if applicable, are measured as the amount by which the carrying value of an asset group exceeds its fair value and are recognized in operating results. We continually apply our best judgment when applying these impairment rules to determine the timing of the impairment test, the undiscounted cash flows used to assess impairments and the fair value of an impaired asset group. The dynamic economic environment in which we operate and the resulting assumptions used to estimate future cash flows impact the outcome of our impairment tests.\nContingencies. We are involved in a variety of legal matters that arise in the normal course of business. Based on the available information, we evaluate the relevant range and likelihood of potential outcomes and we record the appropriate liability when the amount is deemed probable and reasonably estimable.\nFor a further listing and discussion of our accounting policies, see Note 2: ''Significant Accounting Policies'' in the notes to our audited consolidated financial statements included elsewhere in this Form 10-K.\nRecent Accounting Pronouncements\nFor a discussion of recent accounting pronouncements, see Note 4: ''Recent Accounting Pronouncements'' in the notes to our audited consolidated financial statements included elsewhere in this Form 10-K.",
    "item_7A": "Item 7A. Quantitative and Qualitative Disclosures About Market Risk\nWe are exposed to financial market risks, including changes in interest rates and foreign currency exchange rates. To mitigate these risks, we utilize derivative financial instruments. We do not use derivative financial instruments for speculative or trading purposes.\nAs of December 31, 2019, our long-term debt (including current maturities) totaled $3,749.2 million. We have no interest rate exposure to rate changes on our fixed rate debt, which totaled $2,265.1 million. We do have interest rate exposure with respect to the $1,484.1 million balance of our variable interest rate debt outstanding as of December 31, 2019. A 50 basis point increase in interest rates would impact our expected annual interest expense for the next 12 months by approximately $7.4 million. However, some of this impact would be offset by additional interest earned on our cash and cash equivalents should rates on\ndeposits and investments also increase. We entered into interest rate swaps to hedge some of the risk of variability in cash flows resulting from future interest payments on our variable interest rate debt.\nTo ensure the adequacy and effectiveness of our foreign exchange hedge positions, we continually monitor our foreign exchange forward positions, both on a stand-alone basis and in conjunction with their underlying foreign currency exposures, from an accounting and economic perspective. However, given the inherent limitations of forecasting and the anticipatory nature of exposures intended to be hedged, we cannot provide any assurances that such programs will offset more than a portion of the adverse financial impact resulting from unfavorable movements in foreign exchange rates.\nWe are subject to risks associated with transactions that are denominated in currencies other than our functional currencies, as well as the effects of translating amounts denominated in a foreign currency to the U.S. Dollar as a normal part of the reporting process. Some of our Japanese operations utilize Japanese Yen as the functional currency, which results in a translation adjustment that is included as a component of accumulated other comprehensive income.\nWe enter into forward foreign currency contracts that economically hedge the gains and losses generated by the re-measurement of certain recorded assets and liabilities in a non-functional currency. Changes in the fair value of these undesignated hedges are recognized in other income and expense immediately as an offset to the changes in the fair value of the assets or liabilities being hedged. The notional amount of foreign exchange contracts at December 31, 2019 and 2018 was $183.3 million and $157.3 million, respectively. Our policies prohibit speculation on financial instruments, trading in currencies for which there are no underlying exposures, or entering into trades for any currency to intentionally increase the underlying exposure.\nSubstantially all of our revenue is transacted in U.S. Dollars. However, a significant amount of our operating expenditures and capital purchases are transacted in local currencies, including Japanese Yen, Euros, Korean Won, Malaysian Ringgit, Philippine Peso, Singapore Dollars, Swiss Francs, Chinese Renminbi, and Czech Koruna. Due to the materiality of our transactions in these local currencies, our results are impacted by changes in currency exchange rates measured against the U.S. Dollar. For example, we determined that based on a hypothetical weighted-average change of 10% in currency exchange rates, our results would have impacted our income before taxes by approximately $105.7 million for the year ended December 31, 2019, assuming no offsetting hedge position or correlated activities.\nSee Note 15: ''Financial Instruments'' in the notes to the audited consolidated financial statements included elsewhere in this Form 10-K for further information with respect to our hedging activity.",
    "item_8": "Item 8. Financial Statements and Supplementary Data\nOur consolidated Financial Statements listed in the index appearing under Part IV, Item 15(a)(1) of this Form 10-K and the Financial Statement Schedule listed in the index appearing under Part IV, Item 15(a)(2) of this Form 10-K are filed as part of this Form 10-K and are incorporated herein by reference in this Item 8.",
    "item_9": "Item 9. Changes in and Disagreements with Accountants on Accounting and Financial Disclosure\nNone.",
    "item_9A": "Item 9A. Controls and Procedures\nEvaluation of Disclosure Controls and Procedures.\nWe carried out an evaluation, under the supervision and with the participation of our management, including our Chief Executive Officer and Chief Financial Officer, of the effectiveness of our disclosure controls and procedures (as defined in Rules 13a-15(e) and 15d-15(e) of the Exchange Act). Based upon that evaluation, our Chief Executive Officer and Chief Financial Officer concluded that, as of the end of the period covered in this Form 10-K, our disclosure controls and procedures were effective to ensure that information required to be disclosed in reports filed or submitted under the Exchange Act is recorded, processed, summarized and reported within the required time periods and is accumulated and communicated to our management, including our Chief Executive Officer and Chief Financial Officer, as appropriate, to allow timely decisions regarding required disclosure.\nChanges in Internal Control Over Financial Reporting.\nWe also carried out an evaluation, under the supervision and with the participation of our management, including our Chief Executive Officer and Chief Financial Officer, of changes to our internal control over financial reporting (as defined in Rules 13a-15(f) and 15d-15(f) of the Exchange Act) that occurred during the fiscal quarter ended December 31, 2019.\nThere have been no changes to our internal control over financial reporting (as defined in Exchange Act Rules 13a-15(f) and 15d-15(f)) that occurred during the fiscal quarter ended December 31, 2019 which have materially affected, or are reasonably likely to materially affect, our internal control over financial reporting.\nManagement's Report on Internal Control Over Financial Reporting.\nOur management is responsible for establishing and maintaining adequate internal control over financial reporting (as defined in Exchange Act Rules 13a-15(f) and 15d-15(f)). Because of its inherent limitations, internal control over financial reporting may not prevent or detect misstatements. Also, projections of any evaluation of effectiveness to future periods are subject to the risk that controls may become inadequate because of changes in conditions, or that the degree of compliance with the policies and procedures may deteriorate.\nOur management assessed the effectiveness of our internal control over financial reporting as of December 31, 2019. In making this assessment, we used the criteria set forth by the Committee of Sponsoring Organizations of the Treadway Commission in Internal Control-Integrated Framework 2013. Based on this assessment, management has concluded that our internal control over financial reporting was effective as of December 31, 2019.\nManagement’s assessment of the effectiveness of our internal control over financial reporting as of December 31, 2019 excluded Quantenna, which was acquired by the Company on June 19, 2019. Quantenna is a wholly-owned subsidiary of the Company that is excluded from management’s assessment of internal control over financial reporting and represented approximately 1% and 2% of total assets and total revenue, respectively, of the related consolidated financial statement amounts as of and for the year ended December 31, 2019.\nThe effectiveness of our internal control over financial reporting as of December 31, 2019 has been audited by PricewaterhouseCoopers LLP, an independent registered public accounting firm, as stated in their report which appears in \"Exhibits and Financial Statement Schedules\" of this Form 10-K.",
    "item_9B": "Item 9B. Other Information\nNone.\nPART III",
    "item_9C": "",
    "item_10": "Item 10. Directors, Executive Officers and Corporate Governance\nThe information under the heading \"Executive Officers of the Registrant\" in this Form 10-K is incorporated by reference into this section. Information concerning directors and persons nominated to become directors and executive officers is incorporated by reference from the text under the captions \"Management Proposals-Proposal No. 1: Election of Directors,\" \"The Board of Directors and Corporate Governance,\" \"Section 16(a) Reporting Compliance\" and \"Miscellaneous Information-Stockholder Nominations and Proposals\" in our Proxy Statement to be filed pursuant to Regulation 14A within 120 days after our fiscal year\nended December 31, 2019 in connection with our 2020 Annual Meeting of Stockholders (\"Proxy Statement\").\nCode of Business Conduct\nInformation concerning our Code of Business Conduct is incorporated by reference from the text under the caption \"The Board of Directors and Corporate Governance-Code of Business Conduct\" in our Proxy Statement.",
    "item_11": "Item 11. Executive Compensation\nInformation concerning executive compensation is incorporated by reference from the text under the captions \"The Board of Directors and Corporate Governance-2019 Compensation of Directors,\" \"Compensation of Executive Officers,\" \"Compensation Committee Report,\" \"Compensation Discussion and Analysis,\" \"ON Semiconductor 2019 Pay Ratio Disclosure\" and \"Compensation Committee Interlocks and Insider Participation\" in our Proxy Statement.\nThe information incorporated by reference under the caption \"Compensation Committee Report\" in our Proxy Statement shall be deemed furnished, and not filed, in this Form 10-K and shall not be deemed incorporated by reference into any filing under the Securities Act or the Exchange Act as a result of this furnishing, except to the extent that we specifically incorporate it by reference.",
    "item_12": "Item 12. Security Ownership of Certain Beneficial Owners and Management and Related Stockholder Matters\nInformation concerning security ownership of certain beneficial owners and management is incorporated by reference from the text under the captions “Principal Stockholders,” “Share Ownership of Directors and Officers” and “Share-Based Compensation Plan Information” in our Proxy Statement.",
    "item_13": "Item 13. Certain Relationships and Related Transactions, and Director Independence\nInformation concerning certain relationships and related transactions involving us and certain others is incorporated by reference from the text under the captions \"Management Proposals-Proposal No. 1: Election of Directors,\" \"The Board of Directors and Corporate Governance,\" and \"Relationships and Related Transactions\" in our Proxy Statement.",
    "item_14": "Item 14. Principal Accountant Fees and Services\nInformation concerning principal accounting fees and services is incorporated by reference from the text under the caption \"Audit and Related Fees\" in our Proxy Statement.\nPART IV",
    "item_15": "Item 15. Exhibits and Financial Statement Schedules\n(a) The following documents are filed as part of this Annual Report on Form 10-K:\n(1)\nConsolidated Financial Statements:\nON Semiconductor Corporation Consolidated Financial Statements:\nReport of Independent Registered Public Accounting Firm\nConsolidated Balance Sheets as of December 31, 2019 and December 31, 2018\nConsolidated Statements of Operations and Comprehensive Income for the years ended December 31, 2019, 2018 and 2017\nConsolidated Statements of Stockholders' Equity for the years ended December 31, 2019, 2018 and 2017\nConsolidated Statements of Cash Flows for the years ended December 31, 2019, 2018 and 2017\nNotes to Consolidated Financial Statements\n(2)\nConsolidated Financial Statement Schedule:\nSchedule II - Valuation and Qualifying Accounts for the years ended December 31, 2019, 2018 and 2017\nAll other schedules are omitted because they are not applicable or the required information is shown in the financial statements or related notes\n(3)\nExhibits:\nEXHIBIT INDEX*\nExhibit No.\nExhibit Description\n2.1\nAsset Purchase Agreement, dated as of March 11, 1997, between Fairchild Semiconductor Corporation and National Semiconductor Corporation (incorporated by reference to Exhibit 2.02 to Fairchild Semiconductor Corporation’s Registration Statement filed with the Commission on May 12, 1997 (File No. 333-26897))†\n2.2\nReorganization Agreement, dated as of May 11, 1999, among Motorola, Inc., SCG Holding Corporation and Semiconductor Components Industries, LLC (incorporated by reference to Exhibit 2.1 to the Company’s Registration Statement filed with the Commission on November 5, 1999 (File No. 333-90359))†\n2.3(a)\nAgreement and Plan of Recapitalization and Merger, as amended, dated as of May 11, 1999, among SCG Holding Corporation, Semiconductor Components Industries, LLC, Motorola, Inc., TPG Semiconductor Holdings LLC, and TPG Semiconductor Acquisition Corp. (incorporated by reference to Exhibit 2.2 to the Company’s Registration Statement filed with the Commission on November 5, 1999 (File No. 333-90359))†\n2.3(b)\nAmendment No. 1 to Agreement and Plan of Recapitalization and Merger, dated as of July 28, 1999, among SCG Holding Corporation, Semiconductor Components Industries, LLC, Motorola, Inc., TPG Semiconductor Holdings LLC, and TPG Semiconductor Acquisition Corp. (incorporated by reference to Exhibit 2.3 to the Company’s Registration Statement filed with the Commission on November 5, 1999 (File No. 333-90359))†\n2.4(a)\nPurchase Agreement by and among ON Semiconductor Corporation, Semiconductor Components Industries, LLC and SANYO Electric Co., Ltd. dated July 15, 2010 (incorporated by reference to Exhibit 2.1 to the Company’s Quarterly Report on Form 10-Q filed with the Commission on November 4, 2010)†\n2.4(b)\nAmendment No. 1 to Purchase Agreement by and among ON Semiconductor Corporation, Semiconductor Components Industries, LLC and SANYO Electric Co., Ltd. dated November 30, 2010 (incorporated by reference to Exhibit 2.2 to the Company’s Current Report on Form 8-K filed with the Commission on January 6, 2011)†\n2.5\nAgreement and Plan of Merger by and among ON Semiconductor Benelux B.V., Alpine Acquisition Sub, Aptina, Inc. and Fortis Advisors LLC, as Equityholder Representative, dated as of June 9, 2014 (incorporated by reference to Exhibit 2.1 to the Company’s Quarterly Report on Form 10-Q filed with the Commission on August 1, 2014)†\n2.6\nAgreement and Plan of Merger, dated November 18, 2015, by and among Fairchild Semiconductor International, Inc., ON Semiconductor Corporation and Falcon Operations Sub, Inc. (incorporated by reference to Exhibit 2.1 to the Company’s Current Report on Form 8-K filed with the Commission on November 18, 2015)†\n2.7\nAgreement and Plan of Merger, dated March 27, 2019, by and among Quantenna Communications, Inc., ON Semiconductor Corporation and Raptor Operations Sub, Inc. (incorporated by reference to Exhibit 2.1 to the Company’s Current Report on Form 8-K filed with the Commission on March 27, 2019)†\n3.1(a)\nCertificate of Incorporation of ON Semiconductor Corporation, as further amended through March 26, 2008 (incorporated by reference to Exhibit 3.1 to the Company’s Quarterly Report on Form 10-Q filed with the Commission on May 7, 2008)\n3.1(b)\nCertificate of Amendment to the Amended and Restated Certificate of Incorporation (incorporated by reference to Exhibit 3.1 to the Company’s Current Report on Form 8-K filed with the Commission on June 3, 2014)\n3.1(c)\nCertificate of Amendment to the Amended and Restated Certificate of Incorporation, dated May 17, 2017 (incorporated by reference to Exhibit 3.1 to the Company’s Quarterly Report on Form 10-Q filed with the Commission on August 7, 2017)\n3.2\nBy-Laws of ON Semiconductor Corporation as Amended and Restated on November 21, 2013 (incorporated by reference to Exhibit 3.1 to the Company’s Current Report on Form 8-K filed with the Commission on November 25, 2013)\n4.1\nSpecimen of share certificate of Common Stock, par value $0.01, ON Semiconductor Corporation (incorporated by reference to Exhibit 4.1 to the Company’s Annual Report on Form 10-K filed with the Commission on March 10, 2004)\n4.2(a)\nIndenture regarding the 1.00% Convertible Senior Notes due 2020, dated June 8, 2015, among ON Semiconductor Corporation, the guarantors party thereto and Wells Fargo Bank, National Association, as trustee (incorporated by reference to Exhibit 4.1 to the Company’s Current Report on Form 8-K filed with the Commission on June 8, 2015)\n4.2(b)\nForm of Global 1.00% Convertible Senior Note due 2020 (included in Exhibit 4.2(a))\n4.2(c)\nSupplemental Indenture to the Indenture regarding the 1.00% Convertible Senior Notes due 2020, dated March 11, 2016, among ON Semiconductor Corporation, the guarantors party thereto and Wells Fargo Bank, National Association, as trustee (incorporated by reference to Exhibit 4.1 to the Company’s Current Report on Form 8-K filed with the Commission on March 17, 2016)\n4.2(d)\nSecond Supplemental Indenture to the Indenture regarding the 1.00% Convertible Senior Notes 2020, dated April 14, 2016, among ON Semiconductor Corporation, the guarantors party thereto and Wells Fargo Bank, National Association, as trustee (incorporated by reference to Exhibit 4.1 to the Company’s Current Report on Form 8-K filed with the Commission on April 15, 2016)\n4.2(e)\nThird Supplemental Indenture to the Indenture regarding the 1.00% Convertible Senior Notes due 2020, dated November 21, 2016, among ON Semiconductor Corporation, the guarantors party thereto and Wells Fargo Bank, National Association, as trustee (incorporated by reference to Exhibit 4.1 to the Company’s Current Report on Form 8-K filed with the Commission on November 21, 2016)\n4.2(f)\nFourth Supplemental Indenture to the Indenture regarding the 1.00% Convertible Senior Notes due 2020, dated January 7, 2020, among ON Semiconductor Corporation, the guarantors party thereto and Wells Fargo Bank, National Association, as trustee(1)\n4.3(a)\nIndenture regarding the 1.625% Convertible Senior Notes due 2023, dated as of March 31, 2017 among ON Semiconductor Corporation, the guarantors party thereto and Wells Fargo Bank, National Association, as trustee (incorporated by reference to Exhibit 4.1 to the Company’s Current Report on Form 8-K filed with the Commission on April 3, 2017)\n4.3(b)\nForm of Global 1.625% Convertible Senior Note due 2023 (included in Exhibit 4.3(a))\n4.3(c)\nFirst Supplemental Indenture to the Indenture regarding the 1.625% Convertible Senior Notes due 2023, dated as of January 7, 2020 among ON Semiconductor Corporation, the guarantors party thereto and Wells Fargo Bank, National Association, as trustee(1)\n4.4\nDescription of the Registrant’s Securities Registered under Section 12 of the Securities Exchange Act of 1934, as amended(1)\n10.1\nAmended and Restated Intellectual Property Agreement, dated August 4, 1999, among Semiconductor Components Industries, LLC and Motorola, Inc. (incorporated by reference to Exhibit 10.5 to Amendment No. 1 to the Company’s Registration Statement filed with the Commission on January 11, 2000 (File No. 333-90359))\n10.2\nLease for 52nd Street property, dated July 31, 1999, among Semiconductor Components Industries, LLC as Lessor, and Motorola, Inc. as Lessee (incorporated by reference to Exhibit 10.16 to the Company’s Registration Statement filed with the Commission on November 5, 1999 (File No. 333-90359))\n10.3\nDeclaration of Covenants, Easement of Restrictions and Options to Purchase and Lease, dated July 31, 1999, among Semiconductor Components Industries, LLC and Motorola, Inc. (incorporated by reference to Exhibit 10.17 to the Company’s Registration Statement filed with the Commission on November 5, 1999 (File No. 333-90359))\n10.4(a)\nJoint Venture Contract for Leshan-Phoenix Semiconductor Company Limited, amended and restated on April 20, 2006 between SCG (China) Holding Corporation (a subsidiary of ON Semiconductor Corporation) and Leshan Radio Company Ltd. (incorporated by reference to Exhibit 10.3 to the Company’s Quarterly Report on Form 10-Q filed with the Commission on July 28, 2006)\n10.4(b)\nAmendment Agreement, dated September 29, 2014, to Joint Venture Contract for Leshan-Phoenix Semiconductor Company Limited between ON Semiconductor (China) Holding, LLC (a subsidiary of ON Semiconductor Corporation) and Leshan Radio Company Ltd. (incorporated by reference to Exhibit 10.5(b) to the Company’s Annual Report on Form 10-K filed with the Commission on February 27, 2015)\n10.5(a)\nCredit Agreement, dated April 15, 2016, among ON Semiconductor Corporation, as borrower, the several lenders party thereto, Deutsche Bank AG New York Branch, as administrative agent and collateral agent, Deutsche Bank Securities Inc., Merrill Lynch, Pierce, Fenner & Smith Incorporated, BMO Capital Markets Corp., HSBC Securities (USA) Inc. and Sumitomo Mitsui Banking Corporation, as joint lead arrangers and joint bookrunners, Barclays Bank PLC, Compass Bank, The Bank of Tokyo-Mitsubishi UFJ, Ltd., Morgan Stanley Senior Funding, Inc., BOKF, NA and KBC Bank N.V., as co-managers, and HSBC Bank USA, N.A. and Sumitomo Mitsui Banking Corporation, as co-documentation agents (incorporated by reference to Exhibit 10.1 to the Company’s Current Report on Form 8-K filed with the Commission on April 15, 2016)\n10.5(b)\nGuarantee and Collateral Agreement, dated April 15, 2016, made by ON Semiconductor Corporation and the other signatories thereto in favor of Deutsche Bank AG New York Branch, as administrative agent and collateral agent (incorporated by reference to Exhibit 10.2 to the Company’s Current Report on Form 8-K filed with the Commission on April 15, 2016)\n10.5(c)\nEscrow Agreement, dated April 15, 2016, among ON Semiconductor Corporation, MUFG Union Bank, N.A., as escrow agent, and Deutsche Bank AG New York Branch, as administrative agent and collateral agent (incorporated by reference to Exhibit 10.3 to the Company’s Current Report on Form 8-K filed with the Commission on April 15, 2016)\n10.5(d)\nJoinder to Amended and Restated Guaranty, dated March 15, 2016, among the guarantors party thereto (incorporated by reference to Exhibit 10.1 to the Company’s Current Report on Form 8-K filed with the Commission on March 17, 2016)\n10.5(e)\nJoinder to Amended and Restated Guaranty, dated April 14, 2016, among the guarantors party thereto (incorporated by reference to Exhibit 10.4 to the Company’s Current Report on Form 8-K filed with the Commission on April 15, 2016)\n10.5(f)\nAssumption Agreement, dated September 19, 2016, by and between ON Semiconductor (China) Holdings, LLC and Deutsche Bank AG New York Branch (incorporated by reference to Exhibit 10.1 to the Company’s Current Report on Form 8-K filed with the Commission on September 23, 2016)\n10.5(g)\nPledge Supplement, dated September 19, 2016, by ON Semiconductor (China) Holdings, LLC (incorporated by reference to Exhibit 10.2 to the Company’s Current Report on Form 8-K filed with the Commission on September 23, 2016)\n10.5(h)\nAssumption Agreement, dated September 19, 2016, by and among Fairchild Semiconductor International, Inc., Fairchild Semiconductor Corporation, Fairchild Semiconductor Corporation of California, Giant Holdings, Inc., Fairchild Semiconductor West Corporation, Kota Microcircuits, Inc., Silicon Patent Holdings, Giant Semiconductor Corporation, Micro-Ohm Corporation, Fairchild Energy, LLC and Deutsche Bank AG New York Branch (incorporated by reference to Exhibit 10.3 to the Company’s Current Report on Form 8-K filed with the Commission on September 23, 2016)\n10.5(i)\nPledge Supplement, dated September 19, 2016, by Fairchild Semiconductor International, Inc., Fairchild Semiconductor Corporation, Fairchild Semiconductor Corporation of California, Giant Holdings, Inc., Fairchild Semiconductor West Corporation, Kota Microcircuits, Inc., Silicon Patent Holdings, Giant Semiconductor Corporation, Micro-Ohm Corporation and Fairchild Energy, LLC (incorporated by reference to Exhibit 10.4 to the Company’s Current Report on Form 8-K filed with the Commission on September 23, 2016)\n10.5(j)\nFirst Amendment to Credit Agreement, dated September 30, 2016, among ON Semiconductor Corporation, as borrower, certain subsidiaries thereof, as guarantors, the several lenders party thereto, and Deutsche Bank AG New York Branch, as administrative agent and collateral agent (incorporated by reference to Exhibit 10.1 to the Company’s Current Report on Form 8-K filed with the Commission on September 30, 2016)\n10.5(k)\nSecond Amendment to Credit Agreement, dated March 31, 2017, among ON Semiconductor Corporation, as borrower, certain subsidiaries thereof, as guarantors, the several lenders party thereto, and Deutsche Bank AG New York Branch, as administrative agent and collateral agent (incorporated by reference to Exhibit 10.1 to the Company’s Current Report on Form 8-K filed with the Commission on April 3, 2017)\n10.5(l)\nThird Amendment to Credit Agreement, dated November 30, 2017, among ON Semiconductor Corporation, as borrower, certain subsidiaries thereof, as guarantors, the several lenders party thereto, and Deutsche Bank AG New York Branch, as administrative agent and collateral agent (incorporated by reference to Exhibit 10.1 to the Company’s Current Report on Form 8-K filed with the Commission on December 4, 2017)\n10.5(m)\nFourth Amendment to Credit Agreement, dated May 31, 2018, among ON Semiconductor Corporation, as borrower, certain subsidiaries thereof, as guarantors, the several lenders party thereto, and Deutsche Bank AG New York Branch, as administrative agent and collateral agent (incorporated by reference to Exhibit 10.1 to the Company’s Quarterly Report on Form 10-Q filed with the Commission on July 30, 2018)\n10.5(n)\nFifth Amendment to Credit Agreement, dated June 12, 2019, among ON Semiconductor Corporation, as borrower, certain subsidiaries thereof, as guarantors, the several lenders party thereto, and Deutsche Bank AG New York Branch, as administrative agent and collateral agent (incorporated by reference to Exhibit 10.1 to the Company’s Current Report on Form 8-K filed with the Commission on June 17, 2019)\n10.5(o)\nSixth Amendment to Credit Agreement, dated August 15, 2019, among ON Semiconductor Corporation, as borrower, certain subsidiaries thereof, as guarantors, the several lenders party thereto, and Deutsche Bank AG New York Branch, as administrative agent and collateral agent (incorporated by reference to Exhibit 10.1 to the Company’s Quarterly Report on Form 10-Q filed with the Commission on October 28, 2019)\n10.5(p)\nSeventh Amendment to Credit Agreement, dated September 19, 2019, among ON Semiconductor Corporation, as borrower, certain subsidiaries thereof, as guarantors, the several lenders party thereto, and Deutsche Bank AG New York Branch, as administrative agent and collateral agent (incorporated by reference to Exhibit 10.1 to the Current Report on Form 8-K filed with the Commission on September 20, 2019)\n10.6(a)\nForm of Convertible Note Hedge and Warrant Transactions (incorporated by reference to Exhibit 10.1 to the Company’s Current Report on Form 8-K filed with the Commission on June 8, 2015)\n10.6(b)\nForm of Warrant Confirmation (incorporated by reference to Exhibit 10.2 to the Company’s Current Report on Form 8-K filed with the Commission on June 8, 2015)\n10.7(a)\nON Semiconductor Corporation 2000 Stock Incentive Plan, as amended and restated May 19, 2004 (incorporated by reference to Exhibit 10.7 to the Company’s Quarterly Report on Form 10-Q filed with the Commission on August 6, 2004)(2)\n10.7(b)\nAmendment to the ON Semiconductor Corporation 2000 Stock Incentive Plan, dated May 16, 2007 (incorporated by reference to Exhibit 10.2 to the Company’s Quarterly Report on Form 10-Q filed with the Commission on August 1, 2007)(2)\n10.7(c)\nNon-qualified Stock Option Agreement for the ON Semiconductor Corporation 2000 Stock Incentive Plan (incorporated by reference to Exhibit 10.35(d) to Amendment No. 1 to the Company’s Registration Statement filed with the Commission on March 24, 2000 (File No. 333-30670))(2)\n10.7(d)\nON Semiconductor Corporation Amended and Restated Stock Incentive Plan (incorporated by reference to Exhibit 4.1 to the Company’s Registration Statement filed with the Commission on May 19, 2010 (File No. 333-166958))(2)\n10.7(e)\nFirst Amendment to the ON Semiconductor Corporation Amended and Restated Stock Incentive Plan (incorporated by reference to Exhibit 10.2 to the Company’s Quarterly Report on Form 10-Q filed with the Commission on August 3, 2012)(2)\n10.7(f)\nSecond Amendment to the ON Semiconductor Corporation Amended and Restated Stock Incentive Plan, effective May 20, 2015 (incorporated by reference to Exhibit 10.5 to the Company’s Quarterly Report on Form 10-Q filed with the Commission on August 3, 2015)(2)\n10.7(g)\nThird Amendment to the ON Semiconductor Corporation Amended and Restated Stock Incentive Plan, effective May 17, 2017 (incorporated by reference to Exhibit 10.1 to the Company’s Quarterly Report on Form 10-Q filed with the Commission on August 7, 2017)(2)\n10.7(h)\nNon-qualified Stock Option Agreement for Senior Vice Presidents an Above for the ON Semiconductor Corporation Amended and Restated Stock Incentive Plan (form of standard agreement) (incorporated by reference to Exhibit 10.3 to the Company’s Quarterly Report on Form 10-Q filed with the Commission on August 5, 2010)(2)\n10.7(i)\nRestricted Stock Units Award Agreement for Senior Vice Presidents and Above for the ON Semiconductor Corporation Amended and Restated Stock Incentive Plan (form of standard agreement) (incorporated by reference to Exhibit 10.4 to the Company’s Quarterly Report on Form 10-Q filed with the Commission on August 5, 2010)(2)\n10.7(j)\nStock Grant Award Agreement for Directors under the ON Semiconductor Corporation Amended and Restated Stock Incentive Plan (form of standard Stock Grant Award for Non-employee Directors) (incorporated by reference to Exhibit 10.1 to the Company’s Quarterly Report on Form 10-Q filed with the Commission on May 6, 2011)(2)\n10.7(k)\nPerformance-Based Restricted Stock Units Award Agreement under the ON Semiconductor Corporation Amended and Restated Stock Incentive Plan (2016 form of Performance-Based Award for Senior Vice Presidents and Above) (incorporated by reference to Exhibit 10.1 to the Company’s Quarterly Report on Form 10-Q filed with the Commission on August 8, 2016)(2)\n10.7(l)\nPerformance-Based Restricted Stock Units Award Agreement under the ON Semiconductor Corporation Amended and Restated Stock Incentive Plan (2017 form of Performance-Based Award for Senior Vice Presidents and Above) (incorporated by reference to Exhibit 10.3 to the Company’s Quarterly Report on Form 10-Q filed with the Commission on August 7, 2017)(2)\n10.7(m)\nPerformance-Based Restricted Stock Units Award Agreement under the ON Semiconductor Corporation Amended and Restated Stock Incentive Plan (2018 form of Performance-Based Award for Senior Vice Presidents and Above) (incorporated by reference to Exhibit 10.1 to the Company’s Quarterly Report on Form 10-Q filed with the Commission on April 30, 2018)(2)\n10.7(n)\nRestricted Stock Units Award Agreement under the ON Semiconductor Corporation Amended and Restated Stock Incentive Plan (2018 form agreement for Senior Vice Presidents and Above) (incorporated by reference to Exhibit 10.2 to the Company’s Quarterly Report on Form 10-Q filed with the Commission on April 30, 2018)(2)\n10.7(o)\nRestricted Stock Units Award Agreement under the ON Semiconductor Corporation Amended and Restated Stock Incentive Plan (2019 form agreement for Section 16 Officers) (incorporated by reference to Exhibit 10.1 to the Company’s Current Report on Form 8-K filed with the Commission on February 19, 2019)(2)\n10.7(p)\nPerformance-Based Restricted Stock Units Award Agreement under the ON Semiconductor Corporation Amended and Restated Stock Incentive Plan (2019 form agreement for Senior Vice Presidents and Above) (incorporated by reference to Exhibit 10.2 to the Company’s Current Report on Form 8-K filed with the Commission on February 19, 2019)(2)\n10.7(q)\nPerformance-Based Restricted Stock Units Upside Award Agreement under the ON Semiconductor Corporation Amended and Restated Stock Incentive Plan (2019 form agreement for Senior Vice Presidents and Above) (incorporated by reference to Exhibit 10.3 to the Company’s Current Report on Form 8-K filed with the Commission on February 19, 2019)(2)\n10.8(a)\nON Semiconductor Corporation 2000 Employee Stock Purchase Plan, as amended and restated as of May 20, 2009 (incorporated by reference to Exhibit 4.1 to the Registration Statement on Form S-8 No. 333-159381 filed with the Commission on May 21, 2009)(2)\n10.8(b)\nAmendment to the ON Semiconductor Corporation 2000 Employee Stock Purchase Plan, as amended as of May 15, 2013 (incorporated by reference to Exhibit 10.1 of the Company’s Quarterly Report on Form 10-Q filed with the Commission on August 2, 2013)(2)\n10.8(c)\nAmendment to the ON Semiconductor Corporation 2000 Employee Stock Purchase Plan, as amended as of May 20, 2015 (incorporated by reference to Exhibit 10.6 to the Company’s Quarterly Report on Form 10-Q filed with the Commission on August 3, 2015)(2)\n10.8(d)\nAmendment to the ON Semiconductor Corporation 2000 Employee Stock Purchase Plan, as amended as of May 17, 2017 (incorporated by reference to Exhibit 10.2 to the Company’s Quarterly Report on Form 10-Q filed with the Commission on August 7, 2017)(2)\n10.9\nAmended and Restated Employment Agreement, effective June 1, 2017, by and between Semiconductor Components Industries, LLC and Keith Jackson (incorporated by reference to Exhibit 10.1 to the Company’s Current Report on Form 8-K filed with the Commission on June 2, 2017)(2)\n10.10\nAmended and Restated Employment Agreement, effective June 1, 2017, by and between Semiconductor Components Industries, LLC and George H. Cave (incorporated by reference to Exhibit 10.12 to the Company’s Annual Report on Form 10-K filed with the Commission on February 21, 2018)(2)\n10.11(a)\nEmployment Agreement by and between Semiconductor Components Industries, LLC and Bernard Gutmann, dated as of September 26, 2012 (incorporated by reference to Exhibit 10.1 to the Company’s Current Report on Form 8-K filed with the Commission on September 27, 2012)(2)\n10.11(b)\nAmendment No. 1 to Employment Agreement by and between Semiconductor Components Industries, LLC and Bernard Gutmann, dated as of June 1, 2017 (incorporated by reference to Exhibit 10.2 to the Company’s Current Report on Form 8-K filed with the Commission on June 2, 2017)(2)\n10.12(a)\nEmployment Agreement between Semiconductor Components Industries, LLC and William Schromm dated as of August 25, 2014 (incorporated by reference to Exhibit 10.1 to the Company’s Current Report on Form 8-K filed with the Commission on August 25, 2014)(2)\n10.12(b)\nAmendment No. 1 to Employment Agreement by and between Semiconductor Components Industries, LLC and William Schromm, dated as of June 1, 2017 (incorporated by reference to Exhibit 10.4 to the Company’s Current Report on Form 8-K filed with the Commission on June 2, 2017)(2)\n10.13(a)\nEmployment Agreement between Semiconductor Components Industries, LLC and Paul Rolls dated as of July 14, 2013 (incorporated by reference to Exhibit 10.1 to the Company’s Quarterly Report on Form 10-Q filed with the Commission on May 4, 2015)(2)\n10.13(b)\nAmendment No. 1 to Employment Agreement by and between Semiconductor Components Industries, LLC and Paul Rolls, effective June 1, 2017 (incorporated by reference to Exhibit 10.21(b) to the Company’s Annual Report on Form 10-K filed with the Commission on February 21, 2018)(2)\n10.14\nKey Officer Severance and Change of Control Agreement by and between Semiconductor Components Industries, LLC and Taner Ozcelik, dated as of June 1, 2017 (incorporated by reference to Exhibit 10.22 to the Company’s Annual Report on Form 10-K filed with the Commission on February 21, 2018)(2)\n10.15\nEmployment Agreement by and between Semiconductor Components Industries, LLC and Vince Hopkin, dated as of May 11, 2018 (incorporated by reference to Exhibit 10.2 to the Company’s Quarterly Report on Form 10-Q filed with the Commission on July 30, 2018)(2)\n10.16\nEmployment Agreement by and between Semiconductor Components Industries, LLC and Simon Keeton, dated January 1, 2019 (incorporated by reference to Exhibit 10.20 to the Company's Annual Report on Form 10-K filed with the Commission on February 20, 2019)(2)\n10.17\nForm of Indemnification Agreement with Directors and Officers (incorporated by reference to Exhibit 10.1 to the Company’s Current Report on Form 8-K filed with the Commission on February 25, 2016)(2)\n10.18(a)\nEnvironmental Side Letter, dated March 11, 1997, between National Semiconductor Corporation and Fairchild Semiconductor Corporation (incorporated by reference to Exhibit 10.19 to Fairchild Semiconductor Corporation’s Registration Statement filed with the Commission on May 12, 1997 (File No. 333-26897))\n10.18(b)\nIntellectual Property License Agreement, dated April 13, 1999, between Samsung Electronics Co., Ltd. and Fairchild Korea Semiconductor, Ltd. (incorporated by reference to Exhibit 10.41 to Fairchild Semiconductor International, Inc.’s Registration Statement filed with the Commission on June 30, 1999 (File No. 333-78557))\n10.18(c)\nFairchild Benefit Restoration Plan (incorporated by reference to Exhibit 10.23 to Fairchild Semiconductor Corporation’s Registration Statement filed with the Commission on May 12, 1997 (File No. 333-26897))(2)\n10.18(d)\nTechnology Licensing and Transfer Agreement, dated March 11, 1997, between National Semiconductor Corporation and Fairchild Semiconductor Corporation (incorporated by reference to Amendment No. 3 to Fairchild Semiconductor Corporation’s Registration Statement on Form S-4, filed July 9, 1997 (File No. 333-28697))\n10.18(e)\nIntellectual Property Assignment and License Agreement, dated December 29, 1997, between Raytheon Semiconductor, Inc. and Raytheon Company (incorporated by reference to Fairchild Semiconductor International, Inc.’s Current Report on Form 8-K, dated December 31, 1997, filed January 13, 1998. (File No. 333-26897))\n10.19\nAsset Purchase Agreement, dated as of April 22, 2019, between GLOBALFOUNDRIES U.S. Inc. and Semiconductor Components Industries, LLC (incorporated by reference to Exhibit 10.1 to the Company’s Quarterly Report on Form 10-Q filed with the Commission on August 5, 2019)†\n10.20\nSettlement Agreement, dated October 19, 2019, by and between ON Semiconductor Corporation and Power Integrations, Inc.(1)\n14.1\nON Semiconductor Corporation Code of Business Conduct effective as of August 16, 2016 (incorporated by reference to Exhibit 14.1 to the Company’s Current Report on Form 8-K filed with the Commission on August 24, 2016)\n21.1\nList of Significant Subsidiaries(1)\n23.1\nConsent of Independent Registered Public Accounting Firm-PricewaterhouseCoopers LLP(1)\n24.1\nPowers of Attorney(1)\n31.1\nCertification by CEO pursuant to Rule 13a-14(a) or 15d-14(a) of the Securities Exchange Act of 1934, as adopted pursuant to Section 302 of the Sarbanes-Oxley Act of 2002(1)\n31.2\nCertification by CFO pursuant to Rule 13a-14(a) or 15d-14(a) of the Securities Exchange Act of 1934, as adopted pursuant to Section 302 of the Sarbanes-Oxley Act of 2002(1)\nCertification by CEO and CFO pursuant to 18 U.S.C. Section 1350, as adopted pursuant to Section 906 of the Sarbanes-Oxley Act of 2002(3)\n101.INS\nXBRL Instance Document\n101.SCH\nXBRL Taxonomy Extension Schema Document\n101.CAL\nXBRL Taxonomy Extension Calculation Linkbase Document\n101.DEF\nXBRL Taxonomy Extension Definition Linkbase Document\n101.LAB\nXBRL Taxonomy Extension Label Linkbase Document\n101.PRE\nXBRL Taxonomy Extension Presentation Linkbase Document\nCover Page Interactive Data File - the cover page XBRL tags are embedded within the Inline XBRL document.\n* Reports filed under the Securities Exchange Act (Form 10-K, Form 10-Q and Form 8-K) are filed under File No. 000-30419.\n(1) Filed herewith.\n(2) Management contract or compensatory plan, contract or arrangement.\n(3) Furnished herewith.\n† Schedules or other attachments to these exhibits not filed herewith shall be furnished to the Commission upon request.",
    "item_16": "Item 16. Form 10-K Summary\nNone.",
    "stock_ticker": "ON"
}