{
    "cik": "1097864",
    "company": "ON SEMICONDUCTOR CORP",
    "filing_type": "10-K",
    "filing_date": "2022-02-14",
    "period_of_report": "2021-12-31",
    "sic": "3674",
    "state_of_inc": "DE",
    "state_location": "AZ",
    "fiscal_year_end": "1231",
    "filing_html_index": "https://www.sec.gov/Archives/edgar/data/1097864/0001628280-22-002416-index.html",
    "htm_filing_link": "https://www.sec.gov/Archives/edgar/data/1097864/000162828022002416/on-20211231.htm",
    "complete_text_filing_link": "https://www.sec.gov/Archives/edgar/data/1097864/0001628280-22-002416.txt",
    "filename": "1097864_10K_2021_0001628280-22-002416.htm",
    "item_1": "Item 1. Business\nOverview\nON Semiconductor Corporation, together with its wholly and majority-owned subsidiaries, which operate under the onsemiTM brand (\"onsemi,\" \"we,\" \"us,\" \"our,\" or the \"Company\"), was incorporated under the laws of the state of Delaware in 1992.\nWe provide industry leading intelligent sensing and power solutions to help our customers solve the most challenging problems and create cutting edge products for a better future. Our intelligent power technologies enable the electrification of the automotive industry that allows for lighter and longer-range electric vehicles, empowers efficient fast-charging systems and propels sustainable energy for the highest efficiency solar strings, industrial power and storage systems. Our intelligent sensing technologies, supports the next generation industry allowing for smarter factories and buildings while also enhancing the automotive mobility experience with imaging and depth sensing that make advanced vehicle safety and automated driving systems possible.\nonsemi’s intelligent power allows our customers to exceed range targets with lower weight and reduce system cost through efficiency. With our sensing integration, we believe onsemi’s intelligent power solutions achieve higher efficiencies compared to our peers and allows lower temperature operation, reducing cooling requirements, saving costs and minimizing weight while delivering the required power with less die per module and achieving higher range for a given battery capacity. onsemi’s intelligent sensing solutions offer proprietary features in smaller packages that support customers' use cases. We believe our intelligent sensing technology offers advanced features to achieve optimal results and our product integration drives improved efficiency. This performance is delivered in a smaller footprint while reducing system latency to increase safety and throughput by providing a proprietary feature set to solve different use cases.\nWe serve a broad base of end-user markets, including automotive, industrial and others which include communications, computing and consumer. We believe the evolution of automotive with advancements in autonomous driving, ADAS, vehicle electrification, and the increase in electronics content for vehicle platforms is reshaping the boundaries of transportation. With our extensive portfolio of AEC-qualified products, onsemi helps customers design high reliability solutions while delivering top performance. And within the industrial space, onsemi is helping OEMs develop innovative products to navigate the ongoing transformation across energy infrastructure, factory automation and power conversion.\nAs of December 31, 2021, we were organized into the following three operating and reportable segments: the Power Solutions Group (\"PSG\"), the Advanced Solutions Group (\"ASG\") and the Intelligent Sensing Group (\"ISG\").\nBusiness Strategy Developments\nOur primary focus continues to be on gross margin and operating margin expansion, while at the same time achieving revenue growth in our focused end-markets of automotive, industrial and communications infrastructure as well as being opportunistic in other end-markets, including obtaining longer-term supply arrangements with strategic end-customers. We are also focused on achieving efficiencies in our operating expenditures. While we believe we have made significant progress on gross margin and operating margin expansion, we continue to rationalize our product portfolio and have allocated capital, research and development investments and resources to accelerate growth in high-margin products and end-markets by moving away from non-differentiated products, which have had historically lower gross margins. To this effect, onsemi is exploring the sale of select manufacturing facilities. As actions are initiated to achieve our business strategy goals, we could incur accounting charges in the future.\nWe believe these actions, among others, will allow us to transition to a lighter internal fabrication model where our financial performance will be less volatile and not as heavily influenced by our internal manufacturing volumes. We will continue to rationalize our manufacturing footprint in 2022 to align with our investment priorities and corporate strategy. Our goal is to reduce volatility in our gross margins and maximize return on our manufacturing investments with the intention of having our product strategy drive our manufacturing footprint and capital investments.\nIn order to streamline our operations and achieve efficiencies, we implemented an involuntary severance plan during 2021, under which approximately 960 employees were notified of their employment termination and we incurred severance and related charges of $65.3 million. We continue to evaluate employee positions and locations for potential efficiencies and may incur additional severance and related charges in the future.\nWe are focused on sustainability as we drive a common theme across all markets. In August 2020, onsemi announced its commitment to achieving net zero emissions by 2040. As we initiate steps to achieve our sustainability goals, additional investments may be required in the future in connection with such actions, although the timing and amounts of such investments are uncertain at this time.\nCompleted and Pending Acquisitions and Divestitures\nOn October 28, 2021, we completed our acquisition of GT Advanced Technologies Inc. (\"GTAT\"), a producer of SiC. Pursuant to the terms and subject to the conditions set forth in the Agreement and Plan of Merger, the purchase price for the acquisition was $434.9 million, which included cash consideration of $424.6 million and effective settlement of pre-acquisition balances (non-cash) of approximately $10 million, in exchange for all of the outstanding equity interests of GTAT. We believe the GTAT acquisition will act as a building block to fuel growth and accelerate innovation in disruptive intelligent power technologies and secure supply of SiC to meet rapidly growing customer demand for SiC-based solutions in the sustainable ecosystem.\nOn October 1, 2021, we divested one of our businesses along with the related intellectual property for aggregate consideration of approximately $13.6 million and recognized a gain on sale of $10.2 million after offsetting the carrying values of the disposed assets and liabilities.\nDuring 2019 and 2020, we entered into an Asset Purchase Agreement (the \"APA\") and an Asset Purchase Agreement Amendment (the \"APA Amendment\") to acquire GLOBALFOUNDRIES U.S. Inc.'s (\"GFUS\") East Fishkill, New York site and fabrication facilities and certain other assets and liabilities on or around December 31, 2022 for an aggregate purchase price of $400.0 million in cash, subject to adjustments as described in the APA and the APA Amendment (the \"Total Consideration\"). We paid GFUS $70.0 million and $100.0 million during 2019 and 2020, respectively, of the Total Consideration in cash as a non-refundable deposit, which will be applied toward and reduce the Total Consideration.\nSee Note 5: ''Acquisitions and Divestitures'' in the notes to our audited consolidated financial statements included elsewhere in this Form 10-K for additional information.\nImpact of the Novel Coronavirus Disease 2019 (\"COVID-19\") Pandemic on our Business\nIn response to the impact of the ongoing COVID-19 pandemic on our business and industry, we have proactively implemented preventative protocols, which we continuously assess and update for current local conditions and emerging trends. These are intended to safeguard our employees, contractors, customers, suppliers and communities and to ensure business continuity in case of further government restrictions or if severe outbreaks impact operations at certain of our facilities. While substantially all of our global manufacturing sites are currently operational, our facilities could be required to temporarily curtail production levels or temporarily cease operations based on government mandates in response to further outbreaks or new variants of COVID-19. We are still unable to predict the ultimate extent to which the COVID-19 pandemic will impact our operations.\nRevenue-Generating Activities\nonsemi generates revenue from the sale of semiconductor products to distributors and direct customers. We also generate revenue, to a much lesser extent, from product development agreements and manufacturing services provided to customers. We believe that our ability to offer a broad range of products, combined with our global manufacturing and logistics network, provides our customers with single source purchasing on a cost-effective and timely basis.\nAs many of our products are sold into different end-markets, the total revenue reported under PSG, ASG and ISG is not indicative of actual sales in the end-market associated with that segment, but rather is the sum of the revenue from the product lines assigned to that segment. From time to time, we reassess the alignment of our product families and devices to our operating segments and may move product families or individual devices from one operating segment to another.\nThe following table illustrates the product technologies under each of our segments based on our operating strategy:\nProducts and Technology\nThe following provides certain information regarding the products and technologies for each of our operating segments. See Note 3: ''Revenue and Segment Information'' in the notes to our audited consolidated financial statements included elsewhere in this Form 10-K for other information regarding our segments, their revenue and property, plant and equipment and the gross profit derived from each segment.\nPSG\nPSG offers a wide array of analog, discrete, module and integrated semiconductor products that perform multiple application functions, including power switching, power conversion, signal conditioning, circuit protection, signal amplification and voltage regulation functions. The trends driving growth within our end-user markets are primarily higher power efficiency and power density in power applications, the demand for greater functionality, and faster data transmission rates in all communications. The advancement of existing volt electrical infrastructure, electrification of power train in the form of EV/HEV, higher trench density enabling lower losses in power efficient packages and lower capacitance and integrated signal conditioning products to support faster data transmission rates significantly increase the use of high power semiconductor solutions. The recent increase in the use of WBG MOSFETs and diodes, including SiC and IGBT, is further expanding the use of semiconductor products.\nASG\nASG designs and develops analog, mixed-signal, advanced logic, ASSPs and ASICs, RF and integrated power solutions for a broad base of end-users in different end-markets. Our product solutions enable industry leading active mode and standby mode efficiency now demanded by regulatory agencies around the world. Additionally, ASG offers trusted foundry and design services for our government customers which leverages the Company’s broad range of manufacturing, IC design, packaging, and silicon technology offerings to provide turn-key solutions for our customers.\nISG\nISG designs and develops CMOS image sensors, image signal processors, single photon detectors, including SiPM and SPAD arrays, as well as actuator drivers for autofocus and image stabilization for a broad base of end-users in the different end-markets. Our broad range of product offerings delivers excellent pixel performance, sensor functionality and camera systems capabilities in which high quality visual imagery is becoming increasingly important to our customers and their end-users, particularly in automotive and factory automation and in applications powered by AI.\nCustomers\nWe sell our products to distributors and direct customers for ultimate use in a variety of end-products in different end-markets. In general, we have maintained long-term relationships with our key customers and our sales agreements are renewable periodically and contain certain terms and conditions with respect to payment, delivery, warranty and supply. During 2021, we entered into a number of long-term supply arrangements with certain strategic end-customers, which generally include minimum purchase commitments. Pricing terms on product development agreements are negotiated at the beginning of a project. Almost all of our contracts have default provisions, and certain of our contracts in the public sector are terminable at\nany time for convenience of the contracting agency.\nWe generally warrant that products sold to our customers will, at the time of shipment, be free from defects in workmanship and materials and conform to our approved specifications. Our standard warranty extends for a period of two years from the date of delivery, except in the case of image sensor products, which are warrantied for one year from the date of delivery. Unless otherwise agreed in writing with our customers, they may cancel orders 120 days prior to shipment for standard products without penalty and, for custom products, prior to shipment, provided they pay onsemi's actual costs incurred as of the date we receive the cancellation notice. The loss of one of our large customers would have a material adverse effect on the operations of the respective segment, and may have a material adverse effect on our consolidated results of operations.\nDistributors\nSales to distributors accounted for approximately 64% of our revenue in 2021, 60% of our revenue in 2020 and 57% of our revenue in 2019. We had one distributor whose revenue accounted for approximately 13% of the total revenue for the year ended December 31, 2021. Our distributors resell to mid-sized and smaller OEMs and other companies. Sales to distributors are typically made pursuant to agreements that provide return rights and stock rotation provisions permitting limited levels of product returns.\nDirect Customers\nSales to direct customers, which include manufacturers who provide contract manufacturing services for OEMs, accounted for approximately 36% of our revenue in 2021, 40% of our revenue in 2020 and 43% of our revenue in 2019. Large multi-nationals and selected regional OEMs, which are significant in specific markets, form our core direct customers. Generally, these customers do not have the right to return our products following a sale other than pursuant to our warranty.\nFor additional information regarding agreements with our customers, see \"Markets,\" \"Resources\" and \"Risk Factors - Trends, Risks and Uncertainties Related to Our Business\" included elsewhere in this Form 10-K and Note 2: \"Significant Accounting Policies - Revenue Recognition\" in the notes to our audited consolidated financial statements included elsewhere in this Form 10-K.\nMarkets\nProduct Development\nonsemi is focused on innovation to create intelligent power and sensing technologies that solve the most challenging customer problems. Our product development efforts are directed towards the following:\n•Powering the electrification of the automotive industry with our intelligent power technologies that allow for lighter and longer-range electric vehicles and enable efficient fast-charging systems;\n•Propelling the sustainable energy evolution with our intelligent power technologies for the highest efficiency solar strings, industrial power and storage systems;\n•Enhancing the automotive mobility experience with our intelligent sensing technologies with imaging and depth sensing that make advanced vehicle safety and automated driving systems possible; and\n•Enabling automation and data exchange (Industry 4.0) with our intelligent sensing technologies for smarter factories and buildings.\nWhile our new product development efforts continue to be focused on building solutions in areas that appeal to customers in focused market segments and across multiple high-growth applications, it is our practice to regularly re-evaluate our research and development spending, to assess the deployment of resources and to review the funding of high-growth technologies. We deploy people and capital with the goal of maximizing the return for our research and development investments by targeting innovative products and solutions for high growth applications that position us to outperform the industry.\nEnd-Markets\nWe serve a broad base of end-user markets, with a primary focus towards automotive, industrial and communication infrastructure. The following table sets forth our principal end-markets, the estimated percentage (based in part on information provided by our distributors) of our revenue generated from each end-market during 2021, and sample applications for our products. Other includes the end-markets of communication, consumer and computing.\nCompetition\nWe face significant competition from major international semiconductor companies, as well as smaller companies focused on specific market niches. Because some of our components include functionality that in some cases may be integrated into more complex ICs, we also face competition from manufacturers of ICs, ASICs and fully-customized ICs, as well as customers who develop their own IC products. See \"Risk Factors-Trends, Risks and Uncertainties Related to Our Business\" included elsewhere in this Form 10-K for additional information.\nSome of our competitors have greater financial and other resources with which to pursue development, engineering, manufacturing, marketing and distribution of their products and may generally be better situated to withstand adverse economic or market conditions. The semiconductor industry has experienced, and may continue to experience, significant consolidation among companies and vertical integration among customers. The following discusses the effects of competition on our three operating segments:\nPSG\nOur competitive strengths include our core competencies of leading edge fabrication technologies, micro packaging expertise, breadth of product line and IP portfolio, high quality cost effective manufacturing and supply chain management which ensures supply to our customers. Our commitment to continual innovation allows us to provide an ever broader range of semiconductor solutions to our customers who differentiate in power density and power efficiency, the key performance characteristics driving our markets.\nThe principal methods of competition in our discrete, module and integrated semiconductor products are through new products and package innovations enabling enhanced performance over existing products. Of particular importance are our power MOSFETs, IGBTs, WBG MOSFETs and diodes, including SiC rectifiers and power module portfolio for power conversion applications, and ESD portfolio for hi-speed serial interface protection products, where we believe we have significant performance advantages over our competition. PSG's competitors include: Broadcom Limited (\"Broadcom\"), Diodes Incorporated, Infineon Technologies AG (\"Infineon\"), Wolfspeed, Nexperia BV, Rohm Semiconductor USA LLC (\"Rohm\"), Semtech Corporation, STMicroelectronics N.V. (\"STMicroelectronics\"), Texas Instruments Incorporated (\"TI\"), Toshiba Corporation and Vishay Intertechnology, Inc.\nASG\nASG principally competes on design experience, manufacturing capability, depth and quality of IP, ability to service customer needs from the design phase to the shipping of a completed product, length of design cycle, longevity of technology support and experience of sales and technical support personnel. Our competitive position with respect to the above basis is enhanced by long-standing relationships with leading direct customers.\nOur ability to compete successfully depends on internal and external variables. These variables include, but are not limited to, the timeliness with which we can develop new products and technologies, product performance and quality, manufacturing\nyields and availability of supply, customer service, pricing, industry trends and general economic trends. Competitors for certain of ASG's products and solutions include: Infineon, NXP Semiconductors N.V. (\"NXP\"), STMicroelectronics and TI.\nISG\nISG differentiates itself from the competition through deep technical knowledge and close customer relationships to drive leading edge sensing performance for both human and machine vision applications. ISG has significant imaging experience and was one of the earliest to commercialize CMOS active pixel sensors and introduce CMOS technology in many of our markets. ISG has leveraged this expertise into market leading positions in automotive and industrial applications, which allows us to offer technical and end-user applications knowledge to help customers develop innovative sensing solutions across a broad range of end-user needs.\nCompetitors for certain of ISG's products and solutions include: Sony Semiconductor Manufacturing Corporation, Samsung Electronics Co., Ltd., Omnivision, STMicroelectronics, Rohm, Renesas Electronics Corporation, and Broadcom.\nSales, Marketing and Distribution\nWe have global distribution centers in China, the Philippines and Singapore. Global and regional distribution channels further support our customers' needs for quick response and service. We offer efficient, cost-effective global applications support from our technical information centers and solution engineering centers, allowing for applications that are developed in one region of the world to be instantaneously available throughout all other regions.\nBacklog\nOur sales are made primarily pursuant to orders that are booked as far as 52 weeks in advance of delivery. Generally, prices and quantities are fixed at the time of booking. Backlog as of a given date consists of existing orders and forecasted demand from our customers, in each case scheduled to be shipped in the current or future period. Backlog is influenced by several factors, including market demand, pricing and customer order patterns in reaction to product lead times. During 2021, our backlog for shipments requested for a given quarter exceeded actual revenue during such quarter.\nIn the semiconductor industry, backlog quantities and shipment schedules under outstanding purchase orders are frequently revised to reflect changes in customer needs. Historically, a significant portion of our backlog was cancellable, however, under our current agreements, including orders subject to minimum purchase commitments under our longer-term supply arrangements, are not subject to cancellation. See \"Risk Factors-Trends, Risks and Uncertainties Related to Our Business\" located elsewhere in this Form 10-K for additional information regarding the inventory practices within the semiconductor industry.\nResources\nRaw Materials\nOur manufacturing processes use many raw materials, including silicon wafers, SiC wafers, laminate substrates, gold, copper, lead frames, mold compound, ceramic packages and various chemicals and gases as well as other production supplies used in our manufacturing processes. We obtain our raw materials and supplies from a large number of sources, generally on a just-in-time basis. From time to time, suppliers may extend lead times, limit supplies or increase prices due to capacity constraints or other factors. Although we continue to experience some supply constraints due to the current conditions, we could face further shortages in various essential materials as experienced during the COVID-19 pandemic and increased demand in the industry or other factors.\nManufacturing and Design Operations\nWe currently have domestic design operations in Arizona, California, Idaho, New York, Oregon, Pennsylvania, Rhode Island, Texas, Utah and Virginia. We also have foreign design operations in Australia, Belgium, Canada, China, the Czech Republic, France, Germany, India, Ireland, Israel, Italy, Japan, South Korea, the Philippines, Romania, Russia, Singapore, Slovak Republic, Slovenia, Switzerland, Taiwan and the United Kingdom. We operate front-end wafer fabrication facilities in Belgium, the Czech Republic, Japan, South Korea, Malaysia and the United States and back-end assembly and test site facilities in Canada, China, Malaysia, the Philippines, Vietnam and the United States. In addition to these front-end and back-end manufacturing operations, our facility in New Hampshire manufactures SiC crystal boules and our facility in Rožnov pod Radhoštěm, Czech Republic manufactures silicon wafers that are used by a number of our facilities.\nThe table below sets forth information with respect to the manufacturing facilities we operate either directly or pursuant to joint ventures, the reportable segments that use such facilities, and the approximate gross square footage of each site's building, which includes, among other things, manufacturing, laboratory, warehousing, office, utility, support and unused areas.\n_______________________\n(1)These facilities are leased.\n(2)This facility is used for both front-end and back-end operations.\n(3)These facilities are located on leased land.\n(4)On February 8, 2022, we completed the divestiture of this facility\n(5)In 2020, we began exploring the sale of this facility.\nSee Note 5: ''Acquisitions and Divestitures'' in the notes to our audited consolidated financial statements included elsewhere in this Form 10-K regarding the pending acquisition of a manufacturing facility in 2022.\nWe operate all of our existing manufacturing facilities directly, except our assembly and test operations facility located in Leshan, China, which is owned by Leshan-Phoenix Semiconductor Company Limited, a joint venture company in which we own 80% of the outstanding equity interests (\"Leshan\"). The financial and operating results of Leshan have been consolidated in our financial statements. Our joint venture partner in Leshan, Leshan Radio Company Ltd. (\"Leshan Radio\"), is formerly a state-owned enterprise. Pursuant to the joint venture agreement between us and Leshan Radio, requests for production capacity are made to the board of directors of Leshan by each shareholder of the joint venture. Each request represents a purchase commitment, provided that any shareholder may elect to pay the cost associated with the unused capacity (which is generally equal to the fixed cost of the capacity) in lieu of satisfying the commitment. We purchased 80% of Leshan's production capacity in each of 2021, 2020 and 2019 and are currently committed to purchase approximately 80% of Leshan's expected production capacity in 2022.\nWe use third-party contractors for some of our manufacturing activities, primarily for wafer fabrication and the assembly and testing of finished goods. Our agreements with these contract manufacturers typically require us to forecast product needs and commit to purchase services consistent with these forecasts. In some cases, longer-term commitments are required in the early stages of the relationship. These manufacturers collectively accounted for approximately 37% of our total manufacturing input costs in 2021, 33% in 2020 and 31% in 2019.\nFor information regarding risks associated with our foreign operations, see \"Risk Factors -Trends, Risks and Uncertainties Related to Our Business\" included elsewhere in this Form 10-K.\nPatents, Trademarks, Copyrights and Other Intellectual Property Rights\nWe market our products under worldwide trademarks including the ON Semiconductor, ON, onsemi, and various product names and logos, and, in the United States and internationally, we rely primarily on a combination of patents, trademarks, copyrights, trade secrets, employee and non-disclosure agreements and licensing agreements to protect our IP. We acquired or were licensed or sublicensed to a significant amount of IP, including patents and patent applications, in connection with our acquisitions, and we have numerous U.S. and foreign patents issued, allowed and pending. As of December 31, 2021, we held patents with expiration dates ranging from 2022 to 2040, and none of the patents that expire in the next three years materially affect our business. Our policy is to protect our products and processes by asserting our IP rights where appropriate and prudent and by obtaining patents, copyrights and other IP rights used in connection with our business when practicable and appropriate.\nSeasonality\nWe believe our business today is driven more by content gains within applications and secular growth drivers and not solely by macroeconomic and industry cyclicality, as was the case historically. Our 2021 results were positively influenced by macroeconomic factors including a better-than-expected economic recovery from the COVID-19 pandemic along with our efforts focused on price increases, better utilization, product diversification and content gains. We could again experience period-to-period fluctuations in operating results due to general industry or macroeconomic conditions. For information regarding risks associated with the cyclicality and seasonality of our business, see \"Risk Factors-Trends, Risks and Uncertainties Related to Our Business\" included elsewhere in this Form 10-K.\nGovernment Regulation\nOur manufacturing operations are subject to environmental and worker health and safety laws and regulations. These laws and regulations include those relating to emissions and discharges into the air and water, the management and disposal of hazardous substances, the release of hazardous substances into the environment at or from our facilities and at other sites and the investigation and remediation of contamination. As with other companies engaged in like businesses, the nature of our operations exposes us to the risk of liabilities and claims, regardless of fault, with respect to such matters, including personal injury claims and civil and criminal fines.\nWe believe that our operations are in material compliance with applicable environmental and health and safety laws and regulations. The costs we incurred in complying with applicable environmental regulations for the year ended December 31, 2021 were not material, and we do not expect the cost of complying with existing environmental and health and safety laws and regulations, together with any liabilities for currently known environmental conditions, to have a material adverse effect on the capital expenditures or earnings or our competitive position. It is possible, however, that future developments, including\nchanges in laws and regulations, government policies, customer specification, personnel and physical property conditions, including currently undiscovered contamination, could lead to material costs, and such costs may have a material adverse effect on our future business or prospects. See Note 13: ''Commitments and Contingencies'' in the notes to our audited consolidated financial statements included elsewhere in this Form 10-K for information on certain environmental matters.\nWe are also subject to numerous United States and foreign laws and regulations, including, without limitation, tariffs, trade sanctions, trade barriers, trade embargoes, regulations relating to import-export control, technology transfer restrictions, the International Traffic in Arms Regulation promulgated under the Arms Export Control Act (\"ITAR\"), the Foreign Corrupt Practices Act (\"FCPA\"), and the anti-boycott provisions of the U.S. Export Administration Act. Additionally, U.S. or China governmental authorities have taken, and may continue to take, administrative, legislative or regulatory action that could impact our operations.\nWe believe that our operations are in material compliance with applicable trade regulations relating to import-export control, technology transfer restrictions, ITAR, FCPA, the anti-boycott provisions of the U.S. Export Administration Act, and similar applicable laws and regulations. The costs we incurred in complying with applicable trade regulations for the year ended December 31, 2021 were not material, and we do not expect the cost of complying with existing trade laws and regulations to have a material adverse effect on the capital expenditures or earnings or our competitive position. It is possible, however, that future developments, including changes in laws and regulations or government policies, could lead to material costs, and such costs may have a material adverse effect on our future business or prospects. For information regarding risks associated with import-export control regulations and similar applicable laws and regulations, see \"Risk Factors-Trends, Risks and Uncertainties Related to Our Business\" included elsewhere in this Form 10-K.\nEnvironmental, Social and Governance Initiatives\nonsemi strives to be a responsible corporate citizen. We uphold ethical standards in our business practices and policies, and we believe that sustainable corporate practices and consistent attention to social and governance priorities will help enhance long-term value for our stockholders.\nIn 2021, onsemi affirmed its climate change policy, highlighting the focus areas for its climate change-related actions. onsemi is committed to protect and respect its environment and energy resources for future generations throughout its manufacturing operations including wafer fabrication, assembly, test, and support operations. In that regard, onsemi has committed to achieving net zero emissions by 2040.\nWe work together with our customers, peers, partners and suppliers to promote continual improvement in human rights, labor, environment, health and safety, anti-corruption, ethics and management system standards within our operations and our supply chain. We proactively verify compliance to the Responsible Business Alliance (“RBA”) Code of Conduct including the elimination of forced labor, slavery and human trafficking and conflict minerals as per our involvement with the Responsible Minerals Initiative.\nOur Board of Directors and management regularly evaluate our corporate responsibility policies, including our Code of Business Conduct and other corporate social responsibility policies and programs, to ensure an effective outcome and adherence by our employees, suppliers, vendors and partners.\nHuman Capital Resources\nCore Principles\nOur success depends on our ability to attract, train, retain and motivate our employees involved in the design, development, manufacture and support of new and existing products and services. We are a member of the RBA, the principles of which are fundamental to our corporate culture and core values and are reflected in our commitments to our employees, customers, communities and other stakeholders. These principles include providing a safe and positive work environment to our employees that emphasizes learning and professional development and respect for individuals and ethical conduct.\nHeadcount\nAs of December 31, 2021, we had approximately 30,000 regular full-time employees and approximately 3,300 part-time and temporary employees in facilities located in 35 countries. Approximately 12% of our regular full-time employees are located in the United States and Canada, 13% in Europe and Middle Eastern countries and 75% in Asia Pacific and Japan, with approximately 71% engaged in manufacturing, 2% directly in research and development, 3% in customer service or other\naspects of sales and marketing, and 24% in other roles. Approximately 107 of our domestic employees (or approximately 3% of our U.S. based employees) are covered by a collective bargaining agreement. All of these employees are located at our Mountain Top, Pennsylvania manufacturing facility. Certain of our foreign employees are covered by collective bargaining arrangements (e.g., those in China, Vietnam, Japan, the Czech Republic and Belgium) or similar arrangements or are represented by workers councils.\nDiversity, Equity and Inclusion\nWe are consciously expanding the diversity of our workforce, creating growth and development opportunities for our employees, embracing different perspectives and fostering an inclusive work environment. We have organization level and overall Company metrics to monitor for diverse director-level and above employees, diverse new hires and diverse promotions. Our Human Resources organization and the Human Capital and Compensation Committee of the board of directors of the Company (the \"Board of Directors\"), through its charter, provides oversight of our policies, programs and initiatives focusing on workflow equity and workplace inclusion.\nCompensation, Benefits, Health, Safety and Wellness\nOur compensation philosophy is focused on delivering total rewards based on corporate affordability in a way that enables attraction, retention, and recognition of performance delivered in an equitable manner. We provide our employees and their families with access to flexible and convenient health and wellness programs, including benefits that secure them during events that may require time away from work or that impact their financial well-being. Our primary focus during the COVID-19 pandemic has been protecting the health and safety of our employees and the communities in which we operate. We use a combination of total rewards and other programs (which vary by region and salary grade) to attract and retain our employees, including: annual performance bonuses; stock awards, including an employee stock purchase plan; retirement support; healthcare and insurance benefits; business travel and disability insurance; health savings and flexible spending accounts; flexible work schedules, vacation and paid time off; parental leave; paid counseling assistance; backup child and adult care; education assistance; and on-site services, such as health centers and fitness centers.\nCareer Growth and Development\nWe invest resources in professional development and growth as a means of improving employee motivation, performance and improving retention. Our talent development programs provide employees with the resources they need to help achieve their career goals, build management skills and lead their organizations. We have established a leadership pathway model as a tool for employees to practice and apply learning as part of their development.\nTurnover\nWe monitor employee turnover rates by region and the Company as a whole. The average tenure of our employees is approximately seven years and approximately one-fifth of our employees have been employed by us for more than 10 years. We believe our compensation philosophy along with the career growth and development opportunities promotes longer employee tenure and reduces voluntary turnover.\nExecutive Officers of the Registrant\nCertain information concerning our executive officers as of February 9, 2022 is set forth below.\nName Age Position\nHassane El-Khoury 42 President, Chief Executive Officer and Director\nThad Trent 54 Executive Vice President, Chief Financial Officer and Treasurer\nVincent C. Hopkin 59 Executive Vice President and General Manager, ASG\nRoss F. Jatou 53 Senior Vice President and General Manager, ISG\nSimon Keeton 49 Executive Vice President and General Manager, PSG\nAll of our executive officers are also officers of SCI LLC. The present term of office for the officers named above will generally expire on the earliest of their retirement, resignation or removal. There is no family relationship among our executive officers.\nHassane El-Khoury. Mr. El-Khoury was elected as a Director of onsemi and appointed as President and Chief Executive Officer of onsemi in December 2020. Prior to joining onsemi, he spent 13 years at Cypress Semiconductor Corporation, a semiconductor design and manufacturing company (\"Cypress\"), serving as Chief Executive Officer from August 2016 to April 2020. During his time at Cypress, he held various positions spanning business unit management, product development, applications engineering and business development. Additionally, Mr. El-Khoury currently serves as a member of the board of directors at Sakuu Corporation. He holds a Bachelor of Science in electrical engineering from Lawrence Technological University and a Master's of Engineering Management from Oakland University.\nThad Trent. Mr. Trent was appointed Executive Vice President and Chief Financial Officer of onsemi in February 2021 and has served as the Treasurer since 2021. Mr. Trent has held several leadership roles throughout his career, most recently as Chief Financial Officer at Cypress (\"Cypress CFO\") responsible for strategic planning, accounting, investor relations, tax, corporate development and information technology. Under his leadership, Cypress’ revenue increased from $723 million to $2.5 billion, and the enterprise value increased five times during his five-year tenure as Cypress CFO.\nHe served as Cypress CFO until its sale to Infineon in April 2020. He is a seasoned finance professional with progressive leadership and management experience with both global publicly held technology companies and startups. Mr. Trent has a proven track record of driving sustainable financial performance, transformative mergers and acquisitions, operational excellence, process efficiency, financial leadership and robust compliance and regulatory control. He earned his Bachelor of Science in business administration and finance at San Diego State University.\nVincent C. Hopkin. Mr. Hopkin joined the Company in March 2008 and currently serves as Executive Vice President and General Manager, ASG of onsemi. From September 2016 to May 2018, he was Senior Vice President and General Manager of the Digital and DC/DC Solutions Division. He has more than three decades of experience in the electronics industry. During his career, Mr. Hopkin has held various leadership positions within business units, sales and manufacturing. Prior to joining onsemi in 2008, he successfully managed several businesses including ASIC, military/aerospace, image sensing and foundry services at AMIS. Mr. Hopkin joined AMIS in 1983 and worked in several operations functions. Mr. Hopkin holds a Bachelor of Science degree in management and organizational behavior from Idaho State University.\nRoss F. Jatou. Mr. Jatou joined onsemi in 2015 as the Vice President and General Manager of the Automotive Solutions Division within the Company’s ISG. In October 2020, he was named Senior Vice President and General Manager, ISG of onsemi, assuming leadership of both the divisions within ISG: the Automotive Sensing Division and the Industrial and Consumer Solutions Division. Prior to onsemi, Mr. Jatou had an extensive career with NVIDIA Corporation of nearly 15 years, where he was the Vice President of Hardware Engineering. His background and experience include product development, engineering management, and automotive design quality and forecasting, and he is an expert in imaging graphics and system interfaces, telecommunications, high performance computing, automotive and embedded solutions. He has a Bachelor of Science degree in electrical engineering and a Master of Applied Science in millimeter wave technology and parallel processing from the University of Toronto. Mr. Jatou completed executive business programs from Stanford University School of Business and Harvard Business School.\nSimon Keeton. Mr. Keeton joined the Company in July 2007 and is currently the Executive Vice President and General Manager, PSG of onsemi. During his career, Mr. Keeton has held various management positions within the Company. Before Mr. Keeton’s promotion to his current role on January 1, 2019, he was a Senior Vice President and General Manager of the MOSFET Division. From 2012 to 2016, Mr. Keeton served as Vice President and General Manager of the Integrated Circuit Division under our former Standard Products Group. Prior to that time, he served as Vice President and General Manager of the Consumer Products Division from 2009 to 2012 and as Business Unit Director of our Signals and Interface Business Unit from 2007 to 2009. Before joining the Company, Mr. Keeton served as Strategic Planning Manager of the Digital Enterprise Group of Intel Corporation (\"Intel\") and held various marketing and business management roles at Vitesse Semiconductor Corporation.\nAvailable Information\nWe make our annual report on Form 10-K, quarterly reports on Form 10-Q, current reports on Form 8-K and all amendments to those reports available, free of charge, in the \"Investor Relations\" section of our website as soon as reasonably practicable after we electronically file these materials with, or furnish these materials to the SEC. Our website is www.onsemi.com. Information on or connected to our website is neither part of, nor incorporated by reference into, this Form 10-K or any other report filed with or furnished to the SEC. You will find these materials on the SEC website at www.sec.gov, which contains reports, proxy statements and other information regarding issuers that file electronically with the SEC.",
    "item_1A": "Item 1A. Risk Factors\nForward-Looking Statements\nThis Annual Report on Form 10-K includes \"forward-looking statements,\" as that term is defined in Section 27A of the Securities Act and Section 21E of the Exchange Act. All statements, other than statements of historical facts, included or incorporated in this Form 10-K could be deemed forward-looking statements, particularly statements about our plans, strategies and prospects under the headings \"Management’s Discussion and Analysis of Financial Condition and Results of Operations\" and \"Business.\" Forward-looking statements are often characterized by the use of words such as \"believes,\" \"estimates,\" \"expects,\" \"projects,\" \"may,\" \"will,\" \"intends,\" \"plans,\" \"anticipates,\" \"should\" or similar expressions, or by discussions of strategy, plans or intentions. All forward-looking statements in this Form 10-K are made based on our current expectations, forecasts, estimates and assumptions, and involve risks, uncertainties and other factors that could cause results or events to differ materially from those expressed in the forward-looking statements. Readers are cautioned not to place undue reliance on forward-looking statements. We assume no obligation to update such information, except as may be required by law.\nYou should carefully consider the trends, risks and uncertainties described below and other information in this Form 10-K and subsequent reports filed with or furnished to the SEC before making any investment decision with respect to our securities. If any of the following trends, risks or uncertainties actually occurs or continues, our business, financial condition or operating results could be materially and adversely affected, the trading prices of our securities could decline, and you could lose all or part of your investment. All forward-looking statements attributable to us or persons acting on our behalf are expressly qualified in their entirety by this cautionary statement.\nTrends, Risks and Uncertainties Related to Our Business\nThe manufacturing and other operations required to produce our products are highly dependent on the efficient operation of numerous processes, including processes contingent upon third party component manufacturers and other service providers and processes among our various internal facilities, and any disruption in these processes could have a material adverse effect on our ability to produce many of our products at all or at competitive prices, which could in turn materially adversely affect our business and results of operations.\nOur manufacturing network includes multiple owned and third-party facilities, which may each produce one or more components necessary for the assembly of a single product. As a result of this interdependence, an operational disruption at a facility may have a disproportionate impact on our ability to produce many of our products. In the event of a disruption at any such facility, we may be unable to effectively source replacement components on acceptable terms from qualified third parties, in which case our ability to produce many of our products could be materially disrupted or delayed. Conversely, some of our facilities are single source facilities that only produce one of our end-products, and a disruption at any such facility would materially delay or cease production of the related product. In the event of any such operational disruption, we may experience difficulty in beginning production of replacement components or products at new facilities or transferring production to other existing facilities, any of which could result in a loss of future revenues and materially adversely affect our business and results of operations.\nIn addition, for certain manufacturing activities and for the supply of raw materials, we utilize third-party contractors. Our agreements with these manufacturers typically require us to commit to purchase services based on forecasted product needs, which may be inaccurate, and, in some cases, require longer-term commitments. We are also dependent upon a limited number of highly specialized third-party suppliers for required components and materials for certain of our key technologies. Arranging for replacement manufacturers and suppliers can be time-consuming and costly, and the number of qualified alternative providers can be extremely limited. Our business operations, productivity and customer relations could be materially adversely affected if these contractual relationships were disrupted or terminated, the cost of such services increased significantly, the quality of the services provided deteriorated or our forecasted needs proved to be materially incorrect. Generally, our agreements with suppliers of raw materials impose no minimum or continuing supply obligations, and we obtain our raw materials and supplies from a large number of sources. Shortages could occur in various essential raw materials, and if we are unable to obtain adequate supplies of raw materials in a timely manner, the costs of our raw materials increases significantly, their quality deteriorates or they give rise to compatibility or performance issues in our products, our results of operations could be materially adversely affected.\nOur manufacturing efficiency is contingent upon the operations of these interdependent processes and will continue to be an important factor in our future profitability, and there can be no assurance that we will be able to maintain this manufacturing efficiency, increase manufacturing efficiency to the same extent as our competitors, or be successful in our manufacturing\nrationalization plans. If we are unable to utilize our manufacturing facilities, testing facilities and external manufacturers at expected or minimum purchase obligation levels, or if production capacity increases while revenue does not, the fixed costs and other operating expenses associated with these facilities and arrangements will not be fully absorbed, resulting in higher average unit costs and lower gross profits, which could have a material adverse effect on our results of operations.\nThe effects of the COVID-19 pandemic have had, and could continue to have, an adverse impact on our business, results of operations and financial condition.\nOur business has been, and is expected to continue to be, adversely impacted by the effects of the COVID-19 pandemic. In addition to global macroeconomic effects, the COVID-19 pandemic and related adverse public health developments have been causing, and are expected to continue to cause, disruption to our domestic and international operations and sales activities. In addition, we and our suppliers, third-party distributors, sub-contractors and customers have been, and are expected to continue to be, disrupted by worker absenteeism, quarantines and restrictions on certain of our employees’ ability to perform their jobs, office and factory closures or restrictions, labor shortages, disruptions to ports and other shipping infrastructure, border closures or other travel or health-related restrictions. Depending on the magnitude of such effects on our manufacturing activities or the operations of our suppliers, third-party distributors or sub-contractors, our supply chain, manufacturing and product shipments could be delayed, which could materially adversely affect our business, results of operations and financial condition. In addition, any economic downturn or recession brought on by the COVID-19 pandemic or other disease outbreaks could adversely affect demand for our products and impact our results of operations and financial condition. These effects, alone or taken together, could have a material adverse effect on our business, results of operations, legal exposure, or financial condition. The extent of the COVID-19 pandemic’s effect on our operational and financial performance will depend on future developments, including the duration, spread and intensity of the pandemic, including resurgences in certain geographic areas as a result of new strains and variants, such as Delta and Omicron, the efficacy of vaccines, the speed of vaccine rollouts and the effect of vaccine mandates, if any, on our employees, all of which are uncertain and difficult to predict. While we are not able at this time to estimate the long-term effect of these factors on our business, the adverse impact on our business, results of operations, financial condition and cash flows has been, and could continue to be, material.\nWe may be unable to implement certain business strategies, which may include exiting certain facilities, product lines or businesses, or restructuring our operations, and any issue with the pursuit of such business strategy developments could materially adversely affect our business and results of operations.\nWe may from time to time determine to implement business strategies and restructuring initiatives in order to remain competitive. Because our strategies and restructuring activities may involve changes to many aspects of our business, including the location of our production facilities and personnel and the potential exit of certain product lines and businesses, our ability to successfully do so depends on a number of factors, many of which are outside of our control. If we are not able to effectively manage or efficiently implement these strategies and/or restructuring initiatives for reasons within or outside of our control, then our business operations could be materially adversely affected.\nIn addition, implementation of a business strategy may lead to the disruption of our existing business operations. For example, following the announcement of our commitment to achieving carbon neutral emissions by 2040, we may take actions to pursue our goal of generating net-zero emissions that may result in material expenditures that could impact our financial condition or results of operations and/or could disrupt our existing operations. In addition, the failure to successfully and timely realize the anticipated benefits of these transactions or strategies could have a material adverse effect on our profitability, financial condition or results of operations. In addition, even if we fully execute and implement these activities, there may be other unforeseeable and unintended consequences that could materially adversely impact our profitability and business, including unintended employee attrition or harm to our competitive position. To the extent that we do not achieve the profitability enhancement or other anticipated benefits of strategy or restructuring initiatives, our results of operations may be materially adversely affected.\nIf we are unable to identify and make the substantial research and development investments or develop new products required to satisfy customer demands as required to remain competitive in our business, our business, financial condition and results of operations may be materially adversely affected.\nThe semiconductor industry requires substantial investment in research and development in order to develop and bring to market enhanced technologies and products. The development of new products is complex and time-consuming, often requiring significant capital investment and lead time for development and testing. We cannot assure you that we will have sufficient resources to maintain the level of investment in research and development required to remain competitive. In addition, the lengthy development cycle for certain of our products could limit our ability to adapt quickly to changes affecting the product markets and requirements of our customers and end-users, and we may be unable to develop innovative responses to our\ncustomers’ and end-users’ evolving needs on the timelines they require or at all. There can be no assurance that we will win competitive bid selection processes, known as \"design wins,\" for new products. In addition, design wins do not guarantee that we will make customer sales or generate sufficient revenue to recover design and development investments, realize a return on the capital expended or achieve expected gross margins, as expenditures for technology and product development are generally made before the commercial viability for such developments can be assured. To the extent that we underinvest in our research and development efforts, fail to recognize the need for innovation with respect to our products, or that our investments and capital expenditures in research and development do not lead to sales of new products, we may be unable to bring to market technologies and products attractive to customers, and so our business, financial condition and results of operations may be materially adversely affected.\nThe semiconductor industry is characterized by rapidly changing technologies, innovation, short product life cycles, evolving regulatory and industry standards and certifications, changing customer needs and frequent new product introductions. Products are frequently replaced by more technologically advanced substitutes and, as demand for older technology falls, the price at which such products can be sold drops. If we cannot advance our process technologies or improve our production efficiencies to a degree sufficient to maintain required margins, we will no longer be able to make a profit from the sale of older products. In certain limited cases, we may not be able to cease production of older products, either due to contractual obligations or for customer relationship reasons and, as a result, may be required to bear a loss on such products for a sustained period of time. If reductions in our production costs fail to keep pace with reductions in market prices for products we sell, our business and results of operations could be materially adversely affected. If our new product development efforts fail to align with the needs of our customers, our business and results of operations could be materially adversely affected.\nThe semiconductor industry is highly competitive, and has experienced rapid consolidation, and if we are unable to compete effectively or identify attractive opportunities for consolidation, it could materially adversely affect our business and results of operations.\nThe semiconductor industry is highly competitive, and our ability to compete successfully depends on elements both within and outside of our control. We face significant competition within each of our product lines from major global semiconductor companies as well as smaller companies focused on specific market niches. In addition, companies not currently in direct competition with us may introduce competing products in the future.\nIf we are unable to compete effectively, our competitive position could be weakened relative to our peers, which would have a material adverse effect on our business and results of operations. Products or technologies developed by competitors may render our products or technologies obsolete or noncompetitive. We also may be unable to market and sell our products if they are not competitive on the basis of price, quality, technical performance, features, system compatibility, customized design, innovation, availability, delivery timing and reliability. If we fail to compete effectively on developing strategic relationships with customers and customer sales and technical support, our sales and revenue may be materially adversely affected. Competitive pressures may limit our ability to raise prices, and any inability to maintain revenue or raise prices to offset increases in costs could have a significant adverse effect on our gross margin. Reduced sales and lower gross margins would materially adversely affect our business and results of operations.\nThe semiconductor industry has experienced, and may continue to experience, significant consolidation among companies and vertical integration among customers. Larger competitors resulting from consolidations may have certain advantages over us, and we may be at a competitive disadvantage if we fail to identify attractive opportunities to acquire companies to expand our business. Consolidation among competitors and integration among customers could erode our market share, impair our capacity to compete and require us to restructure operations, any of which would have a material adverse effect on our business.\nBecause a significant portion of our revenue is derived from customers in the automotive industry, a downturn or lower sales to customers in the industry could materially adversely affect our business and results of operations.\nA significant portion of our sales are to customers within the automotive industry. Sales into this industry represented approximately 34% of our revenue for the year ended December 31, 2021. The automotive industry is cyclical, and, as a result, our customers in the industry are sensitive to changes in general economic conditions, disruptive innovation and end-market preferences, which can adversely affect sales of our products and, correspondingly, our results of operations. Additionally, the quantity and price of our products sold to customers in the industry could decline despite continued growth in its respective end markets. Lower sales to customers in the automotive industry may have a material adverse effect on our business and results of operations. Further, to the extent we have long-term supply agreements with our customers which includes fixed pricing, we could be subject to fluctuating manufacturing costs that could negatively impact our profitability. Additionally, under our long-term supply agreements, we could incur certain obligations if we are not able to fulfill our commitments\nOur operating results depend, in part, on the performance of independent distributors.\nA portion of our sales occurs through global and regional distributors that are not under our control. We rely on distributors to grow and develop their customer base and anticipate customer needs, and any lack of such actions by our distributors may adversely affect our results of operations. These independent distributors also generally represent product lines offered by several companies and are not subject to any minimum sales requirements or obligation to market our products to their customers. In turn, distributors could reduce their sales efforts for our products or choose to terminate their representation of us. Additionally, we rely on our distributors to provide accurate and timely sales reports in order for us to be able to generate financial reports that accurately represent distributor sales of our products during any given period. Any inaccuracies or untimely reports could adversely affect our ability to produce accurate and timely financial reports and recognize revenue.\nChanges in, and the regulatory implementation of, tariffs or other government trade policies could reduce demand for our products, limit our ability to sell our products to certain customers or our ability to comply with applicable laws and regulations, which may materially adversely affect our business and results of operations.\nThe imposition of tariffs and trade restrictions as a result of international trade disputes or changes in trade policies may adversely affect our sales and profitability. For example, additional tariffs and the related geopolitical uncertainty between the United States and China and other countries may cause decreased end market demand for our products from distributors and other customers, which could have a material adverse effect on our business and results of operations. In addition, tariffs on components that we import from certain nations that have imposed, or may in the future impose, tariffs may adversely affect our profitability unless we are able to exclude such components from the tariffs or we raise prices for our products, which may result in our products becoming less attractive relative to products offered by our competitors. To the extent that our sales or profitability are negatively affected by any such tariffs or other trade actions, our business and results of operations may be materially adversely affected.\nOur international sales and purchases are subject to numerous United States and foreign laws and regulations related to import and export matters. For example, licenses or proper license exceptions are required for the shipment of our products to certain countries under applicable export control regulations, including the provisions of the U.S. Export Administration Act. A determination by the U.S. government or any foreign government that we have failed to comply with trade or export regulations can result in penalties, including fines, administrative, civil or criminal penalties or other liabilities, seizure of products, or, in the extreme case, denial of export privileges or suspension or debarment from government contracts, which could have a material adverse effect on our sales, business and results of operations.\nWe may be unable to attract and retain highly skilled personnel.\nOur success depends on our ability to attract, motivate and retain highly skilled personnel, including technical, marketing, management and staff personnel, both in the U.S. and internationally. In the semiconductor industry, the competition for qualified personnel, particularly experienced design engineers and other technical employees is intense. During such periods, competitors may try to recruit our most valuable technical employees. Additionally, we have entered into employment agreements with certain senior executives, but we do not have employment agreements with most of our employees. Many of these employees could leave our company with little or no prior notice and would be free to work for a competitor. While we devote a great deal of our attention to designing competitive compensation programs aimed at attracting and retaining personnel, specific elements of our compensation programs may not be competitive with those of our competitors, and there can be no assurance that we will be able to retain our current personnel or recruit the key personnel we require. If one or more of our senior executives or other key personnel are unable or unwilling to continue in their present positions, we may not be able to replace them easily or at all and other senior management may be required to divert attention from other aspects of our business. Loss of the services of, or failure to effectively recruit, qualified personnel could have a material adverse effect on our competitive position and on our business.\nWarranty claims, product liability claims, product recalls, and the failure to comply with the terms and conditions of our contracts, could harm our business, reputation, results of operations and financial condition.\nManufacturing semiconductors is a highly complex and precise process, requiring production in a tightly controlled, clean environment. Minute impurities in our manufacturing materials, contaminants in the manufacturing environment, manufacturing equipment failures, and other defects can cause our products to be non-compliant with customer requirements or otherwise nonfunctional. We face an inherent business risk of exposure to warranty and product liability claims in the event that our products fail to perform as expected or such failure of our products results, or is alleged to result, in bodily injury or property damage (or both). In addition, if any of our designed products are or are alleged to be defective, we may be required to participate in their recall. As suppliers become more integrally involved in electrical design, OEMs are increasingly expecting\nthem to warrant their products and are looking to them for contributions when faced with product liability claims or recalls. A successful warranty or product liability claim against us in excess of our available insurance coverage, if any, and established reserves, or a requirement that we participate in a product recall, could have material adverse effects on our business, results of operations and financial condition. Additionally, in the event that our products fail to perform as expected or such failure of our products results in a recall, our reputation may be damaged, which could make it more difficult for us to sell our products to existing and prospective customers and could materially adversely affect our business, reputation, results of operations and financial condition.\nSince a defect or failure in our product could give rise to failures in the goods that incorporate them (and claims for consequential damages against our customers from their customers), we may face claims for damages that are disproportionate to the revenue and profits we receive from the products involved. In certain instances, we attempt to limit our liability through our standard terms and conditions or other contractual provisions, but there is no assurance that such limitations will be effective. To the extent we are liable for damages in excess of the revenue and profits received from the products involved, our results of operations and financial condition could be materially adversely affected.\nCurrency fluctuations, changes in foreign exchange regulations and repatriation delays and costs could have a material adverse effect on our results of operations and financial condition.\nWe have sizeable sales and operations in the Asia/Pacific region and Europe and a significant amount of this business is transacted in currency other than U.S. dollars. In addition, while a significant percentage of our cash is generated outside the U.S., many of our liabilities, including our outstanding indebtedness, and certain other cash payments, such as share repurchases, are payable in the U.S. in U.S. dollars. As a result, currency fluctuations and changes in foreign exchange regulations can have a material adverse effect on our liquidity and financial condition.\nIn addition, repatriation of funds held outside the U.S. could have adverse tax consequences and could be subject to delay due to required local country approvals or local obligations. Foreign exchange regulations may also limit our ability to convert or repatriate foreign currency. As a result of having a lower amount of cash and cash equivalents in the U.S., our financial flexibility may be reduced, which could have a material adverse effect on our ability to make interest and principal payments due under our various debt obligations. Restrictions on repatriation or the inability to use cash held abroad to fund our operations in the U.S. may have a material adverse effect on our liquidity and financial condition.\nTrends, Risks and Uncertainties Related to Intellectual Property\nIf our technologies are subject to claims of infringement on the IP rights of others, efforts to address such claims could have a material adverse effect on our results of operations.\nWe may from time to time be subject to claims that we may be infringing the IP rights of others. If necessary or desirable, we may seek licenses under such IP rights. However, we cannot assure you that we will obtain such licenses or that the terms of any offered licenses will be acceptable to us. The failure to obtain a license from a third party for IP we use could cause us to incur substantial liabilities or to suspend the manufacture or shipment of products or our use of processes requiring such technologies. Further, we may be subject to IP litigation, which could cause us to incur significant expense, materially adversely affect sales of the challenged product or technologies and divert the efforts of our technical and management personnel, whether or not such litigation is resolved in our favor. In the event of an adverse outcome or pursuant to the terms of a settlement of any such litigation, we may be required to: pay substantial damages or settlement costs; indemnify customers or distributors; cease the manufacture, use, sale or importation of infringing products; expend significant resources to develop or acquire non-infringing technologies; discontinue the use of processes; or obtain licenses, which may not be available on reasonable terms, to the infringing technologies.\nThe outcome of IP litigation is inherently uncertain and, if not resolved in our favor, could materially adversely affect our business, financial condition and results of operations.\nIf we are unable to protect the IP we have developed or licensed, our competitive position, business and results of operations could be materially and adversely affected.\nThe enforceability of our patents, trademarks, copyrights, software licenses and other IP is uncertain in certain circumstances. Effective IP protection may be unavailable, limited or not applied for in the U.S. and internationally. The various laws and regulations governing our registered and unregistered IP assets, patents, trade secrets, trademarks, mask works and copyrights to protect our products and technologies are subject to legislative and regulatory change and interpretation by courts. With respect to our IP generally, we cannot assure you that:\n•any of the substantial number of U.S. or foreign patents and pending patent applications that we employ in our business will not lapse or be invalidated, circumvented, challenged, abandoned or licensed to others;\n•any of our pending or future patent applications will be issued or have the coverage originally sought;\n•any of the trademarks, copyrights, trade secrets, know-how or mask works that we employ in our business will not lapse or be invalidated, circumvented, challenged, abandoned or licensed to others;\n•any of our pending or future trademark, copyright, or mask work applications will be issued or have the coverage originally sought; or\n•that we will be able to successfully enforce our IP rights in the U.S. or foreign countries.\nWhen we seek to enforce our rights, we are often subject to claims that the IP right is invalid, is otherwise not enforceable or is licensed to the party against whom we are asserting a claim. In addition, our assertion of IP rights often results in the other party seeking to assert alleged IP rights of its own against us, which may materially and adversely impact our business. An unfavorable ruling in these sorts of matters could include money damages or an injunction prohibiting us from manufacturing or selling one or more products, which could in turn negatively affect our business, results of operations or cash flows.\nIn addition, some of our products and technologies are not covered by any patents or pending patent applications. We seek to protect our proprietary technologies, including technologies that may not be patented or patentable, in part by confidentiality agreements and, if applicable, inventors’ rights agreements with our collaborators, advisors, employees and consultants. We cannot assure you that these agreements will not be breached, that we will have adequate remedies for any breach or that persons or institutions will not assert rights to IP arising out of our research. Should we be unable to protect our IP, competitors may develop products or technologies that duplicate our products or technologies, benefit financially from innovations for which we bore the costs of development and undercut the sales and marketing of our products, all of which could have a material adverse effect on our business and results of operations.\nTrends, Risks and Uncertainties Related to Technology and Data Privacy\nWe may be subject to disruptions or breaches of our secured network that could irreparably damage our reputation and our business, expose us to liability and materially adversely affect our results of operations.\nWe routinely collect and store sensitive data, including confidential and other proprietary information about our business and our employees, customers, suppliers and business partners. The secure processing, maintenance and transmission of this information is critical to our operations and business strategy. We may be subject to disruptions or breaches of our secured network caused by computer viruses, illegal hacking, criminal fraud or impersonation, acts of vandalism or terrorism or employee error. Our cyber security measures and/or those of our third-party service providers and/or customers may not detect or prevent such security breaches. The costs to us to reduce the risk of or alleviate cyber security breaches and vulnerabilities could be significant, and our efforts to address these problems may not be successful and could result in interruptions and delays that may materially impede our sales, manufacturing, distribution or other critical functions. Any such compromise of our information security could result in the misappropriation or unauthorized publication of our confidential business or proprietary information or that of other parties with which we do business, an interruption in our operations, the unauthorized transfer of cash or other of our assets, the unauthorized release of customer or employee data or a violation of privacy or other laws. In addition, computer programmers and hackers also may be able to develop and deploy viruses, worms and other malicious software programs that attack our products, or that otherwise exploit any security vulnerabilities, and any such attack, if successful, could expose us to liability to customer claims. Any of the foregoing could irreparably damage our reputation and business, which could have a material adverse effect on our results of operations.\nThe Company is subject to governmental laws, regulations and other legal obligations related to privacy and data protection.\nThe legislative and regulatory framework for privacy and data protection issues worldwide is rapidly evolving and is likely to remain uncertain for the foreseeable future. We collect Personally Identifiable Information (\"PII\") and other data as part of our business processes and activities. This data is subject to a variety of laws and regulations, including oversight by various regulatory or other governmental bodies. Many foreign countries and governmental bodies, including the European Union and other relevant jurisdictions where we conduct business, have laws and regulations concerning the collection and use of PII and other data obtained from their residents or by businesses operating within their jurisdictions that are currently more restrictive than those in the U.S. Any inability, or perceived inability, to adequately address privacy and data protection concerns, even if unfounded, or to comply with applicable laws, regulations, policies, industry standards, contractual obligations or other legal obligations, could result in additional cost and liability to the Company or company officials, including substantial monetary fines, and could damage our reputation, inhibit sales and adversely affect our business.\nTrends, Risks and Uncertainties Related to Regulation\nEnvironmental and health and safety liabilities and expenditures could materially adversely affect our results of operations and financial condition.\nThe semiconductor industry has been subject to increasing environmental regulations, particularly those environmental regulations that control and restrict the use, transportation, emission, discharge, storage and disposal of certain chemicals, elements and materials used or produced in the semiconductor manufacturing process. We also have operations subject to laws and regulations relating to workplace safety and worker health, which, among other requirements, regulate employee exposure to hazardous substances. We have indemnities from third parties for certain environmental and health and safety liabilities for periods prior to our operations at some of our current and past sites, and we have also purchased environmental insurance to cover certain claims related to historical contamination and future releases of hazardous substances. However, we cannot assure you that such indemnification arrangements and insurance will cover any or all of our material environmental costs. In addition, the nature of our operations exposes us to the continuing risk of environmental and health and safety liabilities including:\n•changes in U.S. and international environmental or health and safety laws or regulations, including, but not limited to, future laws or regulations imposed in response to climate change concerns;\n•the manner in which environmental or health and safety laws or regulations will be enforced, administered or interpreted;\n•our ability to enforce and collect under indemnity agreements and insurance policies relating to environmental liabilities;\n•the cost of compliance with future environmental or health and safety laws or regulations or the costs associated with any future environmental claims, including the cost of clean-up of currently unknown environmental conditions; or\n•the cost of fines, penalties or other legal liability, should we fail to comply with environmental or health and safety laws or regulations.\nTo the extent that we face unforeseen environmental or health and safety compliance costs or remediation expenses or liabilities that are not covered by indemnities or insurance, we may bear the full effect of such costs, expenses and liabilities, which could materially adversely affect our results of operations and financial condition.\nWe are subject to anti-corruption laws in the jurisdictions in which we operate, including the FCPA. Our failure to comply with these laws could result in penalties that could harm our reputation and have a material adverse effect on our business, financial condition and results of operations.\nWe are subject to the FCPA, which generally prohibits companies and their intermediaries from making improper payments to foreign officials for the purpose of obtaining or keeping business and/or other benefits, along with various other anti-corruption laws. Although we have implemented policies and procedures designed to ensure that we, our employees and other intermediaries comply with the FCPA and other anti-corruption laws to which we are subject, there is no assurance that such policies or procedures will work effectively all of the time or protect us against liability under the FCPA or other laws for actions taken by our employees and other intermediaries with respect to our business or any businesses that we may acquire. If we are not in compliance with the FCPA and other laws governing the conduct of business with government entities (including local laws), we may be subject to criminal and civil penalties and other remedial measures, which could have a material adverse impact on our business, financial condition, results of operations and liquidity. Any investigation of any potential violations of the FCPA or other anti-corruption laws by the U.S. or foreign authorities could harm our reputation and have an adverse impact on our business, financial condition and results of operations.\nWe could be subject to changes in tax legislation or have exposure to additional tax liabilities, which could adversely affect our results of operations and financial condition.\nWe conduct operations worldwide through our foreign subsidiaries and are, therefore, subject to complex income tax and transfer pricing regulations in the jurisdictions in which we operate. Changes to, or interpretations of, tax legislation or regulations could significantly increase our effective tax rate and ultimately reduce our cash flow from operating activities. In addition, other factors or events, such as changes to our operating structure, strategy and investment decisions, could also increase our future effective tax rate and ultimately reduce our cash flow from operating activities.\nTax rules may change in a manner that adversely affects our future reported results of operations or the way we conduct our business. In response to the 2017 Tax Cuts and Jobs Act and to better align our profits with our activities, we implemented certain restructuring during the year ended December 31, 2020. After our restructuring, most of our income is taxable in the United States with a significant portion qualifying for preferential treatment as foreign-derived intangible income (“FDII”). Beginning in 2026, the effective rate for FDII increases from 13% to 16%. Further, if U.S. rates increase and/or the FDII deduction is eliminated or reduced, both of which have been proposed by the current U.S. presidential administration and Congress, our provision for income taxes, results of operations and cash flows would be adversely (potentially materially)\naffected. Also, if our customers move manufacturing operations to the United States, our FDII deduction may be reduced.\nFurther changes in tax laws of foreign jurisdictions could arise as a result of the base erosion and profit shifting project that was undertaken by the Organisation for Economic Co-operation and Development (“OECD”). The OECD, which represents a coalition of member countries, recommended changes to numerous long-standing tax principles related to transfer pricing and continues to develop new proposals including allocating greater taxing rights to countries where customers are located and establishing a minimum tax on global income. These changes, as adopted by countries, may increase tax uncertainty and may adversely affect our provision for income taxes, results of operations and financial condition.\nSocial and environmental responsibility regulations, policies and provisions, as well as customer and investor demands, may make our supply chain more complex and may adversely affect our relationships with customers and investors.\nWith the increasing focus on corporate social and environmental responsibility in the semiconductor industry, a number of our customers have adopted, or may adopt, procurement policies that include social and environmental responsibility provisions or requirements that their suppliers should comply with, or they may seek to include such provisions or requirements in their procurement terms and conditions. In addition, an increasing number of OEMs are seeking to source products that do not contain minerals sourced from areas where proceeds from the sale of such minerals are likely to be used to fund armed conflicts, such as in the Democratic Republic of Congo. This could adversely affect the sourcing, availability and pricing of minerals used in the manufacture of semiconductor devices, including our products. As a result, we may face difficulties in satisfying these customers’ demands, which may harm our sales and operating results.\nMore investors are also requiring companies to disclose corporate social and environmental policies, practices and metrics. In addition, various jurisdictions are developing climate change-based laws or regulations that could cause us to incur additional direct costs for compliance, as well as indirect costs resulting from our customers, suppliers or both incurring additional compliance costs that are passed on to us. These legal and regulatory requirements, as well as investor expectations, on corporate environmental and social responsibility practices and disclosure, are subject to change, can be unpredictable and may be difficult and expensive for us to comply with. If we are unable to comply, or are unable to cause our suppliers to comply, with such policies or provisions or meet the requirements of our customers and investors, a customer may stop purchasing products from us or an investor may sell their shares, and may take legal action against us, which could harm our reputation, revenue and results of operations.\nTrends, Risks and Uncertainties Related to Our Indebtedness\nOur debt could materially adversely affect our financial condition and results of operations.\nAs of December 31, 2021, we had $3,258.3 million of outstanding principal relating to our indebtedness. We may need to incur additional indebtedness in the future to repay or refinance other outstanding debt, to make acquisitions or for other purposes, and if we incur additional debt, the related risks that we now face could intensify. As of December 31, 2021, we had approximately $1.97 billion available for future borrowings under the Revolving Credit Facility. The degree to which we are leveraged could have important consequences to our potential and current investors, including:\n•our ability to obtain additional financing in the future for working capital, capital expenditures, acquisitions, general corporate purposes or other purposes may be impaired;\n•the timing, amount and execution of our capital allocation policy, including our Share Repurchase Program (as defined below), could be affected by the degree to which we are leveraged;\n•a significant portion of our cash flow from operating activities must be dedicated to service our debt, which reduces the funds available to us for our operations and may limit our ability to engage in activities that may be in our long-term best interests;\n•some of our debt are and will continue to be at variable rates of interest, which may result in higher interest expense in the event of increases in market interest rates;\n•our debt agreements may contain, and any agreements to refinance our debt could continue to contain, financial and restrictive covenants, and our failure to comply with them may result in an event of default which if not cured or waived, could have a material adverse effect on us;\n•our level of indebtedness will increase our vulnerability to, and reduce our flexibility to respond to, general economic downturns and adverse industry and business conditions;\n•as our long-term debt ages, we must repay, and may need to renegotiate, such debt or seek additional financing;\n•our existing debt requires substantially all of our assets to be collateralized and to the extent any future debt we incur requires collateral to secure such indebtedness, our assets could be at risk and our flexibility related to such assets could be limited;\n•our debt service obligations could limit our flexibility in planning for, or reacting to, changes in our business and the semiconductor industry;\n•our ability to deduct interest expense that we may incur may be limited or deferred under U.S. and/or local tax rules, including Section 163(j) of the Code and the Treasury Regulations promulgated thereunder; and\n•our level of indebtedness may place us at a competitive disadvantage relative to less leveraged competitors.\nTo the extent that we continue to maintain or expand our significant indebtedness, our financial condition and results of operations may be materially adversely affected.\nThe inability to meet our obligations under our Amended Credit Agreement could materially and adversely affect us by, among other things, limiting our ability to conduct our operations and reducing our flexibility to respond to changing business and economic conditions.\nThe obligations under the Amended Credit Agreement are collateralized by a lien on substantially all of the personal property and material real property assets of the Company’s domestic subsidiaries. As a result, if we are unable to satisfy our obligations under the Amended Credit Agreement, the lenders could take possession of and foreclose on the pledged collateral securing the indebtedness, in which case we would be at risk of losing the related collateral, which would have a material adverse effect on our business and operations. In addition, subject to customary exceptions, the Amended Credit Agreement requires mandatory prepayment under certain circumstances, which may result in prepaying outstanding amounts under the Revolving Credit Facility and the Term Loan \"B\" Facility rather than using funds for other business purposes. Our financing could have a material adverse effect on our business and financial condition, including, among other things, our ability to obtain additional financing for working capital, capital expenditures, acquisitions, and other general corporate purposes and could reduce our flexibility to respond to changing business and economic conditions.\nThe agreements relating to our indebtedness, including the Amended Credit Agreement and the 3.875% Notes, may restrict our ability to operate our business, and as a result may materially adversely affect our results of operations.\nOur debt agreements, including the Amended Credit Agreement and the 3.875% Notes, contain, and any future debt agreements may include, a number of restrictive covenants that impose significant operating and financial restrictions on us and our subsidiaries. Such restrictive covenants may significantly limit our ability to: incur additional debt, including issuing guarantees; incur liens; make certain investments; settle a conversion of our 1.625% Notes in whole or in part with cash; redeem, or otherwise perform our obligations under the terms of, our 3.875% Notes; sell or otherwise dispose of assets; make acquisitions; engage in mergers or consolidations or certain other \"change of control\" transactions; make distributions to our stockholders; engage in restructuring activities; engage in certain sale and leaseback transactions; and issue or repurchase stock or other securities.\nSuch agreements may also require us to satisfy other requirements, including maintaining certain financial ratios and condition tests. Our ability to meet these requirements can be affected by events beyond our control, and we may be unable to meet them. To the extent we fail to meet any such requirements and are in default under our debt obligations, our financial condition may be materially adversely affected. These restrictions may limit our ability to engage in activities that could otherwise benefit us. To the extent that we are unable to engage in activities that support the growth, profitability and competitiveness of our business, our results of operations may be materially adversely affected.\nWe may not be able to generate sufficient cash flow to meet our debt service obligations, and any inability to repay our debt when required would have a material adverse effect on our business, financial condition and results of operations.\nOur ability to generate sufficient cash flow from operating activities to make required payments on our debt obligations will depend on our future financial performance, which will be affected by a range of economic, competitive, and business factors, many of which are outside of our control. If we do not generate sufficient cash to satisfy our debt obligations as they come due, we may have to undertake alternative financing plans, such as refinancing or restructuring our debt, selling additional assets, reducing or delaying capital investments, or seeking to raise additional capital. We cannot assure you that any refinancing would be possible, that any assets could be sold, or, if sold, of the timing of the sales and the amount of proceeds realized from those sales, or that additional financing could be obtained on acceptable terms, if at all, or would be permitted under the terms of our various debt instruments then in effect.\nFurthermore, we cannot assure you that, if we were required to repurchase any of our debt securities upon a change of control or other specified event, our assets or cash flow would be sufficient to fully repay borrowings under our outstanding debt instruments or that we would be able to refinance or restructure the payments on those debt securities. If we are unable to repay, refinance or restructure our indebtedness under our collateralized debt, the holders of such debt could proceed against the collateral securing that indebtedness, which could materially negatively impact our results of operations and financial condition. A default under our committed credit facilities, including our Amended Credit Agreement, could also limit our ability to make\nfurther borrowings under those facilities, which could materially adversely affect our business and results of operations. In addition, to the extent we are not able to borrow or refinance debt obligations, we may have to issue additional shares of our common stock, which would have a dilutive effect to the current stockholders.\nAn event of default under any agreement relating to our outstanding indebtedness could cross default other indebtedness, which could have a material adverse effect on our business, financial condition and results of operations.\nIf there were an event of default under certain of our agreements relating to our outstanding indebtedness, the holders of the defaulted debt could cause all amounts outstanding with respect to that debt to be due and payable immediately, which default or acceleration of debt could cross default other indebtedness. Any such cross default would put immediate pressure on our liquidity and financial condition and would amplify the risks described above with regards to being unable to repay our indebtedness when due and payable. We cannot assure you that our assets or cash flow would be sufficient to fully repay borrowings under our outstanding debt instruments if accelerated upon an event of default and, as described above, any inability to repay our debt when due would have a material adverse effect on our business, financial condition and results of operations.\nIf our operating subsidiaries, which may have no independent obligation to repay our debt, are not able to make cash available to us for such repayment, our business, financial condition and results of operations may be adversely affected.\nWe conduct our operations through our subsidiaries. Repayment of our indebtedness is dependent on the generation of cash flow by our subsidiaries and their ability to make such cash available to us, by dividend, debt repayment or otherwise. Unless they are guarantors of our indebtedness, our subsidiaries have no obligation to pay amounts due on such indebtedness or to make funds available for that purpose. Our subsidiaries may not be able to, or may not be permitted to, make distributions to enable us to make payments in respect of our indebtedness. Each subsidiary is a distinct legal entity, and, under certain circumstances, legal, contractual, governmental, or regulatory restrictions may limit our ability to obtain cash from our subsidiaries. In the event that we do not receive distributions or payments from our subsidiaries, we may be unable to make required principal and interest payments on our indebtedness and, as described above, any inability to repay our debt when due would have a material adverse effect on our business, financial condition and results of operations.\nIf interest rates increase, our debt service obligations under our variable rate indebtedness could increase significantly, which would have a material adverse effect on our results of operations.\nBorrowings under certain of our facilities from time to time, including under our Amended Credit Agreement, are at variable rates of interest and as a result expose us to interest rate risk. If interest rates were to increase, our debt service obligations on the variable rate indebtedness would increase even though the amount borrowed remained the same, and our net income and cash flows, including cash available for servicing our indebtedness, will correspondingly decrease. While we have entered into swap agreements to reduce interest rate volatility for a portion of our Term Loan \"B\" Facility through 2024, we may not maintain interest rate swaps with respect to all of our variable rate indebtedness, and any swaps we enter into may not fully mitigate our interest rate risk. To the extent the risk materializes and is not fully mitigated, the resulting increase in interest expense could have a material adverse effect on our results of operations.\nOur Amended Credit Agreement and our interest rate swap agreements have an interest rate tied to LIBO Rate. While certain of these agreements, such as the Amended Credit Agreement, provide procedures for determining an alternative base rate in the event that LIBO Rate is discontinued, not all do so. Effective as of December 31, 2021, the United Kingdom Financial Conduct Authority (\"FCA\"), which regulates the LIBO Rate, no longer publishes LIBO Rate quotations, including one-week and two-month U.S. dollar LIBOR settings. The publication of overnight and one-, three-, six- and 12-month U.S. dollar LIBOR settings will be extended through June 30, 2023. Further, on October 21, 2021, five U.S. federal financial institution regulatory agencies, in conjunction with U.S. state bank and state credit union regulators, issued a joint statement to emphasize the expectation that supervised institutions with LIBO Rate exposure continue to progress toward an orderly transition away from LIBO Rate in advance of the 2023 deadline and providing considerations with respect to alternative base rates and appropriate fallback language, noting that failure to adequately prepare for the LIBO Rate’s discontinuance could undermine financial stability and institutions’ safety and soundness and create litigation, operational, and consumer protection risks. Regardless, there can be no assurances as to what alternative base rates may be and whether such base rates will be more or less favorable than LIBO Rate and any other unforeseen impacts of the discontinuation of LIBO Rate. The Company intends to monitor the developments with respect to the phasing out of LIBO Rate and work with its lenders to ensure the transition away from LIBO Rate will have minimal impact on its financial condition, but can provide no assurances that the impact of the discontinuation of LIBO Rate would not have a material adverse effect on its results of operations.\nThe timing of the cash payments to service the 0% Notes, the 1.625% Notes and the 3.875% Notes is not entirely in our control and may require a significant amount of cash, and we may not have sufficient cash flow or the ability to raise the funds necessary to satisfy these obligations in a timely manner.\nAs of December 31, 2021, we had outstanding approximately $155.1 million aggregate principal amount of our 1.625% Notes, $700.0 million aggregate principal amount of our 3.875% Notes and $805.0 million of aggregate principal of our 0% Notes (collectively, the \"Outstanding Notes\"). Holders of the Outstanding Notes have certain rights that would require us to make repurchases prior to the stated maturity for all or a portion of the amounts due in certain circumstances. For example, holders of the 3.875% Notes have the right to require us to repurchase all of their 3.875% Notes upon the occurrence of certain change of control triggering events accompanied by certain ratings events (as described in the indenture governing the 3.875% Notes) at a repurchase price equal to 101% of their principal amount, plus accrued and unpaid interest, if any, accrued prior to, but not including, the repurchase date.\nServicing the Outstanding Notes may require a significant amount of cash, and we may not have sufficient cash flow or the ability to raise the funds necessary to satisfy our obligations under such notes. Our ability to make cash payments in connection with conversions of the 1.625% Notes or the 0% Notes, repurchase any of the Outstanding Notes in the case of an applicable repurchase-triggering event under the respective indentures or repay such notes at maturity will depend on market conditions and our future performance, which is subject to economic, financial, competitive, and other factors beyond our control.\nFurther, if we are unable to make cash payments upon conversion of the 1.625% Notes or the 0% Notes, we would be required to issue significant amounts of our common stock, which would dilute existing stockholders.\nIn certain circumstances, a takeover of our Company and similar triggering events could also trigger an option of the holders of the 1.625% Notes, the 3.875% Notes and the 0% Notes to require us to repurchase such notes. This may have the effect of delaying or preventing a takeover of our Company that would otherwise be beneficial to the holders of the 1.625% Notes, the 3.875% Notes, the 0% Notes and our common stock, which could materially decrease the value of such notes and of our common stock.\nThe terms of the Amended Credit Agreement and the terms of the 3.875% Notes limit the amount of future indebtedness secured by liens that we may incur. If we incur significantly more debt, this could intensify the risks described above. Our decision to use our cash for other purposes, such as to make acquisitions or to repurchase our common stock, could also intensify these risks.\nThe conditional conversion features of the 1.625% Notes and the 0% Notes, if triggered, may adversely affect our financial condition and results of operations and, if we elect to settle any amounts related to conditional conversion features in common stock, any such settlement could materially dilute the ownership interests of existing stockholders.\nIf specified conditions are met, holders of the 1.625% Notes and the 0% Notes may convert their notes prior to their stated maturity in the event the conditional conversion features are triggered, holders electing to convert their notes could require us to settle a portion or all of our conversion obligations through the payment of cash. Further, we are required to settle conversions of the 0% Notes in cash up to the aggregate principal amount of the notes being converted and may elect to pay or deliver, as the case may be, cash or shares of common stock, or a combination, to settle the remaining amount. Any such cash payments could materially adversely affect our liquidity. Additionally, when the conditional conversion features are triggered at the end of a reporting period, we are required under applicable accounting rules to reclassify the outstanding principal of such notes as a current rather than long-term liability, which would result in a material reduction of our net working capital. A conditional conversion feature under the 1.625% Notes has been triggered as of December 31, 2021 and in certain prior quarters, and we can provide no assurance as to when or whether these conditional conversion features will lapse or be triggered again in the future. Any material decrease in our liquidity or reduction in our net working capital could have a material adverse effect on our financial condition and results of operations. In addition, we may elect to settle the 1.625% Notes solely in common stock to avoid an event of default under our Amended Credit Agreement, and any such issuance of common stock could materially dilute the ownership interests of existing stockholders, including stockholders who previously converted such notes to shares of our common stock. Our 0% Notes require the principal of $805.0 million to be paid in cash, the excess value, if any, can be paid in a combination of cash or shares. To the extent we elect to settle the excess in shares, the ownership interests of existing stockholders could be materially diluted.\nNote hedge and warrant transactions we have entered into may materially adversely affect the value of our common stock.\nConcurrently with the issuances of the 1.625% Notes and the 0% Notes, respectively, we entered into note hedge transactions with certain financial institutions, which we refer to as the option counterparties. The convertible note hedges are expected to\nreduce the potential dilution upon any conversion of the respective series of notes and/or offset any cash payments we are required to make in excess of the principal amount of converted notes of such series, as the case may be. We also entered into warrant transactions with the option counterparties with respect to the 1.625% Notes and the 0% Notes. The warrant transactions could separately have a dilutive effect on our common stock to the extent that the market price per share of our common stock exceeds $30.70, with respect to the 1.625% Notes, and $74.34, with respect to the 0% Notes.\nIn connection with establishing their initial hedge of the convertible note hedges and warrant transactions for the 1.625% Notes and the 0% Notes, the option counterparties or their respective affiliates have purchased shares of our common stock and/or entered into various derivative transactions with respect to our common stock. The option counterparties or their respective affiliates may modify their hedge positions by entering into or unwinding various derivatives contracts with respect to our common stock and/or purchasing or selling our common stock or other securities of ours in secondary market transactions prior to the maturity of such notes. The potential effect, if any, of these transactions and activities on the market price of our common stock will depend in part on market conditions and cannot be ascertained at this time. Any of these activities could materially adversely affect the value of our common stock.\nCounterparty risk with respect to the note hedge transactions, if realized, could have a material adverse impact on our results of operations.\nThe option counterparties are financial institutions or affiliates of financial institutions, and we are subject to the risk that these option counterparties may default under the note hedge transactions. We can provide no assurances as to the financial stability or viability of any of the option counterparties. Our exposure to the credit risk of the option counterparties is not secured by any collateral. If one or more of the option counterparties to one or more of our note hedge transactions becomes subject to insolvency proceedings, we will become an unsecured creditor in those proceedings with a claim equal to our exposure at the time under those transactions.\nTo the extent the option counterparties do not honor their contractual commitments with us pursuant to the note hedge transactions, we could face a material increase in our exposure to potential dilution upon any conversion of the 1.625% Notes and/or the 0% Notes and/or cash payments we are required to make in excess of the principal amount of converted 1.625% Notes and/or the 0% Notes, as the case may be. Our exposure will depend on many factors but, generally, the increase in our exposure will be correlated to the increase in the market price of our common stock and in the volatility of the market price of our common stock. In addition, upon a default by one of the option counterparties, we may suffer adverse tax consequences with respect to our common stock. Any such adverse tax consequences or increased cash payments could have a material adverse effect on our results of operations.\nTrends, Risks and Uncertainties Related to Our Common Stock\nProvisions in our charter documents may delay or prevent the acquisition of our Company, which could materially adversely affect the value of our common stock.\nOur certificate of incorporation and by-laws contain provisions that could make it harder for a third party to acquire us without the consent of our Board of Directors. These provisions:\n•establish advance notice requirements for submitting nominations for election to the Board of Directors and for proposing matters that can be acted upon by stockholders at a meeting;\n•authorize the issuance of \"blank check\" preferred stock, which is preferred stock that our Board of Directors can create and issue without prior stockholder approval and that could be issued with voting or other rights or preferences that could impede a takeover attempt; and\n•require the approval by holders of at least 66 2/3% of our outstanding common stock to amend any of these provisions in our certificate of incorporation or by-laws.\nAlthough we believe these provisions make a higher third-party bid more likely by requiring potential acquirers to negotiate with our Board of Directors, these provisions apply even if an initial offer may be considered beneficial by some stockholders. Any delay or prevention of an acquisition of our Company that would have been beneficial to our stockholders could materially decrease the value of our common stock.\nGeneral Risk Factors\nWe may be unable to successfully integrate new strategic acquisitions, which could materially adversely affect our business, results of operations and financial condition.\nWe have made, and may continue to make, strategic acquisitions and alliances that involve significant risks and uncertainties. Successful acquisitions and alliances in our industry require, among other things, efficient integration and aligning of product offerings and manufacturing operations and coordination of sales and marketing and research and development efforts, often in markets or regions in which we have less experience. Risks related to successful integration of an acquisition include, but are not limited to: (1) the ability to integrate information technology and other systems; (2) issues not discovered in our due diligence; (3) customers responding by changing their existing business relationships with us or the acquired company; (4) diversion of management’s attention from our day to day operations; and (5) loss of key employees post-integration. In addition, we may incur unexpected costs or taxes resulting from the acquisition or integration of the newly acquired business. Missteps or delays in integrating our acquisitions, which could be caused by factors outside of our control, or our failure to realize the expected benefits of the acquisitions on the timeline we anticipate, could materially adversely affect our results of operations and financial condition.\nDepending on the level of our ownership interest in and the extent to which we can exercise control over the acquired business, we may be required by U.S. generally accepted accounting principles (\"GAAP\") and SEC rules and regulations to consolidate newly acquired businesses into our consolidated financial statements. The acquired businesses may not have independent audited financial statements or statements prepared in accordance with GAAP, or the acquired businesses may have financial controls and systems that are not compatible with our financial controls and systems, any of which could materially impair our ability to properly integrate such businesses into our consolidated financial statements on a timely basis. Any revisions to, inaccuracies in or restatements of our consolidated financial statements due to accounting for our acquisitions could have a material adverse effect our financial condition and results of operations.\nDownturns or volatility in general economic conditions, as well as general macroeconomic trends and impacts, could have an adverse impact on our business, results of operations, financial condition and cash flows.\nHistorically, worldwide semiconductor industry sales have tracked the impacts of financial crises, subsequent recoveries and persistent economic uncertainty. We believe our business today is driven more by secular growth drivers and not solely by macroeconomic and industry cyclicality, as was the case historically, yet we could experience period-to-period fluctuations in operating results due to general industry or economic conditions and volatile or uncertain economic conditions can adversely impact our sales and profitability and make it difficult for us and our competitors to accurately forecast and plan our future business activities.\nIn addition to general economic conditions, impacts of other macroeconomic events, such as the COVID-19 pandemic, climate change and other natural disasters, could materially adversely impact our operations by causing disruptions in the geographies in which we and our suppliers, third party distributors and sub-contractors operate. If any of these events impact our supply chain, manufacturing and product shipments could be delayed, which could materially adversely affect our business, results of operations and financial condition. In addition, disruption of transportation and distribution systems could result in reduced operational efficiency and customer service interruption. Such events can negatively impact revenue and earnings and can significantly impact cash flow.\nRegulatory and legislative developments related to climate change may materially adversely affect our business and financial condition.\nVarious jurisdictions are developing climate change-based laws or regulations that could cause us to incur additional direct costs for compliance, as well as indirect costs resulting from our customers, suppliers, or both incurring additional compliance costs that are passed on to us. These legal and regulatory requirements, as well as heightened investor expectations, on corporate environmental and social responsibility practices and disclosure, are subject to change, can be unpredictable, and may be difficult and expensive for us to comply with, given the complexity of our supply chain and our significant outsourced manufacturing. If we are unable to comply, or are unable to cause our suppliers to comply, with such policies or provisions or meet the requirements of our customers and investors, a customer may stop purchasing products from us or an investor may sell their shares, and may take legal action against us, which could harm our reputation, revenue and results of operations. Any future climate change regulations could also negatively impact our ability to compete with companies situated in areas not subject to such limitations. Given the political significance and uncertainty around the impact of climate change, we cannot predict how legislation and regulation will affect our financial condition, operating performance and ability to compete. Furthermore, increased awareness and any adverse publicity in the global marketplace about potential impacts on climate change by us or others in our industry could harm our reputation. Any of the foregoing could result in a material adverse effect on our business and financial condition.",
    "item_1B": "Item 1B. Unresolved Staff Comments\nNone.",
    "item_1C": "",
    "item_2": "Item 2. Properties\nOur corporate headquarters, as well as certain design center and research and development operations, are located in approximately 600,000 square feet of building space on property that we own in Phoenix, Arizona. We also own and lease properties around the world for use as sales offices, design centers, research and development labs, warehouses, logistic centers, trading offices and manufacturing support. The size and location of these properties, which are used by all of our reportable segments, change from time to time based on business requirements. We operate distribution centers, which are leased or contracted through a third-party, in locations throughout Asia, Europe and the Americas. See \"Business-Resources\" included elsewhere in this Form 10-K for information on properties used in our manufacturing operations. While these facilities are primarily used in manufacturing operations, they also include office, utility, laboratory, warehouse and unused space. Additionally, we own and lease research and development facilities located in Australia, Belgium, Canada, China, the Czech Republic, France, Germany, India, Ireland, Israel, Italy, Japan, the Philippines, Singapore, South Korea, Romania, Russia, the Slovak Republic, Slovenia, Switzerland, Taiwan, the United Kingdom and the United States. Our joint venture in Leshan, China also owns manufacturing, warehouse, laboratory, office and other unused space. We believe that our facilities around the world, whether owned or leased, are well-maintained.\nCertain of our properties are subject to encumbrances such as mortgages and liens. See Note 9: ''Long-Term Debt'' in the notes to our audited consolidated financial statements included elsewhere in this Form 10-K for further information. In addition, due to local law restrictions, the land upon which our facilities are located in certain foreign locations is subject to varying long-term leases. See \"Business-Resources\" included elsewhere in this Form 10-K for further details on our properties and \"Business-Governmental Regulation\" for further details on environmental regulation of our properties.",
    "item_3": "Item 3. Legal Proceedings\nSee Note 13: ''Commitments and Contingencies'' under the heading \"Legal Matters\" in the notes to our audited consolidated financial statements included elsewhere in this Form 10-K for a description of legal proceedings and related matters.",
    "item_4": "Item 4. Mine Safety Disclosure\nNot applicable.\nPART II",
    "item_5": "Item 5. Market for Registrant's Common Equity, Related Stockholder Matters and Issuer Purchases of Equity Securities\nOur common stock is traded under the symbol \"ON\" on the Nasdaq Global Select Market. The stock price details can be obtained from the Nasdaq website at www.nasdaq.com. As of February 9, 2022, there were approximately 188 holders of record of our common stock and 432,497,822 shares of common stock outstanding.\nCompany Stock Performance\nThe following graph shows a comparison of the five-year cumulative total stockholder return for onsemi, the PHLX Semiconductor Sector Index and the NASDAQ Composite Index. The comparison assumes $100 was invested on December 31, 2016 in shares of our common stock and in each of the indices shown and assumes that all of the dividends were reinvested. Note that past stock price performance is not necessarily indicative of future stock price performance.\nWe have neither declared nor paid any cash dividends on our common stock since our initial public offering. Our future dividend policy with respect to our common stock will depend upon our earnings, capital requirements, financial condition, debt restrictions and other factors deemed relevant by our Board of Directors in its sole discretion.\nOur outstanding debt facilities may limit the amount of dividends we are permitted to pay and the amount we are permitted to buy back shares under the Share Repurchase Program (as defined below). So long as no default has occurred and is continuing or results therefrom, our Amended Credit Agreement permits us to pay cash dividends to our common stockholders, buy back shares under the Share Repurchase Program, or a combination thereof, in an amount up to $100.0 million. Additionally, we may pay dividends and buy back shares under the Share Repurchase Program in an unlimited amount so long as, after giving effect thereto, the consolidated total net leverage ratio (calculated in accordance with our Amended Credit Agreement) does not exceed 2.50 to 1.00. See Note 9: ''Long-Term Debt'' in the notes to the audited consolidated financial statements included elsewhere in this Form 10-K for further discussion of our Amended Credit Agreement.\nIssuer Purchases of Equity Securities\nThe following table provides information regarding repurchases of our common stock during the quarter ended December 31, 2021:\n_______________________\n(1)The periods represent our fiscal month start and end dates for the fourth quarter of 2021.\n(2)The number of shares purchased represents shares of common stock held by employees who tendered owned shares of common stock to the Company to satisfy the employee withholding taxes due upon the vesting of RSUs. Also included in the November 27, 2021 - December 31, 2021 period is an aggregate of 1,580,990 shares that were received on December 14, 2021 pursuant to bond hedges for which no cash was exchanged. See Note 9: ''Long-Term Debt'' in the notes to the consolidated financial statements included elsewhere in this Form 10-K for additional information on this transaction.\n(3)The price per share is based on the fair market value at the time of tender, repurchase or exercise of outstanding put options, respectively.\n(4)Represents the authorized amount remaining under the Share Repurchase Program.\nShare Repurchase Program\nThere were no repurchases of common stock under the Share Repurchase Program during the year ended December 31, 2021. There were $65.3 million in repurchases of the Company's stock under the Share Repurchase Program during the year ended December 31, 2020.\nUnder the Share Repurchase Program, we may repurchase our common stock from time to time in privately negotiated transactions or open market transactions, including pursuant to a trading plan in accordance with Rule 10b5-1 and Rule 10b-18 of the Exchange Act, or by any combination of such methods or other methods. The timing of any repurchases and the actual number of shares repurchased will depend on a variety of factors, including our stock price, corporate and regulatory requirements, restrictions under our debt obligations, and other market and economic conditions. The Share Repurchase Program does not require us to purchase any particular amount of common stock and is subject to a variety of factors including the Board’s discretion. As of December 31, 2021, the authorized amount remaining under the Share Repurchase Program was $1,295.8 million.\nSee Note 10: ''Earnings Per Share and Equity'' of the notes to our audited consolidated financial statements included elsewhere in this Form 10-K for further information on shares of common stock tendered to the Company by employees to satisfy applicable employee withholding taxes due upon vesting of RSUs and the Share Repurchase Program.",
    "item_6": "Item 6. [Reserved]",
    "item_7": "Item 7. Management’s Discussion and Analysis of Financial Condition and Results of Operations\nYou should read the following discussion in conjunction with our audited historical consolidated financial statements, including the notes thereto, which are included elsewhere in this Form 10-K. Management's Discussion and Analysis of Financial Condition and Results of Operations contains statements that are forward-looking. These statements are based on current expectations and assumptions that are subject to risk, uncertainties, and other factors. Actual results could differ materially because of the factors discussed in \"Risk Factors\" included elsewhere in this Form 10-K.\nExecutive Overview\nThis executive overview presents summarized information regarding our business and operating trends only. For further information relating to the information summarized herein, see \"Management's Discussion and Analysis of Financial Condition and Results of Operations\" in its entirety.\nonsemi Results\nOur revenue for the year ended December 31, 2021 was $6,739.8 million, an increase of 28.3% from $5,255.0 million for the year ended December 31, 2020. The increase was attributable to the improving economic conditions and an exceptionally strong market for semiconductor products resulting in a significant increase in demand across PSG, ASG and ISG. During 2021, we reported net income attributable to onsemi of $1,009.6 million compared to $234.2 million in 2020. Our operating income totaled $1,287.6 million during 2021 compared to $348.7 million during 2020. The increase in operating income and net income attributable to onsemi was due to significantly better gross margins from higher sales volume, favorable mix, increase in average selling prices, better utilization in factories and savings from restructuring activities. Our gross margin increased by approximately 760 basis points to 40.3% in 2021 from 32.7% in 2020. See discussion under \"Results of Operations\" for additional discussion on the reasons for the fluctuations year over year.\nBusiness and Macroeconomic Environment\nThe COVID-19 pandemic has had, and continues to have, a significant impact around the world, prompting governments and businesses to take unprecedented measures including restrictions on travel, business operations and temporary closures of facilities. However, during 2021, economic conditions began to improve and business conditions became stronger during the second half of the year. During 2021, we achieved revenue growth in our focused end-markets of automotive, industrial and communications infrastructure as well as expand our gross margin and operating margin as a result of cost-saving initiatives, product rationalization, favorable mix and price increases, among other actions. While the semiconductor industry conditions have resulted in increased costs throughout our supply chain, we have been able to pass a majority of such increases to our customers, which also contributed to higher revenue for 2021. We expect to continue to pursue cost-saving initiatives to be able to align our overall cost structure, capital investments and other expenditures with our expected revenue, spending and capacity levels to help offset increased costs. We have taken, and continue to take, significant cost containment efforts, including, but\nnot limited to, workforce reductions and reducing discretionary spending.\nThe ongoing impact of the COVID-19 pandemic on the Company’s operational and financial performance is uncertain and will depend on many factors outside the Company’s control, including the timing, extent, trajectory and duration of the pandemic, the emergence of new variants, the development, availability, distribution and effectiveness of vaccines and treatments, the imposition of protective public safety measures, and the impact of the pandemic on the global economy and demand for products. While all our global manufacturing sites are currently operational, our facilities could be required to temporarily curtail production levels or temporarily cease operations based on government mandates due to the COVID-19 pandemic. There can be no assurances that we will adequately forecast the magnitude or duration of the adverse economic conditions on our business or that we will effectively align our cost structure, capital investments and other expenditures with our revenue, spending and capacity levels in the future.\nSee Note 7: ''Restructuring, Asset Impairments and Other Charges, net'' in the notes to our audited consolidated financial statements included elsewhere in this Form 10-K for information relating to our most recent cost-saving initiatives.\nResults of Operations\nA discussion of our results of operations for the year ended December 31, 2021 compared to December 31, 2020 is included below. For a discussion and comparison of the results of our operations for the year ended December 31, 2020 with the year ended December 31, 2019, refer to \"Management's Discussion and Analysis of Financial Conditions and Results of Operations\" in our Form 10-K for the year ended December 31, 2020 filed with the SEC on February 16, 2021.\nOperating Results\nThe following table summarizes certain information relating to our operating results that has been derived from our audited consolidated financial statements (in millions):\nRevenue\nRevenue was $6,739.8 million and $5,255.0 million for 2021 and 2020, respectively. The increase from 2020 to 2021 of $1,484.8 million, or 28.3%, was attributable to a 32.0%, 25.6% and 22.0% increase in revenue in PSG, ASG and ISG, respectively, which is further explained below.\nWe had one customer, a distributor, whose revenue accounted for approximately 13% of the total revenue for the year ended December 31, 2021.\nRevenue by operating and reportable segments was as follows (dollars in millions):\n_______________________\n(1)Certain of the amounts may not total due to rounding of individual amounts.\nRevenue from PSG\nRevenue from PSG increased by $833.0 million, or approximately 32%, during 2021 compared to 2020. The revenue from our\nAdvanced Power Division and our Integrated Circuits, Protection and Signal Division increased by $521.7 million and $317.6 million, respectively. These increases primarily were driven by better economic conditions resulting in increased demand for our products along with a favorable mix in the products sold and an increase in average selling prices. Although we experienced supply chain constraints during 2021, they were offset by increased demand for our products, however in 2020, we experienced decreased demand, delays in fulfilling certain customer orders and certain of our factories operating at significantly reduced capacity levels as a result of the COVID-19 pandemic.\nRevenue from ASG\nRevenue from ASG increased by $489.5 million, or approximately 25.6%, during 2021 compared to 2020. The revenue from our Mobile, Computing and Cloud Division, our Automotive Division and our Industrial Solutions Division, increased by $230.3 million, $155.0 million and $110.2 million, respectively. The increases primarily were due to improved economic conditions resulting in increased demand for our products in other end-markets along with a favorable mix in the products sold and an increase in average selling prices. Although we experienced supply chain constraints during 2021, they were offset by increased demand for our products, however in 2020, we experienced decreased demand, delays in fulfilling certain customer orders and certain of our factories operating at significantly reduced capacity levels as a result of the COVID-19 pandemic.\nRevenue from ISG\nRevenue from ISG increased by $162.3 million, or approximately 22%, during 2021 compared to 2020. The revenue from our Automotive Sensing Division and our Industrial and Consumer Solutions Division increased by $152.5 million and $70.7 million, respectively, and was partially offset by a decrease of $61.0 million from the exited CCD business. The increase in revenue was due to the improvement in economic conditions, specifically with automotive component manufacturers and the automotive industry overall, resulting in increased demand for these products along with a favorable mix in the products sold and an increase in average selling prices.\nRevenue by Geographic Location\nRevenue by geographic location, based on sales billed from the respective country or regions, are as follows (dollars in millions):\n_______________________\n(1)Certain of the amounts may not total due to rounding of individual amounts.\nGross Profit and Gross Margin (exclusive of amortization of acquisition-related intangible assets)\nOur gross profit by operating and reportable segment was as follows (dollars in millions):\n_______________________\n(1)Certain of the amounts may not total due to rounding of individual amounts.\n(2)Beginning in 2021, unallocated manufacturing costs were included as part of segment operating results to determine\nsegment gross profit. As a result, the prior-period amounts have been reclassified to conform to current-period presentation.\nOur gross profit increased by $998.5 million, or approximately 58%, from $1,715.8 million during 2020 to $2,714.3 million during 2021. Gross margin increased to 40.3% during 2021 compared to 32.7% during 2020.\nThe increases in gross profit and gross margin were due to increases in sales volume, increased utilization and a better mix in the portfolio of the products sold combined with an increase in average selling prices for many of our products. The favorable economic environment and significant improvement in demand in all end-markets and specifically from automotive and industrial end-markets contributed to increased demand and better pricing for our products. We were also able to pass a majority of the increased cost from our suppliers to our customers.\nOperating Expenses\nResearch and Development\nResearch and development expenses were $655.0 million and $642.9 million, or approximately 10% and 12% of revenue for 2021 and 2020, respectively, representing an increase of $12.1 million, or approximately 2% year-over-year. The increase in variable compensation was partially offset by a decrease in payroll expenses due to restructuring activities, and costs associated with third-party consultants.\nSelling and Marketing\nSelling and marketing expenses were $293.6 million and $278.7 million, or approximately 4% and 5% of revenue for 2021 and 2020, respectively, representing an increase of $14.9 million, or approximately 5% year-over-year. The increase was primarily due to an increase in variable compensation.\nGeneral and Administrative\nGeneral and administrative expenses were $304.8 million and $258.7 million, or approximately 5% and 5% of revenue for 2021 and 2020, respectively, representing an increase of $46.1 million, or approximately 18% year-over-year. The increase was primarily due to an increase in variable compensation and stock compensation.\nAmortization of Acquisition-Related Intangible Assets\nAmortization of acquisition-related intangible assets was $99.0 million and $120.3 million for 2021 and 2020, respectively. The decrease of $21.3 million, or approximately 17.7%, was primarily due to the full amortization of certain of our technology-related intangible assets during 2020.\nRestructuring, Asset Impairments and Other Charges, net\nRestructuring, asset impairments and other charges, net was $71.4 million and $65.2 million for 2021 and 2020, respectively. Amounts incurred during 2021 primarily related to the involuntary severance plan. Amounts incurred during 2020 related to the voluntary and involuntary severance plans and certain general workforce reductions. Included in 2020 was also asset impairment charges of $17.5 million.\nFor additional information, see Note 7: ''Restructuring, Asset Impairments and Other Charges, net'' in the notes to our audited consolidated financial statements included elsewhere in this Form 10-K.\nOther Income and Expenses\nInterest Expense\nInterest expense decreased by $38.0 million, or approximately 22.6%, to $130.4 million during 2021 compared to $168.4 million in 2020, primarily due to the decrease in our long-term debt and a decrease in interest rates on our variable rate debt. Our average gross amount of long-term debt balance (including current maturities) during 2021 and 2020 was $3,423.9 million and $3,669.4 million, respectively. Our weighted average interest rate on our gross amount of long-term debt (including current maturities) was 3.8% and 4.6% per annum in 2021 and 2020, respectively.\nSee \"Liquidity and Capital Resources-Key Financing and Capital Events\" below and Note 9: ''Long-Term Debt'' in the notes to our audited consolidated financial statements included elsewhere in this Form 10-K for a description of our indebtedness and our refinancing activities.\nGain on Divestiture of Business\nGain on divestiture of business was $10.2 million in 2021, compared to zero in 2020, due to the divestiture of a business entity engaged in research and development.\nLoss on Debt Refinancing and Prepayment\nWe recorded loss on debt refinancing and prepayment of $29.0 million during 2021 related to the partial repurchase or exchange of certain of the outstanding 1.625% Notes. See \"Liquidity and Capital Resources-Key Financing and Capital Events\" below and Note 9: ''Long-Term Debt'' in the notes to our audited consolidated financial statements included elsewhere in this Form 10-K for a description of our indebtedness and our refinancing activities. No such expenses were incurred during 2020.\nOther Income (Expense)\nOther income (expense) was an expense of $8.6 million in 2020 compared to an income of $18.0 million in 2021, reflecting a change of approximately 309.3%. During 2021, we recognized actuarial gains on our pension obligations of $21.4 million which was partially offset by miscellaneous adjustments of $4.6 million, compared to an actuarial loss of $4.0 million during 2020.\nIncome Tax Provision\nWe recorded an income tax provision of $146.6 million and a benefit of $59.8 million in 2021 and 2020, respectively.\nThe income tax provision for the year ended December 31, 2021 consisted primarily of $179.4 million for income and withholding taxes of certain of our foreign and domestic operations, $3.6 million related to a discrete foreign tax rate change, $2.9 million related to return to provision adjustments and $3.4 million related to additional valuation allowance, partially offset by discrete benefits of $24.3 million relating to the release of uncertain tax positions in foreign jurisdictions for favorable audit results and lapse of statue, $6.9 million relating to net equity award windfalls and $11.5 million primarily relating to an increase in deferred tax assets expected to be realized in the foreseeable future due to the liquidation of a foreign subsidiary.\nThe income tax benefit for the year ended December 31, 2020 consisted of discrete benefits of $63.0 million primarily due to the recognition of certain deferred tax assets, net of deferred tax liabilities, related to the domestication of certain foreign subsidiaries and a benefit of $49.4 million related to the release of valuation allowance against certain state deferred tax assets. These benefits were partially offset by a provision of $43.9 million for income and withholding taxes of certain of our foreign and domestic operations, a $2.3 million discrete provision relating to prior year uncertain tax positions, a discrete provision of $5.5 million relating to additional foreign valuation allowance, and $0.9 million of other discrete items.\nFor additional information, see Note 16: ''Income Taxes'' in the notes to the audited consolidated financial statements included elsewhere in this Form 10-K.\nLiquidity and Capital Resources\nThis section includes a discussion and analysis of our cash requirements, contingencies, sources and uses of cash, operations, working capital and long-term assets and liabilities.\nContingencies\nWe are a party to a variety of agreements entered into in the ordinary course of business pursuant to which we may be obligated to indemnify other parties for certain liabilities that arise out of or relate to the subject matter of the agreements. Some of the agreements entered into by us require us to indemnify the other party against losses, including, but not limited to, losses due to IP infringement, environmental contamination and other property damage, personal injury, our failure to comply with applicable laws, our negligence or willful misconduct or our breach of representations, warranties or covenants related to such matters as title to sold assets.\nWe face risk of exposure to warranty and product liability claims in the event that our products fail to perform as expected or such failure of our products results, or is alleged to result, in economic damage, bodily injury or property damage. In addition, if any of our designed products are alleged to be defective, we may be required to participate in their recall. Depending on the significance of any particular customer and other relevant factors, we may agree to provide more favorable rights to such customer for valid defective product claims. We maintain directors’ and officers’ insurance policies that indemnify our directors and officers against various liabilities, including certain liabilities under the Exchange Act that might be incurred by any director or officer in his or her capacity as such.\nWhile our future obligations under certain agreements may contain limitations on liability for indemnification, other agreements do not contain such limitations and under such agreements it is not possible to predict the maximum potential amount of future payments due to the conditional nature of our obligations and the unique facts and circumstances involved in each particular agreement. Historically, payments made by us under any of these indemnities have not had a material effect on our business, financial condition, results of operations or cash flows, and we do not believe that any amounts that we may be required to pay under these indemnities in the future will be material to our business, financial condition, results of operations or cash flows.\nSee Note 13: ''Commitments and Contingencies'' in the notes to our audited consolidated financial statements included elsewhere in this Form 10-K for possible contingencies related to legal matters. See also \"Business-Government Regulation\" for information on certain environmental matters.\nSources and Uses of Cash\nOur balance of cash and cash equivalents was $1,352.6 million as of December 31, 2021. We require cash to: (i) fund our operating expenses, working capital requirements, outlays for strategic acquisitions and investments, (ii) service our debt, including principal and interest; (iii) conduct research and development; (iv) incur capital expenditures; and (v) repurchase our common stock. As part of our business strategy, we review acquisition and divestiture opportunities on a regular basis. During 2021, we completed the acquisition of GTAT. See Note 5: ''Acquisitions and Divestitures'' in the notes to our audited consolidated financial statements included elsewhere in this Form 10-K.\nWe believe that the key factors that could affect our internal and external sources of cash include:\n•Changes in demand for our products, including as a result of the COVID-19 pandemic, competitive pricing pressures, supply chain constraints, effective management of our manufacturing capacity, our ability to achieve further reductions in operating expenses, our ability to make progress on the achievement of our business strategy and sustainability goals, the impact of our restructuring programs on our production and cost efficiency and our ability to make the research and development expenditures required to remain competitive in our business\n•Our access to bank financing and the debt and equity capital markets that could impair our ability to obtain needed financing on acceptable terms or to respond to business opportunities and developments as they arise, including interest rate fluctuations, macroeconomic conditions, sudden reductions in the general availability of lending from banks or the related increase in cost to obtain bank financing and our ability to maintain compliance with covenants under our debt agreements in effect from time to time.\nThe following are some of the significant sources and uses of cash during 2021 outside of our operating activities and regular capital expenditures:\n•Issuance of $805.0 million aggregate principal amount of 0% Convertible Senior Notes due 2027, the net proceeds of which were used to repurchase $372.4 million in aggregate principal amount of our outstanding 1.625% Notes for a total consideration of $506.5 million in cash and 5.4 million shares of the Company's common stock.\n•Payment of $160.3 million for convertible note hedges and receipt of $93.8 million for the sale of warrants, both in relation to the issuance of the 0% Notes.\n•Repayment of the outstanding balance of $700.0 million under the Revolving Credit Facility.\n•Repurchase of $47.4 million in aggregate principal amount of our outstanding 1.625% Notes for $47.4 million in cash and 1.6 million shares of the Company's common stock.\n•Acquisition of GTAT for $424.6 million in cash.\n•Net purchases of available-for-sale securities for $44.7 million.\nOur ability to service our long-term debt, including our 0% Notes, 3.875% Notes, 1.625% Notes, the Revolving Credit Facility and the Term Loan \"B\" Facility, to remain in compliance with the various covenants contained in our debt agreements and to fund working capital, capital expenditures and business development efforts will depend on our ability to generate cash from operating activities, which is subject to, among other things, our future operating performance and the timing of the full economic recovery from the COVID-19 pandemic, as well as to financial, competitive, legislative, regulatory and other conditions, some of which may be beyond our control.\nIf we fail to generate sufficient cash from operations, we may need to raise additional equity or borrow additional funds to achieve our longer-term objectives. There can be no assurance that such equity or borrowings will be available or, if available, will be at rates or prices acceptable to us. We believe that cash flow from operating activities coupled with existing cash and cash equivalents and existing credit facilities will be adequate to fund our operating, debt repayment and capital needs, as well as enable us to maintain compliance with our various debt agreements, through at least the next 12 months. To the extent that results or events differ from our financial projections or business plans, our liquidity may be adversely impacted.\nDuring the ordinary course of business, we evaluate our cash requirements and, if necessary, adjust our expenditures for inventory, operating expenditures and capital expenditures to reflect the current market conditions and our projected sales and demand. Our capital expenditures are primarily directed towards manufacturing equipment, and can materially influence our available cash for other initiatives. Our capital expenditure levels can materially influence our available cash for other initiatives. For example, during 2021, we paid approximately $444.6 million for capital expenditures, while in 2020 we paid approximately $383.6 million. While our capital expenditures have historically been approximately 6% to 7% of annual revenue, we expect to incur capital expenditures in the range of 11% to 12% of revenue in 2022 to expand our manufacturing capabilities to meet the market demands and further improve our manufacturing cost structure.\nAs of December 31, 2021, there was $1,598.2 million outstanding under the Term Loan \"B\" Facility, in addition to $805 million aggregate principal amount of the 0% Notes, $700 million aggregate principal amount of 3.875% Notes and $155.1 million aggregate principal amount of the 1.625% Notes. The aggregate principal amount of outstanding 1.625% Notes, net of unamortized discount and issuance costs, has been reclassified as a current portion of long-term debt. The associated interest expense related to this indebtedness will continue to have a significant impact on our results of operations.\nSee Note 5: ''Acquisitions and Divestitures'' and Note 9: ''Long-Term Debt'' in the notes to our audited consolidated financial statements included elsewhere in this Form 10-K for additional information.\nCash Management\nOur ability to manage cash is limited, as our primary cash inflows and outflows are dictated by the terms of our sales and supply agreements, contractual obligations, debt instruments and legal and regulatory requirements. While we have some flexibility with respect to the timing of capital equipment purchases, we must invest in capital equipment on a timely basis to allow us to maintain our manufacturing efficiency and support our platforms for new products.\nPrimary Cash Flow Sources\nOur long-term cash generation is dependent on the ability of our operations to generate cash. Our cash flows from operating activities were $1,782.0 million, $884.3 million, and $694.7 million for the years ended December 31, 2021, 2020 and 2019, respectively. Our operating cash flows for the year ended December 31, 2021 increased by $897.7 million, or 101.5%, compared to the year ended December 31, 2020, which was primarily due to better economic conditions resulting in significantly increased demand for our products, increase in average selling prices, better mix in the products sold, cash savings from restructuring activities and better working capital management.\nOur ability to maintain positive operating cash flows is dependent on, among other factors, our success in achieving our revenue goals and manufacturing and operating cost targets. Management of our assets and liabilities, including both working capital and long-term assets and liabilities, also influences our operating cash flows, and each of these components is discussed below.\nWorking Capital\nWorking capital, calculated as total current assets less total current liabilities, fluctuates depending on end-market demand and our effective management of certain items such as receivables, inventory and payables. In times of escalating demand, our working capital requirements may be affected as we purchase additional manufacturing materials and increase production. Our working capital may also be affected by restructuring programs, which may require us to use cash for severance payments, asset transfers and contract termination costs. In addition, our working capital may be affected by acquisitions and transactions involving our convertible notes and other debt instruments. Although investments made to fund working capital will reduce our cash balances, these investments are necessary to support business and operating initiatives.\nOur working capital, excluding cash and cash equivalents and the current portion of long-term debt, was $1,046.3 million as of December 31, 2021 and has fluctuated between $885.0 million and $1,057.1 million at the end of each of our last eight fiscal quarters. Our working capital, including cash and cash equivalents and the current portion of long-term debt, was $2,238.2\nmillion as of December 31, 2021 and has fluctuated between $1,457.6 million and $2,379.8 million at the end of each of our last eight fiscal quarters. The significant fluctuation was due to the withdrawal and repayment on our Revolving Credit Facility during 2020 and 2021 as well as the reclassification of the 1.625% Notes as a current liability. We expect a significant increase in capital expenditures during 2022.\nLong-Term Assets and Liabilities\nOur long-term assets consist primarily of property, plant and equipment, intangible assets, deferred taxes and goodwill. Our manufacturing rationalization plans have included efforts to utilize our existing manufacturing assets and supply arrangements more efficiently. We believe that near-term access to additional manufacturing capacity, should it be required, could be readily obtained on reasonable terms through manufacturing agreements with third parties. We will continue to look for opportunities to make strategic purchases in the future for additional capacity.\nOur long-term liabilities, excluding long-term debt and deferred taxes, consist of liabilities under our foreign defined benefit pension plans, operating lease liabilities and contingent tax reserves. In regard to our foreign defined benefit pension plans, our annual funding of these obligations is equal to the minimum amount legally required in each jurisdiction in which the plans operate. This annual amount is dependent upon numerous actuarial assumptions. For additional information, see Note 12: ''Employee Benefit Plans'', \"Note 8: ''Balance Sheet Information'' and Note 16: ''Income Taxes'' in the notes to our audited consolidated financial statements included elsewhere in this Form 10-K.\nKey Financing and Capital Events\nOverview\nFor the past several years, we have undertaken various measures to secure liquidity to pursue acquisitions, repurchase shares of our common stock, reduce interest costs, amend existing key financing arrangements and, in some cases, extend a portion of our debt maturities to continue to provide us additional operating flexibility. Certain of these measures continued in 2021. Set forth below is a summary of certain key financing events affecting our capital structure during the last three years. For further discussion of our debt instruments, see Note 9: ''Long-Term Debt'' and for further discussion on the Share Repurchase Program (as defined below), see Note 10: ''Earnings Per Share and Equity'' in the notes to our audited consolidated financial statements included elsewhere in this Form 10-K.\n2021 Financing Events\nIssuance of 0% Convertible Senior Notes due 2027\nOn May 19, 2021, we completed a private offering of $805.0 million aggregate principal amount of 0% Notes, the proceeds of which were used to repurchase a portion of the 1.625% Notes in privately negotiated note repurchase or exchange transactions, repay a portion of the Revolving Credit Facility, pay the net cost of the related convertible note hedges after such costs were offset by the proceeds from the related sale of warrants (each described below), and general corporate purposes. The 0% Notes will mature on May 1, 2027, unless earlier repurchased or redeemed by the Company or converted pursuant to their terms.\nThe initial conversion rate of the 0% Notes is 18.8796 shares of common stock per $1,000 principal amount, which is equivalent to an initial conversion price of approximately $52.97 per share of common stock. We may redeem all or any portion of the 0% Notes, the holders may convert their 0% Notes and the conversion rate is subject to adjustment, in each case upon the occurrence of certain specified events as set forth in the Indenture governing the 0% Notes. We incurred issuance costs of $19.0 million in connection with the issuance of the 0% Notes, of which $15.7 million was capitalized as debt issuance costs and $3.3 million was allocated to the conversion option and recorded to stockholders’ equity. The debt discount and debt issuance costs are being amortized at an effective interest rate of 3.2% over the contractual term of the 0% Notes.\nIn connection with the issuance of the 0% Notes, we entered into convertible note hedge transactions with respect to our common stock with the initial purchasers of the 0% Notes or their affiliates (\"Counterparties\") and paid $160.3 million in cash for the convertible note hedges, which was recorded to stockholders’ equity. We also entered into warrant transactions with the Counterparties and received $93.8 million in cash for the sale of warrants, which was recorded to stockholders’ equity.\nPartial exchange or repurchase of the 1.625% Notes\nOn May 11, 2021, contemporaneously with the issuance of the 0% Notes, we entered into separate privately negotiated transactions with certain holders of the 1.625% Notes to repurchase or exchange, as applicable, $372.4 million in aggregate\nprincipal amount of the 1.625% Notes for a total consideration of $506.5 million in cash and 5.4 million shares of the Company’s common stock. On December 10, 2021, we repurchased $47.4 million of the 1.625% Notes for $47.4 million in cash and 1.6 million shares of common stock.\nRepayments under the Revolving Credit Facility\nDuring the year ended December 31, 2021, we repaid the outstanding balance of $700.0 million under the Revolving Credit Facility using a portion of the net proceeds from the issuance of the 0% Notes and cash generated from operations. As of December 31, 2021, we had approximately $1.97 billion available under the Revolving Credit Facility for future borrowings.\n2020 Financing Events\nMaturity and Settlement of 1.00% Notes due 2020\nThe 1.00% Notes matured on December 1, 2020. The maturity of the notes resulted in us paying $690.0 million in cash, representing the principal portion of the 1.00% Notes, to holders of the 1.00% Notes using our available cash and cash equivalents. The excess over the principal amount was settled by issuing shares of common stock held in treasury. At the time of issuance of the 1.00% Notes, we concurrently entered into hedge transactions with certain of the initial purchasers of the 1.00% Notes, and accordingly, repurchased an equivalent number of shares of our common stock at fair market value, to effectively offset the issuance of shares.\nAlso at the time of issuance of the 1.00% Notes, we sold warrants to certain bank counterparties whereby the holders of the warrants had the option to purchase from us the equivalent number of shares of our common stock at a price of $25.96 per share. All these warrants were exercised by the holders during the first and second quarters of 2021 and were settled by issuing an aggregate of 13.4 million shares of common stock.\nIssuance of 3.875% Notes\nOn August 21, 2020, we completed a private offering of $700.0 million aggregate principal amount of the 3.875% Notes. The 3.875% Notes bear interest at a rate of 3.875% per year, payable semi-annually on March 1 and September 1 of each year, beginning on March 1, 2021, and will mature on September 1, 2028, unless earlier redeemed or repurchased by us. In connection with the issuance, we incurred original issue discount and debt issuance costs amounting to $9.4 million, which has been capitalized and will be amortized to interest expense through the maturity date of September 1, 2028. The net proceeds from the issuance of the 3.875% Notes were used entirely to repay borrowings under the Revolving Credit Facility.\nBorrowing and repayment under the Revolving Credit Facility\nOn March 24, 2020, we borrowed $1,165.0 million under the Revolving Credit Facility as a precautionary measure in order to increase the Company’s cash position and provide financial flexibility in light of the uncertainty resulting from the impact of the COVID-19 pandemic. Due to better macroeconomic and business conditions, on August 21, 2020, we used the net proceeds from the issuance of the 3.875% Notes along with cash on hand to repay $1,200.0 million of outstanding borrowings. Additionally, on December 31, 2020, we repaid $65.0 million of outstanding borrowings under the Revolving Credit Facility.\nShare Repurchase Program\nDuring 2020, we repurchased 3.6 million shares of our common stock for an aggregate purchase price of $65.3 million pursuant to the Share Repurchase Program.\n2019 Financing Events\nAmendments to the Amended Credit Agreement\nOn June 12, 2019, we entered into the Fifth Amendment to the Amended Credit Agreement (the \"Fifth Amendment\") and on June 19, 2019, drew $900.0 million of the Revolving Credit Facility to partially fund the acquisition of Quantenna. On August 15, 2019, we entered into the Sixth Amendment to the Amended Credit Agreement (the \"Sixth Amendment\") which increased amounts that may be borrowed under the Revolving Credit Facility by $70.0 million to $1.97 billion. On September 19, 2019, we entered into the Seventh Amendment to the Amended Credit Agreement (the \"Seventh Amendment\") and utilized the additional borrowings pursuant to the Seventh Amendment to repay $500.5 million of the outstanding balance under the Revolving Credit Facility.\nShare Repurchase Program\nDuring 2019, we repurchased 7.8 million shares of our common stock for an aggregate purchase price of $138.9 million pursuant to the Share Repurchase Program.\nDebt Guarantees and Related Covenants\nAs of December 31, 2021, we were in compliance with the indentures relating to our 0% Notes, 3.875% Notes and 1.625% Notes and with covenants relating to our Term Loan \"B\" Facility and Revolving Credit Facility. Our 0% Notes, 3.875% Notes and 1.625% Notes are senior to the existing and future subordinated indebtedness of onsemi and our guarantor subsidiaries and rank equally in right of payment to all of our existing and future senior debt and as unsecured obligations and are subordinated to all of our existing and future secured debt to the extent of the assets securing such debt.\nSee Note 9: ''Long-Term Debt'' in the notes to our audited consolidated financial statements included elsewhere in this Form 10-K for additional information.\nCritical Accounting Policies and Estimates\nThe accompanying discussion and analysis of our financial condition and results of operations is based upon our audited consolidated financial statements, which have been prepared in accordance with accounting principles generally accepted in the United States. We believe certain of our accounting policies are critical to understanding our financial position and results of operations. We utilize the following critical accounting policies in the preparation of our financial statements.\nUse of Estimates. The preparation of financial statements in accordance with GAAP requires us to make estimates and assumptions that affect the reported amount of assets and liabilities at the date of the financial statements and the reported amount of revenue and expenses during the reporting period. We evaluate these estimates and judgments on an ongoing basis and base our estimates on experience, current and expected future conditions, third-party evaluations and various other assumptions that we believe are reasonable under the circumstances. Significant estimates have been used by management in conjunction with the following: (i) future payouts for customer incentives and amounts subject to allowances and returns; (ii) valuation and obsolescence relating to inventories; (iii) measurement of valuation allowances against deferred tax assets, and evaluations of uncertain tax positions; and (iv) assumptions used in business combinations. Additionally, during periods where it becomes applicable, significant estimates will be used by management in determining the future cash flows used to assess and test for impairment of long-lived assets and goodwill. Actual results may differ from the estimates and assumptions used in the consolidated financial statements.\nRevenue. We generate revenue from sales of our semiconductor products to direct customers and distributors. We also generate revenue, to a much lesser extent, from product development agreements and manufacturing services provided to customers. We recognize revenue when we satisfy a performance obligation in an amount reflecting the consideration to which we expect to be entitled. For sales agreements, we have identified the promise to transfer products, each of which is distinct, to be the performance obligation. For product development agreements, we have identified the completion of a service defined in the agreement to be the performance obligation. We apply a five-step approach in determining the amount and timing of revenue to be recognized: (1) identifying the contract with a customer; (2) identifying the performance obligations in the contract; (3) determining the transaction price; (4) allocating the transaction price to the performance obligations in the contract; and (5) recognizing revenue when the performance obligation is satisfied. We allocate the transaction price to each distinct product based on its relative stand-alone selling price. In determining the transaction price, we evaluate whether the price is subject to refund or adjustment to determine the net consideration to which we expect to be entitled. Substantially all of our revenue is recognized at the time control of the products transfers to the customer.\nSales to certain distributors, primarily those with ship and credit rights, can be subject to price adjustment on certain products. We develop an estimate of their expected claims under the ship and credit program based on the historical claims data submitted by product and customer and expected future claims, which requires the use of estimates and assumptions related to the amount of each claim as well as the historical period used to develop the estimate.\nOur direct customers do not have the right to return products, other than pursuant to the provisions of our standard warranty. Sales to distributors, however, are typically made pursuant to agreements that provide return rights and stock rotation provisions permitting limited levels of product returns. Provisions for discounts and rebates to customers, estimated returns and allowances, ship and credit claims and other adjustments are provided for in the same period the related revenue are recognized,\nand are netted against revenue. For non-quality related returns, we recognize a related asset for the right to recover returned products with a corresponding reduction to cost of goods sold. We record a reserve for cash discounts as a reduction to accounts receivable and a reduction to revenue, based on the experience with each customer.\nInventories. We carry our inventories at the lower of standard cost (which approximates actual cost on a first-in, first-out basis) or net realizable value and record provisions for potential excess and obsolete inventories based upon a regular analysis of inventory on hand compared to historical and projected end-user demand. The determination of projected end-user demand requires the use of estimates and assumptions related to projected unit sales for each product. These provisions can influence our results from operations. For example, when demand falls for a given part, all or a portion of the related inventory that is considered to be in excess of anticipated demand is reserved, impacting our cost of revenue and gross profit. The majority of product inventory that has been previously reserved is ultimately discarded. However, we do sell some products that have previously been written down, such sales have historically been consistently insignificant and the related impact on our margins has also been insignificant.\nIncome Taxes. Income taxes are accounted for using the asset and liability method. Under this method, deferred income tax assets and liabilities are recognized for the future tax consequences attributable to temporary differences between the financial statement carrying amounts of existing assets and liabilities and their respective tax bases. Deferred income tax assets and liabilities are measured using enacted tax rates expected to apply to taxable income in the years in which these temporary differences are expected to be recovered or settled. The effect on deferred tax assets and liabilities of a change in tax rates is recognized in income in the period that includes the enactment date. A valuation allowance is provided for those deferred tax assets for which we cannot conclude that it is more likely than not that such deferred tax assets will be realized.\nIn determining the amount of the valuation allowance, estimated future taxable income, feasible tax planning strategies, future reversals of existing temporary differences and taxable income in prior carryback years, if a carryback is permitted are considered. If we determine it is more likely than not that all or a portion of the remaining deferred tax assets will not be realized, the valuation allowance will be increased with a charge to income tax expense. Conversely, if we determine it is more likely than not to be able to utilize all or a portion of the deferred tax assets for which a valuation allowance has been provided, the related portion of the valuation allowance will be recorded as a reduction to income tax expense.\nWe recognize and measure benefits for uncertain tax positions using a two-step approach. The first step is to evaluate the tax position taken or expected to be taken in a tax return by determining if the weight of available evidence indicates that is it more likely than not that the tax positions will be sustained upon audit, including resolution of any related appeals or litigation processes. For tax positions that are more likely than not to be sustained upon audit, the second step is to measure the tax benefit as the largest amount that is more than 50% likely to be realized upon settlement. No tax benefit is recognized for tax positions that are not more likely than not to be sustained. Our practice is to recognize interest and/or penalties related to income tax matters in income tax expense. Significant judgment is required to evaluate uncertain tax positions. Evaluations are based upon a number of factors, including changes in facts or circumstances, changes in tax law, correspondence with tax authorities during the course of tax audits and effective settlement of audit issues. Changes in the recognition or measurement of uncertain tax positions could result in material increases or decreases in income tax expense in the period in which the change is made, which could have a material impact to our effective tax rate.\nBusiness Combination. We use estimates and assumptions in allocating the purchase price of acquired business by utilizing established valuation techniques appropriate for the technology industry to record the acquired assets and liabilities at fair value. We utilize the income approach, cost approach or market approach, depending upon which approach is the most appropriate based on the nature and reliability of available data. If the income approach is used, the fair value determination is predicated upon the value of the future cash flows that an asset is expected to generate over its economic life and involves significant assumptions as to cash flows, associated expenses, long-term growth rates and discount rates. The cost approach takes into account the cost to replace (or reproduce) the asset and involves assumptions relating to the asset's value of physical, functional and/or economic obsolescence that has occurred with respect to the asset. The market approach is used to estimate value from an analysis of actual transactions or offerings for economically comparable assets available as of the valuation date. Determining the fair value of acquired technology assets is judgmental in nature and requires the use of significant estimates and assumptions, including the discount rate, revenue growth rates, projected gross margins, and estimated research and development expenses.\nImpairment of Goodwill and Long-Lived Assets. We evaluate our goodwill for potential impairment annually during the fourth quarter and whenever events or changes in circumstances indicate the carrying value of goodwill may not be recoverable. Our impairment evaluation consists of a qualitative assessment, and if deemed necessary, a quantitative test is performed which compares the fair value of a reporting unit with its carrying amount, including goodwill.\nDetermining the fair value of our reporting units is subjective in nature and involves the use of significant estimates and assumptions, including projected net cash flows, discount and long-term growth rates. We determine the fair value of our reporting units based on an income approach, whereby the fair value of the reporting unit is derived from the present value of estimated future cash flows. The assumptions about estimated cash flows include factors such as future revenue, gross profit, operating expenses, and industry trends. We consider historical rates and current market conditions when determining the discount and long-term growth rates to use in its analysis. We consider other valuation methods, such as the cost approach or market approach, if it is determined that these methods provide a more representative approximation of fair value.\nWe evaluate the recoverability of the carrying amount of our property, plant and equipment and intangible assets, whenever events or changes in circumstances indicate that the carrying amount of an asset group may not be fully recoverable. Impairment is first assessed when the undiscounted expected cash flows derived for an asset group are less than its carrying amount. Impairment losses, if applicable, are measured as the amount by which the carrying value of an asset group exceeds its fair value and are recognized in operating results. We continually apply our best judgment when applying these impairment rules to determine the timing of the impairment test, the undiscounted cash flows used to assess impairments and the fair value of an impaired asset group. The dynamic economic environment in which we operate and the resulting assumptions used to estimate future cash flows impact the outcome of our impairment tests. As we continue to implement our business strategy to rationalize products and manufacturing locations to transition to a lighter internal fabrication model, there could be divestiture transactions resulting in a portion of goodwill or other assets being de-recognized, and which may or may not result in accounting charges.\nContingencies. We are involved in a variety of legal matters that arise in the normal course of business. Based on the available information, we evaluate the relevant range and likelihood of potential outcomes and we record the appropriate liability when the amount is deemed probable and reasonably estimable.\nFor a further listing and discussion of our accounting policies, see Note 2: ''Significant Accounting Policies'' in the notes to our audited consolidated financial statements included elsewhere in this Form 10-K.\nRecent Accounting Pronouncements\nFor a discussion of recent accounting pronouncements, see Note 4: ''Recent Accounting Pronouncements'' in the notes to our audited consolidated financial statements included elsewhere in this Form 10-K.",
    "item_7A": "Item 7A. Quantitative and Qualitative Disclosures About Market Risk\nWe are exposed to financial market risks, including changes in interest rates and foreign currency exchange rates. To mitigate these risks, we utilize derivative financial instruments. We do not use derivative financial instruments for speculative or trading purposes.\nAs of December 31, 2021, our gross long-term debt (including current maturities) totaled $3,258.3 million. We have no interest rate exposure to rate changes on our fixed rate debt, which totaled $3,160.1 million. We do have interest rate exposure with respect to the $98.2 million balance of our variable interest rate debt outstanding as of December 31, 2021. A 50 basis point increase in interest rates would impact our expected annual interest expense for the next 12 months by approximately $4.2 million. However, some of this impact would be offset by additional interest earned on our cash and cash equivalents should rates on deposits and investments also increase. Our interest rate swaps hedge the majority of the risk of variability in cash flows resulting from future interest payments on our variable interest rate debt.\nWhile we have observed stabilization in the capital markets impacted by the COVID-19 pandemic, there can be no assurance that equity or borrowings will be available when we access the capital markets again or, if available, will be at rates or prices acceptable to us.\nTo ensure the adequacy and effectiveness of our foreign exchange hedge positions, we continually monitor our foreign exchange forward positions, both on a stand-alone basis and in conjunction with their underlying foreign currency exposures, from an accounting and economic perspective. However, given the inherent limitations of forecasting and the anticipatory nature of exposures intended to be hedged, we cannot provide any assurances that such programs will offset more than a portion of the adverse financial impact resulting from unfavorable movements in foreign exchange rates.\nWe are subject to risks associated with transactions that are denominated in currencies other than our functional currencies, as well as the effects of translating amounts denominated in a foreign currency to the U.S. Dollar as a normal part of the reporting\nprocess. Some of our Japanese operations utilize Japanese Yen as the functional currency, which results in a translation adjustment that is included as a component of accumulated other comprehensive income.\nWe enter into forward foreign currency contracts that economically hedge the gains and losses generated by the re-measurement of certain recorded assets and liabilities in a non-functional currency. Changes in the fair value of these undesignated hedges are recognized in other income and expense immediately as an offset to the changes in the fair value of the assets or liabilities being hedged. The notional amount of foreign exchange contracts at December 31, 2021 and 2020 was $288.3 million and $263.4 million, respectively. Our policies prohibit speculation on financial instruments, trading in currencies for which there are no underlying exposures, or entering into trades for any currency to intentionally increase the underlying exposure.\nSubstantially all of our revenue is transacted in U.S. Dollars. However, a significant amount of our operating expenditures and capital purchases are transacted in local currencies, including Chinese Renminbi, Czech Koruna, Euros, Japanese Yen, Korean Won, Malaysian Ringgit, Philippine Peso and Vietnamese Dong. Due to the materiality of our transactions in these local currencies, our results are impacted by changes in currency exchange rates measured against the U.S. Dollar. For example, we determined that based on a hypothetical weighted-average change of 10% in currency exchange rates, our results would have impacted our income before taxes by approximately $143.7 million for the year ended December 31, 2021, assuming no offsetting hedge position or correlated activities.\nSee Note 15: ''Financial Instruments'' in the notes to the audited consolidated financial statements included elsewhere in this Form 10-K for further information with respect to our hedging activity.",
    "item_8": "Item 8. Financial Statements and Supplementary Data\nOur consolidated Financial Statements listed in the index appearing under Part IV, Item 15(a)(1) of this Form 10-K and the Financial Statement Schedule listed in the index appearing under Part IV, Item 15(a)(2) of this Form 10-K are filed as part of this Form 10-K and are incorporated herein by reference in this Item 8.",
    "item_9": "Item 9. Changes in and Disagreements with Accountants on Accounting and Financial Disclosure\nNone.",
    "item_9A": "Item 9A. Controls and Procedures\nEvaluation of Disclosure Controls and Procedures.\nWe carried out an evaluation, under the supervision and with the participation of our management, including our Chief Executive Officer and Chief Financial Officer, of the effectiveness of our disclosure controls and procedures (as defined in Rules 13a-15(e) and 15d-15(e) of the Exchange Act). Based upon that evaluation, our Chief Executive Officer and Chief Financial Officer concluded that, as of the end of the period covered in this Form 10-K, our disclosure controls and procedures were effective to ensure that information required to be disclosed in reports filed or submitted under the Exchange Act is recorded, processed, summarized and reported within the required time periods and is accumulated and communicated to our management, including our Chief Executive Officer and Chief Financial Officer, as appropriate, to allow timely decisions regarding required disclosure.\nChanges in Internal Control Over Financial Reporting.\nWe also carried out an evaluation, under the supervision and with the participation of our management, including our Chief Executive Officer and Chief Financial Officer, of changes to our internal control over financial reporting (as defined in Rules 13a-15(f) and 15d-15(f) of the Exchange Act) that occurred during the fiscal quarter ended December 31, 2021.\nThere have been no changes to our internal control over financial reporting (as defined in Exchange Act Rules 13a-15(f) and 15d-15(f)) that occurred during the fiscal quarter ended December 31, 2021 which have materially affected, or are reasonably likely to materially affect, our internal control over financial reporting.\nManagement's Report on Internal Control Over Financial Reporting.\nOur management is responsible for establishing and maintaining adequate internal control over financial reporting (as defined in Exchange Act Rules 13a-15(f) and 15d-15(f)). Because of its inherent limitations, internal control over financial reporting may not prevent or detect misstatements. Also, projections of any evaluation of effectiveness to future periods are subject to the\nrisk that controls may become inadequate because of changes in conditions, or that the degree of compliance with the policies and procedures may deteriorate.\nOur management assessed the effectiveness of our internal control over financial reporting as of December 31, 2021. In making this assessment, we used the criteria set forth by the Committee of Sponsoring Organizations of the Treadway Commission in Internal Control-Integrated Framework 2013. Based on this assessment, management has concluded that our internal control over financial reporting was effective as of December 31, 2021.\nManagement's assessment of the effectiveness of internal control over financial reporting as of December 31, 2021 excluded GT Advanced Technologies Inc. (\"GTAT\"), which was acquired by the Company on October 28, 2021. GTAT is a wholly-owned subsidiary of the Company and represented 0.7% and 0.1% of total assets and total revenue, respectively, of the related consolidated financial statement amounts as of and for the year ended December 31, 2021.\nThe effectiveness of our internal control over financial reporting as of December 31, 2021 has been audited by PricewaterhouseCoopers LLP, an independent registered public accounting firm, as stated in their report which appears in \"Exhibits and Financial Statement Schedules\" of this Form 10-K.",
    "item_9B": "Item 9B. Other Information\nNone.",
    "item_9C": "Item 9C. Disclosure Regarding Foreign Jurisdictions that Prevent Inspections\nNot applicable\nPART III",
    "item_10": "Item 10. Directors, Executive Officers and Corporate Governance\nThe information under the heading \"Executive Officers of the Registrant\" in this Form 10-K is incorporated by reference into this section. Information concerning directors and persons nominated to become directors and executive officers is incorporated by reference from the text under the captions \"Management Proposals-Proposal No. 1: Election of Directors,\" \"The Board of Directors and Corporate Governance,\" \"Section 16(a) Reporting Compliance\" and \"Miscellaneous Information-Stockholder Nominations and Proposals\" in our Proxy Statement to be filed pursuant to Regulation 14A within 120 days after our fiscal year ended December 31, 2021 in connection with our 2022 Annual Meeting of Stockholders (\"Proxy Statement\").\nCode of Business Conduct\nInformation concerning our Code of Business Conduct is incorporated by reference from the text under the caption \"The Board of Directors and Corporate Governance-Code of Business Conduct\" in our Proxy Statement.",
    "item_11": "Item 11. Executive Compensation\nInformation concerning executive compensation is incorporated by reference from the text under the captions \"The Board of Directors and Corporate Governance-2021 Compensation of Directors,\" \"Compensation of Executive Officers,\" \"Compensation Committee Report,\" \"Compensation Discussion and Analysis,\" \"onsemi 2021 Pay Ratio Disclosure\" and \"Human Capital and Compensation Committee Interlocks and Insider Participation\" in our Proxy Statement.\nThe information incorporated by reference under the caption \"Compensation Committee Report\" in our Proxy Statement shall be deemed furnished, and not filed, in this Form 10-K and shall not be deemed incorporated by reference into any filing under the Securities Act or the Exchange Act as a result of this furnishing, except to the extent that we specifically incorporate it by reference.",
    "item_12": "Item 12. Security Ownership of Certain Beneficial Owners and Management and Related Stockholder Matters\nInformation concerning security ownership of certain beneficial owners and management is incorporated by reference from the text under the captions \"Principal Stockholders,\" \"Share Ownership of Directors and Officers\" and \"Share-Based Compensation Plan Information\" in our Proxy Statement.",
    "item_13": "Item 13. Certain Relationships and Related Transactions, and Director Independence\nInformation concerning certain relationships and related transactions involving us and certain others is incorporated by reference from the text under the captions \"Management Proposals-Proposal No. 1: Election of Directors,\" \"The Board of Directors and Corporate Governance,\" and \"Related Party Transactions\" in our Proxy Statement.",
    "item_14": "Item 14. Principal Accountant Fees and Services\nInformation concerning principal accounting fees and services is incorporated by reference from the text under the caption \"Audit and Related Fees\" in our Proxy Statement.\nPART IV",
    "item_15": "Item 15. Exhibits and Financial Statement Schedules\n(a) The following documents are filed as part of this Annual Report on Form 10-K:\n(1) Consolidated Financial Statements:\nON Semiconductor Corporation Consolidated Financial Statements:\nReport of Independent Registered Public Accounting Firm (PCAOB ID 238)\nConsolidated Balance Sheets as of December 31, 2021 and December 31, 2020\nConsolidated Statements of Operations and Comprehensive Income for the years ended December 31, 2021, 2020 and 2019\nConsolidated Statements of Stockholders' Equity for the years ended December 31, 2021, 2020 and 2019\nConsolidated Statements of Cash Flows for the years ended December 31, 2021, 2020 and 2019\nNotes to Consolidated Financial Statements 61\n(2) Consolidated Financial Statement Schedule:\nSchedule II - Valuation and Qualifying Accounts for the years ended December 31, 2021, 2020 and 2019\nAll other schedules are omitted because they are not applicable or the required information is shown in the financial statements or related notes\n(3) Exhibits:\nEXHIBIT INDEX*\nExhibit No. Exhibit Description\n2.1 Agreement and Plan of Merger, dated November 18, 2015, by and among Fairchild Semiconductor International, Inc., ON Semiconductor Corporation and Falcon Operations Sub, Inc. (incorporated by reference to Exhibit 2.1 to the Company’s Current Report on Form 8-K filed with the Commission on November 18, 2015)†\n2.2 Agreement and Plan of Merger, dated March 27, 2019, by and among Quantenna Communications, Inc., ON Semiconductor Corporation and Raptor Operations Sub, Inc. (incorporated by reference to Exhibit 2.1 to the Company’s Current Report on Form 8-K filed with the Commission on March 27, 2019)†\n2.3 Agreement and Plan of Merger, dated August 25, 2021, by and among ON Semiconductor Corporation, Semiconductor Components Industries, LLC, Terra Merger Sub, Inc., GT Advanced Technologies Inc. and Pirinate Consulting Group 2, LLC, as equityholder representative (incorporated by reference to Exhibit 2.1 to the Company’s Current Report on Form 8-K filed with the Commission on August 25, 2021)†\n3.1(a) Certificate of Incorporation of ON Semiconductor Corporation, as further amended through March 26, 2008 (incorporated by reference to Exhibit 3.1 to the Company’s Quarterly Report on Form 10-Q filed with the Commission on May 7, 2008)\n3.1(b) Certificate of Amendment to the Amended and Restated Certificate of Incorporation (incorporated by reference to Exhibit 3.1 to the Company’s Current Report on Form 8-K filed with the Commission on June 3, 2014)\n3.1(c) Certificate of Amendment to the Amended and Restated Certificate of Incorporation, dated May 17, 2017 (incorporated by reference to Exhibit 3.1 to the Company’s Quarterly Report on Form 10-Q filed with the Commission on August 7, 2017)\n3.1(d) Certificate of Designations of Series B Junior Participating Preferred Stock of ON Semiconductor Corporation (incorporated by reference to Exhibit 3.1 to the Company’s Current Report on Form 8-K filed with the Commission on June 8, 2020)\n3.1(e) Certificate of Elimination of Series B Junior Participating Preferred Stock of ON Semiconductor Corporation (incorporated by reference to Exhibit 3.1 to the Company’s Current Report on Form 8-K filed with the Commission on August 20, 2021)\n3.2 By-Laws of ON Semiconductor Corporation as Amended and Restated on November 21, 2013 (incorporated by reference to Exhibit 3.1 to the Company’s Current Report on Form 8-K filed with the Commission on November 25, 2013)\n4.1 Specimen of share certificate of Common Stock, par value $0.01, ON Semiconductor Corporation (incorporated by reference to Exhibit 4.1 to the Company’s Annual Report on Form 10-K filed with the Commission on March 10, 2004)\n4.2(a) Indenture regarding the 1.625% Convertible Senior Notes due 2023, dated as of March 31, 2017 among ON Semiconductor Corporation, the guarantors party thereto and Wells Fargo Bank, National Association, as trustee (incorporated by reference to Exhibit 4.1 to the Company’s Current Report on Form 8-K filed with the Commission on April 3, 2017)\n4.2(b) Form of Global 1.625% Convertible Senior Note due 2023 (included in Exhibit 4.2(a))\n4.2(c) First Supplemental Indenture to the Indenture regarding the 1.625% Convertible Senior Notes due 2023, dated as of January 7, 2020 among ON Semiconductor Corporation, the guarantors party thereto and Wells Fargo Bank, National Association, as trustee (incorporated by reference to Exhibit 4.3(c) to the Company’s Annual Report on Form 10-K filed with the Commission on February 19, 2020) (incorporated by reference to Exhibit 4.3(c) to the Company’s Annual Report on Form 10-K filed with the Commission on February 19, 2020)\n4.3(a) Indenture, dated as of August 21, 2020, among ON Semiconductor Corporation, the guarantors party thereto and Wells Fargo Bank, National Association (incorporated by reference to Exhibit 4.1 to the Company’s Current Report on Form 8-K filed with the Commission on August 21, 2020) Semiconductor Corporation, the guarantors party thereto and Wells Fargo Bank, National Association (incorporated by reference to Exhibit 4.1 to the Company’s Current Report on Form 8-K filed with the Commission on August 21, 2020)\n4.3(b) Form of Global 3.875% Senior Note due 2028 (included in Exhibit 4.3(a))\n4.4(a) Indenture, dated as of May 14, 2021, among the Company, the guarantors party thereto and Wells Fargo Bank, National Association (incorporated by reference to Exhibit 4.1 to the Company’s Current Report on Form 8-K filed with the Commission on May 19, 2021)\n4.4(b) Form of Global 0% Convertible Senior Note due 2027 (included in Exhibit 4.4(a))\n4.5 Description of the Registrant’s Securities Registered under Section 12 of the Securities Exchange Act of 1934, as amended(1)\n10.1 Amended and Restated Intellectual Property Agreement, dated August 4, 1999, among Semiconductor Components Industries, LLC and Motorola, Inc. (incorporated by reference to Exhibit 10.5 to Amendment No. 1 to the Company’s Registration Statement filed with the Commission on January 11, 2000 (File No. 333-90359))\n10.2 Lease for 52nd Street property, dated July 31, 1999, among Semiconductor Components Industries, LLC as Lessor, and Motorola, Inc. as Lessee (incorporated by reference to Exhibit 10.16 to the Company’s Registration Statement filed with the Commission on November 5, 1999 (File No. 333-90359))\n10.3 Declaration of Covenants, Easement of Restrictions and Options to Purchase and Lease, dated July 31, 1999, among Semiconductor Components Industries, LLC and Motorola, Inc. (incorporated by reference to Exhibit 10.17 to the Company’s Registration Statement filed with the Commission on November 5, 1999 (File No. 333-90359))\n10.4(a) Joint Venture Contract for Leshan-Phoenix Semiconductor Company Limited, amended and restated on April 20, 2006 between SCG (China) Holding Corporation (a subsidiary of ON Semiconductor Corporation) and Leshan Radio Company Ltd. (incorporated by reference to Exhibit 10.3 to the Company’s Quarterly Report on Form 10-Q filed with the Commission on July 28, 2006)\n10.4(b) Amendment Agreement, dated September 29, 2014, to Joint Venture Contract for Leshan-Phoenix Semiconductor Company Limited between ON Semiconductor (China) Holding, LLC (a subsidiary of ON Semiconductor Corporation) and Leshan Radio Company Ltd. (incorporated by reference to Exhibit 10.5(b) to the Company’s Annual Report on Form 10-K filed with the Commission on February 27, 2015)\n10.5(a) Credit Agreement, dated April 15, 2016, among ON Semiconductor Corporation, as borrower, the several lenders party thereto, Deutsche Bank AG New York Branch, as administrative agent and collateral agent, Deutsche Bank Securities Inc., Merrill Lynch, Pierce, Fenner & Smith Incorporated, BMO Capital Markets Corp., HSBC Securities (USA) Inc. and Sumitomo Mitsui Banking Corporation, as joint lead arrangers and joint bookrunners, Barclays Bank PLC, Compass Bank, The Bank of Tokyo-Mitsubishi UFJ, Ltd., Morgan Stanley Senior Funding, Inc., BOKF, NA and KBC Bank N.V., as co-managers, and HSBC Bank USA, N.A. and Sumitomo Mitsui Banking Corporation, as co-documentation agents (incorporated by reference to Exhibit 10.1 to the Company’s Current Report on Form 8-K filed with the Commission on April 15, 2016)\n10.5(b) Guarantee and Collateral Agreement, dated April 15, 2016, made by ON Semiconductor Corporation and the other signatories thereto in favor of Deutsche Bank AG New York Branch, as administrative agent and collateral agent (incorporated by reference to Exhibit 10.2 to the Company’s Current Report on Form 8-K filed with the Commission on April 15, 2016)\n10.5(c) Escrow Agreement, dated April 15, 2016, among ON Semiconductor Corporation, MUFG Union Bank, N.A., as escrow agent, and Deutsche Bank AG New York Branch, as administrative agent and collateral agent (incorporated by reference to Exhibit 10.3 to the Company’s Current Report on Form 8-K filed with the Commission on April 15, 2016)\n10.5(d) Joinder to Amended and Restated Guaranty, dated March 15, 2016, among the guarantors party thereto (incorporated by reference to Exhibit 10.1 to the Company’s Current Report on Form 8-K filed with the Commission on March 17, 2016)\n10.5(e) Joinder to Amended and Restated Guaranty, dated April 14, 2016, among the guarantors party thereto (incorporated by reference to Exhibit 10.4 to the Company’s Current Report on Form 8-K filed with the Commission on April 15, 2016)\n10.5(f) Assumption Agreement, dated September 19, 2016, by and between ON Semiconductor (China) Holdings, LLC and Deutsche Bank AG New York Branch (incorporated by reference to Exhibit 10.1 to the Company’s Current Report on Form 8-K filed with the Commission on September 23, 2016)\n10.5(g) Pledge Supplement, dated September 19, 2016, by ON Semiconductor (China) Holdings, LLC (incorporated by reference to Exhibit 10.2 to the Company’s Current Report on Form 8-K filed with the Commission on September 23, 2016)\n10.5(h) Assumption Agreement, dated September 19, 2016, by and among Fairchild Semiconductor International, Inc., Fairchild Semiconductor Corporation, Fairchild Semiconductor Corporation of California, Giant Holdings, Inc., Fairchild Semiconductor West Corporation, Kota Microcircuits, Inc., Silicon Patent Holdings, Giant Semiconductor Corporation, Micro-Ohm Corporation, Fairchild Energy, LLC and Deutsche Bank AG New York Branch (incorporated by reference to Exhibit 10.3 to the Company’s Current Report on Form 8-K filed with the Commission on September 23, 2016)\n10.5(i) Pledge Supplement, dated September 19, 2016, by Fairchild Semiconductor International, Inc., Fairchild Semiconductor Corporation, Fairchild Semiconductor Corporation of California, Giant Holdings, Inc., Fairchild Semiconductor West Corporation, Kota Microcircuits, Inc., Silicon Patent Holdings, Giant Semiconductor Corporation, Micro-Ohm Corporation and Fairchild Energy, LLC (incorporated by reference to Exhibit 10.4 to the Company’s Current Report on Form 8-K filed with the Commission on September 23, 2016)\n10.5(j) First Amendment to Credit Agreement, dated September 30, 2016, among ON Semiconductor Corporation, as borrower, certain subsidiaries thereof, as guarantors, the several lenders party thereto, and Deutsche Bank AG New York Branch, as administrative agent and collateral agent (incorporated by reference to Exhibit 10.1 to the Company’s Current Report on Form 8-K filed with the Commission on September 30, 2016)\n10.5(k) Second Amendment to Credit Agreement, dated March 31, 2017, among ON Semiconductor Corporation, as borrower, certain subsidiaries thereof, as guarantors, the several lenders party thereto, and Deutsche Bank AG New York Branch, as administrative agent and collateral agent (incorporated by reference to Exhibit 10.1 to the Company’s Current Report on Form 8-K filed with the Commission on April 3, 2017)\n10.5(l) Third Amendment to Credit Agreement, dated November 30, 2017, among ON Semiconductor Corporation, as borrower, certain subsidiaries thereof, as guarantors, the several lenders party thereto, and Deutsche Bank AG New York Branch, as administrative agent and collateral agent (incorporated by reference to Exhibit 10.1 to the Company’s Current Report on Form 8-K filed with the Commission on December 4, 2017)\n10.5(m) Fourth Amendment to Credit Agreement, dated May 31, 2018, among ON Semiconductor Corporation, as borrower, certain subsidiaries thereof, as guarantors, the several lenders party thereto, and Deutsche Bank AG New York Branch, as administrative agent and collateral agent (incorporated by reference to Exhibit 10.1 to the Company’s Quarterly Report on Form 10-Q filed with the Commission on July 30, 2018)\n10.5(n) Fifth Amendment to Credit Agreement, dated June 12, 2019, among ON Semiconductor Corporation, as borrower, certain subsidiaries thereof, as guarantors, the several lenders party thereto, and Deutsche Bank AG New York Branch, as administrative agent and collateral agent (incorporated by reference to Exhibit 10.1 to the Company’s Current Report on Form 8-K filed with the Commission on June 17, 2019)\n10.5(o) Sixth Amendment to Credit Agreement, dated August 15, 2019, among ON Semiconductor Corporation, as borrower, certain subsidiaries thereof, as guarantors, the several lenders party thereto, and Deutsche Bank AG New York Branch, as administrative agent and collateral agent (incorporated by reference to Exhibit 10.1 to the Company’s Quarterly Report on Form 10-Q filed with the Commission on October 28, 2019)\n10.5(p) Seventh Amendment to Credit Agreement, dated September 19, 2019, among ON Semiconductor Corporation, as borrower, certain subsidiaries thereof, as guarantors, the several lenders party thereto, and Deutsche Bank AG New York Branch, as administrative agent and collateral agent (incorporated by reference to Exhibit 10.1 to the Current Report on Form 8-K filed with the Commission on September 20, 2019)\n10.5(q) Eighth Amendment to Credit Agreement, dated as of June 23, 2020, among ON Semiconductor Corporation, as borrower, certain subsidiaries thereof, as guarantors, the several lenders party thereto, and Deutsche Bank AG New York Branch, as administrative agent and collateral agent (incorporated by reference to Exhibit 10.1 to the Company’s Current Report on Form 8-K filed with the Commission on June 24, 2020)\n10.5(r) Ninth Amendment to Credit Agreement, dated as of May 10, 2021, by and among ON Semiconductor Corporation, as borrower, the subsidiary guarantors party thereto, Deutsche Bank AG New York Branch, as administrative agent and collateral agent, and certain Lenders party thereto constituting the Required lenders (incorporated by reference to Exhibit 10.3 to the Company’s Quarterly Report on Form 10-Q filed with the Commission on August 2, 2021)\n10.6(a) Form of Convertible Note Hedges related to the Company's 1.625% Convertible Senior Note due 2023(1)\n10.6(b) Form of Warrant Confirmation for Warrants related to the Company's 1.625% Convertible Senior Note due 2023(1)\n10.7(a) ON Semiconductor Corporation Amended and Restated Stock Incentive Plan (as amended and restated February 11, 2022) (1)(2)\n10.7(b) Restricted Stock Units Award Agreement under the ON Semiconductor Corporation Amended and Restated Stock Incentive Plan (2019 form agreement for Section 16 Officers) (incorporated by reference to Exhibit 10.1 to the Company’s Current Report on Form 8-K filed with the Commission on February 19, 2019)(2)\n10.7(c) 2020 Form of Performance-Based Restricted Stock Units Award for Senior Vice Presidents and Above (Upside) under the ON Semiconductor Corporation Amended and Restated Stock Incentive Plan (incorporated by reference to Exhibit 10.1 to the Company’s Current Report on Form 8-K/A filed with the Commission on March 5, 2020)(2)\n10.7(d) Restricted Stock Units Award Agreement under the ON Semiconductor Amended and Restated Stock Incentive Plan (2021 form agreement for Senior Employee Group) (incorporated by reference to Exhibit 10.4 to the Company’s Quarterly Report on Form 10-Q filed with the Commission on May 3, 2021)(2)\n10.7(e) Performance-Based Restricted Stock Units Award Agreement under the ON Semiconductor Amended and Restated Stock Incentive Plan (2021 form agreement for Tier I Employees) (incorporated by reference to Exhibit 10.3 to the Company’s Quarterly Report on Form 10-Q filed with the Commission on May 3, 2021)(2)\n10.7(f) Restricted Stock Units Award Agreement under the ON Semiconductor Corporation Amended and Restated Stock Incentive Plan for Hassane S. El-Khoury, dated December 7, 2020 (incorporated by reference to Exhibit 10.7(r) to the Company's Annual Report on Form 10-K filed with the Commission on February 16, 2021)(2)\n10.7(g) Performance-Based Restricted Stock Units Award Agreement under the ON Semiconductor Corporation Amended and Restated Stock Incentive Plan for Hassane S. El-Khoury, dated December 7, 2020 (incorporated by reference to Exhibit 10.7(s) to the Company's Annual Report on Form 10-K filed with the Commission on February 16, 2021)(2)\n10.7(h) Restricted Stock Units Award Agreement under the ON Semiconductor Corporation Amended and Restated Stock Incentive Plan for Thad Trent, dated February 16, 2021 (incorporated by reference to Exhibit 10.2 to the Company’s Quarterly Report on Form 10-Q filed with the Commission on May 3, 2021)(2)\n10.7(i) Performance-Based Restricted Stock Units Award Agreement under the ON Semiconductor Corporation Amended and Restated Stock Incentive Plan for Thad Trent, dated February 16, 2021 (incorporated by reference to Exhibit 10.3 to the Company’s Quarterly Report on Form 10-Q filed with the Commission on May 3, 2021)(2)\n10.8(a) ON Semiconductor Corporation 2000 Employee Stock Purchase Plan, as amended and restated as of May 20, 2009 (incorporated by reference to Exhibit 4.1 to the Registration Statement on Form S-8 No. 333-159381 filed with the Commission on May 21, 2009)(2)\n10.8(b) Amendment to the ON Semiconductor Corporation 2000 Employee Stock Purchase Plan, as amended as of May 15, 2013 (incorporated by reference to Exhibit 10.1 to the Company’s Quarterly Report on Form 10-Q filed with the Commission on August 2, 2013)(2)\n10.8(c) Amendment to the ON Semiconductor Corporation 2000 Employee Stock Purchase Plan, as amended as of May 20, 2015 (incorporated by reference to Exhibit 10.6 to the Company’s Quarterly Report on Form 10-Q filed with the Commission on August 3, 2015)(2)\n10.8(d) Amendment to the ON Semiconductor Corporation 2000 Employee Stock Purchase Plan, as amended as of May 17, 2017 (incorporated by reference to Exhibit 10.2 to the Company’s Quarterly Report on Form 10-Q filed with the Commission on August 7, 2017)(2)\n10.8(e) ON Semiconductor Corporation 2000 Employee Stock Purchase Plan (as amended by the amendment effective March 17, 2021), approved by stockholders May 20, 2021 (incorporated by reference to Exhibit 10.1 to the Company’s Quarterly Report on Form 10-Q filed with the Commission on August 2, 2021)(2)\n10.9 Employment Agreement by and between Semiconductor Components Industries, LLC and Hassane S. El-Khoury, dated December 7, 2020 (incorporated by reference to Exhibit 10.16 to the Company's Annual Report on Form 10-K filed with the Commission on February 16, 2021)(2)\n10.10 Employment Agreement by and between Semiconductor Components Industries, LLC and Thad Trent, dated February 16, 2021 (incorporated by reference to Exhibit 10.1 to the Company’s Quarterly Report on Form 10-Q filed with the Commission on May 3, 2021)(2)\n10.11 Employment Agreement by and between Semiconductor Components Industries, LLC and Vincent C. Hopkin, dated as of May 11, 2018 (incorporated by reference to Exhibit 10.2 to the Company’s Quarterly Report on Form 10-Q filed with the Commission on July 30, 2018)(2)\n10.12 Employment Agreement by and between Semiconductor Components Industries, LLC and Simon Keeton, dated January 1, 2019 (incorporated by reference to Exhibit 10.20 to the Company's Annual Report on Form 10-K filed with the Commission on February 20, 2019)(2)\n10.13 Key Officer Severance and Change in Control Agreement by and between Semiconductor Components Industries, LLC and Ross F. Jatou, dated as of October 1, 2020 (incorporated by reference to Exhibit 10.17 to the Company's Annual Report on Form 10-K filed with the Commission on February 16, 2021)(2)\n10.14 Form of Indemnification Agreement with Directors and Officers (incorporated by reference to Exhibit 10.1 to the Company’s Current Report on Form 8-K filed with the Commission on February 25, 2016)(2)\n10.15(a) Environmental Side Letter, dated March 11, 1997, between National Semiconductor Corporation and Fairchild Semiconductor Corporation (incorporated by reference to Exhibit 10.19 to Fairchild Semiconductor Corporation’s Registration Statement filed with the Commission on May 12, 1997 (File No. 333-26897))\n10.15(b) Intellectual Property License Agreement, dated April 13, 1999, between Samsung Electronics Co., Ltd. and Fairchild Korea Semiconductor, Ltd. (incorporated by reference to Exhibit 10.41 to Fairchild Semiconductor International, Inc.’s Registration Statement filed with the Commission on June 30, 1999 (File No. 333-78557))\n10.15(c) Technology Licensing and Transfer Agreement, dated March 11, 1997, between National Semiconductor Corporation and Fairchild Semiconductor Corporation (incorporated by reference to Amendment No. 3 to Fairchild Semiconductor Corporation’s Registration Statement on Form S-4, filed with the Commission on July 9, 1997 (File No. 333-28697))\n10.16(a) Asset Purchase Agreement, dated as of April 22, 2019, between GLOBALFOUNDRIES U.S. Inc. and Semiconductor Components Industries, LLC (incorporated by reference to Exhibit 10.1 to the Company’s Quarterly Report on Form 10-Q filed with the Commission on August 5, 2019)†\n10.16(b) Amendment No. 1 to Asset Purchase Agreement, dated October 1, 2020, by and among Semiconductor Components Industries, LLC, GLOBALFOUNDRIES U.S. Inc., and GLOBALFOUNDRIES Inc. (incorporated by reference to Exhibit 10.1 to the Company’s Current Report on Form 8-K filed with the Commission on October 7, 2020)\n10.17 Settlement Agreement, dated October 19, 2019, by and between ON Semiconductor Corporation and Power Integrations, Inc. (incorporated by reference to Exhibit 10.20 to the Company's Annual Report on Form 10-K filed with the Commission on February 19, 2020)\n10.18(a) Form of Confirmation for Convertible Notes Hedges related to the Company’s 0% Convertible Senior Note due 2027 (incorporated by reference to Exhibit 10.1 to the Company’s Current Report on Form 8-K filed with the Commission on May 19, 2021)\n10.18(b) Form of Confirmation for Warrants related to the Company’s 0% Convertible Senior Note due 2027 (incorporated by reference to Exhibit 10.2 to the Company’s Current Report on Form 8-K filed with the Commission on May 19, 2021)\n21.1 List of Significant Subsidiaries(1)\n23.1 Consent of Independent Registered Public Accounting Firm-PricewaterhouseCoopers LLP(1)\n24.1 Powers of Attorney(1)\n31.1 Certification by CEO pursuant to Rule 13a-14(a) or 15d-14(a) of the Securities Exchange Act of 1934, as adopted pursuant to Section 302 of the Sarbanes-Oxley Act of 2002(1)\n31.2 Certification by CFO pursuant to Rule 13a-14(a) or 15d-14(a) of the Securities Exchange Act of 1934, as adopted pursuant to Section 302 of the Sarbanes-Oxley Act of 2002(1)\n32 Certification by CEO and CFO pursuant to 18 U.S.C. Section 1350, as adopted pursuant to Section 906 of the Sarbanes-Oxley Act of 2002(3)\n101.INS XBRL Instance Document\n101.SCH XBRL Taxonomy Extension Schema Document\n101.CAL XBRL Taxonomy Extension Calculation Linkbase Document\n101.DEF XBRL Taxonomy Extension Definition Linkbase Document\n101.LAB XBRL Taxonomy Extension Label Linkbase Document\n101.PRE XBRL Taxonomy Extension Presentation Linkbase Document\n104 Cover Page Interactive Data File - the cover page XBRL tags are embedded within the Inline XBRL document.\n* Reports filed under the Securities Exchange Act (Form 10-K, Form 10-Q and Form 8-K) are filed under File No. 000-30419 and File No. 001-39317.\n(1) Filed herewith.\n(2) Management contract or compensatory plan, contract or arrangement.\n(3) Furnished herewith.\n† Schedules or other attachments to these exhibits not filed herewith shall be furnished to the Commission upon request.",
    "item_16": "Item 16. Form 10-K Summary\nNone.",
    "stock_ticker": "ON"
}