{
    "cik": "4904",
    "company": "AMERICAN ELECTRIC POWER CO INC",
    "filing_type": "10-K",
    "filing_date": "2020-02-20",
    "period_of_report": "2019-12-31",
    "sic": "4911",
    "state_of_inc": "NY",
    "state_location": "OH",
    "fiscal_year_end": "1231",
    "filing_html_index": "https://www.sec.gov/Archives/edgar/data/4904/0000004904-20-000007-index.html",
    "htm_filing_link": "https://www.sec.gov/Archives/edgar/data/4904/000000490420000007/aep10klegal20194q.htm",
    "complete_text_filing_link": "https://www.sec.gov/Archives/edgar/data/4904/0000004904-20-000007.txt",
    "filename": "4904_10K_2019_0000004904-20-000007.htm",
    "item_1": "ITEM 1. BUSINESS\nGENERAL\nOverview and Description of Major Subsidiaries\nAEP was incorporated under the laws of the State of New York in 1906 and reorganized in 1925. It is a public utility holding company that owns, directly or indirectly, all of the outstanding common stock of its public utility subsidiaries and varying percentages of other subsidiaries.\nThe service areas of AEP’s public utility subsidiaries cover portions of the states of Arkansas, Indiana, Kentucky, Louisiana, Michigan, Ohio, Oklahoma, Tennessee, Texas, Virginia and West Virginia. Transmission networks are interconnected with extensive distribution facilities in the territories served. The public utility subsidiaries of AEP have traditionally provided electric service, consisting of generation, transmission and distribution, on an integrated basis to their retail customers. Restructuring laws in Michigan, Ohio and the ERCOT area of Texas have caused AEP public utility subsidiaries in those states to unbundle previously integrated regulated rates for their retail customers.\nThe member companies of the AEP System have contractual, financial and other business relationships with the other member companies, such as participation in the AEP System savings and retirement plans and tax returns, sales of electricity and transportation and handling of fuel. The companies of the AEP System also obtain certain accounting, administrative, information systems, engineering, financial, legal, maintenance and other services at cost from a common provider, AEPSC.\nAs of December 31, 2019, the subsidiaries of AEP had a total of 17,408 employees. Because it is a holding company rather than an operating company, AEP has no employees. The material subsidiaries of AEP are as follows:\nAEP Texas\nOrganized in Delaware in 1925, AEP Texas is engaged in the transmission and distribution of electric power to approximately 1,049,000 retail customers through REPs in west, central and southern Texas. As of December 31, 2019, AEP Texas had 1,585 employees. Among the principal industries served by AEP Texas are petroleum and coal products manufacturing, chemical manufacturing, oil and gas extraction, pipeline transportation and primary metal manufacturing. The territory served by AEP Texas also includes several military installations and correctional facilities. AEP Texas is a member of ERCOT. AEP Texas is part of AEP’s Transmission and Distribution Utilities segment.\nAEPTCo\nOrganized in Delaware in 2006, AEPTCo is a holding company for the State Transcos. The State Transcos develop and own new transmission assets that are physically connected to the AEP System. Individual State Transcos (a) have obtained the approvals necessary to operate in Indiana, Kentucky, Michigan, Ohio, Oklahoma and West Virginia, subject to any applicable siting requirements, (b) are authorized to submit projects for commission approval in Virginia and (c) have been granted consent to enter into a joint license agreement that will support investment in Tennessee. Neither AEPTCo nor its subsidiaries have any employees. Instead, AEPSC and certain AEP utility subsidiaries provide services to these entities. AEPTCo is part of the AEP Transmission Holdco segment.\nAPCo\nOrganized in Virginia in 1926, APCo is engaged in the generation, transmission and distribution of electric power to approximately 956,000 retail customers in the southwestern portion of Virginia and southern West Virginia, and in supplying and marketing electric power at wholesale to other electric utility companies, municipalities and other market participants. APCo owns 6,629 MWs of generating capacity. APCo uses its generation to serve its retail and other customers. As of December 31, 2019, APCo had 1,699 employees. Among the principal industries served by APCo are coal mining, primary metals, pipeline transportation, chemical manufacturing and paper manufacturing. APCo is a member of PJM. APCo is part of AEP’s Vertically Integrated Utilities segment.\nI&M\nOrganized in Indiana in 1907, I&M is engaged in the generation, transmission and distribution of electric power to approximately 599,000 retail customers in northern and eastern Indiana and southwestern Michigan, and in supplying and marketing electric power at wholesale to other electric utility companies, rural electric cooperatives, municipalities and other market participants. I&M owns or leases 3,634 MWs of generating capacity, which it uses to serve its retail and other customers. As of December 31, 2019, I&M had 2,336 employees. Among the principal industries served are primary metals, transportation equipment, chemical manufacturing, plastics and rubber products and fabricated metal product manufacturing. I&M is a member of PJM. I&M is part of AEP’s Vertically Integrated Utilities segment.\nKPCo\nOrganized in Kentucky in 1919, KPCo is engaged in the generation, transmission and distribution of electric power to approximately 165,000 retail customers in eastern Kentucky, and in supplying and marketing electric power at wholesale to other electric utility companies, municipalities and other market participants. KPCo owns 1,060 MWs of generating capacity. KPCo uses its generation to serve its retail and other customers. As of December 31, 2019, KPCo had 500 employees. Among the principal industries served are petroleum and coal products manufacturing, chemical manufacturing, coal mining, oil and gas extraction and primary metals. KPCo is a member of PJM. KPCo is part of AEP’s Vertically Integrated Utilities segment.\nKGPCo\nOrganized in Virginia in 1917, KGPCo provides electric service to approximately 48,000 retail customers in Kingsport and eight neighboring communities in northeastern Tennessee. KGPCo does not own any generating facilities and is a member of PJM. It purchases electric power from APCo for distribution to its customers. As of December 31, 2019, KGPCo had 54 employees. KGPCo is part of AEP’s Vertically Integrated Utilities segment.\nOPCo\nOrganized in Ohio in 1907 and reincorporated in 1924, OPCo is engaged in the transmission and distribution of electric power to approximately 1,494,000 retail customers in Ohio. OPCo purchases energy and capacity at auction to serve generation service customers who have not switched to a competitive generation supplier. As of December 31, 2019, OPCo had 1,681 employees. Among the principal industries served by OPCo are primary metals, petroleum and coal products manufacturing, plastics and rubber products, chemical manufacturing, fabricated metal product manufacturing and data centers. OPCo is a member of PJM. OPCo is part of AEP’s Transmission and Distribution Utilities segment.\nPSO\nOrganized in Oklahoma in 1913, PSO is engaged in the generation, transmission and distribution of electric power to approximately 559,000 retail customers in eastern and southwestern Oklahoma, and in supplying and marketing electric power at wholesale to other electric utility companies, municipalities, rural electric cooperatives and other market participants. PSO owns 3,833 MWs of generating capacity, which it uses to serve its retail and other customers. As of December 31, 2019, PSO had 1,097 employees. Among the principal industries served by PSO are paper manufacturing, oil and gas extraction, petroleum and coal products manufacturing, transportation equipment and pipeline transportation. PSO is a member of SPP. PSO is part of AEP’s Vertically Integrated Utilities segment.\nSWEPCo\nOrganized in Delaware in 1912, SWEPCo is engaged in the generation, transmission and distribution of electric power to approximately 540,000 retail customers in northeastern and panhandle of Texas, northwestern Louisiana and western Arkansas and in supplying and marketing electric power at wholesale to other electric utility companies, municipalities, rural electric cooperatives and other market participants. SWEPCo owns 5,169 MWs of generating capacity, which it uses to serve its retail and other customers. As of December 31, 2019, SWEPCo had 1,469 employees. Among the principal industries served by SWEPCo are petroleum and coal products manufacturing, food manufacturing, paper manufacturing, oil and gas extraction and chemical manufacturing. The territory served by SWEPCo includes several military installations, colleges and universities. SWEPCo also owns and operates a lignite coal mining operation. SWEPCo is a member of SPP. SWEPCo is part of AEP’s Vertically Integrated Utilities segment.\nWPCo\nOrganized in West Virginia in 1883 and reincorporated in 1911, WPCo provides electric service to approximately 42,000 retail customers in northern West Virginia and in supplying and marketing electric power at wholesale to other market participants. WPCo owns 780 MWs of generating capacity which it uses to serve its retail and other customers. Among the principal industries served by WPCo are coal mining, primary metals, pipeline transportation, chemical manufacturing and paper manufacturing. WPCo is a member of PJM. As of December 31, 2019, WPCo had 50 employees. WPCo is part of AEP’s Vertically Integrated Utilities segment.\nService Company Subsidiary\nAEPSC is a service company subsidiary that provides accounting, administrative, information systems, engineering, financial, legal, maintenance and other services at cost to AEP subsidiaries. The executive officers of AEP and certain of the executive officers of its public utility subsidiaries are employees of AEPSC. As of December 31, 2019, AEPSC had 6,439 employees.\nCompany Website and Availability of SEC Filings\nOur principal corporate website address is www.aep.com. Information on our website is not incorporated by reference herein and is not part of this Form 10-K. We make available free of charge through our website our Annual Report on Form 10-K, quarterly reports on Form 10-Q, current reports on Form 8-K and amendments to those reports filed or furnished pursuant to Section 13(a) or 15(d) of the Exchange Act as soon as reasonably practicable after such documents are electronically filed with, or furnished to, the SEC. The SEC maintains a website at www.sec.gov that contains reports, proxy and information statements and other information regarding AEP.\nPublic Utility Subsidiaries by Jurisdiction\nThe following table illustrates certain regulatory information with respect to the jurisdictions in which the public utility subsidiaries of AEP operate:\n(a)\nIdentifies the predominant authorized ROE and may not include other, less significant, permitted recovery. Actual ROE varies from authorized ROE.\n(b)\nAuthorized ROE was approved in OPCo’s last distribution base case. The authorized ROE for riders with an approved equity return (e.g. Distribution Investment Rider) is 10.00%. See “Ohio Electric Security Plan Filings” section of Note 4 included in the 2019 Annual Report.\n(a)\nPretax income does not include intercompany eliminations.\nCLASSES OF SERVICE\nThe principal classes of service from which AEP’s subsidiaries derive revenues and the amount of such revenues during the years ended December 31, 2019, 2018 and 2017 are as follows:\nAEP Texas\nAEPTCo\nAPCo\nI&M\nOPCo\nPSO\nSWEPCo\n(a)\n2018 and 2017 amounts have been revised to reflect the reclassification of certain customer accounts between Retail classes. This reclassification did not impact previously reported Total Retail Revenues. Management concluded that these prior period disclosure only errors were immaterial individually and in the aggregate.\nFINANCING\nGeneral\nCompanies within the AEP System generally use short-term debt to finance working capital needs. Short-term debt may also be used to finance acquisitions, construction and redemption or repurchase of outstanding securities until such needs can be financed with long-term debt. In recent history, short-term funding needs have been provided for by cash on hand and AEP’s commercial paper program. Funds are made available to subsidiaries under the AEP corporate borrowing program. Certain public utility subsidiaries of AEP also sell accounts receivable to provide liquidity. See “Financial Condition” section of Management’s Discussion and Analysis of Financial Condition and Results of Operations included in the 2019 Annual Report for additional information.\nAEP’s revolving credit agreement (which backstops the commercial paper program) includes covenants and events of default typical for this type of facility, including a maximum debt/capital test. In addition, the acceleration of AEP’s payment obligations, or the obligations of certain of its major subsidiaries, prior to maturity under any other agreement or instrument relating to debt outstanding in excess of $50 million, would cause an event of default under the credit agreement. As of December 31, 2019, AEP was in compliance with its debt covenants. With the exception of a voluntary bankruptcy or insolvency, any event of default has either or both a cure period or notice requirement before termination of the agreement. A voluntary bankruptcy or insolvency of AEP or one of its significant subsidiaries would be considered an immediate termination event. See “Financial Condition” section of Management’s Discussion and Analysis of Financial Condition and Results of Operations included in the 2019 Annual Report for additional information.\nAEP’s subsidiaries have also utilized, and expect to continue to utilize, additional financing arrangements, such as securitization financings and leasing arrangements, including the leasing of coal transportation equipment and facilities.\nENVIRONMENTAL AND OTHER MATTERS\nGeneral\nAEP subsidiaries are currently subject to regulation by federal, state and local authorities with regard to air and water-quality control and other environmental matters, and are subject to zoning and other regulation by local authorities. The environmental issues that management believes are potentially material to the AEP System are outlined below.\nClean Water Act Requirements\nOperations for AEP subsidiaries are subject to the Federal Clean Water Act, which prohibits the discharge of pollutants into waters of the United States except pursuant to appropriate permits and regulates systems that withdraw surface water for use in power plants. In 2014, the Federal EPA issued a final rule setting forth standards for water withdrawals at existing power plants that is intended to reduce mortality of aquatic organisms pinned against a plant’s cooling water intake screen (impingement) or entrained in the cooling water. The standards affect all plants withdrawing more than two million gallons of cooling water per day. Compliance with this standard is required within eight years of the effective date of the final rule.\nIn November 2015, the Federal EPA issued a final rule revising effluent limitation guidelines for electricity generating facilities. The rule establishes limits on Flue Gas Desulfurization wastewater, fly ash and bottom ash transport water and flue gas mercury control wastewater to be imposed as soon as possible after November 2018 and no later than December 2023. In January 2020, the Federal EPA issued a final rule revising the scope of the “waters of the United States” subject to Clean Water Act regulation. See “Environmental Issues - Clean Water Act Regulations” section of Management’s Discussion and Analysis of Financial Condition and Results of Operations included in the 2019 Annual Report for additional information.\nCoal Ash Regulation\nAEP’s operations produce a number of different coal combustion by-products, including fly ash, bottom ash, gypsum and other materials. A Federal EPA rule regulates the disposal and beneficial re-use of coal combustion residuals, including fly ash and bottom ash generated at coal-fired electric generating units. The rule requires certain standards for location, groundwater monitoring and dam stability to be met at landfills and certain surface impoundments at operating facilities. If existing disposal facilities cannot meet these standards, they will be required to close. See “Environmental Issues - Coal Combustion Residual Rule” section of Management’s Discussion and Analysis of Financial Condition and Results of Operations included in the 2019 Annual Report for additional information.\nClean Air Act Requirements\nThe CAA establishes a comprehensive program to protect and improve the nation’s air quality and control mobile and stationary sources of air emissions. The major CAA programs affecting AEP’s power plants are described below. The states implement and administer many of these programs and could impose additional or more stringent requirements.\nThe Acid Rain Program\nThe CAA includes a cap-and-trade emission reduction program for SO2 emissions from power plants and requirements for power plants to reduce NOx emissions through the use of available combustion controls, collectively called the Acid Rain Program. AEP continues to meet its obligations under the Acid Rain Program through the installation of controls, use of alternate fuels and participation in the emissions allowance markets.\nNational Ambient Air Quality Standards (NAAQS)\nThe CAA requires the Federal EPA to review the available scientific data for criteria pollutants periodically and establish a concentration level in the ambient air for those substances that is adequate to protect the public health and welfare with an extra safety margin. The Federal EPA also can list additional pollutants and develop concentration levels for them. These concentration levels are known as NAAQS.\nEach state identifies the areas within its boundaries that meet the NAAQS (attainment areas) and those that do not (non-attainment areas). Each state must develop a SIP to bring non-attainment areas into compliance with the NAAQS and maintain good air quality in attainment areas. All SIPs are submitted to the Federal EPA for approval. If a state fails to develop adequate plans, the Federal EPA develops and implements a plan. As the Federal EPA reviews the NAAQS and establishes new concentration levels, the attainment status of areas can change and states may be required to develop new SIPs. See “Environmental Issues - Clean Air Act Requirements” section of Management’s Discussion and Analysis of Financial Condition and Results of Operations included in the 2019 Annual Report for additional information.\nHazardous Air Pollutants (HAP)\nThe CAA also requires the Federal EPA to investigate HAP emissions from the electric utility sector and submit a report to Congress to determine whether those emissions should be regulated. In 2011, the Federal EPA issued a rule setting Maximum Achievable Control Technology standards for new and existing coal and oil-fired utility units and New Source Performance Standards for emissions from new and modified power plants. In 2014, the U.S. Supreme Court determined that the Federal EPA acted unreasonably in refusing to consider costs in determining if it was appropriate and necessary to regulate HAP emissions from electric generating units. The Federal EPA has engaged in additional rulemaking activity but the 2011 rule remains in effect. See “Environmental Issues - Hazardous Air Pollutants” section of Management’s Discussion and Analysis of Financial Condition and Results of Operations included in the 2019 Annual Report for additional information.\nRegional Haze\nThe CAA establishes visibility goals for certain federally designated areas, including national parks, and requires states to submit SIPs that will demonstrate reasonable progress toward preventing impairment of visibility in these protected areas. In 2005, the Federal EPA issued its Clean Air Visibility Rule, detailing how the CAA’s best available retrofit technology requirements will be applied to facilities built between 1962 and 1977 that emit more than 250 tons per year of certain pollutants in specific industrial categories, including power plants.\nPSO executed a settlement with the Federal EPA and the State of Oklahoma to comply with Regional Haze program requirements in Oklahoma, and the settlement is now codified in the Oklahoma SIP and approved by the Federal EPA. The Federal EPA disapproved portions of the Arkansas and Texas SIPs, and finalized FIPs for both states. Arkansas submitted and received approval of a revised SIP, and EPA developed a revised FIP for Texas. See “Environmental Issues - Clean Air Act Requirements” section of Management’s Discussion and Analysis of Financial Condition and Results of Operations included in the 2019 Annual Report for additional information.\nClimate Change\nAEP has taken action to reduce and offset CO2 emissions from its generating fleet and expects CO2 emissions from its operations to continue to decline due to the retirement of some of its coal-fired generation units, and actions taken to diversify the generation fleet and increase energy efficiency where there is regulatory support for such activities. In 2019, AEP announced revised intermediate and long-term CO2 emission reduction goals, based on the output of the company’s integrated resource plans, which take into account economics, customer demand, regulations, grid reliability and resiliency, and reflect the company’s current business strategy. The intermediate goal is a 70% reduction from 2000 CO2 emission levels from AEP generating facilities by 2030; the long-term goal is an 80% or more reduction of CO2 emissions from AEP generating facilities from 2000 levels by 2050. AEP’s total estimated CO2 emissions in 2019 were approximately 58 million metric tons, a 65% reduction from AEP’s 2000 CO2 emissions.\nThe Federal EPA has taken action to regulate CO2 emissions from new and existing fossil fueled electric generating units under the existing provisions of the CAA. The Clean Power Plan was adopted in October 2015 but the U.S. Supreme Court issued a stay of its implementation, including all of the deadlines for submission of initial or final state plans. The Federal EPA issued a proposal in 2017 to repeal the Clean Power Plan and finalized the repeal in 2019. In 2018 the Federal EPA issued a proposal to revise the standards for new and modified sources. In 2019, the Federal EPA finalized new guidelines for states to use to develop CO2 performance standards for coal-fired generating units. See “Environmental Issues - Climate Change, CO2 Regulation and Energy Policy” section of Management’s Discussion and Analysis of Financial Condition and Results of Operations included in the 2019 Annual Report for additional information.\nManagement expects emissions to continue to decline over time as AEP diversifies generating sources and operates fewer coal units. The projected decline in coal-fired generation is due to a number of factors, including the ongoing cost of operating older units, the relative cost of coal and natural gas as fuel sources, increasing environmental regulations requiring significant capital investments and changing commodity market fundamentals.\nTransforming AEP’s Generation Fleet\nThe electric utility industry is in the midst of an historic transformation, driven by changing customer needs, policy demands, demographics, competitive offerings, technologies and commodity prices. AEP is also transforming to be more agile and customer-focused as a valued provider of energy solutions. AEP’s long-term commitment to reduce CO2 emissions reflects the current direction of the company’s resource plans to meet those needs. AEP’s exposure to carbon regulation has been greatly reduced over the last several years. From 2000 to 2019, AEP’s CO2 emissions declined 65%. In 2019, coal represented 45% of AEP’s generating capacity, compared with 70% in 2005. Management expects the percentage of AEP’s generating resources fueled by coal will continue to decline. Transforming AEP’s generation portfolio to include, where there is regulatory support, more renewable energy and focusing on the efficient use of energy, demand response, distributed resources and technology solutions to more efficiently manage the grid over time is part of this strategy.\nThe graph below summarizes AEP’s generation capacity by resource type for the years 1999, 2005 and 2019:\n(a)\nEnergy Efficiency/Demand Response represents avoided capacity rather than physical assets.\nRenewable Sources of Energy\nThe states AEP serves, other than Kentucky, West Virginia and Tennessee, have established mandatory or voluntary programs to increase the use of energy efficiency, alternative energy or renewable energy sources.\nAs of December 31, 2019, AEP’s regulated utilities had long-term contracts for 2,750 MWs of wind, 80 MWs of hydro, and 10 MWs of solar power delivering renewable energy to the companies’ customers. In addition, I&M owns four solar projects that make up I&M’s 16 MW Clean Energy Solar Pilot Project. Management actively manages AEP’s compliance position and is on pace to meet the relevant requirements or benchmarks in each applicable jurisdiction.\nIn July 2019, PSO and SWEPCo submitted filings before their respective commissions for approval to acquire the North Central Wind Energy Facilities, comprised of three Oklahoma wind facilities totaling 1,485 MWs, on a fixed cost turn-key basis at completion. Subject to regulatory approval, PSO will own 45.5% and SWEPCo will own 54.5% of the project, which will cost approximately $2 billion. Two wind facilities, totaling 1,286 MWs, would qualify for 80% of the federal Production Tax Credits (PTCs) with year-end 2021 in-service dates. The third wind facility (199 MWs) would qualify for 100% of the PTCs with a year-end 2020 in-service date. The acquisition can be scaled, subject to commercial limitation, to align with individual state resource needs and approvals. In December 2019, PSO reached a joint stipulation and settlement agreement with the OCC, Oklahoma Attorney General’s office and customer groups. In January 2020, SWEPCo reached a joint settlement agreement with the APSC, Arkansas Attorney General’s office and Walmart, Inc. Hearings are scheduled for the first quarter of 2020. PSO and SWEPCo are seeking regulatory approvals by July 2020.\nThe growth of AEP’s renewable generation portfolio reflects the company’s strategy to diversify generation resources to provide clean energy options to customers that meet both their energy and capacity needs. In addition to gradually reducing AEP’s reliance on coal-fueled generating units, the growth of renewables and natural gas helps AEP to maintain a diversity of generation resources.\nThe integrated resource plans filed with state regulatory commissions by AEP’s regulated utility subsidiaries reflect AEP’s renewable strategy to balance reliability and cost with customers’ desire for clean energy in a carbon-constrained world. AEP has committed significant capital investments to modernize the electric grid and integrate these new resources. Transmission assets of the AEP System interconnect approximately 11,900 MWs of renewable energy resources. AEP’s transmission development initiatives are designed to facilitate the interconnection of additional renewable energy resources.\nAEP Energy Supply, LLC is a holding company with several divisions, including AEP Renewables and AEP OnSite Partners.\nAEP Renewables develops, owns and operates utility scale renewable projects backed with long-term contracts with creditworthy counterparties throughout the United States. AEP Renewables works directly with stakeholders to ensure that customers have clean, sustainable renewable energy to meet their environmental goals. As of December 31, 2019, AEP Renewables owned projects operating in 11 states, including approximately 1,212 MWs of installed wind capacity and 90 MWs of installed solar capacity. These figures include the 2019 addition of 724 MWs of wind generation and battery assets located in several states acquired from Sempra Renewables LLC and the 75% interest, or 227 MWs, of Santa Rita East wind generation located in west Texas. In October 2019, AEP Renewables entered into an agreement to construct Flat Ridge 3, a wind farm in Kansas. The 128 MW facility is expected to reach commercial operation before the end of 2020.\nAEP OnSite Partners works directly with wholesale and large retail customers to provide tailored solutions to reduce their energy costs based upon market knowledge, innovative applications of technology and deal structuring capabilities. AEP OnSite Partners targets opportunities in distributed solar, combined heat and power, energy storage, waste heat recovery, energy efficiency, peaking generation and other energy solutions that create value for customers. AEP OnSite Partners pursues and develops behind the meter projects with creditworthy customers. As of December 31, 2019, AEP OnSite Partners owned projects located in 17 states, including approximately 119 MWs of installed solar capacity, and approximately 28 MWs of solar projects under construction.\nCompetitive Renewable Generation Facilities\n(a)\nColorado, Hawaii, Indiana, Kansas, Michigan, Minnesota, Pennsylvania, and Texas.\n(b)\nCalifornia, Colorado, Florida, Hawaii, Iowa, Minnesota, Nebraska, New Hampshire, New Jersey, New Mexico, New York, Ohio, Rhode Island, Texas and Vermont.\n(c)\nIllinois, New Mexico and Ohio.\nEnd Use Energy Efficiency\nAEP has reduced energy consumption and peak demand through the introduction of additional energy efficiency and demand response programs. These programs, commonly referred to as demand side management, were implemented in jurisdictions where appropriate cost recovery was available. AEP’s operating companies’ programs have reduced annual consumption by over 9 million MWhs and peak demand by approximately 2,806 MWs since 2008. AEP estimates that its operating companies spent approximately $1.5 billion during that period to achieve these levels.\nEnergy efficiency and demand reduction programs have received regulatory support in most of the states AEP serves. Appropriate cost recovery will be essential for AEP operating companies to continue and expand these consumer offerings. Appropriate recovery of program costs, lost revenues and an opportunity to earn a reasonable return ensures that energy efficiency programs are considered equally with supply side investments. As AEP continues to transition to a cleaner, more efficient energy future, energy efficiency and demand response programs will continue to play an important role in how the company serves its customers. AEP believes its experience providing robust energy efficiency programs in several states positions the company to be a cost-effective provider of these programs as states develop their implementation plans.\nCorporate Governance\nIn response to environmental issues and in connection with its assessment of AEP’s strategic plan, the Board of Directors continually reviews the risks posed by new environmental rules and requirements that could accelerate the retirement of coal-fired generation assets. The Board of Directors is informed of any new environmental regulations and proposed regulation or legislation that would significantly affect AEP. The Board’s Committee on Directors and Corporate Governance oversees AEP’s annual Corporate Accountability Report, which includes information about AEP’s environmental, social, governance and financial performance. AEP set CO2 emission reduction goals in 2018 after considering input from corporate governance outreach effort with shareholders.\nIn September 2019, AEP announced new intermediate and long-term CO2 emission reduction goals, based on the output of the company’s integrated resource plans, which take into account economics, customer demand, grid reliability and resiliency, regulations and the company’s current business strategy. The intermediate goal is a 70% reduction from 2000 CO2 emission levels from AEP generating facilities by 2030; the long-term goal is to surpass an 80% reduction of CO2 emissions from AEP generating facilities from 2000 levels by 2050. AEP has made significant progress in reducing CO2 emissions from its power generation fleet and expects its emissions to continue to decline. AEP’s aspirational emissions goal is zero CO2 emissions by 2050. Technological advances, including energy storage, will determine how quickly AEP can achieve zero emissions while continuing to provide reliable, affordable power for customers.\nOther Environmental Issues and Matters\nThe Comprehensive Environmental Response, Compensation and Liability Act of 1980 imposes costs for environmental remediation upon owners and previous owners of sites, as well as transporters and generators of hazardous material disposed of at such sites. See “The Comprehensive Environmental Response Compensation and Liability Act (Superfund) and State Remediation” section of Note 6 included in the 2019 Annual Report for additional information.\nEnvironmental Investments\nInvestments related to improving AEP System plants’ environmental performance and compliance with air and water quality standards during 2017, 2018 and 2019 and the current estimate for 2020 are shown below. These investments include both environmental as well as other related spending. Estimated construction expenditures are subject to periodic review and modification and may vary based on the ongoing effects of regulatory constraints, environmental regulations, business opportunities, market volatility, economic trends and the ability to access capital. In addition to the amounts set forth below, AEP expects to make substantial investments in future years in connection with the modification and addition at generation plants’ facilities for environmental quality controls. Such future investments are needed in order to comply with air and water quality standards that have been adopted and have deadlines for compliance after 2019 or have been proposed and may be adopted. Future investments could be significantly greater if emissions reduction requirements are accelerated or otherwise become more stringent. The cost of complying with applicable environmental laws, regulations and rules is expected to be material to the AEP System. AEP typically recovers costs of complying with environmental standards from customers through rates in regulated jurisdictions. Failure to recover these costs could reduce future net income and cash flows and possibly harm AEP’s financial condition. See “Environmental Issues” section of Management’s Discussion and Analysis of Financial Condition and Results of Operations and Note 6 - Commitments, Guarantees and Contingencies included in the 2019 Annual Report for additional information.\n(a)\nIncludes expenditures of the subsidiaries shown and other subsidiaries not shown. The figures reflect construction expenditures, not investments in subsidiary companies.\n(b)\nEstimated amounts are exclusive of debt AFUDC.\nManagement continues to refine the cost estimates of complying with air and water quality standards and other impacts of the environmental proposals. The following cost estimates for the years 2020 through 2026 will change depending on the timing of implementation and whether the Federal EPA provides flexibility in the final rules. These cost estimates will also change based on: (a) the states’ implementation of these regulatory programs, including the potential for SIPs or FIPs that impose more stringent standards, (b) additional rulemaking activities in response to court decisions, (c) the actual performance of the pollution control technologies installed on the units, (d) changes in costs for new pollution controls, (e) new generating technology developments, (f) total MWs of capacity retired, replaced or sold, including the type and amount of such replacement capacity and (g) other factors. Management’s current ranges of estimates of new major environmental investments beginning in 2020, exclusive of debt AFUDC, are set forth below:\nBUSINESS SEGMENTS\nAEP’s Reportable Segments\nAEP’s primary business is the generation, transmission and distribution of electricity. Within its Vertically Integrated Utilities segment, AEP centrally dispatches generation assets and manages its overall utility operations on an integrated basis because of the substantial impact of cost-based rates and regulatory oversight. Intersegment sales and transfers are generally based on underlying contractual arrangements and agreements. AEP’s reportable segments are as follows:\n•\nVertically Integrated Utilities\n•\nTransmission and Distribution Utilities\n•\nAEP Transmission Holdco\n•\nGeneration & Marketing\nThe remainder of AEP’s activities is presented as Corporate and Other, which is not considered a reportable segment. See Note 9 - Business Segments included in the 2019 Annual Report for additional information on AEP’s segments.\nVERTICALLY INTEGRATED UTILITIES\nGENERAL\nAEP’s vertically integrated utility operations are engaged in the generation, transmission and distribution of electricity for sale to retail and wholesale customers through assets owned and operated by AEGCo, APCo, I&M, KGPCo, KPCo, PSO, SWEPCo and WPCo. AEPSC, as agent for AEP’s public utility subsidiaries, performs marketing, generation dispatch, fuel procurement and power-related risk management and trading activities on behalf of each of these subsidiaries.\nELECTRIC GENERATION\nFacilities\nAs of December 31, 2019, AEP’s vertically integrated public utility subsidiaries owned or leased approximately 22,000 MWs of domestic generation. See Item 2 - Properties for more information regarding the generation capacity of vertically integrated public utility subsidiaries.\nFuel Supply\nThe following table shows the owned and leased generation sources by type (including wind purchase agreements), on an actual net generation (MWhs) basis, used by the Vertically Integrated Utilities:\nA price increase/decrease in one or more fuel sources relative to other fuels, as well as the addition of renewable resources, may result in the decreased/increased use of other fuels. AEP’s overall 2019 fossil fuel costs for the Vertically Integrated Utilities increased 2.4% on a dollar per MMBtu basis from 2018.\nCoal and Lignite\nAEP’s Vertically Integrated Utilities procure coal and lignite under a combination of purchasing arrangements including long-term contracts, affiliate operations and spot agreements with various producers, marketers and coal trading firms. Coal consumption in 2019 decreased approximately 18% from 2018 mainly due to lower dispatching of coal generation from weaker power market prices.\nManagement believes that the Vertically Integrated Utilities will be able to secure and transport coal and lignite of adequate quality and in adequate quantities to operate their coal and lignite-fired units. Through subsidiaries, AEP owns, leases or controls more than 4,004 railcars, 468 barges, 8 towboats and a coal handling terminal with approximately 18 million tons of annual capacity to move and store coal for use in AEP generating facilities.\nSpot market prices for coal started to weaken in the second half of 2019. The decreased spot coal prices reflect lower demand for domestic and export coal. AEP’s strategy for purchasing coal includes layering in supplies over time. The price impact of this process is reflected in subsequent periods and can occasionally cause current spot market prices to be trending opposite to the price of coal delivered. The price paid for coal delivered in 2019 increased approximately 6% from 2018.\nThe following table shows the amount of coal and lignite delivered to the Vertically Integrated Utilities’ plants during the past three years and the average delivered price of coal purchased by the Vertically Integrated Utilities:\nTotal coal delivered to the plants (millions of tons)\n30.4\n29.0\n29.3\nAverage cost per ton of coal delivered\n$\n45.85\n$\n43.21\n$\n44.24\nThe coal supplies at the Vertically Integrated Utilities plants vary from time to time depending on various factors, including, but not limited to, demand for electric power, unit outages, transportation infrastructure limitations, space limitations, plant coal consumption rates, availability of acceptable coals, labor issues and weather conditions, which may interrupt production or deliveries. As of December 31, 2019, the Vertically Integrated Utilities’ coal inventory was approximately 54 days of full load burn. While inventory targets vary by plant and are changed as necessary, the current coal inventory target for the Vertically Integrated Utilities is approximately 30 days of full load burn.\nNatural Gas\nThe Vertically Integrated Utilities consumed approximately 117 billion cubic feet of natural gas during 2019 for generating power. This represents an increase of 5% from 2018. Total gas consumption for the Vertically Integrated Utilities was higher year over year primarily due to lower natural gas prices. Several of AEP’s natural gas-fired power plants are connected to at least two pipelines which allow greater access to competitive supplies and improve delivery reliability. A portfolio of term, monthly, seasonal and daily supply and transportation agreements provide natural gas\nrequirements for each plant, as appropriate. AEP’s natural gas supply agreements are entered into on a competitive basis and based on market prices.\nThe following table shows the amount of natural gas delivered to the Vertically Integrated Utilities’ plants during the past three years and the average delivered price of natural gas purchased by the Vertically Integrated Utilities.\nTotal natural gas delivered to the plants (billion of cubic feet)\n117.0\n111.6\n86.3\nAverage price per MMBtu of purchased natural gas\n$\n2.64\n$\n3.26\n$\n3.37\nNuclear\nI&M has made commitments to meet the current nuclear fuel requirements of the Cook Plant. I&M has made and will make purchases of uranium in various forms in the spot, short-term and mid-term markets. I&M also continues to finance its nuclear fuel through leasing.\nFor purposes of the storage of high-level radioactive waste in the form of SNF, I&M completed modifications to its SNF storage pool in the early 1990’s. I&M entered into an agreement to provide for onsite dry cask storage of SNF to permit normal operations to continue. I&M is scheduled to conduct further dry cask loading and storage projects on an ongoing periodic basis.\nNuclear Waste and Decommissioning\nAs the owner of the Cook Plant, I&M has a significant future financial commitment to dispose of SNF and decommission and decontaminate the plant safely. The cost to decommission a nuclear plant is affected by NRC regulations and the SNF disposal program. The most recent decommissioning cost study was completed in 2018. The estimated cost of decommissioning and disposal of low-level radioactive waste for the Cook Plant was $2 billion in 2018 non-discounted dollars, with additional ongoing estimated costs of $6 million per year for post decommissioning storage of SNF and an eventual estimated cost of $37 million for the subsequent decommissioning of the spent fuel storage facility, also in 2018 non-discounted dollars. As of December 31, 2019 and 2018, the total decommissioning trust fund balance for the Cook Plant was approximately $2.7 billion and $2.2 billion, respectively. The balance of funds available to eventually decommission Cook Plant will differ based on contributions and investment returns. The ultimate cost of retiring the Cook Plant may be materially different from estimates and funding targets as a result of the:\n•\nEscalation of various cost elements (including, but not limited to, general inflation and the cost of energy).\n•\nFurther development of regulatory requirements governing decommissioning.\n•\nTechnology available at the time of decommissioning differing significantly from that assumed in studies.\n•\nAvailability of nuclear waste disposal facilities.\n•\nAvailability of a United States Department of Energy facility for permanent storage of SNF.\nAccordingly, management is unable to provide assurance that the ultimate cost of decommissioning the Cook Plant will not be significantly different than current projections. AEP will seek recovery from customers through regulated rates if actual decommissioning costs exceed projections. See the “Nuclear Contingencies” section of Note 6 - Commitments, Guarantees and Contingencies included in the 2019 Annual Report for information with respect to nuclear waste and decommissioning.\nLow-Level Radioactive Waste\nThe Low-Level Waste Policy Act of 1980 mandates that the responsibility for the disposal of low-level radioactive waste rests with the individual states. Low-level radioactive waste consists largely of ordinary refuse and other items that have come in contact with radioactive materials. Michigan does not currently have a disposal site for such waste available. I&M cannot predict when such a site may be available. However, the states of Utah and Texas have licensed low level radioactive waste disposal sites which currently accept low level radioactive waste from Michigan waste generators. There is currently no set date limiting I&M’s access to either of these facilities. The Cook Plant has a facility onsite designed specifically for the storage of low level radioactive waste. In the event that low level radioactive waste disposal facility access becomes unavailable, it can be stored onsite at this facility.\nCounterparty Risk Management\nThe Vertically Integrated Utilities segment also sells power and enters into related energy transactions with wholesale customers and other market participants. As a result, counterparties and exchanges may require cash or cash related instruments to be deposited on transactions as margin against open positions. As of December 31, 2019, counterparties posted approximately $13 million in cash, cash equivalents or letters of credit with AEPSC for the benefit of AEP’s public utility subsidiaries (while, as of that date, AEP’s public utility subsidiaries posted approximately $24 million with counterparties and exchanges). Since open trading contracts are valued based on market prices of various commodities, exposures change daily. See the “Quantitative and Qualitative Disclosures About Market Risk” section of Management’s Discussion and Analysis of Financial Condition and Results of Operations included in the 2019 Annual Report for additional information.\nCertain Power Agreements\nI&M\nThe UPA between AEGCo and I&M, dated March 31, 1982, provides for the sale by AEGCo to I&M of all the capacity (and the energy associated therewith) available to AEGCo at the Rockport Plant. Whether or not power is available from AEGCo, I&M is obligated to pay a demand charge for the right to receive such power (and an energy charge for any associated energy taken by I&M). The agreement will continue in effect until the last of the lease terms of Unit 2 of the Rockport Plant have expired (currently December 2022) unless extended in specified circumstances.\nPursuant to an assignment between I&M and KPCo, and a UPA between AEGCo and KPCo, AEGCo sells KPCo 30% of the capacity (and the energy associated therewith) available to AEGCo from both units of the Rockport Plant. KPCo has agreed to pay to AEGCo the amounts that I&M would have paid AEGCo under the terms of the UPA between AEGCo and I&M for such entitlement. The KPCo UPA expires in December 2022.\nOVEC\nAEP and several nonaffiliated utility companies jointly own OVEC. The aggregate equity participation of AEP in OVEC is 43.47%. Parent owns 39.17% and OPCo owns 4.3%. Under the Inter-Company Power Agreement (ICPA), which defines the rights of the owners and sets the power participation ratio of each, the sponsoring companies are entitled to receive and are obligated to pay for all OVEC capacity (approximately 2,400 MWs) in proportion to their respective power participation ratios. The aggregate power participation ratio of APCo, I&M and OPCo is 43.47%. The ICPA terminates in June 2040. The proceeds from charges by OVEC to sponsoring companies under the ICPA based on their prower participation ratios are designed to be sufficient for OVEC to meet its operating expenses and fixed costs. OVEC’s Board of Directors, as elected by AEP and the other owners, has authorized environmental investments related to their ownership interests, with resulting expenses (including for related debt and interest thereon) included in charges under the ICPA. OVEC financed capital expenditures totaling $1.3 billion in connection with flue gas desulfurization projects and the associated scrubber waste disposal landfills at its two generation plants through debt issuances, including tax-advantaged debt issuances. Both OVEC generation plants are operating with the new environmental controls in service. OPCo attempted to assign its rights and obligations under the ICPA to an affiliate\nas part of its transfer of its generation assets and liabilities in keeping with corporate separation required by Ohio law. OPCo failed to obtain the consent to assignment from the other owners of OVEC and therefore filed a request with the PUCO seeking authorization to maintain its ownership of OVEC. In December 2013, the PUCO approved OPCo’s request, subject to the condition that energy from the OVEC entitlements are sold into the day-ahead or real-time PJM energy markets, or on a forward basis through a bilateral arrangement. In November 2016, the PUCO approved OPCo’s request to approve a cost-based purchased power agreement (PPA) rider, effective in January 2017, that would initially be based upon OPCo’s contractual entitlement under the ICPA which is approximately 20% of OVEC’s capacity. In January 2020, provisions enacted as part of Ohio Am. Sub. H.B. 6 went into effect that replace the PPA rider and enable OPCo to continue recovering the net cost associated with the ICPA, including any additional contractual entitlement received as a result of the FirstEnergy Solutions (FES) bankruptcy, through 2030.\nIn March 2018, FES, with an aggregate power participation ratio of approximately 5% under the ICPA, filed bankruptcy. In July 2018, the Bankruptcy Court granted FES’s motion to reject the ICPA. OVEC appealed this decision in the United States Court of Appeals for the Sixth Circuit and in December 2019 the Sixth Circuit remanded the rejection of the ICPA back to the Bankruptcy Court for further consideration based on reversing the Bankruptcy Court’s application of the business judgment standard in rejecting the ICPA. If OVEC does not have sufficient funds to honor its payment obligations, there is risk that APCo, I&M and/or OPCo may need to make payments in addition to their power participation ratio payments. Further, if OVEC’s indebtedness is accelerated for any reason, there is risk that APCo, I&M and/or OPCo may be required to pay some or all of such accelerated indebtedness in amounts equal to their aggregate power participation ratio of 43.47%. The foregoing and other related actions have adversely impacted the credit ratings of OVEC.\nELECTRIC DELIVERY\nGeneral\nOther than AEGCo, AEP’s vertically integrated public utility subsidiaries own and operate transmission and distribution lines and other facilities to deliver electric power. See Item 2 - Properties for more information regarding the transmission and distribution lines. Most of the transmission and distribution services are sold to retail customers of AEP’s vertically integrated public utility subsidiaries in their service territories. These sales are made at rates approved by the state utility commissions of the states in which they operate, and in some instances, approved by the FERC. See Item 1. Business - Vertically Integrated Utilities - Regulation - Rates. The FERC regulates and approves the rates for both wholesale transmission transactions and wholesale generation contracts. The use and the recovery of costs associated with the transmission assets of the AEP vertically integrated public utility subsidiaries are subject to the rules, principles, protocols and agreements in place with PJM and SPP, and as approved by the FERC. See Item 1. Business - Vertically Integrated Utilities - Regulation - FERC. As discussed below, some transmission services also are separately sold to nonaffiliated companies.\nOther than AEGCo, AEP’s vertically integrated public utility subsidiaries hold franchises or other rights to provide electric service in various municipalities and regions in their service areas. In some cases, these franchises provide the utility with the exclusive right to provide electric service within a specific territory. These franchises have varying provisions and expiration dates. In general, the operating companies consider their franchises to be adequate for the conduct of their business. For a discussion of competition in the sale of power, see Item 1. Business - Vertically Integrated Utilities - Competition.\nTransmission Agreement (TA)\nAPCo, I&M, KGPCo, KPCo and WPCo own and operate transmission facilities that are used to provide transmission service under the PJM OATT and are parties to the TA. OPCo, which is a subsidiary in AEP’s Transmission and Distribution Utilities segment that provides transmission service under the PJM OATT, is also a party to the TA. The TA defines how the parties to the agreement share the revenues associated with their transmission facilities and the costs of transmission service provided by PJM. The TA has been approved by the FERC.\nTCA and OATT\nPSO, SWEPCo and AEPSC are parties to the TCA. Under the TCA, a coordinating committee is charged with the responsibility of (a) overseeing the coordinated planning of the transmission facilities of the parties to the agreement, including the performance of transmission planning studies, (b) the interaction of such subsidiaries with independent system operators and other regional bodies interested in transmission planning and (c) compliance with the terms of the OATT filed with the FERC and the rules of the FERC relating to such tariff. Pursuant to the TCA, AEPSC has responsibility for monitoring the reliability of their transmission systems and administering the OATT on behalf of the other parties to the agreement. The TCA also provides for the allocation among the parties of revenues collected for transmission and ancillary services provided under the OATT. These allocations have been determined by the FERC-approved OATT for the SPP.\nRegional Transmission Organizations\nAEGCo, APCo, I&M, KGPCo, KPCo and WPCo are members of PJM, and PSO and SWEPCo are members of SPP (both FERC-approved RTOs). RTOs operate, plan and control utility transmission assets in a manner designed to provide open access to such assets in a way that prevents discrimination between participants owning transmission assets and those that do not.\nREGULATION\nGeneral\nAEP’s vertically integrated public utility subsidiaries’ retail rates and certain other matters are subject to traditional cost-based regulation by the state utility commissions. AEP’s vertically integrated public utility subsidiaries are also subject to regulation by the FERC under the Federal Power Act with respect to wholesale power and transmission service transactions. I&M is subject to regulation by the NRC under the Atomic Energy Act of 1954, as amended, with respect to the operation of the Cook Plant. AEP and its vertically integrated public utility subsidiaries are also subject to the regulatory provisions of, much of the Energy Policy Act of 2005, which is administered by the FERC.\nRates\nHistorically, state utility commissions have established electric service rates on a cost-of-service basis, which is designed to allow a utility an opportunity to recover its cost of providing service and to earn a reasonable return on its investment used in providing that service. A utility’s cost of service generally reflects its operating expenses, including operation and maintenance expense, depreciation expense and taxes. State utility commissions periodically adjust rates pursuant to a review of (a) a utility’s adjusted revenues and expenses during a defined test period and (b) such utility’s level of investment. Absent a legal limitation, such as a law limiting the frequency of rate changes or capping rates for a period of time, a state utility commission can review and change rates on its own initiative. Some states may initiate reviews at the request of a utility, customer, governmental or other representative of a group of customers. Such parties may, however, agree with one another not to request reviews of or changes to rates for a specified period of time.\nPublic utilities have traditionally financed capital investments until the new asset is placed in service. Provided the asset was found to be a prudent investment, it was then added to rate base and entitled to a return through rate recovery. Given long lead times in construction, the high costs of plant and equipment and volatile capital markets, management actively pursues strategies to accelerate rate recognition of investments and cash flow. AEP representatives continue to engage state commissioners and legislators on alternative ratemaking options to reduce regulatory lag and enhance certainty in the process. These options include pre-approvals, a return on construction work in progress, rider/trackers, formula rates and the inclusion of future test-year projections into rates.\nThe rates of AEP’s vertically integrated public utility subsidiaries are generally based on the cost of providing traditional bundled electric service (i.e., generation, transmission and distribution service). Historically, the state regulatory frameworks in the service area of the AEP vertically integrated public utility subsidiaries reflected specified fuel costs\nas part of bundled (or, more recently, unbundled) rates or incorporated fuel adjustment clauses in a utility’s rates and tariffs. Fuel adjustment clauses permit periodic adjustments to fuel cost recovery from customers and therefore provide protection against exposure to fuel cost changes.\nThe following state-by-state analysis summarizes the regulatory environment of certain major jurisdictions in which AEP’s vertically integrated public utility subsidiaries operate. Several public utility subsidiaries operate in more than one jurisdiction. See Note 4 - Rate Matters included in the 2019 Annual Report for more information regarding pending rate matters.\nIndiana\nI&M provides retail electric service in Indiana at bundled rates approved by the IURC, with rates set on a cost-of-service basis. Indiana provides for timely fuel and purchased power cost recovery through a fuel cost recovery mechanism.\nOklahoma\nPSO provides retail electric service in Oklahoma at bundled rates approved by the OCC. PSO’s rates are set on a cost-of-service basis. Fuel and purchased energy costs are recovered or refunded by applying fuel adjustment and other factors to retail kilowatt-hour sales.\nVirginia\nAPCo currently provides retail electric service in Virginia at unbundled generation and distribution rates approved by the Virginia SCC. Virginia generally allows for timely recovery of fuel costs through a fuel adjustment clause. In addition to base rates and fuel cost recovery, APCo is permitted to recover a variety of costs through rate adjustment clauses including transmission services provided at OATT rates based on rates established by the FERC.\nWest Virginia\nAPCo and WPCo provide retail electric service at bundled rates approved by the WVPSC, with rates set on a combined cost-of-service basis. West Virginia generally allows for timely recovery of fuel costs through an expanded net energy cost which trues-up to actual expenses.\nFERC\nThe FERC regulates rates for interstate power sales at wholesale, transmission of electric power, accounting and other matters, including construction and operation of hydroelectric projects. The FERC regulations require AEP’s vertically integrated public utility subsidiaries to provide open access transmission service at FERC-approved rates, and AEP has approved cost-based formula transmission rates on file at the FERC. The FERC also regulates unbundled transmission service to retail customers. In addition, the FERC regulates the sale of power for resale in interstate commerce by (a) approving contracts for wholesale sales to municipal and cooperative utilities and (b) granting authority to public utilities to sell power at wholesale at market-based rates upon a showing that the seller lacks the ability to improperly influence market prices. AEP’s vertically integrated public utility subsidiaries have market-based rate authority from the FERC, under which much of their wholesale marketing activity takes place. The FERC requires each public utility that owns or controls interstate transmission facilities to, directly or through an RTO, to file an open access network and point-to-point transmission tariff that offers services comparable to the utility’s own uses of its transmission system. The FERC also requires all transmitting utilities, directly or through an RTO, to establish an Open Access Same-time Information System, which electronically posts transmission information such as available capacity and prices, and requires utilities to comply with Standards of Conduct that prohibit utilities’ transmission employees from providing non-public transmission information to the utility’s marketing employees. Additionally, the vertically integrated public utility subsidiaries are subject to reliability standards promulgated by the North American Electric Reliability Corporation, with the approval of the FERC.\nThe FERC oversees RTOs, entities created to operate, plan and control utility transmission assets. AEGCo, APCo, I&M, KGPCo, KPCo and WPCo are members of PJM. PSO and SWEPCo are members of SPP.\nThe FERC has jurisdiction over the issuances of securities of most of AEP’s public utility subsidiaries, the acquisition of securities of utilities, the acquisition or sale of certain utility assets and mergers with another electric utility or holding company. In addition, both the FERC and state regulators are permitted to review the books and records of any company within a holding company system.\nCOMPETITION\nOther than AEGCo, AEP’s vertically integrated public utility subsidiaries generate, transmit and distribute electricity to retail customers of AEP’s vertically integrated public utility subsidiaries in their service territories. These sales are made at rates approved by the state utility commissions of the states in which they operate, and in some instances, approved by the FERC, and are not subject to competition from other vertically integrated public utilities. Other than AEGCo, AEP’s vertically integrated public utility subsidiaries hold franchises or other rights that effectively grant the exclusive ability to provide electric service in various municipalities and regions in their service areas.\nAEP’s vertically integrated public utility subsidiaries compete with self-generation and with distributors of other energy sources, such as natural gas, fuel oil, renewables and coal, within their service areas. The primary factors in such competition are price, reliability of service and the capability of customers to utilize alternative sources of energy other than electric power. With respect to competing generators and self-generation, the public utility subsidiaries of AEP believe that they currently maintain a competitive position.\nChanges in regulatory policies and advances in newer technologies for batteries or energy storage, fuel cells, microturbines, wind turbines and photovoltaic solar cells are reducing costs of new technology to levels that are making them competitive with some central station electricity production. The costs of photovoltaic solar cells in particular have continued to become increasingly competitive. The ability to maintain relatively low cost, efficient and reliable operations and to provide cost-effective programs and services to customers are significant determinants of AEP’s competitiveness.\nSEASONALITY\nThe consumption of electric power is generally seasonal. In many parts of the country, demand for power peaks during the hot summer months, with market prices also peaking at that time. In other areas, power demand peaks during the winter. The pattern of this fluctuation may change due to the nature and location of AEP’s facilities and the terms of power sale contracts into which AEP enters. In addition, AEP has historically sold less power, and consequently earned less income, when weather conditions are milder. Unusually mild weather in the future could diminish AEP’s results of operations. Conversely, unusually extreme weather conditions could increase AEP’s results of operations.\nTRANSMISSION AND DISTRIBUTION UTILITIES\nGENERAL\nThis segment consists of the transmission and distribution of electricity for sale to retail and wholesale customers through assets owned and operated by AEP Texas and OPCo. OPCo is engaged in the transmission and distribution of electric power to approximately 1,494,000 retail customers in Ohio. OPCo purchases energy and capacity at auction to serve generation service customers who have not switched to a competitive generation supplier. AEP Texas is engaged in the transmission and distribution of electric power to approximately 1,049,000 retail customers through REPs in west, central and southern Texas.\nAEP’s transmission and distribution utility subsidiaries own and operate transmission and distribution lines and other facilities to deliver electric power. See Item 2 - Properties, for more information regarding the transmission and distribution lines. Transmission and distribution services are sold to retail customers of AEP’s transmission and distribution utility subsidiaries in their service territories. These sales are made at rates approved by the PUCT for AEP Texas and by the PUCO and the FERC for OPCo. The FERC regulates and approves the rates for wholesale transmission transactions. As discussed below, some transmission services also are separately sold to nonaffiliated companies.\nAEP’s transmission and distribution utility subsidiaries hold franchises or other rights to provide electric service in various municipalities and regions in their service areas. In some cases, these franchises provide the utility with the exclusive right to provide electric service. These franchises have varying provisions and expiration dates. In general, the operating companies consider their franchises to be adequate for the conduct of their business.\nThe use and the recovery of costs associated with the transmission assets of the AEP transmission and distribution utility subsidiaries are subject to the rules, protocols and agreements in place with PJM and ERCOT, and as approved by the FERC. In addition to providing transmission services in connection with power sales in their service areas, AEP’s transmission and distribution utility subsidiaries also provide transmission services for nonaffiliated companies through RTOs.\nTransmission Agreement\nOPCo owns and operates transmission facilities that are used to provide transmission service under the PJM OATT; OPCo is a party to the TA with other utility subsidiary affiliates. The TA defines how the parties to the agreement share the revenues associated with their transmission facilities and the costs of transmission service provided by PJM. The TA has been approved by the FERC.\nRegional Transmission Organizations\nOPCo is a member of PJM, a FERC-approved RTO. RTOs operate, plan and control utility transmission assets to provide open access to such assets in a way that prevents discrimination between participants owning transmission assets and those that do not. AEP Texas is a member of ERCOT.\nREGULATION\nOPCo provides distribution and transmission services to retail customers within its service territory at cost-based rates approved by the PUCO or by the FERC. AEP Texas provides transmission and distribution service on a cost-of-service basis at rates approved by the PUCT and wholesale transmission service under tariffs approved by the FERC consistent with PUCT rules. Transmission and distribution rates are established on a cost-of-service basis, which is designed to allow a utility an opportunity to recover its cost of providing service and to earn a reasonable return on its investment used in providing that service. The cost of service generally reflects operating expenses, including operation and maintenance expense, depreciation expense and taxes. Utility commissions periodically adjust rates pursuant to a review of: (a) a utility’s adjusted revenues and expenses during a defined test period and (b) such utility’s level of investment.\nFERC\nThe FERC regulates rates for transmission of electric power, accounting and other matters. The FERC regulations require AEP to provide open access transmission service at FERC-approved rates, and it has approved cost-based formula transmission rates on file at the FERC. The FERC also regulates unbundled transmission service to retail customers. The FERC requires each public utility that owns or controls interstate transmission facilities to, directly or through an RTO, file an open access network and point-to-point transmission tariff that offers services comparable to the utility’s own uses of its transmission system. The FERC also requires all transmitting utilities, directly or through an RTO, to establish an Open Access Same-time Information System, which electronically posts transmission information such as available capacity and prices, and requires utilities to comply with Standards of Conduct that prohibit utilities’ transmission employees from providing non-public transmission information to the utility’s marketing employees. In addition, both the FERC and state regulators are permitted to review the books and records of any company within a holding company system. Additionally, the transmission and distribution utility subsidiaries are subject to reliability standards as set forth by the North American Electric Reliability Corporation, with the approval of the FERC.\nSEASONALITY\nThe delivery of electric power is generally seasonal. In many parts of the country, demand for power peaks during the hot summer months. In other areas, power demand peaks during the winter months. The pattern of this fluctuation may change due to the nature and location of AEP’s transmission and distribution facilities. In addition, AEP transmission and distribution has historically delivered less power, and consequently earned less income, when weather conditions are milder. In Texas, and to a lesser extent, in Ohio, where there is residential decoupling, unusually mild weather in the future could diminish AEP’s results of operations. Conversely, unusually extreme weather conditions could increase AEP’s results of operations.\nAEP TRANSMISSION HOLDCO\nGENERAL\nAEPTHCo is a holding company for (a) AEPTCo, which is the direct holding company for the State Transcos and (b) AEP’s Transmission Joint Ventures.\nAEPTCo\nAEPTCo wholly owns the State Transcos which are independent of, but respectively overlay, the following AEP electric utility operating companies: APCo, I&M, KPCo, OPCo, PSO, SWEPCo, and WPCo. The State Transcos develop, own, operate, and maintain their respective transmission assets. Assets of the State Transcos interconnect to transmission facilities owned by the aforementioned operating companies and nonaffiliated transmission owners within the footprints of PJM, MISO and SPP. APTCo, IMTCo, KTCo, OHTCo, and WVTCo are located within PJM. IMTCo also owns portions of the Greentown station assets located in MISO. OKTCo and SWTCo are located within SPP.\nIMTCo, KTCo, OHTCo, OKTCo, and WVTCo own and operate transmission assets in their respective jurisdictions. The Virginia SCC and WVPSC granted consent for APCo and APTCo to enter into a joint license agreement that will support APTCo investment in the state of Tennessee. SWTCo does not currently own or operate transmission assets.\nThe State Transcos are regulated for rate-making purposes exclusively by the FERC and earn revenues through tariff rates charged for the use of their electric transmission systems. The State Transcos establish transmission rates each year through formula rate filings with the FERC. The rate filings calculate the revenue requirement needed to cover the costs of operation and debt service and to earn an allowed ROE. These rates are then included in an OATT for PJM, MISO and SPP.\nThe State Transcos own, operate, maintain and invest in transmission infrastructure in order to maintain and enhance system integrity and grid reliability, grid security, safety, reduce transmission constraints and facilitate interconnections of new generating resources and new wholesale customers, as well as enhance competitive wholesale electricity markets. A key part of AEP’s business is replacing and upgrading transmission facilities, assets and components of the existing AEP System as needed to maintain reliability.\nThe State Transcos provide the capability to build, replace and upgrade existing facilities. As of December 31, 2019, the State Transcos had $8.4 billion of transmission and other assets in-service with plans to construct approximately $4.3 billion of additional transmission assets through 2022. Additional investment in transmission infrastructure is needed within PJM and SPP to maintain the required level of grid reliability, resiliency, security and efficiency and to address an aging transmission infrastructure. Additional transmission facilities will be needed based on changes in generating resources, such as wind or solar projects, generation additions or retirements, and additional new customer interconnections. The State Transcos will continue their investment to enhance physical and cyber security of assets, and are also investing in improving the telecommunication network that supports the operation and control of the grid.\nAEPTHCO JOINT VENTURE INITIATIVES\nAEP has established joint ventures with other electric utility companies for the purpose of developing, building, and owning transmission assets that seek to improve reliability and market efficiency and provide transmission access to remote generation sources in North America (Transmission Joint Ventures).\nThe Transmission Joint Ventures currently include:\n(a)\nETT is undertaking multiple projects and the completion dates will vary for those projects. ETT’s investment in completed and active projects in ERCOT is expected to be $3.4 billion. Future projects will be evaluated on a case-by-case basis.\n(b)\nIn November 2019, Pioneer received FERC approval authorizing an ROE of 9.88% (10.38% inclusive of the RTO incentive adder of 0.5%.\n(c)\nThe ROE represents the weighted average approved ROE based on the costs of two projects developed by Transource Missouri; the $64 million Iatan-Nashua project (10.3%) and the $247 million Sibley-Nebraska City project (11.3%).\n(d)\nAEP owns 86.5% of Transource Missouri, Transource West Virginia, Transource Maryland and Transource Pennsylvania through its ownership interest in Transource Energy, LLC (Transource). Transource is a joint venture with AEPTHCo and Evergy, Inc. formed to pursue competitive transmission projects. AEPTHCo and Evergy, Inc. own 86.5% and 13.5% of Transource, respectively.\n(e)\nIn August 2016, Transource Maryland and Transource Pennsylvania received approval from the PJM Interconnection Board to construct portions of a transmission project located in both Maryland and Pennsylvania. The project is expected to go in service in 2022. Project costs are in 2019 dollars.\nTransource Missouri, Transource West Virginia, Transource Maryland and Transource Pennsylvania are consolidated joint ventures by AEP. All other joint ventures in the table above are not consolidated by AEP. AEP’s joint ventures do not have employees. Business services for the joint ventures are provided by AEPSC and other AEP subsidiaries and the joint venture partners. During 2019, approximately 608 AEPSC employees and 291 operating company employees provided service to one or more joint ventures.\nREGULATION\nThe State Transcos and the Transmission Joint Ventures located outside of ERCOT establish transmission rates annually through forward looking formula rate filings with the FERC pursuant to FERC-approved implementation protocols. The protocols include a transparent, formal review process to ensure the updated transmission rates are prudently incurred and reasonably calculated. The IMTCo-owned Greentown station assets acquired from Duke Energy Indiana, LLC in December 2018 are located in MISO. IMTCo utilizes a historic cost recovery model to recover MISO assets.\nThe State Transcos’ and the Transmission Joint Ventures’ (where applicable) rates are included in the respective OATT for PJM and SPP. An OATT is the FERC rate schedule that provides the terms and conditions for transmission and related services on a transmission provider’s transmission system. The FERC requires transmission providers such as PJM and SPP to offer transmission service to all eligible customers (for example, load-serving entities, power marketers, generators and customers) on a non-discriminatory basis.\nThe FERC-approved formula rates establish the annual transmission revenue requirement (ATRR) and transmission service rates for transmission owners in annual rate base filings with the FERC. The formula rates establish rates for a one-year period based on the current projects in-service and proposed projects for a defined timeframe. The formula rates also include a true-up calculation for the previous year’s billings, allowing for over/under-recovery of the transmission owner’s ATRR. PJM and SPP pay the transmission owners their ATRR for use of their facilities and bill transmission customers taking service under the PJM and SPP OATTs, based on the terms and conditions in the respective OATT for the service taken. Additionally, the State Transcos are subject to reliability standards promulgated by the North American Electric Reliability Corporation, with the approval of the FERC.\nThe authorized returns on equity for the State Transcos are the FERC-authorized returns on equity in the PJM and SPP OATTs, respectively. These returns were challenged by parties in filings before the FERC. AEP’s transmission owning subsidiaries within PJM entered into a settlement agreement, approved by the FERC in May 2019, that established a total ROE of 9.85% (10.35% inclusive of the RTO incentive adder of 0.5%) based on a capital structure of up to 55% equity for APTCo, IMTCo, KTCo, OHTCo and WVTCo (the East Transcos). In June 2019, the FERC approved an unopposed settlement agreement between AEP’s transmission owning subsidiaries within SPP that established a total ROE of 10.0% (10.5% inclusive of the RTO incentive adder of 0.5%) without a cap on the capital structure for OKTCo and SWTCo (the West Transcos).\nIn the annual rate base filings described above, the State Transcos in aggregate filed rate base totals of $5.9 billion, $4.6 billion and $3.8 billion for 2019, 2018 and 2017, respectively. The total filed transmission revenue requirements, including prior year over/under-recovery of revenue and associated carrying charges were $992 million, $829 million and $690 million for 2019, 2018, and 2017, respectively.\nThe rates of ETT, which is located in ERCOT, are determined by the PUCT. ETT sets its rates through a combination of base rate cases and interim Transmission Cost of Services (TCOS) filings. ETT may file interim TCOS filings semi-annually to update its rates to reflect changes in its net invested capital.\nThe Transmission Joint Ventures have approved ROEs ranging from 9.6% to 12.8% based on equity capital structures ranging from 40% to 60%.\nGENERATION & MARKETING\nGENERAL\nThe AEP Generation & Marketing segment subsidiaries consist of competitive generating assets, a wholesale energy trading and marketing business and a retail supply and energy management business. The primary fossil generation subsidiary in the Generation & Marketing segment is AGR. As of December 31, 2019, AGR owns 1,294 MWs of generating capacity. Management plans to close 51% of this generation capacity in May 2020. Almost all of the remaining generating capacity is operated by Buckeye Power, a nonaffiliated electric cooperative. Other subsidiaries in this segment own or have the right to receive power from additional generation assets. See Item 2 - Properties for more information regarding the generation assets of the Generation & Marketing segment. AGR is a competitive generation subsidiary.\nWith respect to the wholesale energy trading and marketing business, AEP Generation & Marketing segment subsidiaries enter into short-term and long-term transactions to buy or sell capacity, energy and ancillary services in ERCOT, SPP, MISO and PJM. These subsidiaries sell power into the market and engage in power, natural gas and emissions allowances risk management and trading activities. These activities primarily involve the purchase-and-sale of electricity (and to a lesser extent, natural gas and emissions allowances) under forward contracts at fixed and variable prices. These contracts include physical transactions, exchange-traded futures, and to a lesser extent, OTC swaps and options. The majority of forward contracts are typically settled by entering into offsetting contracts. These transactions are executed with numerous counterparties or on exchanges.\nWith respect to the retail supply and energy management business, AEP Energy is a retail energy supplier that supplies electricity and/or natural gas to residential, commercial, and industrial customers. AEP Energy provides various energy solutions in Illinois, Pennsylvania, Delaware, Maryland, New Jersey, Ohio and Washington, D.C. AEP Energy also provides demand-side management solutions nationwide. AEP Energy had approximately 470,000 customer accounts as of December 31, 2019.\nAEP Energy Supply, LLC is a holding company with several divisions, including AEP Renewables and AEP OnSite Partners.\nAEP Renewables develops, owns and operates utility scale renewable projects backed with long-term contracts with creditworthy counterparties throughout the United States. AEP Renewables works directly with stakeholders to ensure that customers have clean, sustainable renewable energy to meet their environmental goals. As of December 31, 2019, AEP Renewables owned projects operating in 11 states, including approximately 1,212 MWs of installed wind capacity and approximately 90 MWs of installed solar capacity. These figures include the 2019 addition of 724 MWs of wind generation and battery assets located in several states acquired from Sempra Renewables LLC and the 75% interest, or 227 MWs, of Santa Rita East wind generation located in west Texas. In October 2019, AEP Renewables entered into an agreement to construct Flat Ridge 3, a wind farm in Kansas. The 128 MW facility is expected to reach commercial operation before the end of 2020.\nAEP OnSite Partners works directly with wholesale and large retail customers to provide tailored solutions to reduce their energy costs based upon market knowledge, innovative applications of technology and deal structuring capabilities. AEP OnSite Partners targets opportunities in distributed solar, combined heat and power, energy storage, waste heat recovery, energy efficiency, peaking generation and other energy solutions that create value for customers. AEP OnSite Partners pursues and develops behind the meter projects with creditworthy customers. As of December 31, 2019, AEP OnSite Partners owned projects located in 17 states, including approximately 119 MWs of installed solar capacity, and approximately 28 MWs of solar projects under construction.\nREGULATION\nAGR is a public utility under the Federal Power Act, and is subject to the FERC’s exclusive ratemaking jurisdiction over wholesale sales of electricity and the transmission of electricity in interstate commerce. Under the Federal Power Act, the FERC has the authority to grant or deny market-based rates for sales of energy, capacity and ancillary services to ensure that such sales are just and reasonable. The FERC granted AGR market-based rate authority in December 2013. The FERC’s jurisdiction over ratemaking also includes the authority to suspend the market-based rates of AGR and set cost-based rates if the FERC subsequently determines that it can exercise market power, create barriers to entry or engage in abusive affiliate transactions. Periodically, AGR is required to file a market power update to show that it continues to meet the FERC’s standards with respect to generation market power and other criteria used to evaluate whether it continues to qualify for market-based rates. Other matters subject to the FERC jurisdiction include, but are not limited to, review of mergers, and dispositions of jurisdictional facilities and acquisitions of securities of another public utility or an existing operational generating facility.\nSpecific operations of AGR are also subject to the jurisdiction of various other federal, state, regional and local agencies, including federal and state environmental protection agencies. AGR is also regulated by the PUCT for transactions inside ERCOT. Additionally, AGR is subject to mandatory reliability standards promulgated by the North American Electric Reliability Corporation, with the approval of the FERC.\nCOMPETITION\nThe AEP Generation & Marketing segment subsidiaries face competition for the sale of available power, capacity and ancillary services. The principal factors of impact are electricity and fuel prices, new market entrants, construction or retirement of generating assets by others and technological advances in power generation. Because most of AGR’s remaining generation is coal-fired, lower relative natural gas prices will favor competitors that have a higher concentration of natural gas fueled generation. Other factors impacting competitiveness include environmental regulation, transmission congestion or transportation constraints at or near generation facilities, inoperability or inefficiencies, outages and deactivations and retirements at generation facilities.\nTechnology advancements, increased demand for clean energy, changing consumer behaviors, low-priced and abundant natural gas, and regulatory and public policy reforms are among the catalysts for transformation within the industry that impact competition for AEP’s Generation & Marketing segment. AGR also competes with self-generation and with distributors of other energy sources, such as natural gas, fuel oil, renewables and coal, within their service areas. The primary factors in such competition are price, unit availability and the capability of customers to utilize sources of energy other than electric power.\nChanges in regulatory policies and advances in newer technologies for batteries or energy storage, fuel cells, microturbines, wind turbines and photovoltaic solar cells are reducing costs of new technology to levels that are making them competitive with some central station electricity production. The ability to maintain relatively low cost, efficient and reliable operations and to provide cost-effective programs and services to customers are significant determinants of AGR’s competitiveness. The costs of photovoltaic solar cells in particular have continued to become increasingly competitive.\nThis segment’s retail operations provide competitive electricity and natural gas in deregulated retail energy markets in six states and Washington, D.C. Each such retail choice jurisdiction establishes its own laws and regulations governing its competitive market, and public utility commission communications and utility default service pricing can affect customer participation in retail competition. Sustained low natural gas and power prices, low market volatility and maturing competitive environments can adversely affect this business.\nThis segment also engages in procuring and selling output from renewable generation sources under long-term contracts to creditworthy counterparties. New sources are not acquired without first securing a long-term placement of such power. Existing sources do not face competitive exposure. Competitive nonaffiliated suppliers of renewable or other generation could limit opportunities for future transactions for new sources and related output contracts.\nSEASONALITY\nThe consumption of electric power is generally seasonal. In many parts of the country, demand for power peaks during the hot summer months, with market prices also peaking at that time. In other areas, power demand peaks during the winter months. The pattern of this fluctuation may change.\nFuel Supply\nThe following table shows the generation sources by type, on an actual net generation (MWhs) basis, used by the Generation & Marketing segment, not including AEP Energy Partners’ offtake agreement from the Oklaunion Power Station:\nManagement expects the decline in coal generation sources to continue into 2020 due to the shutdown of Conesville Unit 4 in May 2020.\nCoal and Consumables\nAGR procures coal and consumables needed to burn the coal under a combination of purchasing arrangements including long-term and spot contracts with various producers and coal trading firms. As contracts expire, they are replaced, as needed, with contracts at market prices. Coal and consumable inventories remain adequate to meet generation requirements.\nManagement believes that AGR will be able to secure and transport coal and consumables of adequate quality and in adequate quantities to operate their coal-fired units. AGR, through its contracts with third party transporters, has the ability to adequately move and store coal and consumables for use in its generating facilities. AGR plants consumed 2.5 million tons of coal in 2019.\nThe coal supplies at AGR plants vary from time to time depending on various factors, including, but not limited to, demand for electric power, unit outages, transportation infrastructure limitations, space limitations, plant coal consumption rates, coal quality, availability of acceptable coals, labor issues and weather conditions, which may interrupt production or deliveries. AGR aims to maintain the coal inventory of its managed plants in the range of 20 to 60 days of full load burn. As of December 31, 2019, the coal inventory of AGR was within the target range.\nCounterparty Risk Management\nCounterparties and exchanges may require cash or cash related instruments to be deposited on these transactions as margin against open positions. As of December 31, 2019, counterparties posted approximately $16 million in cash, cash equivalents or letters of credit with AEP for the benefit of AEP’s Generation & Marketing segment subsidiaries (while, as of that date, AEP’s Generation & Marketing segment subsidiaries posted approximately $169 million with counterparties and exchanges). Since open trading contracts are valued based on market prices of various commodities, exposures change daily. See the “Quantitative and Qualitative Disclosures About Market Risk” section of Management’s Discussion and Analysis of Financial Condition and Results of Operations included in the 2019 Annual Report for additional information.\nCertain Power Agreements\nAs of December 31, 2019, the assets utilized in this segment included approximately 1,212 MWs of company-owned domestic wind power facilities, 101 MWs of domestic wind power from long-term purchase power agreements and 355 MWs of coal-fired capacity which was obtained through an agreement effective through 2027 that transfers the interest of AEP Texas in the Oklaunion Power Station to AEPEP. Management has announced plans to close Oklaunion Power Station by October 2020. The power obtained from the Oklaunion Power Station is marketed and sold in ERCOT.\nINFORMATION ABOUT OUR EXECUTIVE OFFICERS\nThe following persons are executive officers of AEP. Their ages are given as of February 20, 2020. The officers are appointed annually for a one-year term by the board of directors of AEP.\nNicholas K. Akins\nChairman of the Board, President and Chief Executive Officer\nAge 59\nChairman of the Board since January 2014, President since January 2011 and Chief Executive Officer since November 2011.\nLisa M. Barton\nExecutive Vice President - Utilities\nAge 54\nExecutive Vice President - Transmission from August 2011 to December 2018.\nPaul Chodak, III\nExecutive Vice President - Generation\nAge 56\nExecutive Vice President - Utilities from January 2017 to December 2018. President and Chief Operating Officer of I&M from July 2010 to December 2016.\nDavid M. Feinberg\nExecutive Vice President, General Counsel and Secretary\nAge 50\nExecutive Vice President since January 2013.\nLana L. Hillebrand\nExecutive Vice President and Chief Administrative Officer\nAge 59\nChief Administrative Officer since December 2012 and Senior Vice President from December 2012 to December 2016.\nMark C. McCullough\nExecutive Vice President - Transmission\nAge 60\nExecutive Vice President - Generation from January 2011 to December 2018.\nCharles R. Patton\nExecutive Vice President - External Affairs\nAge 60\nExecutive Vice President - External Affairs since January 2017. President and Chief Operating Officer of APCo from June 2010 to December 2016.\nBrian X. Tierney\nExecutive Vice President and Chief Financial Officer\nAge 52\nExecutive Vice President and Chief Financial Officer since October 2009.\nCharles E. Zebula\nExecutive Vice President - Energy Supply\nAge 59\nExecutive Vice President - Energy Supply since January 2013.",
    "item_1A": "ITEM 1A. RISK FACTORS\nGENERAL RISKS OF REGULATED OPERATIONS\nAEP may not be able to recover the costs of substantial planned investment in capital improvements and additions. (Applies to all Registrants)\nAEP’s business plan calls for extensive investment in capital improvements and additions, including the installation of environmental upgrades and retrofits, construction of additional transmission facilities, modernizing existing infrastructure as well as other initiatives. AEP’s public utility subsidiaries currently provide service at rates approved by one or more regulatory commissions. If these regulatory commissions do not approve adjustments to the rates charged, affected AEP subsidiaries would not be able to recover the costs associated with their investments. This would cause financial results to be diminished.\nRegulated electric revenues and earnings are dependent on federal and state regulation that may limit AEP’s ability to recover costs and other amounts. (Applies to all Registrants)\nThe rates customers pay to AEP regulated utility businesses are subject to approval by the FERC and the respective state utility commissions of Arkansas, Indiana, Kentucky, Louisiana, Michigan, Ohio, Oklahoma, Tennessee, Texas, Virginia and West Virginia. In certain instances, AEP’s applicable regulated utility businesses may agree to negotiated settlements related to various rate matters that are subject to regulatory approval. AEP cannot predict the ultimate outcomes of any settlements or the actions by the FERC or the respective state commissions in establishing rates.\nIf regulated utility earnings exceed the returns established by the relevant commissions, retail electric rates may be subject to review and possible reduction by the commissions, which may decrease future earnings. Additionally, if regulatory bodies do not allow recovery of costs incurred in providing service on a timely basis, it could reduce future net income and cash flows and negatively impact financial condition. Similarly, if recovery or other rate relief authorized in the past is overturned or reversed on appeal, future earnings could be negatively impacted. Any regulatory action or litigation outcome that triggers a reversal of a regulatory asset or deferred cost generally results in an impairment to the balance sheet and a charge to the income statement of the company involved. See Note 4 - Rate Matters included in the 2019 Annual Report for additional information.\nAEP’s transmission investment strategy and execution are dependent on federal and state regulatory policy. (Applies to all Registrants)\nA significant portion of AEP’s earnings is derived from transmission investments and activities. FERC policy currently favors the expansion and updating of the transmission infrastructure within its jurisdiction. If the FERC were to adopt a different policy, if states were to limit or restrict such policies, or if transmission needs do not continue or develop as projected, AEP’s strategy of investing in transmission could be impacted. Management believes AEP’s experience with transmission facilities construction and operation gives AEP an advantage over other competitors in securing authorization to install, construct and operate new transmission lines and facilities. However, there can be no assurance that PJM, SPP, ERCOT or other RTOs will authorize new transmission projects or will award such projects to AEP.\nCertain elements of AEP’s transmission formula rates have been challenged, which could result in lowered rates and/or refunds of amounts previously collected and thus have an adverse effect on AEP’s business, financial condition, results of operations and cash flows. (Applies to all Registrants other than AEP Texas)\nAEP provides transmission service under rates regulated by the FERC. The FERC has approved the cost-based formula rate templates used by AEP to calculate its respective annual revenue requirements, but it has not expressly approved the amount of actual capital and operating expenditures to be used in the formula rates. All aspects of AEP’s rates accepted or approved by the FERC, including the formula rate templates, the rates of return on the actual equity portion of its respective capital structures and the approved targeted capital structures, are subject to challenge by interested parties at the FERC, or by the FERC on its own initiative. In addition, interested parties may challenge the annual\nimplementation and calculation by AEP of its projected rates and formula rate true up pursuant to its approved formula rate templates under AEP’s formula rate implementation protocols. If a challenger can establish that any of these aspects are unjust, unreasonable, unduly discriminatory or preferential, then the FERC can make appropriate prospective adjustments to them and/or disallow any of AEP’s inclusion of those aspects in the rate setting formula.\nAEP settled challenges to its SPP and PJM formula rates in proceedings at the FERC in 2019. However, inquiries related to rates of return, as well as challenges to the formula rates of other utilities, are ongoing in other proceedings at the FERC. The results of these proceedings could potentially negatively impact AEP in any future challenges to AEP’s formula rates. If the FERC orders revenue reductions, including refunds, in any future cases related to its formula rates, it could reduce future net income and cash flows and impact financial condition.\nEnd-use consumers and entities supplying electricity to end-use consumers may also attempt to influence government and/or regulators to change the rate setting methodologies that apply to AEP, particularly if rates for delivered electricity increase substantially.\nChanges in technology and regulatory policies may lower the value of electric utility facilities and franchises. (Applies to all Registrants)\nAEP primarily generates electricity at large central facilities and delivers that electricity to customers over its transmission and distribution facilities to customers usually situated within an exclusive franchise. This method results in economies of scale and generally lower costs than newer technologies such as fuel cells and microturbines, and distributed generation using either new or existing technology. Other technologies, such as light emitting diodes (LEDs), increase the efficiency of electricity and, as a result, lower the demand for it. Changes in regulatory policies and advances in batteries or energy storage, wind turbines and photovoltaic solar cells are reducing costs of new technology to levels that are making them competitive with some central station electricity production and delivery. These developments can challenge AEP’s competitive ability to maintain relatively low cost, efficient and reliable operations, to establish fair regulatory mechanisms and to provide cost-effective programs and services to customers. Further, in the event that alternative generation resources are mandated, subsidized or encouraged through legislation or regulation or otherwise are economically competitive and added to the available generation supply, such resources could displace a higher marginal cost generating units, which could reduce the price at which market participants sell their electricity.\nAEP may not recover costs incurred to begin construction on projects that are canceled. (Applies to all Registrants)\nAEP’s business plan for the construction of new projects involves a number of risks, including construction delays, nonperformance by equipment and other third-party suppliers, and increases in equipment and labor costs. To limit the risks of these construction projects, AEP’s subsidiaries enter into equipment purchase orders and construction contracts and incur engineering and design service costs in advance of receiving necessary regulatory approvals and/or siting or environmental permits. If any of these projects are canceled for any reason, including failure to receive necessary regulatory approvals and/or siting or environmental permits, significant cancellation penalties under the equipment purchase orders and construction contracts could occur. In addition, if any construction work or investments have been recorded as an asset, an impairment may need to be recorded in the event the project is canceled.\nAEP is exposed to nuclear generation risk. (Applies to AEP and I&M)\nI&M owns the Cook Plant, which consists of two nuclear generating units for a rated capacity of 2,288 MWs, or about 7% of the generating capacity in the AEP System. AEP and I&M are, therefore, subject to the risks of nuclear generation, which include the following:\n•\nThe potential harmful effects on the environment and human health due to an adverse incident/event resulting from the operation of nuclear facilities and the storage, handling and disposal of radioactive materials such as SNF.\n•\nLimitations on the amounts and types of insurance commercially available to cover losses that might arise in connection with nuclear operations.\n•\nUncertainties with respect to contingencies and assessment amounts triggered by a loss event (federal law requires owners of nuclear units to purchase the maximum available amount of nuclear liability insurance and potentially contribute to the coverage for losses of others).\n•\nUncertainties with respect to the technological and financial aspects of decommissioning nuclear plants at the end of their licensed lives.\nThere can be no assurance that I&M’s preparations or risk mitigation measures will be adequate if these risks are triggered.\nThe NRC has broad authority under federal law to impose licensing and safety-related requirements for the operation of nuclear generation facilities. In the event of non-compliance, the NRC has the authority to impose fines or shut down a unit, or both, depending upon its assessment of the severity of the situation, until compliance is achieved. Revised safety requirements promulgated by the NRC could necessitate substantial capital expenditures at nuclear plants. In addition, although management has no reason to anticipate a serious nuclear incident at the Cook Plant, if an incident did occur, it could harm results of operations or financial condition. A major incident at a nuclear facility anywhere in the world could cause the NRC to limit or prohibit the operation or licensing of any domestic nuclear unit. Moreover, a major incident at any nuclear facility in the U.S. could require AEP or I&M to make material contributory payments.\nCosts associated with the operation (including fuel), maintenance and retirement of nuclear plants continue to be more significant and less predictable than costs associated with other sources of generation, in large part due to changing regulatory requirements and safety standards, availability of nuclear waste disposal facilities and experience gained in the operation of nuclear facilities. Costs also may include replacement power, any unamortized investment at the end of the useful life of the Cook Plant (whether scheduled or premature), the carrying costs of that investment and retirement costs. The ability to obtain adequate and timely recovery of costs associated with the Cook Plant is not assured.\nAEP subsidiaries are exposed to risks through participation in the market and transmission structures in various regional power markets that are beyond their control. (Applies to all Registrants)\nResults are likely to be affected by differences in the market and transmission structures in various regional power markets. The rules governing the various RTOs, including SPP and PJM, may also change from time to time which could affect costs or revenues. Existing, new or changed rules of these RTOs could result in significant additional fees and increased costs to participate in those structures, including the cost of transmission facilities built by others due to changes in transmission rate design. In addition, these RTOs may assess costs resulting from improved transmission reliability, reduced transmission congestion and firm transmission rights. As members of these RTOs, AEP’s subsidiaries are subject to certain additional risks, including the allocation among existing members, of losses caused by unreimbursed defaults of other participants in these markets and resolution of complaint cases that may seek refunds of revenues previously earned by members of these markets.\nAEP could be subject to higher costs and/or penalties related to mandatory reliability standards. (Applies to all Registrants)\nOwners and operators of the bulk power transmission system are subject to mandatory reliability standards promulgated by the North American Electric Reliability Corporation and enforced by the FERC. The standards are based on the functions that need to be performed to ensure the bulk power system operates reliably and are guided by reliability and market interface principles. Compliance with new reliability standards may subject AEP to higher operating costs and/or increased capital expenditures. While management expects to recover costs and expenditures from customers through regulated rates, there can be no assurance that the applicable commissions will approve full recovery in a timely manner. If AEP were found not to be in compliance with the mandatory reliability standards, AEP could be subject to sanctions, including substantial monetary penalties, which likely would not be recoverable from customers through regulated rates.\nA substantial portion of the receivables of AEP Texas is concentrated in a small number of REPs, and any delay or default in payment could adversely affect its cash flows, financial condition and results of operations. (Applies to AEP and AEP Texas)\nAEP Texas collects receivables from the distribution of electricity from REPs that supply the electricity it distributes to its customers. As of December 31, 2019, AEP Texas did business with approximately 120 REPs. Adverse economic conditions, structural problems in the market served by ERCOT or financial difficulties of one or more REPs could impair the ability of these REPs to pay for these services or could cause them to delay such payments. AEP Texas depends on these REPs to remit payments on a timely basis. Applicable regulatory provisions require that customers be shifted to another REP or a provider of last resort if a REP cannot make timely payments. Applicable PUCT regulations significantly limit the extent to which AEP Texas can apply normal commercial terms or otherwise seek credit protection from firms desiring to provide retail electric service in its service territory, and AEP Texas thus remains at risk for payments related to services provided prior to the shift to another REP or the provider of last resort. In 2019, AEP Texas’ first, second and third largest REPs accounted for 20%, 14% and 14%, respectively, of its operating revenue. Any delay or default in payment by REPs could adversely affect cash flows, financial condition and results of operations. If a REP were unable to meet its obligations, it could consider, among various options, restructuring under the bankruptcy laws, in which event such REP might seek to avoid honoring its obligations, and claims might be made by creditors involving payments AEP Texas had received from such REP.\nRISKS RELATED TO MARKET, ECONOMIC OR FINANCIAL VOLATILITY AND OTHER RISKS\nAEP’s financial performance may be adversely affected if AEP is unable to successfully operate facilities or perform certain corporate functions. (Applies to all Registrants)\nPerformance is highly dependent on the successful operation of generation, transmission and/or distribution facilities. Operating these facilities involves many risks, including:\n•\nOperator error and breakdown or failure of equipment or processes.\n•\nOperating limitations that may be imposed by environmental or other regulatory requirements.\n•\nLabor disputes.\n•\nCompliance with mandatory reliability standards, including mandatory cyber security standards.\n•\nInformation technology failure that impairs AEP’s information technology infrastructure or disrupts normal business operations.\n•\nInformation technology failure that affects AEP’s ability to access customer information or causes loss of confidential or proprietary data that materially and adversely affects AEP’s reputation or exposes AEP to legal claims.\n•\nFuel or water supply interruptions caused by transportation constraints, adverse weather such as drought, non-performance by suppliers and other factors.\n•\nCatastrophic events such as fires, earthquakes, explosions, hurricanes, tornados, ice storms, terrorism (including cyber-terrorism), floods or other similar occurrences.\n•\nFuel costs and related requirements triggered by financial stress in the coal industry.\nPhysical attacks or hostile cyber intrusions could severely impair operations, lead to the disclosure of confidential information and damage AEP’s reputation. (Applies to all Registrants)\nAEP and its regulated utility businesses face physical security and cybersecurity risks as the owner-operators of generation, transmission and/or distribution facilities and as participants in commodities trading. AEP and its regulated utility businesses own assets deemed as critical infrastructure, the operation of which is dependent on information technology systems. Further, the computer systems that run these facilities are not completely isolated from external networks. Parties that wish to disrupt the U.S. bulk power system or AEP operations could view these computer systems, software or networks as targets for cyber attack. In addition, the electric utility business requires the collection of sensitive customer data, as well as confidential employee and shareholder information, which is subject to electronic theft or loss.\nA security breach of AEP or its regulated utility businesses’ physical assets or information systems, interconnected entities in RTOs, or regulators could impact the operation of the generation fleet and/or reliability of the transmission and distribution system or subject AEP and its regulated utility businesses to financial harm associated with theft or inappropriate release of certain types of information, including sensitive customer, vendor, employee, trading or other confidential data. A successful cyber attack on the systems that control generation, transmission, distribution or other assets could severely disrupt business operations, preventing service to customers or collection of revenues. The breach of certain business systems could affect the ability to correctly record, process and report financial information. A major cyber incident could result in significant expenses to investigate and repair security breaches or system damage and could lead to litigation, fines, other remedial action, heightened regulatory scrutiny and damage to AEP’s reputation. In addition, the misappropriation, corruption or loss of personally identifiable information and other confidential data could lead to significant breach notification expenses and mitigation expenses such as credit monitoring. For these reasons, a significant cyber incident could reduce future net income and cash flows and negatively impact financial condition.\nIf AEP is unable to access capital markets on reasonable terms, it could reduce future net income and cash flows and negatively impact financial condition. (Applies to all Registrants)\nAEP relies on access to capital markets as a significant source of liquidity for capital requirements not satisfied by operating cash flows. Volatility, increased interest rates and reduced liquidity in the financial markets could affect AEP’s ability to raise capital on reasonable terms to fund capital needs, including construction costs and refinancing maturing indebtedness. Certain sources of debt and equity capital expressed increasing unwillingness to invest in companies, such as AEP, that rely on fossil fuels. If sources of capital for AEP are reduced, capital costs could increase materially. Restricted access to capital markets and/or increased borrowing costs could reduce future net income and cash flows and negatively impact financial condition.\nShareholder activism could cause AEP to incur significant expense, hinder execution of AEP’s business strategy and impact AEP’s stock price. (Applies to all Registrants)\nShareholder activism, which can take many forms and arise in a variety of situations, could result in substantial costs and divert management’s and AEP’s board’s attention and resources from AEP’s business. Additionally, such shareholder activism could give rise to perceived uncertainties as to AEP’s future, adversely affect AEP’s relationships with its employees, customers or service providers and make it more difficult to attract and retain qualified personnel. Also, AEP may be required to incur significant fees and other expenses related to activist shareholder matters, including for third-party advisors. AEP’s stock price could be subject to significant fluctuation or otherwise be adversely affected by the events, risks and uncertainties of any shareholder activism.\nThe potential phasing out of LIBOR after 2021 may adversely affect the costs and availability of financing. (Applies to all Registrants)\nA portion of the Registrants’ indebtedness bears interest at fluctuating interest rates, primarily based on the London interbank offered rate (“LIBOR”) for deposits of U.S. dollars. LIBOR tends to fluctuate based on general interest rates, rates set by the U.S. Federal Reserve and other central banks, the supply of and demand for credit in the London interbank market and general economic conditions. Accordingly, Registrants’ interest expense for any particular period will fluctuate based on LIBOR and other variable interest rates. On July 27, 2017, the Financial Conduct Authority (the authority that regulates LIBOR) announced that it intends to stop compelling banks to submit rates for the calculation of LIBOR after 2021. It is unclear whether new methods of calculating LIBOR will be established such that it continues to exist after 2021. The U.S. Federal Reserve, in conjunction with the Alternative Reference Rates Committee, is considering replacing U.S. dollar LIBOR with the Secured Overnight Funding Rate, which is calculated based on repurchase agreements backed by treasury securities. It is not possible to predict the effect of these changes, other reforms or the establishment of alternative reference rates in the United Kingdom, the United States or elsewhere. To the extent these interest rates increase, interest expense will increase. If sources of capital for the Registrants are reduced, capital costs could increase materially. Restricted access to capital markets and/or increased borrowing costs could reduce future net income and cash flows and negatively impact financial condition and/or liquidity.\nDowngrades in AEP’s credit ratings could negatively affect its ability to access capital. (Applies to all Registrants)\nThe credit ratings agencies periodically review AEP’s capital structure and the quality and stability of earnings and cash flows. Any negative ratings actions could constrain the capital available to AEP and could limit access to funding for operations. Recently a credit rating agency placed AEP’s credit rating on negative outlook primarily because a key criterion, the ratio of cash flow from operations (excluding working capital) to debt, is expected to decline due to higher capital spending and lower cash flows resulting from changes in tax law. AEP’s business is capital intensive, and AEP is dependent upon the ability to access capital at rates and on terms management determines to be attractive. If AEP’s ability to access capital becomes significantly constrained, AEP’s interest costs will likely increase and could reduce future net income and cash flows and negatively impact financial condition.\nAEP and AEPTCo have no income or cash flow apart from dividends paid or other payments due from their subsidiaries. (Applies to AEP and AEPTCo)\nAEP and AEPTCo are holding companies and have no operations of their own. Their ability to meet their financial obligations associated with their indebtedness and to pay dividends is primarily dependent on the earnings and cash flows of their operating subsidiaries, primarily their regulated utilities, and the ability of their subsidiaries to pay dividends to, or repay loans from them. Their subsidiaries are separate and distinct legal entities that have no obligation (apart from loans from AEP or AEPTCo) to provide them with funds for their payment obligations, whether by dividends, distributions or other payments. Payments to AEP or AEPTCo by their subsidiaries are also contingent upon their earnings and business considerations. AEP and AEPTCo indebtedness and dividends are structurally subordinated to all subsidiary indebtedness.\nAEP’s operating results may fluctuate on a seasonal or quarterly basis and with general economic and weather conditions. (Applies to all Registrants)\nElectric power consumption is generally seasonal. In many parts of the country, demand for power peaks during the hot summer months, with market prices also peaking at that time. In other areas, power demand peaks during the winter. As a result, overall operating results in the future may fluctuate substantially on a seasonal basis. In addition, AEP has historically sold less power, and consequently earned less income, when weather conditions are milder. Unusually mild weather in the future could reduce future net income and cash flows and negatively impact financial condition. In addition, unusually extreme weather conditions could impact AEP’s results of operations in a manner that would not likely be sustainable.\nFurther, deteriorating economic conditions triggered by any cause, including international tariffs, generally result in reduced consumption by customers, particularly industrial customers who may curtail operations or cease production entirely, while an expanding economic environment generally results in increased revenues. As a result, prevailing economic conditions may reduce future net income and cash flows and negatively impact financial condition.\nVolatility in the securities markets, interest rates, and other factors could substantially increase defined benefit pension and other postretirement plan costs and the costs of nuclear decommissioning. (Applies to all Registrants and to AEP and I&M with respect to the costs of nuclear decommissioning)\nThe costs of providing pension and other postretirement benefit plans are dependent on a number of factors, such as the rates of return on plan assets, discount rates, the level of interest rates used to measure the required minimum funding levels of the plan, changes in actuarial assumptions, future government regulation, changes in life expectancy, and the frequency and amount of AEP’s required or voluntary contributions made to the plans. Changes in actuarial assumptions and differences between the assumptions and actual values, as well as a significant decline in the value of investments that fund the pension and other postretirement plans, if not offset or mitigated by a decline in plan liabilities, could increase pension and other postretirement expense, and AEP could be required from time to time to fund the pension plan with significant amounts of cash. Such cash funding obligations could have a material impact on liquidity by reducing cash flows and could negatively affect results of operations.\nAdditionally, I&M holds a significant amount of assets in its nuclear decommissioning trusts to satisfy obligations to decommission its nuclear plant. The rate of return on assets held in those trusts can significantly impact both the costs of decommissioning and the funding requirements for the trusts.\nAEP’s results of operations and cash flows may be negatively affected by a lack of growth or slower growth in the number of customers, or decline in customer demand. (Applies to all Registrants)\nGrowth in customer accounts and growth of customer usage each directly influence demand for electricity and the need for additional power generation and delivery facilities. Customer growth and customer usage are affected by a number of factors outside the control of AEP, such as mandated energy efficiency measures, demand-side management goals, distributed generation resources and economic and demographic conditions, such as population changes, job and income growth, housing starts, new business formation and the overall level of economic activity.\nCertain regulatory and legislative bodies have introduced or are considering requirements and/or incentives to further reduce energy consumption. Additionally, technological advances or other improvements in or applications of technology could lead to declines in per capita energy consumption. Some or all of these factors, could impact the demand for electricity.\nFailure to attract and retain an appropriately qualified workforce could harm results of operations. (Applies to all Registrants)\nCertain events, such as an aging workforce without appropriate replacements, mismatch of skillset or complement to future needs, or unavailability of contract resources may lead to operating challenges and increased costs. The challenges include lack of resources, loss of knowledge and a lengthy time period associated with skill development. In this case, costs, including costs for contractors to replace employees, productivity costs and safety costs, may rise. Failure to hire and adequately train replacement employees, including the transfer of significant internal historical knowledge and expertise to the new employees, or the future availability and cost of contract labor may adversely affect the ability to manage and operate the business. If AEP is unable to successfully attract and retain an appropriately qualified workforce, future net income and cash flows may be reduced.\nChanges in the price of commodities, the cost of procuring fuel, emission allowances for criteria pollutants and the costs of transport may increase AEP’s cost of producing power, impacting financial performance. (Applies to all Registrants except AEP Texas, AEPTCo and OPCo)\nAEP is exposed to changes in the price and availability of fuel (including the cost to procure coal and gas) and the price and availability to transport fuel. AEP has existing contracts of varying durations for the supply of fuel, but as these contracts end or if they are not honored, AEP may not be able to purchase fuel on terms as favorable as the current contracts. The inability to procure fuel at costs that are economical could cause AEP to retire generating capacity prior to the end of its useful life, and while AEP typically recovers expenditures for undepreciated plant balances, there can be no assurance in the future that AEP will recover such costs. Similarly, AEP is exposed to changes in the price and availability of emission allowances. AEP uses emission allowances based on the amount of fuel used and reductions achieved through emission controls and other measures. Based on current environmental programs remaining in effect, AEP has sufficient emission allowances to cover the majority of the projected needs for the next two years and beyond. If the Federal EPA attempts to further reduce interstate transport, and it is acceptable by the courts, additional costs may be incurred either to acquire additional allowances or to achieve further reductions in emissions. If AEP needs to obtain allowances, those purchases may not be on as favorable terms as those under the current environmental programs. AEP’s risks relative to the price and availability to transport coal include the volatility of the price of diesel which is the primary fuel used in transporting coal by barge.\nPrices for coal, natural gas and emission allowances have shown material swings in the past. Changes in the cost of fuel, emission allowances or natural gas and changes in the relationship between such costs and the market prices of power could reduce future net income and cash flows and negatively impact financial condition.\nIn addition, actual power prices and fuel costs will differ from those assumed in financial projections used to value trading and marketing transactions, and those differences may be material. As a result, as those transactions are marked-to-market, they may impact future results of operations and cash flows and impact financial condition.\nAEP is subject to physical and financial risks associated with climate change. (Applies to all Registrants)\nClimate change creates physical and financial risk. Physical risks from climate change may include an increase in sea level and changes in weather conditions, such as changes in precipitation and extreme weather events, such as fires. Customers’ energy needs vary with weather conditions, primarily temperature and humidity. For residential customers, heating and cooling represent their largest energy use. To the extent weather conditions are affected by climate change, customers’ energy use could increase or decrease depending on the duration and magnitude of the changes.\nIncreased energy use due to weather changes may require AEP to invest in additional generating assets, transmission and other infrastructure to serve increased load. Decreased energy use due to weather changes may affect financial condition through decreased revenues. Extreme weather conditions in general require more system backup, adding to costs, and can contribute to increased system stress, including service interruptions. Weather conditions outside of the AEP service territory could also have an impact on revenues. AEP buys and sells electricity depending upon system needs and market opportunities. Extreme weather conditions creating high energy demand on AEP’s own and/or other systems may raise electricity prices as AEP buys short-term energy to serve AEP’s own system, which would increase the cost of energy AEP provides to customers.\nSevere weather and weather-related events impact AEP’s service territories, primarily when thunderstorms, tornadoes, hurricanes, fires, floods and snow or ice storms occur. To the extent the frequency and intensity of extreme weather events and storms increase, AEP’s cost of providing service will increase, and these costs may not be recoverable. Changes in precipitation resulting in droughts, water shortages or floods could adversely affect operations, principally the fossil fuel generating units. A negative impact to water supplies due to long-term drought conditions or severe flooding could adversely impact AEP’s ability to provide electricity to customers, as well as increase the price they pay for energy. AEP may not recover all costs related to mitigating these physical and financial risks.\nTo the extent climate change impacts a region’s economic health, it may also impact revenues. AEP’s financial performance is tied to the health of the regional economies AEP serves. The price of energy, as a factor in a region’s cost of living as well as an important input into the cost of goods and services, has an impact on the economic health of the communities within the AEP System.\nManagement cannot predict the outcome of the legal proceedings relating to AEP’s business activities. (Applies to all Registrants)\nAEP is involved in legal proceedings, claims and litigation arising out of its business operations, the most significant of which are summarized in Note 6 - Commitments, Guarantees and Contingencies included in the 2019 Annual Report. Adverse outcomes in these proceedings could require significant expenditures that could reduce future net income and cash flows and negatively impact financial condition.\nDisruptions at power generation facilities owned by third-parties could interrupt the sales of transmission and distribution services. (Applies to AEP and AEP Texas)\nAEP Texas transmits and distributes electric power that the REPs obtain from power generation facilities owned by third-parties. If power generation is disrupted or if power generation capacity is inadequate, sales of transmission and distribution services may be diminished or interrupted, and results of operations, financial condition and cash flows could be adversely affected.\nHazards associated with high-voltage electricity transmission may result in suspension of AEP’s operations or the imposition of civil or criminal penalties. (Applies to all Registrants)\nAEP operations are subject to the usual hazards associated with high-voltage electricity transmission, including explosions, fires, inclement weather, natural disasters, mechanical failure, unscheduled downtime, equipment interruptions, remediation, chemical spills, discharges or releases of toxic or hazardous substances or gases and other environmental risks. The hazards can cause personal injury and loss of life, severe damage to or destruction of property and equipment and environmental damage, and may result in suspension of operations and the imposition of civil or criminal penalties. AEP maintains property and casualty insurance, but AEP is not fully insured against all potential hazards incident to AEP’s business, such as damage to poles, towers and lines or losses caused by outages.\nAEPTCo depends on its affiliates in the AEP System for a substantial portion of its revenues. (Applies to AEPTCo)\nAEPTCo’s principal transmission service customers are its affiliates in the AEP System. Management expects that these affiliates will continue to be AEPTCo’s principal transmission service customers for the foreseeable future. For the year ended December 31, 2019, its affiliates were responsible for approximately 79% of the consolidated transmission revenues of AEPTCo.\nMost of the real property rights on which the assets of AEPTCo are situated result from affiliate license agreements and are dependent on the terms of the underlying easements and other rights of its affiliates. (Applies to AEPTCo)\nAEPTCo does not hold title to the majority of real property on which its electric transmission assets are located. Instead, under the provisions of certain affiliate contracts, it is permitted to occupy and maintain its facilities upon real property held by the respective AEP System utility affiliate that overlay its operations. The ability of AEPTCo to continue to occupy such real property is dependent upon the terms of such affiliate contracts and upon the underlying real property rights of these utility affiliates, which may be encumbered by easements, mineral rights and other similar encumbrances that may affect the use of such real property. AEP can give no assurance that (a) the relevant AEP System utility affiliates will continue to be affiliates of AEPTCo, (b) suitable replacement arrangements can be obtained in the event that the relevant AEP System utility affiliates are not its affiliates and (c) the underlying easements and other rights are sufficient to permit AEPTCo to operate its assets in a manner free from interruption.\nRISKS RELATED TO OWNING AND OPERATING GENERATION ASSETS AND SELLING POWER\nCosts of compliance with existing environmental laws are significant. (Applies to all Registrants except AEP Texas, AEPTCo and OPCo)\nOperations are subject to extensive federal, state and local environmental statutes, rules and regulations relating to air quality, water quality, waste management, natural resources and health and safety. A majority of the electricity generated by the AEP System is produced by the combustion of fossil fuels. Emissions of nitrogen and sulfur oxides, mercury and particulates and the discharge and disposal of solid waste (including coal-combustion residuals or “CCR”) resulting from fossil fueled generation plants are subject to increased regulations, controls and mitigation expenses. Compliance with these legal requirements requires AEP to commit significant capital toward environmental monitoring, installation of pollution control equipment, emission fees, disposal and permits at AEP facilities and could cause AEP to retire generating capacity prior to the end of its estimated useful life. Costs of compliance with environmental statutes and regulations could reduce future net income and negatively impact financial condition, especially if emission, CCR waste and/or discharge obligations are tightened, more extensive operating and/or permitting requirements are imposed or additional substances become regulated. Although AEP typically recovers expenditures for pollution control technologies, replacement generation, undepreciated plant balances and associated operating costs from customers, there can be no assurance in the future that AEP will recover the remaining costs associated with such plants. Failure to recover these costs could reduce future net income and cash flows and possibly harm financial condition.\nRegulation of CO2 emissions could materially increase costs to AEP and its customers or cause some electric generating units to be uneconomical to operate or maintain. (Applies to all Registrants except AEP Texas, AEPTCo and OPCo)\nIn 2014, the Federal EPA issued standards for new, modified and reconstructed units, and a guideline for the development of SIPs that would reduce carbon emissions from existing utility units. The standards and guidelines were finalized in 2015, and were challenged by several dozen states as well as industry groups and other stakeholders. The U.S. Supreme Court stayed the implementation of the guidelines for existing sources, known as the Clean Power Plan, while the courts considered those challenges. In 2017, the Federal EPA issued a proposal to repeal the Clean Power Plan, and in 2018, the Federal EPA proposed new guidelines that would allow states to establish unit-specific performance standards based on their evaluation of past performance and whether certain efficiency improvement measures could be applied at existing coal-fired units. The Federal EPA also proposed to change the new source performance standard for new coal-fired utility units to 1,900 - 2,000 pounds per MWh depending on the size of the unit, an increase from the current standard of 1,400 pounds per MWh, based on its determination that carbon capture and storage is not available everywhere and is not sufficiently cost-effective to be considered the best available control technology for coal-fired units. The new guidelines were finalized in 2019, and the Clean Power Plan was repealed. Challenges to both of these actions are pending in the U.S. Court of Appeals for the District of Columbia Circuit.\nCO2 standards could require significant increases in capital expenditures and operating costs and could impact the dates for retirement of AEP’s coal-fired units. While AEP typically recovers costs of complying with new requirements, such as the potential CO2 and other greenhouse gases emission standards from customers, there can be no assurance that AEP would recover such costs.\nCourts adjudicating nuisance and other similar claims in the future may order AEP to pay damages or to limit or reduce emissions. (Applies to all Registrants except AEP Texas, AEPTCo and OPCo)\nIn the past, there have been several cases seeking damages based on allegations of federal and state common law nuisance in which AEP, among others, were defendants. In general, the actions allege that emissions from the defendants’ power plants constitute a public nuisance. The plaintiffs in these actions generally seek recovery of damages and other relief. If future actions are resolved against AEP, substantial modifications or retirement of AEP’s existing coal-fired power plants could be required, and AEP might be required to purchase power from third-parties to fulfill AEP’s commitments to supply power to AEP customers. This could have a material impact on revenues. In addition, AEP could be required to invest significantly in additional emission control equipment, accelerate the timing of capital expenditures, pay damages or penalties and/or halt operations. Unless recovered, those costs could reduce future net income and cash flows and harm financial condition. Moreover, results of operations and financial position could be reduced due to the timing of recovery of these investments and the expense of ongoing litigation.\nCommodity trading and marketing activities are subject to inherent risks which can be reduced and controlled but not eliminated. (Applies to all Registrants except AEP Texas, AEPTCo and OPCo)\nAEP routinely has open trading positions in the market, within guidelines set by AEP, resulting from the management of AEP’s trading portfolio. To the extent open trading positions exist, fluctuating commodity prices can improve or diminish financial results and financial position.\nAEP’s power trading activities also expose AEP to risks of commodity price movements. To the extent that AEP’s power trading does not hedge the price risk associated with the generation it owns, or controls, AEP would be exposed to the risk of rising and falling spot market prices.\nIn connection with these trading activities, AEP routinely enters into financial contracts, including futures and options, OTC options, financially-settled swaps and other derivative contracts. These activities expose AEP to risks from price movements. If the values of the financial contracts change in a manner AEP does not anticipate, it could harm financial position or reduce the financial contribution of trading operations.\nParties with whom AEP has contracts may fail to perform their obligations, which could harm AEP’s results of operations. (Applies to all Registrants)\nAEP sells power from its generation facilities into the spot market and other competitive power markets on a contractual basis. AEP also enters into contracts to purchase and sell electricity, natural gas, emission allowances and coal as part of its power marketing and energy trading operations. AEP is exposed to the risk that counterparties that owe AEP money or the delivery of a commodity, including power, could breach their obligations. Should the counterparties to these arrangements fail to perform, AEP may be forced to enter into alternative hedging arrangements or honor underlying commitments at then-current market prices that may exceed AEP’s contractual prices, which would cause financial results to be diminished and AEP might incur losses. Although estimates take into account the expected probability of default by a counterparty, actual exposure to a default by a counterparty may be greater than the estimates predict.\nAEP relies on electric transmission facilities that AEP does not own or control. If these facilities do not provide AEP with adequate transmission capacity, AEP may not be able to deliver wholesale electric power to the purchasers of AEP’s power. (Applies to all Registrants)\nAEP depends on transmission facilities owned and operated by other nonaffiliated power companies to deliver the power AEP sells at wholesale. This dependence exposes AEP to a variety of risks. If transmission is disrupted, or transmission capacity is inadequate, AEP may not be able to sell and deliver AEP wholesale power. If a region’s power transmission infrastructure is inadequate, AEP’s recovery of wholesale costs and profits may be limited. If restrictive transmission price regulation is imposed, the transmission companies may not have sufficient incentive to invest in expansion of transmission infrastructure.\nThe FERC has issued electric transmission initiatives that require electric transmission services to be offered unbundled from commodity sales. Although these initiatives are designed to encourage wholesale market transactions, access to transmission systems may not be available if transmission capacity is insufficient because of physical constraints or because it is contractually unavailable. Management also cannot predict whether transmission facilities will be expanded in specific markets to accommodate competitive access to those markets.\nOVEC may require additional liquidity and other capital support. (Applies to AEP, APCo, I&M and OPCo)\nAEP and several nonaffiliated utility companies own OVEC. The Inter-Company Power Agreement (ICPA) defines the rights and obligations and sets the power participation ratio of the parties to it. Under the ICPA, parties are entitled to receive and are obligated to pay for all OVEC capacity (approximately 2,400 MWs) in proportion to their respective power participation ratios. The aggregate power participation ratio of APCo, I&M and OPCo is 43.47%. If a party fails to make payments owed by it under the ICPA, OVEC may not have sufficient funds to honor its payment obligations, including its ongoing operating expenses as well as its indebtedness. As of December 31, 2019, OVEC has outstanding indebtedness of approximately $1.4 billion, of which APCo, I&M, and OPCo are collectively responsible for $589 million through the ICPA. Although they are not an obligor or guarantor, APCo, I&M, and OPCo are responsible for their respective ratio of OVEC’s outstanding debt through the ICPA.\nFirstEnergy Solutions (“FES”), a nonaffiliated party, whose aggregate power participation ratio is 4.85% under the ICPA, has filed a petition seeking protection under bankruptcy law. Litigation related to these filings continues. In addition, as a result of these and prior related developments, OVEC’s credit ratings have been adversely impacted.\nIf OVEC does not have sufficient funds to honor its payment obligations, there is risk that APCo, I&M and/or OPCo may need to make payments in addition to their power participation ratio payments. Further, if OVEC’s indebtedness is accelerated for any reason, there is risk that APCo, I&M and/or OPCo may be required to pay some or all of such accelerated indebtedness in amounts equal to their aggregate power participation ratio of 43.47%. Also, as a result of the credit rating agencies’ actions, OVEC’s ability to access capital markets on terms as favorable as previously may diminish and its financing costs will increase.",
    "item_1B": "ITEM 1B. UNRESOLVED STAFF COMMENTS\nNone.",
    "item_1C": "",
    "item_2": "ITEM 2. PROPERTIES\nGENERATION FACILITIES\nAs of December 31, 2019, the AEP System owned (or leased where indicated) generation plants, with locations and net maximum power capabilities (winter rating), are shown in the following tables:\nVertically Integrated Utilities Segment\nAEGCo\nPlant Name\nUnits\nState\nFuel Type\nNet Maximum\nCapacity (MWs)\nYear Plant\nor First Unit Commissioned\nRockport, Units 1 and 2 - 50% of each (a)\nIN\nSteam - Coal\n1,310\n(a)\nRockport Plant, Unit 2 is leased.\na\nNA Not applicable.\n(a)\nRockport Plant, Unit 2 is leased.\nThe following table provides operating information related to the Cook Plant:\n(a)\nKPCo owns a 50% interest in the Mitchell Plant units. WPCo owns the remaining 50%. Figures presented reflect only the portion owned by KPCo.\n(a)\nWeleetka Unit 6 was retired in March 2019.\n(b)\nJointly-owned with AEP Texas and nonaffiliated entities. Figures presented reflect only the portion owned by PSO.\n(c)\nIn September 2018, management announced plans to close the plant by October 2020.\n(a)\nJointly-owned with nonaffiliated entities. Figures presented reflect only the portion owned by SWEPCo. The Arkansas jurisdictional portion of SWEPCo’s interest in Turk Plant is not in rate base.\n(b)\nIn January 2020, management announced plans to close the plant at the end of 2026.\n(c)\nKnox Lee Unit 4 was retired in January 2019. Figures presented include Unit 4 in the total.\n(d)\nKnox Lee Unit 2 and Unit 3, Lieberman Unit 2 and Lone Star are scheduled for retirement in May 2020.\nWPCo\nPlant Name\nUnits\nState\nFuel Type\nNet Maximum\nCapacity (MWs)\nYear Plant\nor First Unit Commissioned\nMitchell (a)\nWV\nSteam - Coal\n(a)\n17.5% of WPCo’s interest in the Mitchell Plant units was not in rate base during 2019. In 2020 WPCo’s entire interest in the Mitchell Plant will be in rate base. KPCo owns the remaining 50%. Figures presented reflect only the portion owned by WPCo.\nTransmission and Distribution Segment\nAEP Texas\nPlant Name\nUnits\nState\nFuel Type\nNet Maximum\nCapacity (MWs)\nYear Plant\nor First Unit Commissioned\nOklaunion Power Station (a) (b) (c)\nTX\nSteam - Coal\n(a)\nJointly-owned with PSO and nonaffiliated entities. Figures presented reflect only the portion owned by AEP Texas.\n(b)\nIn September 2018, management announced plans to close the plant by October 2020.\n(c)\nThe capacity and energy from the Oklaunion Power Station is sold to AEPEP under a PPA.\nGeneration & Marketing Segment\n(a)\nJointly-owned with nonaffiliated entities. Figures presented reflect only the portion owned by AGR.\n(b)\nConesville Plant Units 5 and 6 closed effective May 31, 2019 and Unit 4 is scheduled to close in May 2020.\n(a)\nColorado, Hawaii, Indiana, Kansas, Michigan, Minnesota, Pennsylvania, and Texas.\n(b)\nCalifornia, Colorado, Florida, Hawaii, Iowa, Minnesota, Nebraska, New Hampshire, New Jersey, New Mexico, New York, Ohio, Rhode Island, Texas and Vermont.\n(c)\nIllinois, New Mexico and Ohio.\nIn addition to the AGR and Renewable Power generation set forth above, a subsidiary in the Generation & Marketing segment has contractual rights through 2027 from AEP Texas to 355 MWs from the Oklaunion Power Station. AEP Texas co-owns the Oklaunion Power Station with PSO and several nonaffiliated entities. Management has announced plans to close Oklaunion Power Station by October 2020.\nTRANSMISSION AND DISTRIBUTION FACILITIES\nThe following tables set forth the total overhead circuit miles of transmission and distribution lines of the AEP System and its operating companies.\nVertically Integrated Utilities Segment\nTransmission and Distribution Utilities Segment\nAEP Transmission Holdco Segment\nThe following table sets forth the total overhead circuit miles of transmission lines of certain wholly-owned and joint venture-owned entities:\nTITLE TO PROPERTY\nThe AEP System’s generating facilities are generally located on lands owned in fee simple. The greater portion of the transmission and distribution lines of the AEP System has been constructed over lands of private owners pursuant to easements or along public highways and streets pursuant to appropriate statutory authority. The rights of AEP’s public utility subsidiaries in the realty on which their facilities are located are considered adequate for use in the conduct of their business. Minor defects and irregularities customarily found in title to properties of like size and character may exist, but such defects and irregularities do not materially impair the use of the properties. AEP’s public utility subsidiaries generally have the right of eminent domain which permits them, if necessary, to acquire, perfect or secure titles to or easements on privately held lands used or to be used in their utility operations. Legislation in Ohio and Virginia has restricted the right of eminent domain previously granted for power generation purposes.\nSYSTEM TRANSMISSION LINES AND FACILITY SITING\nLaws in the states of Arkansas, Indiana, Kentucky, Louisiana, Michigan, Ohio, Tennessee, Texas, Virginia and West Virginia require prior approval of sites of generating facilities and/or routes of high-voltage transmission lines. AEP has experienced delays and additional costs in constructing facilities as a result of proceedings conducted pursuant to such statutes and in proceedings in which AEP’s operating companies have sought to acquire rights-of-way through condemnation. These proceedings may result in additional delays and costs in future years.\nCONSTRUCTION PROGRAM\nWith input from its state utility commissions, the AEP System continuously assesses the adequacy of its transmission, distribution, generation and other facilities to plan and provide for the reliable supply of electric power and energy to its customers. In this assessment process, assumptions are continually being reviewed as new information becomes available and assessments and plans are modified, as appropriate. AEP forecasts approximately $6.3 billion of construction expenditures for 2020. Capital expenditures related to North Central Wind Energy Facilities are excluded from this budgeted amount. Estimated construction expenditures are subject to periodic review and modification and may vary based on the ongoing effects of regulatory constraints, environmental regulations, business opportunities, market volatility, economic trends, weather and the ability to access capital. See the “Budgeted Capital Expenditures” section of Management’s Discussion and Analysis of Financial Condition and Results of Operations included in the 2019 Annual Report for additional information.\nPOTENTIAL UNINSURED LOSSES\nSome potential losses or liabilities may not be insurable or the amount of insurance carried may not be sufficient to meet potential losses and liabilities, including liabilities relating to damage to AEP’s generation plants and costs of replacement power. Unless allowed to be recovered through rates, future losses or liabilities which are not completely insured could reduce net income and impact the financial conditions of AEP and other AEP System companies. For risks related to owning a nuclear generating unit, see the “Nuclear Contingencies” section of Note 6 - Commitments, Guarantees and Contingencies included in the 2019 Annual Report for additional information.",
    "item_3": "ITEM 3. LEGAL PROCEEDINGS\nFor a discussion of material legal proceedings, see Note 6 - Commitments, Guarantees and Contingencies included in the 2019 Annual Report for additional information.",
    "item_4": "ITEM 4. MINE SAFETY DISCLOSURE\nThe Federal Mine Safety and Health Act of 1977 (Mine Act) imposes stringent health and safety standards on various mining operations. The Mine Act and its related regulations affect numerous aspects of mining operations, including training of mine personnel, mining procedures, equipment used in mine emergency procedures, mine plans and other matters. SWEPCo, through its ownership of Dolet Hills Lignite Company (DHLC), a wholly-owned lignite mining subsidiary of SWEPCo, is subject to the provisions of the Mine Act.\nThe Dodd-Frank Wall Street Reform and Consumer Protection Act (Dodd-Frank Act) requires companies that operate mines to include in their periodic reports filed with the SEC, certain mine safety information covered by the Mine Act. Exhibit 95 “Mine Safety Disclosure Exhibit” contains the notices of violation and proposed assessments received by DHLC under the Mine Act for the quarter ended December 31, 2019.\nPART II",
    "item_5": "ITEM 5. MARKET FOR REGISTRANTS’ COMMON EQUITY, RELATED STOCKHOLDER MATTERS AND ISSUER PURCHASES OF EQUITY SECURITIES\nAEP\nIn addition to the discussion below, the remaining information required by this item is incorporated herein by reference to the material under AEP Common Stock Information and “Management’s Discussion and Analysis of Financial Condition and Results of Operations - Dividend Policy and Restrictions” included in the 2019 Annual Report.\nAEP Texas, APCo, I&M, OPCo, PSO and SWEPCo\nThe common stock of these companies is held solely by AEP. For more information see the “Dividend Restrictions” section of Note 14 - Financing Activities included in the 2019 Annual Report.\nAEPTCo\nAEP owns the entire interest in AEPTCo through its wholly-owned subsidiary AEP Transmission Holdco.\nDuring the quarter ended December 31, 2019, neither AEP nor its publicly-traded subsidiaries purchased equity securities that are registered by AEP or its publicly-traded subsidiaries pursuant to Section 12 of the Exchange Act.",
    "item_6": "ITEM 6. SELECTED FINANCIAL DATA\nAEP\nThe information required by this item is incorporated herein by reference to the material under Selected Consolidated Financial Data in the 2019 Annual Report.\nAEP Texas, AEPTCo, APCo, I&M, OPCo, PSO and SWEPCo\nOmitted pursuant to Instruction I(2)(a). Management’s narrative analysis of the results of operations and other information required by Instruction I(2)(a) is incorporated herein by reference to the material under Management’s Discussion and Analysis of Financial Condition and Results of Operations in the 2019 Annual Report.",
    "item_7": "ITEM 7. MANAGEMENT’S DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION AND RESULTS OF OPERATIONS\nAEP\nThe information required by this item is incorporated herein by reference to the material under Management’s Discussion and Analysis of Financial Condition and Results of Operations in the 2019 Annual Report. Year-to-year comparisons between 2018 and 2017 have been omitted from this Form 10-K but may be found in \"Management's Discussion and Analysis of Financial Condition\" in Part II, Item 7 of our Form 10-K for the fiscal year ended December 31, 2018, which specific discussion is incorporated herein by reference.\nAEP Texas, AEPTCo, APCo, I&M, OPCo, PSO and SWEPCo\nOmitted pursuant to Instruction I(2)(a). Management’s narrative analysis of the results of operations and other information required by Instruction I(2)(a) is incorporated herein by reference to the material under Management’s Discussion and Analysis of Financial Condition and Results of Operations in the 2019 Annual Report.",
    "item_7A": "ITEM 7A. QUANTITATIVE AND QUALITATIVE DISCLOSURES ABOUT MARKET RISK\nAEP, AEP Texas, AEPTCo, APCo, I&M, OPCo, PSO and SWEPCo\nThe information required by this item is incorporated herein by reference to the material under the “Quantitative and Qualitative Disclosures About Market Risk” section of Management’s Discussion and Analysis of Financial Condition and Results of Operations in the 2019 Annual Report.",
    "item_8": "ITEM 8. FINANCIAL STATEMENTS AND SUPPLEMENTARY DATA\nAEP, AEP Texas, AEPTCo, APCo, I&M, OPCo, PSO and SWEPCo\nRefer to AEP's 2019 Annual Reports, which are incorporated herein by reference. Also refer to the Index of Financial Statement Schedules on page S-1 of this Form 10-K.",
    "item_9": "ITEM 9. CHANGES IN AND DISAGREEMENTS WITH ACCOUNTANTS ON ACCOUNTING AND FINANCIAL DISCLOSURE\nAEP, AEP Texas, AEPTCo, APCo, I&M, OPCo, PSO and SWEPCo\nInformation required by this item is set forth under the caption Proposal to Ratify the Appointment of the Independent Registered Public Accounting Firm in the 2020 Proxy Statement, which is incorporated by reference into this item.",
    "item_9A": "ITEM 9A. CONTROLS AND PROCEDURES\nDisclosure Controls and Procedures\nDuring 2019, management, including the principal executive officer and principal financial officer of each of American Electric Power Company, Inc. (“AEP”), AEP Texas Inc., AEP Transmission Company, LLC, Appalachian Power Company, Indiana Michigan Power Company, Ohio Power Company, Public Service Company of Oklahoma and Southwestern Electric Power Company (each a “Registrant” and collectively the “Registrants”) evaluated each respective Registrant’s disclosure controls and procedures. Disclosure controls and procedures are defined as controls and other procedures of the Registrant that are designed to ensure that information required to be disclosed by the Registrants in the reports that they file or submit under the Exchange Act are recorded, processed, summarized and reported within the time periods specified in the Commission’s rules and forms. Disclosure controls and procedures\ninclude, without limitation, controls and procedures designed to ensure that information required to be disclosed by the Registrants in the reports that they file or submit under the Exchange Act is accumulated and communicated to each Registrant’s management, including the principal executive and principal financial officers, or persons performing similar functions, as appropriate to allow timely decisions regarding required disclosure.\nAs of December 31, 2019, the principal executive officer and financial officer of each of the Registrants concluded that the disclosure controls and procedures in place were effective at the reasonable assurance level. The Registrants continually strive to improve their disclosure controls and procedures to enhance the quality of their financial reporting and to maintain dynamic systems that change as events warrant.\nChanges in Internal Control over Financial Reporting\nThere have been no changes in the Registrants’ internal control over financial reporting (as such term is defined in Rule 13a-15(f) and 15d-15(f) under the Exchange Act) during the fourth quarter 2019 that materially affected, or is reasonably likely to materially affect, the Registrants’ internal control over financial reporting.\nInternal Control over Financial Reporting\nSee Management’s Report on Internal Control over Financial Reporting for each Registrant under Item 8. As discussed in that report, management assessed and reported on the effectiveness of each Registrant’s internal control over financial reporting as of December 31, 2019. As a result of that assessment, management concluded that each Registrant’s internal control over financial reporting was effective as of December 31, 2019.",
    "item_9B": "ITEM 9B. OTHER INFORMATION\nNone.\nPART III",
    "item_9C": "",
    "item_10": "ITEM 10. DIRECTORS, EXECUTIVE OFFICERS AND CORPORATE GOVERNANCE\nAEP\nDirectors, Director Nomination Process and Audit Committee\nCertain of the information called for in this Item 10, including the information relating to directors, is incorporated herein by reference to AEP’s definitive proxy information statement (which will be filed with the SEC pursuant to Regulation 14A under the Exchange Act) relating to the 2020 Annual Meeting of Shareholders (the 2020 Annual Meeting) including under the captions “Election of Directors,” “AEP’s Board of Directors and Committees,” “Directors” and “Nominees for Directors.”\nExecutive Officers\nReference also is made under the caption “Information About our Executive Officers” in Part I, Item 1 of this report.\nCode of Ethics\nAEP’s Principles of Business Conduct is the code of ethics that applies to AEP’s Chief Executive Officer, Chief Financial Officer and principal accounting officer. The Principles of Business Conduct is available on AEP’s website at www.aep.com. The Principles of Business Conduct will be made available, without charge, in print to any shareholder who requests such document from Investor Relations, American Electric Power Company, Inc., 1 Riverside Plaza, Columbus, Ohio 43215.\nIf any substantive amendments to the Principles of Business Conduct are made or any waivers are granted, including any implicit waiver, from a provision of the Principles of Business Conduct, to its Chief Executive Officer, Chief Financial Officer or principal accounting officer, AEP will disclose the nature of such amendment or waiver on AEP’s website, www.aep.com, or in a report on Form 8-K.\nSection 16(a) Beneficial Ownership Reporting Compliance\nThe information required by this item is incorporated herein by reference to information contained in the definitive proxy statement of AEP for the 2020 Annual Meeting.\nAEP Texas, AEPTCo, APCo, I&M, OPCo, PSO and SWEPCo\nOmitted pursuant to Instruction I(2)(c).",
    "item_11": "ITEM 11. EXECUTIVE COMPENSATION\nAEP\nThe information called for by this Item 11 is incorporated herein by reference to AEP’s definitive proxy statement (which will be filed with the SEC pursuant to Regulation 14A under the Exchange Act) relating to the 2020 Annual Meeting including under the captions “Compensation Discussion and Analysis,” “Executive Compensation”, “Director Compensation” and “2019 Director Compensation Table”. The information set forth under the subcaption “Human Resources Committee Report” and “Audit Committee Report” should not be deemed filed nor should it be incorporated by reference into any other filing under the Securities Act of 1933, as amended, or the Exchange Act except to the extent AEP specifically incorporates such report by reference therein.\nAEP Texas, AEPTCo, APCo, I&M, OPCo, PSO and SWEPCo\nOmitted pursuant to Instruction I(2)(c).",
    "item_12": "ITEM 12. SECURITY OWNERSHIP OF CERTAIN BENEFICIAL OWNERS AND MANAGEMENT AND RELATED STOCKHOLDER MATTERS\nAEP\nThe information relating to Security Ownership of Certain Beneficial Owners is incorporated herein by reference to AEP’s definitive proxy statement (which will be filed with the SEC pursuant to Regulation 14A under the Exchange Act) relating to 2020 Annual Meeting under the caption “Share Ownership of Certain Beneficial Owners and Management” and “Share Ownership of Directors and Executive Officers.”\nEQUITY COMPENSATION PLAN INFORMATION\nThe following table summarizes the ability of AEP to issue common stock pursuant to equity compensation plans as of December 31, 2019:\n(a)\nThe balance includes unvested 2019 performance shares and restricted stock units as well as vested performance shares deferred as AEP career shares, all of which will be settled and paid in shares of AEP common stock. For performance shares, the total includes the target number of shares that could be granted if performance meets target objectives. The number of securities that would be granted, with respect to performance shares, if performance meets the maximum payout level, is two times the amount included in this total.\n(b)\nNo consideration is required from participants for the exercise or vesting of any outstanding AEP equity compensation awards.\nAEP Texas, AEPTCo, APCo, I&M, OPCo, PSO and SWEPCo\nOmitted pursuant to Instruction I(2)(c).",
    "item_13": "ITEM 13. CERTAIN RELATIONSHIPS AND RELATED TRANSACTIONS AND DIRECTOR INDEPENDENCE\nAEP\nThe information called for by this Item 13 is incorporated herein by reference to AEP’s definitive proxy statement (which will be filed with the SEC pursuant to Regulation 14A under the Exchange Act) relating to the 2020 Annual Meeting under the captions “Transactions with Related Persons” and “Director Independence.”\nAEP Texas, AEPTCo, APCo, I&M, OPCo, PSO and SWEPCo\nOmitted pursuant to Instruction I(2)(c).",
    "item_14": "ITEM 14. PRINCIPAL ACCOUNTING FEES AND SERVICES\nAEP\nThe information called for by this Item 14 is incorporated herein by reference to AEP’s definitive proxy statement (which will be filed with the SEC pursuant to Regulation 14A under the Exchange Act) relating to the 2020 Annual Meeting under the captions “Audit and Non-Audit Fees,” “Audit Committee Report” and “Policy on Audit Committee Pre-Approval of Audit and Permissible Non-Audit Services of the Independent Auditor.”\nAEP Texas, AEPTCo, APCo, I&M, OPCo, PSO and SWEPCo\nEach of the above is a wholly-owned subsidiary of AEP and does not have a separate audit committee. A description of the AEP Audit Committee pre-approval policies, which apply to these companies, is contained in the definitive proxy statement of AEP for the 2020 Annual Meeting of shareholders. The following table presents directly billed fees for professional services rendered by PricewaterhouseCoopers LLP for the audit of these companies’ annual financial statements for the years ended December 31, 2019 and 2018, and fees directly billed for other services rendered by PricewaterhouseCoopers LLP during those periods. PricewaterhouseCoopers LLP also provides additional professional and other services to the AEP System, the cost of which may ultimately be allocated to these companies though not billed directly to them. For a description of these fees and services, see the description of principal accounting fees and services for AEP above.\nPART IV",
    "item_15": "ITEM 15. EXHIBITS AND FINANCIAL STATEMENT SCHEDULES\nThe following documents are filed as a part of this report:\n1.\nFINANCIAL STATEMENTS:\nThe following financial statements have been incorporated herein by reference pursuant to Item 8.\nAEP and Subsidiary Companies:\nReport of Independent Registered Public Accounting Firm; Management’s Report on Internal Control over Financial Reporting; Consolidated Statements of Income for the years ended December 31, 2019, 2018 and 2017; Consolidated Statements of Comprehensive Income (Loss) for the years ended December 31, 2019, 2018 and 2017; Consolidated Statements of Changes in Equity for the years ended December 31, 2019, 2018 and 2017; Consolidated Balance Sheets as of December 31, 2019 and 2018; Consolidated Statements of Cash Flows for the years ended December 31, 2019, 2018 and 2017; Notes to Financial Statements of Registrants.\nAEP Texas, APCo, I&M and OPCo:\nReport of Independent Registered Public Accounting Firm; Management’s Report on Internal Control over Financial Reporting; Consolidated Statements of Income for the years ended December 31, 2019, 2018 and 2017; Consolidated Statements of Comprehensive Income (Loss) for the years ended December 31, 2019, 2018 and 2017; Consolidated Statements of Changes in Common Shareholder’s Equity for the years ended December 31, 2019, 2018 and 2017; Consolidated Balance Sheets as of December 31, 2019 and 2018; Consolidated Statements of Cash Flows for the years ended December 31, 2019, 2018 and 2017; Notes to Financial Statements of Registrants.\nAEPTCo:\nReport of Independent Registered Public Accounting Firm; Management’s Report on Internal Control over Financial Reporting; Consolidated Statements of Income for the years ended December 31, 2019, 2018 and 2017; Consolidated Statements of Changes in Member’s Equity for the years ended December 31, 2019, 2018 and 2017; Consolidated Balance Sheets as of December 31, 2019 and 2018; Consolidated Statements of Cash Flows for the years ended December 31, 2019, 2018 and 2017; Notes to Financial Statements of Registrants.\nPSO:\nReport of Independent Registered Public Accounting Firm; Management’s Report on Internal Control over Financial Reporting; Statements of Income for the years ended December 31, 2019, 2018 and 2017; Statements of Comprehensive Income (Loss) for the years ended December 31, 2019, 2018 and 2017; Statements of Changes in Common Shareholder’s Equity for the years ended December 31, 2019, 2018 and 2017; Balance Sheets as of December 31, 2019 and 2018; Statements of Cash Flows for the years ended December 31, 2019, 2018 and 2017; Notes to Financial Statements of Registrants.\nSWEPCo:\nReport of Independent Registered Public Accounting Firm; Management’s Report on Internal Control over Financial Reporting; Consolidated Statements of Income for the years ended December 31, 2019, 2018 and 2017; Consolidated Statements of Comprehensive Income (Loss) for the years ended December 31, 2019, 2018 and 2017; Consolidated Statements of Changes in Equity for the years ended December 31, 2019, 2018 and 2017; Consolidated Balance Sheets as of December 31, 2019 and 2018; Consolidated Statements of Cash Flows for the years ended December 31, 2019, 2018 and 2017; Notes to Financial Statements of Registrants.\n2. FINANCIAL STATEMENT SCHEDULES:\nPage Number\nFinancial Statement Schedules are listed in the Index of Financial Statement Schedules. (Certain schedules have been omitted because the required information is contained in the notes to financial statements or because such schedules are not required or are not applicable). Reports of Independent Registered Public Accounting Firm.\nS-1\n3. EXHIBITS:\nExhibits for AEP, AEP Texas, AEPTCo, APCo, I&M, OPCo, PSO and SWEPCo are listed in the Exhibit Index beginning on page E-1 and are incorporated herein by reference.\nE-1",
    "item_16": "ITEM 16. FORM 10-K SUMMARY\nNone.",
    "stock_ticker": "AEP"
}