{
    "cik": "723254",
    "company": "CINTAS CORP",
    "filing_type": "10-K",
    "filing_date": "2021-07-28",
    "period_of_report": "2021-05-31",
    "sic": "2320",
    "state_of_inc": "WA",
    "state_location": "OH",
    "fiscal_year_end": "0531",
    "filing_html_index": "https://www.sec.gov/Archives/edgar/data/723254/0000723254-21-000021-index.html",
    "htm_filing_link": "https://www.sec.gov/Archives/edgar/data/723254/000072325421000021/ctas-20210531.htm",
    "complete_text_filing_link": "https://www.sec.gov/Archives/edgar/data/723254/0000723254-21-000021.txt",
    "filename": "723254_10K_2021_0000723254-21-000021.htm",
    "item_1": "Item 1. Business\nOverview\nCintas Corporation (Cintas, Company, we, us or our), a Washington corporation, helps more than one million businesses of all types and sizes, primarily in the United States (U.S.), as well as Canada and Latin America, get READY™ to open their doors with confidence every day by providing a wide range of products and services that enhance our customers’ image and help keep their facilities and employees clean, safe and looking their best. With products and services including uniforms, mats, mops, restroom supplies, first aid and safety products, fire extinguishers and testing, and safety training, Cintas helps customers get Ready for the Workday®. The company is also the creator of the Total Clean Program™ - a first-of-its-kind service that includes scheduled delivery of essential cleaning supplies, hygienically clean laundering, and sanitizing and disinfecting projects and services. Cintas was founded in 1968 by Richard T. Farmer, currently the Chairman Emeritus of the Board of Directors, when he left his family's industrial laundry business in order to develop uniform programs using an exclusive new fabric. In the early 1970's, Cintas acquired the family industrial laundry business. Over the years, Cintas developed additional products and services that complemented its core uniform business and broadened the scope of products and services available to its customers.\nBusiness Segments\nCintas’ reportable operating segments are the Uniform Rental and Facility Services operating segment and the First Aid and Safety Services operating segment. The Uniform Rental and Facility Services reportable operating segment consists of the rental and servicing of uniforms and other garments, including flame resistant clothing, mats, mops and shop towels and other ancillary items. In addition to these rental items, restroom cleaning services and supplies and the sale of items from our catalogs to our customers on route are included within this reportable operating segment. The First Aid and Safety Services reportable operating segment consists of first aid and safety products and services. The remainder of Cintas’ business, which consists of the Fire Protection Services operating segment and the Uniform Direct Sale operating segment, is included in All Other.\nThe following table sets forth Cintas' total revenue and the revenue derived from each reportable operating segment and the remaining operating segments included in the All Other category for the fiscal years ended May 31:\nAdditional information regarding each reportable operating segment and All Other is also included in Note 14 entitled Operating Segment Information of \"Notes to Consolidated Financial Statements.\"\nCOVID-19 Pandemic\nIn December 2019, a novel strain of coronavirus (COVID-19) was reported to have surfaced in Wuhan, China, and has since spread globally. In March 2020, the World Health Organization characterized COVID-19 as a pandemic. Efforts to contain the spread of COVID-19 intensified during our fiscal 2020 fourth quarter and have remained in effect throughout our fiscal 2021. Most states and municipalities within the U.S., as well as Canada, enacted temporary closures of businesses, issued quarantine orders and took other restrictive measures in response to the COVID-19 pandemic. Many of the business closures, quarantine orders and other restrictive measures remained in place through fiscal 2021. Within the U.S., our business was designated an essential business, which allowed us to continue to serve customers that remained open. During our fiscal 2021 fourth quarter, the roll out of vaccines, lower COVID-19 case counts and lifting of restrictions on businesses had a positive impact on our business.\nWe have operations throughout the U.S. and Canada and participate in a global supply chain. During most of fiscal 2021, the existence of the COVID-19 pandemic, the fear associated with the COVID-19 pandemic and the reactions of governments around the world in response to the COVID-19 pandemic to regulate the flow of labor and products\nand impede the business of our customers, impacted our ability to conduct normal business operations, which had an adverse effect on our business. Many of Cintas' customers were also impacted by the COVID-19 pandemic, and we saw an impact on some customer's ability to pay timely. While there was minimal disruption to our supply chain, Cintas did increase inventory, primarily personal protective equipment and facility services inventory, in response to the customer needs and demand associated with the safety and cleanliness requirements of COVID-19. The increase in inventory resulted in additional inventory reserves during fiscal 2021 and could result in future inventory reserve increases if demand for personal protective equipment declines. See Note 1 entitled Significant Accounting Policies of \"Notes to Consolidated Financial Statements\" for additional detail on the additional reserve placed on inventory. The impact of the COVID-19 pandemic is fluid and continues to evolve, and therefore, we cannot predict the extent to which our business, consolidated results of operations, consolidated financial condition or liquidity will ultimately be impacted. For more information, see the sections entitled “Management’s Discussion and Analysis of Financial Condition and Results of Operations,” and “Risk Factors” within this Annual Report on Form 10-K.\nCustomers\nWe provide our products and services to over one million businesses of all types, from small service and manufacturing companies to major corporations that employ thousands of people. This diversity in customer base results in no individual customer accounting for greater than one percent of Cintas' total revenue. As a result, the loss of one account would not have a significant financial impact on Cintas.\nCompetition\nThe primary markets served by all Cintas businesses are local in nature and highly fragmented. Cintas competes with national, regional and local providers, large national retailers and small local retailers as well as companies with a significant online presence and the level of competition varies at each of Cintas' local operations. Product, design, price, quality, service and convenience to the customer are the competitive elements in each of our businesses.\nOperations and Distribution\nWithin the Uniform Rental and Facility Services reportable operating segment, Cintas provides its products and services to customers via local delivery routes originating from rental processing plants and branches. Within the First Aid and Safety Services reportable operating segment and All Other, Cintas provides its products and services via its distribution network and local delivery routes or local representatives. At May 31, 2021, Cintas, in total, had approximately 11,000 local delivery routes, 460 operational facilities and 13 distribution centers.\nSourcing\nCintas is committed to sourcing responsibly. Cintas sources finished products from many outside suppliers. As mentioned on our website, www.cintas.com, each and every supplier must comply with a vendor code of conduct as a condition of doing business with Cintas. Cintas also conducts internal training to ensure that employees who have direct responsibility for supply chain management are knowledgeable and aware of issues and concerns surrounding our supply chain. In addition to sourcing from third-party suppliers, Cintas operates five manufacturing facilities that provide for standard uniform needs. Cintas purchases fabric, used in the manufacturing of its products, from several suppliers. Cintas is not aware of any circumstances that would hinder its ability to continue obtaining these materials.\nGovernment Laws and Regulations\nCintas is subject to a wide array of laws, government regulations, including environmental regulations, and standards in each domestic and foreign jurisdiction in which it operates. In addition to Cintas’s U.S. operations, which in fiscal 2021 generated over 90% of its consolidated net sales, Cintas also operates its business through wholly-owned subsidiaries in foreign jurisdictions, primarily in Canada. Compliance with these laws, government regulations, including environmental regulations, and standards requires the dedication of time and effort of employees as well as financial resources.\nCompliance with environmental regulations and prioritizing our environmental sustainability efforts are important to us as a good corporate citizen. Our journey started in 1929 during the Great Depression when Doc and Amelia Farmer collected shop towels that had been disposed of by manufacturing facilities along the Ohio River. They washed, recycled and sold the clean towels back to companies. Today, the majority of our total Company revenue comes from our Uniform Rental and Facility Services reportable operating segment. Most of these items are cleaned and processed in ways that extend their lifespan and, when not in use, are re-stocked for future customers to maximize their lifespan. Our laundering processes generate far less wastewater than home laundering. Water\ndischarged into the environment is treated at our operating facilities and in accordance with local discharge standards and permits. Our lasting commitment to the environment and our communities is evident from our processes and innovation, which are designed to ensure that our operational facilities are operating efficiently. Cintas is subject to various environmental laws and regulations, as are other companies in the uniform rental industry. The primary federal statutes that apply to our activities in the U.S. are the Clean Air Act, the Clean Water Act and the Resource Conservation and Recovery Act. We are also subject to the Superfund Amendments and Reauthorization Act of 1986, which imposes certain reporting requirements as to emissions of hazardous substances into the air, land and water. While environmental compliance is not a material component of our costs, Cintas makes capital expenditures and associated operating costs, primarily for water treatment and waste removal, on a regular basis in order to comply with environmental laws and regulations, to promote employee safety and to carry out its environmental sustainability principles. Environmental spending related to water treatment and waste removal was approximately $19.0 million in fiscal 2021, approximately $20.0 million in fiscal 2020 and approximately $21.0 million in fiscal 2019. Capital expenditures to limit or monitor hazardous substances totaled approximately $1.0 million in fiscal 2021, approximately $3.0 million in fiscal 2020 and approximately $10.0 million in fiscal 2019.\nIn addition, health and safety regulations (including laws or regulations promulgated in response to the ongoing COVID-19 pandemic) have necessitated, and may continue to necessitate, increased operating costs or capital investments to promote a safe working environment. Cintas is also required to comply with increasingly complex and changing laws and regulations enacted to protect business and personal data in the U.S. and other jurisdictions regarding privacy, data protection and data security, including those related to the collection, storage, use, transmission and protection of personal information and other consumer, customer, vendor or employee data. With respect to the laws and regulations noted above, as well as other applicable laws and regulations, Cintas’s compliance programs may under certain circumstances involve material investments in the form of additional processes, training, personnel, information technology and capital. In fiscal 2021, compliance with the applicable laws, government regulations, including environmental regulations, and standards did not have a material effect on Cintas’s capital expenditures or consolidated results of operations. For a discussion of the risks associated with government regulations that may materially impact Cintas, please see “Item 1A: Risk Factors-Legal and Regulatory Risks.”\nCommunication\nCintas uses its corporate website, www.cintas.com, as a channel for routine distribution of important information, including news releases, analyst presentations and financial information. This year, Cintas produced an expanded Environmental, Social and Governance (ESG) Report to share our focus on making a positive impact through our key ESG priorities. This included work in areas of safety and health, energy and emissions, water usage, sustainable supply chain, and governance, ethics and integrity to support diversity and equality, assisting our employee-partners in need and giving back to the communities where we live and work. Particularly during unprecedented times and issues as a result of the COVID-19 pandemic, Cintas responded with improved policies, cleaning regimens and sanitizing products and services to help keep our employee-partners, and in turn, our customers, safer. We are also READY™ to help as many of our customers fully reopen their businesses.\nCintas files with or furnishes to the Securities and Exchange Commission (SEC) Annual Reports on Form 10-K, Quarterly Reports on Form 10-Q, Current Reports on Form 8-K and any amendments to those reports, as well as proxy statements and annual reports to shareholders, and, from time to time, other documents. The reports and other documents filed with or furnished to the SEC are available to investors on or through our corporate website free of charge as soon as reasonably practicable after we electronically file them with or furnish them to the SEC. The SEC maintains an internet site located at www.sec.gov that contains reports, proxy and information statements and other information regarding issuers, such as Cintas, that file electronically with the SEC. Cintas' SEC filings can be found on the Investors page of its website at www.cintas.com/investors/financials.aspx and its Code of Conduct and Business Ethics can be found on the About Us page of its website at www.cintas.com/company. These documents are available in print to any shareholder who requests a copy by writing or calling Cintas as set forth on the Investor Information page. The content on any website referred to in this Annual Report on Form 10-K is not incorporated by reference into this Form 10-K unless expressly noted.\nHuman Capital\nCintas’ key human capital management objectives are to attract, retain and develop talent to deliver on the Company’s strategy. To support these objectives, Cintas’ human resources programs are designed to: keep people safe and healthy; enhance the Company’s culture through efforts aimed at making the workplace more inclusive; acquire and retain diverse talent; reward and support employee-partners through competitive pay and benefit programs; develop talent to prepare them for critical roles and leadership positions; and facilitate internal talent mobility to create a high-performing workforce. The principles and values our employee-partners share are the driving force behind all our accomplishments. At May 31, 2021, Cintas employed approximately 40,000 employee-partners in our global workforce, of which approximately 1,000 were represented by labor unions.\nOur primary areas of focus in managing our human capital include the following:\nCorporate Culture\nWe believe that our culture at Cintas is just as essential as our products and services. Our culture impacts the quality of the employee-partners we hire, the way we communicate and interact with our customers and each other and our performance standards. Our culture is the cornerstone representing our values, our behaviors, our way of working and how we approach our business, which is strong relationships and a dedication to taking care of one another and our customers. We operate according to the Cintas Code of Conduct, available on our website www.cintas.com, which mandates full compliance with applicable laws and regulations and helps to preserve the integrity of our Company.\nHealth and Safety\nWe aspire to achieve zero workplace injuries and provide a safe, open and accountable work environment for our employee-partners. To enforce internationally recognized standards, we have implemented an occupational health and safety management system in accordance with the Occupational Safety and Health Administration (OSHA). Employee-partners, contractors, vendors and visitors are all covered by the system, which focuses on hazard prevention, training, management commitment and worker involvement. We are also committed to continuously improving performance through our Safety Improvement Committees in every operation, while corporate safety and health employee-partners conduct annual reviews of our operations. Additionally, every year our employee-partners receive online, on-the-job and classroom training on over 30 safety topics, and all maintenance staff must complete the Maintenance Safety Certification. Every Cintas driver completes monthly driver safety training courses or on-the-road skills evaluations. Every manager attends OSHA’s 10-hour Safety Improvement course, and each member of our Senior Management team takes the Management and Leadership Skills for Environmental Health and Safety Professionals Course, part of the Harvard T.H Chan School of Public Health safety and health curriculum. In addition, we provide several channels for all employee-partners to speak up, ask for guidance and report concerns related to ethics or safety violations, and we address those concerns and take appropriate actions to uphold our Cintas values and safety culture. Through these efforts, Cintas has reduced our recordable injury rate by over 70% since 2008, has been awarded 118 OSHA Star sites in the Voluntary Protection Program (VPP), which is more than double any other company in the U.S. and have received numerous safety, health and ergonomics awards from national and international groups.\nEmployee-Partner Wellness\nWe are committed to the health and wellness of our employee-partners. We provide our employee-partners and their families with access to a variety of health and wellness programs, including our long-running Live Well program that supports employee-partners on their health and wellness journeys. We provide free annual biometric screening and health assessments at work or offsite, annual free flu shot clinics onsite or offsite, a tobacco cessation program, weight management programs and an employee-partner assistance program, which offers advice on mental health, legal and financial issues.\nIn response to the COVID-19 pandemic, we utilized our Preparedness Plan and implemented controls that we consider to be in the best interest of our employee-partners and the communities in which we operate, and which comply with government regulations. Some of the controls implemented in response to the COVID-19 pandemic, include physical barriers, social distancing, remote-working where possible, travel restrictions, appropriate personal protective equipment and additional hygiene and cleaning regimes. Keeping people safe remains our top priority, and the diligence and flexibility of our employee-partners in complying with these new controls has allowed us to continue to focus on providing essential products and services to our customers, ranging from cleaning supplies, disinfectant services, hand sanitizer, scrubs, face masks and face shields.\nDiversity & Inclusion\nCintas supports diversity and inclusion by fostering a respectful, creative and productive environment where all employee-partners can reach their full potential without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability or protected veteran status. We actively recruit, retain, develop and advance a diverse and talented workforce. We have four Employee-Partner Business Resource Groups, focused on Women, African Americans, Hispanic and Latin Americans, and Military and Veteran employee-partners. These groups provide platforms for our employee-partners to showcase skills, experiences and perspectives. The Employee-Partner Business Resource Groups also help foster inclusion among all employee-partners to build awareness, recruit and retain a diverse workforce and support the overall success of Cintas. We also have a Management Trainee program that helps Cintas find the best talent for our leadership pipeline, and we monitor representation across management positions. Cintas’ diversity and inclusion efforts are led by our Chief Diversity Officer. This position regularly reports to our Chief Executive Officer and works to help achieve our goals and obtain a diverse and talented workforce, which is critical to our success.\nCompensation Programs and Employee Benefits\nOur compensation and benefits programs provide a total rewards package designed to attract, retain and motivate our employee-partners. In addition to competitive base salaries, the total rewards package (which may vary by position and country) includes, among other items, bonuses, long-term incentives, retirement savings plans, medical insurance, prescription drug benefits, dental insurance, vision insurance, accident and critical illness insurance, life and disability insurance, health savings accounts, flexible spending accounts and an employee-partner assistance program.\nTalent Development\nCintas is committed to the continued development of its employee-partners. We provide numerous training opportunities for our employee-partners, with a focus on continuous learning and development and methodologies to manage performance, provide feedback and develop talent. We offer a wide array of training solutions (classroom, hands-on and e-learning) for our employee-partners. Our talent development programs strive to provide employee-partners resources to achieve career goals and build management and leadership skills. We offer mentoring programs, a management trainee program and executive leadership programs to support the professional growth of our employee-partners and ensure we have the right succession plans in place.",
    "item_1A": "Item 1A. Risk Factors\nThe statements in this section describe the most significant risks that could materially and adversely affect our business, consolidated financial condition and consolidated results of operation and the trading price of our debt or equity securities. Although the risks are organized by headings, and each risk is discussed separately, many are interrelated.\nIn addition, this section sets forth statements which constitute our cautionary statements under the Private Securities Litigation Reform Act of 1995.\nThis Annual Report on Form 10-K contains forward-looking statements. The Private Securities Litigation Reform Act of 1995 provides a safe harbor from civil litigation for forward-looking statements. Forward-looking statements may be identified by words such as “estimates,” “anticipates,” “predicts,” “projects,” “plans,” “expects,” “intends,” “target,” “forecast,” “believes,” “seeks,” “could,” “should,” “may” and “will” or the negative versions thereof and similar words, terms and expressions and by the context in which they are used. Such statements are based upon current expectations of Cintas and speak only as of the date made. You should not place undue reliance on any forward-looking statement. We cannot guarantee that any forward-looking statement will be realized. These statements are subject to various risks, uncertainties, potentially inaccurate assumptions and other factors that could cause actual results to differ from those set forth in or implied by this Annual Report. Factors that might cause such a difference include, but are not limited to, the possibility of greater than anticipated operating costs including energy and fuel costs; lower sales volumes; loss of customers due to outsourcing trends; the performance and costs of integration of acquisitions; fluctuations in costs of materials and labor including increased medical costs; costs and possible effects of union organizing activities; failure to comply with government regulations concerning employment discrimination, employee pay and benefits and employee health and safety; the effect on operations of exchange rate fluctuations, tariffs and other political, economic and regulatory risks; uncertainties regarding any existing or newly-discovered expenses and liabilities related to environmental compliance and remediation; the cost, results and ongoing assessment of internal controls for financial reporting; the effect of new accounting pronouncements; disruptions caused by the inaccessibility of computer systems data, including cybersecurity risks; the initiation or outcome of litigation, investigations or other proceedings; higher assumed sourcing or distribution costs of products; the disruption of operations from catastrophic or extraordinary events including viral pandemics such as the COVID-19 coronavirus; the amount and timing of repurchases of our common stock, if any; changes in federal and state tax and labor laws; and the reactions of competitors in terms of price and service. Cintas undertakes no obligation to publicly release any revisions to any forward-looking statements or to otherwise update any forward-looking statements whether as a result of new information or to reflect events, circumstances or any other unanticipated developments arising after the date on which such statements are made, except otherwise as required by law. The risks and uncertainties described herein are not the only ones we may face. Additional risks and uncertainties presently not known to us or that we currently believe to be immaterial may also harm our business. Investors should not interpret the disclosure of any risk factor to imply that the risk has not already materialized.\nRisks Relating to Business Strategy & Operations\nNegative global economic factors, including the COVID-19 pandemic, may adversely affect our financial performance.\nNegative economic conditions, in North America and our other markets, may adversely affect our financial performance. Higher levels of unemployment, inflation, tax rates and other changes in tax laws and other economic factors could adversely affect the demand for Cintas’ products and services. Increases in labor costs, including the cost to provide employee-partner related healthcare benefits, minimum wages, labor shortages or shortages of skilled labor, regulations regarding the classification of employees and/or their eligibility for overtime wages, higher material costs for items such as fabrics and textiles, the inability to obtain insurance coverage at cost-effective rates, higher interest rates, inflation, higher tax rates and other changes in tax laws and other economic factors could increase our costs of rental uniforms and facility services, cost of other services and selling and administrative expenses. As a result, these factors could adversely affect our sales and consolidated results of operations.\nThe COVID-19 pandemic has created widespread disruption in the global economy and has had, and could continue to have, an adverse impact on our consolidated results of operations and financial performance, as well as on the results of operations and financial performance of many of the customers and suppliers in industries that we serve and operate. The duration of the pandemic itself and the market and workplace disruptions it has caused, including disruptions imposed by federal, state and local actions, as well as the potential for new government\nregulations, and the long-term effects on the economy and our customers are uncertain and as yet unknowable. These factors, as they become more certain, could adversely affect our workforce, sales and overall business. Furthermore, the ultimate impact of the COVID-19 pandemic on our consolidated results of operations and financial performance depends on many factors that are not within our control, including, but not limited to: governmental, business and individuals’ actions that have been and continue to be taken in response to the pandemic; the impact of the pandemic and actions taken in response on global and regional economies; the availability of federal, state or local funding programs; general economic uncertainty in key financial markets and financial market volatility; global economic conditions and levels of economic growth; and the pace of recovery when the COVID-19 pandemic subsides. We are unable to predict the extent to which the pandemic and related impacts will continue to adversely impact our business operations, financial performance, consolidated results of operations, consolidated financial position and the achievement of our strategic objectives.\nIncreased competition could adversely affect our financial performance.\nWe operate in highly competitive industries and compete with national, regional and local providers. Product, design, price, quality, service and convenience to the customer are the competitive elements in these industries. If existing or future competitors seek to gain or retain market share by reducing prices, Cintas may be required to lower prices, which would hurt its results of operations. Cintas' competitors also generally compete with Cintas for acquisition candidates, which can increase the price for acquisitions and reduce the number of available acquisition candidates. In addition, our customers and prospects may decide to perform certain services in-house instead of outsourcing these services to us. These competitive pressures could adversely affect our sales and consolidated results of operations.\nAn inability to open new, cost effective operating facilities may adversely affect our expansion efforts.\nWe plan to expand our presence in existing markets and enter new markets. The opening of new operating facilities is necessary to gain the capacity required for this expansion. Our ability to open new operating facilities depends on our ability to identify attractive locations, negotiate leases or real estate purchase agreements on acceptable terms, identify and obtain adequate utility and water sources and comply with environmental regulations, zoning laws and other similar factors. Any inability to effectively identify and manage these items may adversely affect our expansion efforts, and, consequently, adversely affect our financial performance.\nRisks associated with our acquisition practice could adversely affect our consolidated results of operations.\nHistorically, a portion of our growth has come from acquisitions. We continue to evaluate opportunities for acquiring businesses that may supplement our internal growth. However, there can be no assurance that we will be able to locate and purchase suitable acquisitions. In addition, the success of any acquisition, including the ability to realize anticipated cost synergies, depends in part on our ability to integrate the acquired company. The process of integrating acquired businesses may involve unforeseen difficulties and may require a disproportionate amount of our management's attention and our financial and other resources. If management is not able to effectively manage the integration process, or if any significant business activities are interrupted as a result of the integration process, we may not be able to realize anticipated cost synergies resulting from acquisitions and our business could suffer. Although we conduct due diligence investigations prior to each acquisition, there can be no assurance that we will discover or adequately protect against all material liabilities of an acquired business for which we may be responsible as a successor owner or operator. The failure to identify suitable acquisitions and successfully integrate these acquired businesses, or to discover liabilities associated with such businesses in the diligence process, could adversely affect our consolidated results of operations.\nRisks associated with the suppliers from whom our products are sourced could adversely affect our consolidated results of operations.\nThe products we sell are sourced from a wide variety of domestic and international suppliers. Global sourcing of many of the products we sell is an important factor in our financial performance. We require all our suppliers to comply with applicable laws, including labor and environmental laws, and otherwise be certified as meeting our required supplier standards of conduct. Our ability to find qualified suppliers who meet our standards, and to access products in a timely and efficient manner is a significant challenge, especially with respect to suppliers located and goods sourced outside the U.S. Political and economic stability in the countries in which foreign suppliers are located, the financial stability of suppliers, suppliers' failure to meet our supplier standards, labor problems experienced by our suppliers, the availability of raw materials to suppliers, currency exchange rates, transport availability and cost, inflation and other factors relating to the suppliers and the countries in which they are located are beyond our control. In addition, U.S. and foreign trade policies, tariffs and other impositions on imported goods,\ntrade sanctions imposed on certain countries, the limitation on the importation of certain types of goods or of goods containing certain materials from other countries and other factors relating to foreign trade are beyond our control. These and other factors, including the potential negative impact of viral pandemics such as COVID-19 affecting our suppliers and our access to products could adversely affect our consolidated results of operations.\nWe rely extensively on computer systems, including third-party systems, to process transactions, maintain information and manage our businesses. Disruptions in the availability of computer systems due to implementation of a new system or otherwise, or privacy breaches involving computer systems, could impact our ability to service our customers and adversely affect our sales, consolidated results of operations and reputation and expose us to litigation risk.\nOur businesses rely on various computer systems, including third-party systems, to provide customer information, process customer transactions and provide other general information necessary to manage our businesses. We have an active disaster recovery plan in place that is frequently reviewed and tested. However, our computer systems are subject to damage or interruption due to power outages, computer or telecommunication failures, catastrophic events such as fires, tornadoes and hurricanes and usage errors by our employees. Although we believe that we have adopted appropriate measures to mitigate potential risks to our technology and our operations from these information technology-related and other potential disruptions, given the unpredictability of the timing, nature and scope of such disruptions, we could potentially be subject to production downtimes, operational delays and interruptions in our ability to provide products and services to our customers. Any disruption caused by the unavailability of our computer systems could adversely affect our sales, could require us to make a significant investment to fix or replace them and, therefore, could adversely affect our consolidated results of operations. In addition, cyber-security attacks are evolving and include, but are not limited to, malicious software, attempts to gain unauthorized access to data and other electronic security breaches that could lead to disruptions in systems, unauthorized release of confidential or otherwise protected information and corruption of data. We have experienced cybersecurity incidents in the past, but none of these incidents, individually or in the aggregate, have had a material adverse effect on our business or results of operations. If the network of security controls, policy enforcement mechanisms and monitoring systems to address these threats to our technology fails, or we are unable to successfully address security incidents, production downtimes, operational delays and interruptions in our ability to provide products and services to our customers, the compromising of confidential or otherwise protected Company, customer, or employee information, destruction or corruption of data, security breaches, or other manipulation or improper use of our systems and networks could result in financial losses from remedial actions, loss of business or potential liability and damage to our reputation.\nWe also rely on software applications, enterprise cloud storage systems and cloud computing services provided by third-party vendors for certain information technology services, including our SAP enterprise system, payroll data, risk management data and lease data. If these third-party vendors, as well as our suppliers and other vendors, experience service interruptions or damage, security breaches, cyber-attacks, computer viruses, ransomware or other similar events or intrusions, our business and our consolidated results of operations may be adversely affected.\nFailure to achieve and maintain effective internal controls could adversely affect our business and stock price.\nEffective internal controls are necessary for us to provide reliable financial reports. All internal control systems, no matter how well designed, have inherent limitations. Therefore, even those systems determined to be effective can provide only reasonable assurance with respect to the consolidated financial statement preparation and presentation. While we continue to evaluate our internal controls, we cannot be certain that these measures will ensure that we implement and maintain adequate controls over our financial processes and reporting in the future. If we fail to maintain the adequacy of our internal controls or if we or our independent registered public accounting firm were to discover material weaknesses in our internal controls, as such standards are modified, supplemented or amended, we may not be able to ensure that we can conclude on an ongoing basis that we have effective internal control over financial reporting in accordance with Section 404 of the Sarbanes-Oxley Act of 2002. Failure to achieve and maintain an effective internal control environment could cause us to be unable to produce reliable financial reports or prevent fraud. This may cause investors to lose confidence in our reported financial information, which could have a material adverse effect on our stock price.\nWe may experience difficulties in attracting and retaining competent personnel in key positions. Failure to preserve positive labor relationships with our employees could adversely affect our consolidated results of operations.\nWe believe that a key component of our success is our corporate culture, which has been imparted by management throughout our corporate organization. Our corporate culture, along with our entire operation, depends on our ability to attract, develop and retain key employees. Competitive pressures within and outside our industry may make it more difficult and expensive for us to attract and retain key employees which could adversely affect our businesses.\nWe believe we have positive labor relationships with our employees. However, factors such as difficulty to attract key employees, reduced employee engagement, third-party organizational efforts and increased employee turnover could adversely affect our labor relationships with our employees. A failure to preserve positive labor relationships with our employees and could adversely affect our consolidated financial condition and consolidated results of operations.\nUnexpected events could negatively impact our operations and adversely affect our consolidated results of operations.\nUnexpected events, including fires or explosions at facilities, severe weather conditions, natural disasters such as hurricanes and tornadoes, war or terrorist activities, unplanned outages, viral pandemics such as COVID-19, supply disruptions, failure of equipment or systems or changes in laws and/or regulations impacting our businesses, could adversely affect our consolidated results of operations. These events could result in customer disruption, physical damage to one or more key operating facilities, the temporary closure of one or more key operating facilities or the temporary disruption of information systems. In addition, negative publicity, whether warranted or not, impacting brand image perception could adversely affect our consolidated results of operations.\nFinancial Risks\nOur indebtedness may limit cash flow available to invest in the ongoing needs of our business.\nOur outstanding indebtedness may have negative consequences on our business, such as requiring us to dedicate a substantial portion of our cash flow from operations to the payment of debt service, reducing the availability of our cash flow to fund working capital, capital expenditures, acquisitions, dividend increases, stock buybacks and other general corporate purposes, as well as increase our vulnerability to adverse economic or industry conditions. In addition, it may limit our ability to obtain additional financing in the future to enable us to react to changes in our business or industry or place us at a competitive disadvantage compared to businesses in our industry that have less debt.\nChanges in the fuel and energy industry could adversely affect our consolidated financial condition and consolidated results of operations.\nThe price of fuel and energy needed to run our vehicles and equipment is unpredictable and fluctuates based on events outside our control, including geopolitical developments, supply and demand for fuel and other energy related products, actions by energy producers, war and unrest in oil producing countries, regional production patterns, limits on refining capacities, natural disasters, environmental concerns and viral pandemics such as COVID-19. Increases in fuel and energy costs could adversely affect our consolidated financial condition and consolidated results of operations.\nFluctuations in foreign currency exchange could adversely affect our consolidated financial condition and consolidated results of operations.\nWe earn revenue, pay expenses, own assets and incur liabilities in countries using currencies other than the U.S. dollar, primarily the Canadian dollar. In fiscal years 2021, 2020 and 2019, revenue denominated in currencies other than the U.S. dollar represented less than 10% of our consolidated revenue. Because our consolidated financial statements are presented in U.S. dollars, we must translate revenue and expenses, as well as assets and liabilities, into U.S. dollars at exchange rates in effect during or at the end of each reporting period. Therefore, fluctuations in the value of the U.S. dollar against other major currencies, particularly in the event of significant increases in foreign currency revenue, will impact our revenue and operating income and the value of balance sheet items denominated in foreign currencies. This impact could adversely affect our consolidated financial condition and consolidated results of operations.\nWe may recognize impairment charges, which could adversely affect our consolidated financial condition and consolidated results of operations.\nWe assess our goodwill and other intangible assets and our long-lived assets for impairment when required by U.S. Generally Accepted Accounting Principles (U.S. GAAP). These accounting principles require that we record an impairment charge if circumstances indicate that the asset carrying values exceed their estimated fair values. The estimated fair value of these assets is impacted by, but not limited to, macroeconomic, industry and market conditions in the locations in which we operate. Deterioration in these general economic conditions may result in: declining revenue, which can lead to excess capacity and declining operating cash flow; reductions in management's estimates for future revenue and operating cash flow growth; increases in borrowing rates and other deterioration in factors that impact our weighted average cost of capital; and deteriorating real estate values. If our assessment of goodwill, other intangible assets or long-lived assets indicates an impairment of the carrying value for which we recognize an impairment charge, this may adversely affect our consolidated financial condition and consolidated results of operations.\nThe effects of credit market volatility and changes in our credit ratings could adversely affect our liquidity and consolidated results of operations.\nOur operating cash flows, combined with access to the credit markets, provide us with significant discretionary funding capacity. However, deterioration in the global credit markets may limit our ability to access credit markets, which could adversely affect our liquidity and/or increase our cost of borrowing. In addition, credit market deterioration and its actual or perceived effects on our results of operations and financial condition, along with deterioration in general economic conditions, may increase the likelihood that the major independent credit agencies will downgrade our credit ratings, which could increase our cost of borrowing. Increases in our cost of borrowing could adversely affect our consolidated results of operations.\nLegal and Regulatory Risks\nFailure to comply with federal and state regulations to which we are subject could result in penalties or costs that could adversely affect our consolidated results of operations.\nOur business is subject to complex and stringent state and federal regulations, including employment laws and regulations, minimum wage requirements, overtime requirements, working condition requirements, citizenship requirements, transportation and other laws and regulations. In particular, we are subject to the regulations promulgated by the U.S. Department of Transportation (USDOT) and under the Occupational Safety and Health Act of 1970, as amended (OSHA Act). We have incurred, and will continue to incur, capital and operating expenditures and other costs in the ordinary course of our business in complying with the USDOT regulations, the OSHA Act and other laws and regulations to which we are subject. Changes in laws, regulations and the related interpretations, including any laws or regulations that may be enacted by the current U.S. presidential administration and Congress, may alter the landscape in which we do business and may affect our costs of doing business. The impact of new laws and regulations cannot be predicted. Compliance with new laws and regulations may increase our operating costs or require significant capital expenditures. Any failure to comply with applicable laws or regulations could result in substantial fines by government authorities, payment of damages to private litigants, or possible revocation of our authority to conduct our operations, which could adversely affect our ability to service customers and our consolidated results of operations.\nWe are subject to legal proceedings that may adversely affect our consolidated financial condition and consolidated results of operations.\nWe are subject to various litigation claims and legal proceeding arising from the ordinary course of our business, including personal injury, customer contract, environmental and employment claims. Certain of these lawsuits or potential future lawsuits, if decided adversely to us or settled by us, may result in liability and expense material to our consolidated financial condition and consolidated results of operations.\nCompliance with environmental laws and regulations could result in significant costs that adversely affect our consolidated results of operations.\nOur operating locations are subject to environmental laws and regulations relating to the protection of the environment and health and safety matters, including those governing discharges of pollutants to the air and water, the management and disposal of hazardous substances and wastes and the clean-up of contaminated sites. The operation of our businesses entails risks under environmental laws and regulations. We could incur significant costs, including clean-up costs, fines and sanctions and claims by third parties for property damage and personal\ninjury, as a result of violations of or liabilities under these laws and regulations. We are currently involved in a limited number of remedial investigations and actions at various locations. While based on information currently known to us, we believe that we maintain adequate reserves with respect to these matters, our liability could exceed forecasted amounts, and the imposition of additional clean-up obligations or the discovery of additional contamination at these or other sites could result in significant additional costs which could adversely affect our results of operations. In addition, potentially significant expenditures could be required to comply with environmental laws and regulations, including requirements that may be adopted or imposed in the future.\nUnder applicable environmental laws, an owner or operator of real estate may be required to pay the costs of removing or remediating hazardous materials located on or emanating from property, whether or not the owner or operator knew of or was responsible for the presence of such hazardous materials. While we regularly engage in environmental due diligence in connection with acquisitions, we can give no assurance that locations that have been acquired or leased have been operated in compliance with environmental laws and regulations during prior periods or that future uses or conditions will not make us liable under these laws or expose us to third-party actions, including tort suits.\nIncreases in income tax rates, changes in income tax laws or unfavorable resolution of tax matters could adversely impact our financial results.\nChanges in tax laws or regulations in the jurisdictions in which we do business, or other tax law implementations or interpretations, could increase our effective tax rate, restrict our ability to repatriate undistributed offshore earnings, or impose new restrictions, costs or prohibitions on our current practices and reduce our net income and adversely affect our cash flows.\nWe are also subject to tax audits, including with respect to transfer pricing, in the U.S. and other jurisdictions and our tax positions may be challenged by tax authorities. Although we believe that our current tax provisions are reasonable and appropriate, there can be no assurance that these items will be settled for the amounts accrued, that additional tax exposures will not be identified in the future or that additional tax reserves will not be necessary for any such exposures. Any increase in the amount of taxation incurred as a result of challenges to our tax filing positions could result in a material adverse effect on our business, consolidated results of operations and consolidated financial condition.",
    "item_1B": "Item 1B. Unresolved Staff Comments\nNone.",
    "item_1C": "",
    "item_2": "Item 2. Properties\nCintas occupies 473 facilities located in 329 cities. Cintas leases 242 of these facilities for various terms ranging from monthly to the year 2032. Cintas expects that it will be able to renew or replace its leases on satisfactory terms. Of the five manufacturing facilities noted below, all but one are owned by Cintas. The principal executive office in Cincinnati, Ohio, provides centrally located administrative functions including accounting, finance, marketing and computer system development and support. Cintas operates rental processing plants that house administrative, sales and service personnel and the necessary equipment involved in the cleaning of uniforms and bulk items, such as entrance mats and shop towels. Branch operations provide administrative, sales and service functions. Cintas operates 13 distribution centers and five manufacturing facilities. Cintas also operates first aid and safety and fire protection facilities and direct sales offices. Cintas considers the facilities it operates to be adequate for their intended use. Cintas owns or leases approximately 20,300 vehicles which are used for the route-based services and by the sales and management employee-partners.\nThe following chart provides additional information concerning Cintas' facilities:\n(1) Includes the principal executive office, which is attached to the distribution center in Cincinnati, Ohio.\nCertain facilities are utilized by multiple operating segments. These facilities are only presented once, in their primary operating segment, herein. Rental processing plants, rental branches, distribution centers and manufacturing facilities are used in Cintas' Uniform Rental and Facility Services reportable operating segment. First aid and safety facilities, rental processing plants and distribution centers are used in the First Aid and Safety Services reportable operating segment. Rental processing plants, rental branches, first aid and safety facilities, fire protection facilities, direct sales offices, distribution centers and manufacturing facilities are all utilized by the operating segments included in All Other.",
    "item_3": "Item 3. Legal Proceedings\nCintas is subject to legal proceedings, insurance receipts, legal settlements and claims arising from the ordinary course of its business, including personal injury, customer contract, environmental and employment claims. In the opinion of management, the aggregate liability, if any, with respect to such ordinary course of business actions will not have a material adverse effect on the consolidated financial position, consolidated results of operations or consolidated cash flows of Cintas.\nThe Company, the Board of Directors, Scott Farmer (Executive Chairman) and the Investment Policy Committee are defendants in a purported class action, filed on December 13, 2019, pending in the U.S. District Court for the Southern District of Ohio alleging violations of The Employee Retirement Income Security Act of 1974 (ERISA). The lawsuit asserts that the defendants improperly managed the costs of the employee retirement plan, breached their fiduciary duties in failing to investigate and select lower cost alternative funds and failed to monitor and control the employee retirement plan’s recordkeeping costs. The defendants deny liability.",
    "item_4": "Item 4. Mine Safety Disclosures\nNot applicable.\nPart II",
    "item_5": "Item 5. Market for Registrant's Common Equity,\nRelated Stockholder Matters and Issuer Purchases of Equity Securities\nMarket and Shareholder Information\nCintas' common stock is traded on the NASDAQ Global Select Market under the symbol \"CTAS.\" At May 31, 2021, there were approximately 1,400 shareholders of record of Cintas' common stock. Cintas believes that this represents approximately 240,000 beneficial owners.\nDividends\nDividends on Cintas' outstanding common stock have historically been paid annually. In fiscal 2021, however, Cintas' Board of Directors approved a change in dividend policy from an annual dividend to quarterly dividends. Our Board of Directors declared the following dividends during the fiscal years ended May 31:\n(1) The dividend declared on April 13, 2021 was included in current accrued liabilities on the consolidated balance sheet at May 31, 2021.\nStock Performance Graph\nThe following graph summarizes the cumulative return on $100 invested in Cintas' common stock, the S&P 500 Stock Index and the common stocks of a selected peer group of companies. Because our products and services are diverse, Cintas does not believe that any single published industry index is appropriate for comparing shareholder return. Therefore, the peer group used in the performance graph combines publicly traded companies in the business services industry that have similar characteristics as Cintas for each fiscal year, such as route based delivery of products and services. The companies included in the Peer Group are ABM Industries, Aramark, Rollins, Inc. and UniFirst Corporation.\nTotal shareholder return was based on the increase in the price of the common stock and assumed reinvestment of all dividends. Furthermore, total return was weighted according to market capitalization of each company. The companies in the Peer Group are not the same as those considered by the Compensation Committee of the Board of Directors.\nTotal Shareholder Returns\nComparison of Five-Year Cumulative Total Return\nPurchases of Equity Securities by the Issuer and Affiliated Purchases\n(1) On October 29, 2019, Cintas announced that the Board of Directors authorized a $1.0 billion share buyback program, which does not have an expiration date. From the inception of the October 29, 2019 share buyback program through May 31, 2021, Cintas has purchased a total of 1.2 million shares of Cintas common stock at an average price of $350.31 per share for a total purchase price of $418.8 million.\n(2) During March 2021, Cintas acquired 133 shares of Cintas common stock in satisfaction of employee payroll taxes due on restricted stock awards that vested during the fiscal year. These shares were purchased at an average price of $341.20 per share for a total purchase price of less than $0.1 million.\n(3) During April 2021, Cintas acquired 4,907 shares of Cintas common stock in satisfaction of employee payroll taxes due on restricted stock awards that vested during the fiscal year. These shares were purchased at an average price of $348.32 per share for a total purchase price of $1.7 million.\n(4) During May 2021, Cintas acquired 335 shares of Cintas common stock in satisfaction of employee payroll taxes due on restricted stock awards that vested during the fiscal year. These shares were purchased at an average price of $355.17 per share for a total purchase price of $0.1 million.",
    "item_6": "Item 6. Selected Financial Data\n[Reserved.]",
    "item_7": "Item 7. Management's Discussion and\nAnalysis of Financial Condition and Results of Operations\nBusiness Strategy\nCintas helps more than one million businesses of all types and sizes, primarily in the U.S., as well as Canada and Latin America, get READY™ to open their doors with confidence every day by providing a wide range of products and services that enhance our customers’ image and help keep their facilities and employees clean, safe and looking their best. With products and services including uniforms, mats, mops, restroom supplies, first aid and safety products, fire extinguishers and testing, and safety training, Cintas helps customers get Ready for the Workday®. Cintas is also the creator of the Total Clean Program™ - a first-of-its-kind service that includes scheduled delivery of essential cleaning supplies, hygienically clean laundering, and sanitizing and disinfecting projects and services.\nWe are North America's leading provider of corporate identity uniforms through rental and sales programs, as well as a significant provider of related business services, including entrance mats, restroom cleaning services and supplies, first aid and safety services and fire protection products and services.\nCintas' principal objective is \"to exceed customers' expectations in order to maximize the long-term value of Cintas for shareholders and working partners,\" and it provides the framework and focus for Cintas' business strategy. This strategy is to achieve revenue growth for all our products and services by increasing our penetration at existing customers and by broadening our customer base to include market segments to which we have not historically served. We will also continue to identify additional product and service opportunities for our current and future customers.\nTo pursue the strategy of increasing penetration, we have a highly talented and diverse team of service professionals visiting our customers on a regular basis. This frequent contact with our customers enables us to develop close personal relationships. The combination of our distribution system and these strong customer relationships provides a platform from which we launch additional products and services.\nWe pursue the strategy of broadening our customer base in several ways. Cintas has a national sales organization introducing all its products and services to prospects in all market segments. Our broad range of products and services allows our sales organization to consider any type of business a prospect. We also broaden our customer base through geographic expansion. Finally, we evaluate strategic acquisitions as opportunities arise.\nResults of Operations\nThis Management’s Discussion and Analysis of Financial Condition and Results of Operations focuses on discussion of fiscal 2021 results compared to fiscal 2020 results. For discussion of fiscal 2020 results compared to fiscal 2019 results, see the \"Management’s Discussion and Analysis of Financial Condition and Results of Operations” within our Annual Report on Form 10-K for the fiscal year ended May 31, 2020, filed with the SEC on July 29, 2020.\nCintas classifies its business into two reportable operating segments and places the remainder of its operating segments in an All Other category. Cintas’ two reportable operating segments are Uniform Rental and Facility Services and First Aid and Safety Services. The Uniform Rental and Facility Services reportable operating segment consists of the rental and servicing of uniforms and other garments including flame resistant clothing, mats, mops and shop towels and other ancillary items. In addition to these rental items, restroom cleaning services and supplies and the sale of items from our catalogs to our customers on route are included within this reportable operating segment. The First Aid and Safety Services reportable operating segment consists of first aid and safety products and services. The remainder of Cintas’ business, which consists of the Fire Protection Services operating segment and the Uniform Direct Sale operating segment, is included in All Other. These operating segments consist of fire protection products and services and the direct sale of uniforms and related items. Cintas evaluates operating segment performance based on revenue and income before income taxes. Revenue and income before income taxes for each of these reportable operating segments for the years ended May 31, 2021, 2020 and 2019 are presented in Note 14 entitled Operating Segment Information of \"Notes to Consolidated Financial Statements.\" The Company regularly reviews its operating segments for reporting purposes based on the information its chief operating decision maker regularly reviews for purposes of allocating resources and assessing performance and makes changes when appropriate.\nIn December 2019, a novel strain of coronavirus (COVID-19) was reported to have surfaced in Wuhan, China, and has since spread globally. In March 2020, the World Health Organization characterized COVID-19 as a pandemic. Efforts to contain the spread of COVID-19 intensified during our fiscal 2020 fourth quarter and have remained in effect throughout our fiscal 2021. Most states and municipalities within the U.S., as well as Canada, enacted temporary closures of businesses, issued quarantine orders and took other restrictive measures in response to the COVID-19 pandemic. Many of the business closures, quarantine orders and other restrictive measures remained in place through fiscal 2021. Within the U.S., our business was designated an essential business, which allowed us to continue to serve customers that remained open. During our fiscal 2021 fourth quarter, the roll out of vaccines, lower COVID-19 case counts and lifting of restrictions on businesses had a positive impact on our business.\nWe have operations throughout the U.S. and Canada and participate in a global supply chain. During most of fiscal 2021, the existence of the COVID-19 pandemic, the fear associated with the COVID-19 pandemic and the reactions of governments around the world in response to the COVID-19 pandemic to regulate the flow of labor and products and impede the business of our customers, impacted our ability to conduct normal business operations, which had an adverse effect on our business. Many of Cintas' customers were also impacted by the COVID-19 pandemic, and we saw an impact on some customer's ability to pay timely. While there was minimal disruption to our supply chain, Cintas did increase inventory, primarily personal protective equipment and facility services inventory, in response to the customer needs and demand associated with the safety and cleanliness requirements of COVID-19. The increase in inventory resulted in additional inventory reserves during fiscal 2021 and could result in future inventory reserve increases if demand for personal protective equipment declines. See Note 1 entitled Significant Accounting Policies of \"Notes to Consolidated Financial Statements\" for additional detail on the additional reserve placed on inventory. The impact of the COVID-19 pandemic is fluid and continues to evolve, and therefore, we cannot predict the extent to which our business, consolidated results of operations, consolidated financial condition or liquidity will ultimately be impacted.\nThe following table sets forth certain consolidated statements of income data as a percent of revenue by reportable operating segment, All Other and in total for the fiscal years ended May 31:\nFiscal 2021 Compared to Fiscal 2020\nFiscal 2021 total revenue was $7.1 billion, an increase of 0.4% over the prior fiscal year. Revenue increased organically by 0.2% as a result of increased sales volume. Organic growth adjusts for the impact of acquisitions and divestitures, foreign currency exchange rate fluctuations and workday differences. Total revenue was negatively impacted by a net 0.3% due to acquisitions and divestitures, positively impacted by 0.2% due to foreign currency exchange rate fluctuations and positively impacted by 0.3% due to one more workday in fiscal 2021 compared to fiscal 2020.\nAs previously discussed, government enactments of temporary and indefinite closures of certain businesses in response to the COVID-19 pandemic continued to impact our ability to access and service some of our customers impacted by these mandates during fiscal 2021. Due to the constantly changing impact of the COVID-19 pandemic, uncertainty remains about the pace of the economic recovery and about its impact on future Cintas consolidated financial results.\nOrganic revenue by quarter for fiscal 2021 is as follows:\nUniform Rental and Facility Services reportable operating segment revenue consists predominantly of revenue derived from the rental of corporate identity uniforms and other garments, including flame resistant clothing and the rental and/or sale of mats, mops, shop towels, restroom supplies and other rental services. Revenue from the Uniform Rental and Facility Services reportable operating segment increased 0.8% compared to fiscal 2020 due to an organic growth increase of 0.7%. Revenue growth was negatively impacted by a net 0.5% due to acquisitions and divestitures, positively impacted by 0.2% due to foreign currency exchange rate fluctuations and positively impacted by 0.4% due to one more workday in fiscal 2021 compared to fiscal 2020. Revenue growth was a result of new business, the penetration of additional products and services into existing customers, partially offset by lost business. New business growth resulted from an increase in the productivity of sales representatives. Generally, sales productivity improvements are due to increased tenure and improved training, which produce a higher number of products and services sold.\nOther revenue, consisting of revenue from the First Aid and Safety Services reportable operating segment and All Other, decreased 1.0% compared to fiscal 2020. Revenue improvement from increases in sales representative productivity and sales of personal protection equipment was more than offset by a decrease in sales related to customers in All Other as a result of the impact from the COVID-19 pandemic. Revenue declined organically by 1.9%. Revenue growth was positively impacted by 0.5% due to revenue growth derived through acquisitions in our First Aid and Safety Services reportable operating segment and our Fire Protection operating segment, which is included in All Other, and by 0.4% due to one more workday in fiscal 2021 compared to fiscal 2020.\nCost of uniform rental and facility services decreased 2.3% compared to fiscal 2020. Cost of uniform rental and facility services consists primarily of production expenses, delivery expenses and the amortization of in service inventory, including uniforms, mats, shop towels and other ancillary items. The cost of uniform rental and facility services decreased compared to fiscal 2020 primarily due to certain cost control measures such as reduced labor and supplies that were partially offset by increases in material cost, primarily related to personal protective equipment.\nCost of other consists primarily of cost of goods sold (predominantly first aid and safety products, personal protective equipment, uniforms and fire protection products), delivery expenses and distribution expenses in the First Aid and Safety Services reportable operating segment and All Other. Cost of other increased 2.8% in fiscal 2021 compared to fiscal 2020. The increase was primarily due to an increase in the proportion of sales in the First Aid and Safety Services reportable operating segment of personal protective equipment, which typically have lower gross margins compared to other First Aid and Safety Services reportable operating segment products.\nSelling and administrative expenses decreased $141.9 million, to 27.1% as a percent of revenue, compared to 29.2% in fiscal 2020. The improvement as a percent of revenue was primarily due to efficiencies in labor and employee-partner related expenses as well as lower discretionary spending and a one-time benefit from the gain on the sale of certain operating assets. In addition, during the fourth quarter of fiscal 2020, Cintas initiated certain one-time activities to reduce operating costs and better align its workforce with the needs of its ongoing business and recorded $24.5 million in employee termination costs and $9.2 million in long-lived asset impairment costs.\nNet interest expense (interest expense less interest income) was $97.7 million in fiscal 2021 compared to $104.4 million in fiscal 2020. The decrease in net interest expense was primarily due to the decrease in total debt outstanding during fiscal 2021 compared to fiscal 2020.\nIncome before income taxes was $1,287.7 million, an increase of $229.5 million, or 21.7%, compared to fiscal 2020. The increase in income before income taxes was primarily due to both cost of sales and selling and administrative expenses decreasing in total and as a percent of revenue in fiscal 2021. Income before income taxes also benefited from a one-time net gain on the sale of certain operating assets.\nCintas' effective tax rate on continuing operations was 13.7% for fiscal 2021 compared to 17.2% in fiscal 2020. The effective tax rate in both periods was impacted by certain discrete items, primarily the tax accounting impact for stock-based compensation. In addition, the effective tax rate for fiscal 2021 included a one-time tax benefit on the sale of certain operating assets.\nNet income from continuing operations for fiscal 2021 of $1,111.0 million was a 26.8% increase compared to fiscal 2020. Diluted earnings per share from continuing operations of $10.24 was a 26.3% increase compared to fiscal 2020 diluted earnings per share from continuing operations of $8.11. Diluted earnings per share from continuing operations increased primarily due to the increase in net income.\nUniform Rental and Facility Services Reportable Operating Segment\nUniform Rental and Facility Services reportable operating segment revenue increased $46.1 million, or 0.8%, and the cost of uniform rental and facility services decreased $71.6 million, or 2.3%, due to the reasons previously discussed. The reportable operating segment's fiscal 2021 gross margin was 47.6% of revenue compared to 45.9% in fiscal 2020. The increase in gross margin was primarily due to certain cost control measures such as reduced labor and supplies that were partially offset by increases in material cost, including increases related to increased sales of personal protective equipment.\nSelling and administrative expenses for the Uniform Rental and Facility Services reportable operating segment decreased $103.5 million in fiscal 2021 compared to fiscal 2020. Selling and administrative expense as a percent of revenue for fiscal 2021 was 26.0% compared to 28.1% in fiscal 2020. The improvement in selling and administrative expenses as a percent of revenue was primarily due to efficiencies in labor and employee-partner related expenses as well as lower discretionary spending and a one-time benefit from the gain on the sale of certain operating assets, which was partially offset by a one-time asset impairment on certain long-lived assets. Also, in the fourth quarter of fiscal 2020, the Uniform Rental and Facility Services reportable operating segment initiated certain one-time activities to reduce operating costs and better align its workforce with the needs of its ongoing business. During the fourth quarter of fiscal 2020, the reportable operating segment recorded $20.2 million in employee termination costs and $9.2 million in long-lived asset impairment costs.\nIncome before income taxes increased $221.3 million to $1,225.8 million for fiscal 2021 compared to fiscal 2020. Income before income taxes as a percent of revenue at 21.5% increased 370 basis points from 17.8% in fiscal 2020. The increase was primarily due to the previously discussed improvement in gross margin and selling and administrative expenses as a percent of revenue.\nFirst Aid and Safety Services Reportable Operating Segment\nFirst Aid and Safety Services reportable operating segment revenue increased $75.7 million in fiscal 2021, a 10.7% increase compared to fiscal 2020. Revenue increased organically by 10.0% as a result of new business and sales productivity increases, penetration of additional products and services into existing customers and sales of personal protective equipment in response to the COVID-19 pandemic. Revenue growth was positively impacted by 0.2% due to acquisitions, by 0.1% due to foreign currency exchange rate fluctuations and by 0.4% due to one more workday in fiscal 2021 compared to fiscal 2020.\nCost of sales for the First Aid and Safety Services reportable operating segment increased $82.0 million, or 22.2%, in fiscal 2021, primarily due to higher sales volume and change in sales mix. Gross margin for the First Aid and Safety Services reportable operating segment is defined as revenue less cost of goods, warehouse expenses, service expenses and training expenses. The gross margin as a percent of revenue was 42.4% for fiscal 2021 compared to 47.8% in fiscal 2020. The decrease was primarily a result of the increase in the proportion of sales related to personal protective equipment, as a result of the impact of the COVID-19 pandemic. Personal protective equipment typically has lower gross margins than other First Aid and Safety Services reportable operating segment products.\nSelling and administrative expenses for the First Aid and Safety Services reportable operating segment increased by $19.4 million, or 8.4%, in fiscal 2021 compared to fiscal 2020, but improved as a percent of revenue to 32.0% in fiscal 2021 compared to 32.7% in fiscal 2020. The improvement as a percent of revenue was primarily due to revenue growing at a faster pace than labor and employee-partner related expenses and lower discretionary spending.\nIncome before income taxes for the First Aid and Safety Services reportable operating segment was $81.2 million in fiscal 2021, a decrease of $25.7 million, or 24.1%, compared to fiscal 2020. Income before income taxes as a percent of revenue at 10.4%, decreased from 15.1% in fiscal 2020 due to the previously discussed decrease in gross margin.\nLiquidity and Capital Resources\nThe following table summarizes our cash flows and cash and cash equivalents as of and for the fiscal years ended May 31:\nCash and cash equivalents as of May 31, 2021 and 2020 include $37.9 million and $30.2 million, respectively, that is located outside of the U.S.\nCash flows provided by operating activities have historically supplied us with a significant source of liquidity. We generally use these cash flows to fund most, if not all, of our operations and expansion activities and dividends on our common stock. We may also use cash flows provided by operating activities, as well as proceeds from long-term debt and short-term borrowings, to fund growth and expansion opportunities, as well as other cash requirements such as the repurchase of our common stock and payment of long-term debt.\nThe disruption from the COVID-19 pandemic continued to have an impact on Cintas' fiscal 2021 financial results. However, net cash flow provided by operating activities was not significantly impacted. We expect our cash flows from operating activities to remain sufficient to provide us with adequate levels of short-term liquidity. In addition, we have access to $1.0 billion of short-term debt from our revolving credit facility. Although the impact of the COVID-19 pandemic is fluid and continues to evolve, we believe our long-term liquidity position remains strong. We believe the Company has sufficient liquidity to operate in the current business environment. Acquisitions and dividends remain strategic objectives, but they will be dependent on the economic outlook and liquidity of the Company.\nNet cash provided by operating activities was $1.36 billion for fiscal 2021, which was an increase of $69.3 million compared to fiscal 2020. The increase was primarily the result of increased net income and favorable changes in accrued compensation and other, partially offset by changes in working capital, specifically income taxes, accounts receivable and accrued liabilities and other.\nNet cash used in investing activities was $137.2 million in fiscal 2021, compared to $285.4 million in fiscal 2020. Net cash used in investing activities includes capital expenditures, purchases of investments, proceeds from the sale of operating assets and cash paid for acquisitions of businesses. Capital expenditures were $143.5 million and $230.3 million for fiscal 2021 and fiscal 2020, respectively. Capital expenditures for fiscal 2021 included $104.0 million for the Uniform Rental and Facility Services reportable operating segment and $34.4 million for the First Aid and Safety Services reportable operating segment. The decrease in capital expenditures from fiscal 2020 to fiscal 2021 was due to reduced growth capacity needs within the slower growth landscape of the COVID-19 pandemic. Cash paid for acquisitions of businesses, net of cash acquired, was $10.0 million and $53.7 million for fiscal 2021 and fiscal 2020, respectively. The acquisitions in both fiscal 2021 and 2020 occurred in our Uniform Rental and Facility Services reportable operating segment, our First Aid and Safety Services reportable operating segment and our Fire Protection operating segment, which is included in All Other. In fiscal 2021 and fiscal 2020, investing activities included proceeds of $31.7 million and $13.3 million, respectively, from the sale of certain operating assets, net of\ncash disposed. Net cash used in investing activities also included $4.3 million and $10.0 million of purchases of investments during fiscal 2021 and fiscal 2020, respectively.\nNet cash used in financing activities was $879.9 million for fiscal 2021, compared to $955.2 million in fiscal 2020. The decrease in cash used from financing activities from fiscal 2020 is primarily due to the payment of the $312.5 million of debt in fiscal 2020, partially offset by an increase in cash used to pay dividends and repurchase common stock in fiscal 2021. On October 30, 2018, we announced that the Board of Directors authorized a $1.0 billion share buyback program, which was completed during fiscal 2021. On October 29, 2019, we announced the Board of Directors authorized a new $1.0 billion share buyback program, which does not have an expiration date. The following table summarizes the buyback activity by program and fiscal year ended May 31:\nIn the period subsequent to May 31, 2021 through July 28, 2021, we completed the October 29, 2019 program by purchasing 1.6 million shares of Cintas common stock at an average price of $365.41 for a total purchase price of $581.2 million. From the inception of the October 29, 2019 program through July 28, 2021, Cintas purchased a total of 2.8 million shares of Cintas common stock at an average price of $358.93 per share for a total purchase price of $1.0 billion. In addition, for the fiscal year ended May 31, 2021, Cintas acquired 0.2 million shares of Cintas common stock in satisfaction of employee payroll taxes due on restricted stock awards that vested during the fiscal year. These shares were acquired at an average price of $302.52 per share for a total purchase price of $74.4 million. For the fiscal year ended May 31, 2020, Cintas acquired 0.3 million shares of Cintas common stock in satisfaction of employee payroll taxes due on restricted awards that vested during the fiscal year. These shares were acquired at an average price of $260.89 per share for a total purchase price of $68.8 million.\nOn October 27, 2020, Cintas declared an annual cash dividend on outstanding common stock, representing a 10.2% increase over the annual dividend paid in the prior fiscal year. This marked the 38th consecutive year that Cintas has increased its annual dividend, every year since going public in 1983. Also on October 27, 2020, the Cintas Board of Directors approved a change in the dividend policy from an annual dividend to a quarterly dividend and subsequently declared a quarterly dividend on outstanding common stock. Any future dividend declarations, including the amount of any dividends, are at the discretion of the Board of Directors and dependent upon then-existing conditions, including the Company's consolidated operating results and consolidated financial condition, capital requirements, contractual restrictions, business prospects and other factors that the Board of Directors may deem relevant. Our Board of Directors declared the following dividends during the fiscal years ended May 31:\n.(1) The dividend declared on April 13, 2021 was included in current accrued liabilities on the consolidated balance sheet at May 31, 2021.\nDuring the fiscal year ended May 31, 2020, Cintas paid a net total of $112.5 million on commercial paper borrowings and paid off the term loan balance of $200.0 million with cash on hand. There was no commercial paper outstanding during fiscal 2021. The following table summarizes Cintas' outstanding debt at May 31:\n(1) Cintas assumed these senior notes with the acquisition of G&K in the fourth quarter of fiscal 2017, and they were recorded at fair value. The interest rate shown above is the effective interest rate. The principal amount of these notes is $50.0 million with a stated interest rate of 3.73%.\n(2) Cintas assumed these senior notes with the acquisition of G&K in the fourth quarter of fiscal 2017, and they were recorded at fair value. The interest rate shown above is the effective interest rate. The principal amount of these notes is $50.0 million with a stated interest rate of 3.88%.\nThe credit agreement that supports our commercial paper program was amended and restated on May 24, 2019. The amendment increased the capacity of the revolving credit facility from $600.0 million to $1.0 billion and created a new term loan of $200.0 million. The credit agreement has an accordion feature that provides Cintas the ability to request increases to the borrowing commitments under either the revolving credit facility or the term loan of up to $250.0 million in the aggregate, subject to customary conditions. The maturity date of the revolving credit facility is May 23, 2024. As of May 31, 2021 and 2020, there was no commercial paper outstanding and no borrowings on our credit facility. On June 1, 2021, in accordance with the terms of the notes, Cintas paid the $250.0 million aggregate principal amount of its 4.30%, 10-year senior notes that matured on that date with cash on hand. During fiscal 2022, Cintas expects to issue long-term debt to pay the $650.0 million principal amount of its 2.90%, 5-year senior notes that mature in the fourth quarter of fiscal 2022.\nCintas has certain covenants related to debt agreements. These covenants limit Cintas' ability to incur certain liens, to engage in sale-leaseback transactions and to merge, consolidate or sell all or substantially all of Cintas' assets. These covenants also require Cintas to maintain certain debt to consolidated earnings before interest, taxes, depreciation and amortization (EBITDA) and interest coverage ratios. Cross-default provisions exist between certain debt instruments. If a default of a significant covenant were to occur, the default could result in an acceleration of the maturity of the indebtedness, impair liquidity and limit the ability to raise future capital. Cintas was in compliance with all of the debt covenants for all periods presented.\nOur access to the commercial paper and long-term debt markets has historically provided us with sources of liquidity. We do not anticipate having difficulty in obtaining financing from those markets in the future in view of our favorable experiences in the debt markets in the recent past, including our ability to refinance the $650.0 million aggregate principal amount of our senior notes that mature in fiscal 2022. Additionally, our ability to continue to access the commercial paper and long-term debt markets on favorable interest rate and other terms will depend, to a significant degree, on the ratings assigned by the credit rating agencies to our indebtedness.\nAs of May 31, 2021, our ratings were as follows:\nIn the event that the ratings of our commercial paper or our outstanding long-term debt issues were substantially lowered or withdrawn for any reason, or if the ratings assigned to any new issue of long-term debt securities were significantly lower than those noted above, particularly if we no longer had investment grade ratings, our ability to access the debt markets may be adversely affected. In addition, in such a case, our cost of funds for new issues of commercial paper and long-term debt would be higher than our cost of funds would have been had the ratings of those new issues been at or above the level of the ratings noted above. The rating agency ratings are not recommendations to buy, sell or hold our commercial paper or debt securities. Each rating may be subject to revision or withdrawal at any time by the assigning rating organization and should be evaluated independently of any other rating. Moreover, each credit rating is specific to the security to which it applies.\nTo monitor our credit rating and our capacity for long-term financing, we consider various qualitative and quantitative factors. One such factor is the ratio of our total debt to EBITDA. For the purpose of this calculation, debt is defined as the sum of short-term borrowings, long-term debt due within one year, long-term debt and standby letters of credit.\nFinancial and Nonfinancial Disclosure About Issuers and Guarantors of Cintas’ Senior Notes\nCintas Corporation No. 2 (Corp. 2) is the indirectly, wholly owned principal operating subsidiary of Cintas. Corp. 2 is the issuer of the $2,550.0 million aggregate principal amount of senior notes outstanding as of May 31, 2021, which are unconditionally guaranteed, jointly and severally, by Cintas Corporation and its wholly owned, direct and indirect domestic subsidiaries. See Note 7 entitled Debt and Derivatives of \"Notes to Consolidated Financial Statements\" for more information on Cintas' outstanding debt.\nBasis of Preparation of the Summarized Financial Information\nThe following tables include summarized financial information of Cintas Corporation (Issuer), Corp. 2 and subsidiary guarantors (together, the Obligor Group). Investments in and equity in the earnings of non-guarantors, which are not members of the Obligor Group, have been excluded. Non-guarantor subsidiaries are located outside the U.S., and therefore, excluded from the Obligor Group.\nThe summarized financial information of the Obligor Group is presented on a combined basis with intercompany balances and transactions between entities in the Obligor Group eliminated. The Obligor Group’s amounts due from, amounts due to and transactions with non-guarantors have been presented in separate line items, if they are material. Summarized financial information of the Obligor Group is as follows for the fiscal years ended May 31:\nContractual Obligations\n(1)See Note 7 entitled Debt and Derivatives of \"Notes to Consolidated Financial Statements\" for a detailed presentation of Cintas' debt.\n(2)See Note 8 entitled Leases of \"Notes to Consolidated financial Statements\" for a detailed presentation of Cintas' leases.\nCintas also makes payments to defined contribution plans and may make payments to defined benefit plans to satisfy minimum funding requirements. The amount of contributions made to the defined contribution plans are at the discretion of the Board of Directors of Cintas. Future contributions to the defined contribution plans are expected to be $82.6 million in the next year, $177.9 million in the next two to three years and $196.1 million in the next four to five years. Future contributions to the defined benefit plans are expected to be $0.3 million in the next year, $3.0 million in the next two to three years and $3.0 million in the next four to five years.\nOther Commitments\n(1)Back-up facility for the commercial paper program (reference Note 7 entitled Debt and Derivatives of \"Notes to Consolidated Financial Statements\" for further discussion).\n(2)These standby letters of credit and surety bonds support certain outstanding debt (reference Note 7 entitled Debt and Derivatives of \"Notes to Consolidated Financial Statements\"), self-insured workers' compensation and general liability insurance programs.\nInflation and Changing Prices\nChanges in wages, benefits and energy costs have the potential to materially impact Cintas' consolidated results of operations. Management believes inflation has not had a material impact on Cintas' consolidated financial condition or a negative impact on the consolidated results of operations.\nLitigation and Other Contingencies\nCintas is subject to legal proceedings, insurance receipts, legal settlements and claims arising from the ordinary course of its business, including personal injury, customer contract, environmental and employment claims. In the opinion of management, the aggregate liability, if any, with respect to such ordinary course of business actions will not have a material adverse effect on the consolidated financial position, consolidated results of operations or consolidated cash flows of Cintas.\nThe Company, the Board of Directors, Scott Farmer (Executive Chairman) and the Investment Policy Committee are defendants in a purported class action, filed on December 13, 2019, pending in the U.S. District Court for the Southern District of Ohio alleging violations of ERISA. The lawsuit asserts that the defendants improperly managed the costs of the employee retirement plan, breached their fiduciary duties in failing to investigate and select lower cost alternative funds and failed to monitor and control the employee retirement plan’s recordkeeping costs. The defendants deny liability.\nNew Accounting Standards\nIn April 2019, the Financial Accounting Standards Board (FASB) issued Accounting Standards Update (ASU) 2016-13, “Financial Instruments-Credit Losses (Topic 326): Measurement of Credit Losses on Financial Instruments.” ASU 2016-13 replaces the incurred loss impairment methodology with a methodology that reflects expected credit losses and requires consideration of a broader range of reasonable and supportable information to inform credit loss estimates. In connection with recognizing credit losses on accounts receivable and other financial instruments, Cintas now uses a forward-looking expected loss model rather than the incurred loss model. Adoption of ASU 2016-13 requires using a modified retrospective approach through a cumulative-effect adjustment to retained earnings as of the effective date to align existing credit loss methodology with the new standard. This standard was adopted by Cintas on June 1, 2020 and did not have a material impact on the Company's consolidated financial statements.\nNo other new accounting pronouncement recently issued or newly effective had or is expected to have a material impact on the consolidated financial statements.\nCritical Accounting Policies and Estimates\nThe preparation of Cintas' consolidated financial statements in conformity with U.S. GAAP requires management to make estimates and judgments that have a significant effect on the amounts reported in the consolidated financial statements and accompanying notes. These critical accounting policies should be read in conjunction with Note 1 entitled Significant Accounting Policies of \"Notes to Consolidated Financial Statements.\" Significant changes, estimates or assumptions related to any of the following critical accounting policies, including those impacted by the COVID-19 pandemic, could possibly have a material impact on the consolidated financial statements.\nRevenue recognition\nRental revenue, which is recorded in the Uniform Rental and Facility Services reportable operating segment, is recognized when services are performed or the obligations under the terms of a contract with a customer are satisfied. Other revenue, which is recorded in the First Aid and Safety Services reportable operating segments and All Other, is recognized when either services are performed or the obligations under the terms of a contract with a customer are satisfied. See Note 2 entitled Revenue Recognition of the \"Notes to Consolidated Financial Statements\" for more information on Cintas' revenue.\nUniforms and other rental items in service\nUniforms and other rental items in service are valued at cost less amortization, calculated using the straight-line method. Uniforms in service (other than cleanroom and flame resistant clothing) are amortized over their useful life of 18 months. Other rental items, including shop towels, mats, mops, cleanroom garments, flame resistant clothing, linens and restroom dispensers, are amortized over their useful lives, which range from 8 to 60 months. The amortization rates used are based on industry experience, Cintas' specific experience and wear tests performed by Cintas. These factors are critical to determining the amount of in service inventory and related cost of uniforms and ancillary products that are presented in the consolidated financial statements.\nGoodwill\nGoodwill, obtained through acquisitions of businesses, is valued at cost less any impairment. Cintas completes an annual impairment test, that includes an assessment of qualitative factors including, but not limited to, macroeconomic conditions, industry and market conditions, and entity specific factors such as strategies and financial performance. We test for goodwill impairment at the reporting unit level. Cintas has identified four reporting units for purposes of evaluating goodwill impairment: Uniform Rental and Facility Services, First Aid and Safety Services and two reporting units within All Other. Based on the results of the annual impairment tests, Cintas was not required to recognize an impairment of goodwill for the fiscal years ended May 31, 2021, 2020 or 2019. Cintas will continue to perform impairment tests as of March 1 in future years and when indicators of impairment exist.\nInsurance reserve\nThe insurance reserve represents the estimated ultimate cost of all asserted and unasserted claims, primarily related to workers' compensation, auto liability and other general liability exposure through the consolidated balance sheet dates. Our incurred but not reported reserves are estimated through actuarial procedures, with the assistance of third-party actuarial specialists, of the insurance industry and by using industry assumptions, adjusted for specific expectations based on our claims history. Cintas records an increase or decrease in selling and administrative expenses related to development of prior claims, higher claims activity and other environmental factors in the period in which it becomes known. These changes in estimates may be material to the consolidated financial statements.\nStock-based compensation\nCompensation expense is recognized for all share-based payments to employees, including stock options and restricted stock awards, in the consolidated statements of income based on the fair value of the awards that are granted. The fair value of stock options is estimated at the date of grant using the Black-Scholes option-pricing model. Generally, measured compensation cost, net of actual forfeitures, is recognized on a straight-line basis over the vesting period of the related share-based compensation award. See Note 12 entitled Stock-Based Compensation of \"Notes to Consolidated Financial Statements\" for further information.\nLitigation and other contingencies\nCintas is subject to legal proceedings and claims arising from the ordinary course of its business, including personal injury, customer contract, environmental and employment claims. U.S. GAAP requires that a liability for contingencies be recorded when it is probable that a liability has occurred and the amount of the liability can be reasonably estimated. Significant judgment is required to determine the existence of a liability, as well as the amount to be recorded. While a significant change in assumptions and judgments could have a material impact on the amounts recorded for contingent liabilities, Cintas does not believe that they will result in a material adverse effect on the consolidated financial statements.\nIncome taxes\nDeferred tax assets and liabilities are determined by the differences between the consolidated financial statement carrying amounts and the tax basis of assets and liabilities. Therefore, the Company has not recorded deferred taxes for basis differences expected to reverse in future periods. Cintas accounts for Global Intangible Low-Taxed Income (GILTI) as a current-period expense when incurred. See Note 9 entitled Income Taxes of \"Notes to Consolidated Financial Statements\" for the types of items that give rise to significant deferred income tax assets and liabilities. Deferred income taxes are classified as assets or liabilities based on the classification of the related asset or liability for financial reporting purposes. Cintas regularly reviews deferred tax assets for recoverability based upon projected future taxable income and the expected timing of the reversals of existing temporary differences. Although realization is not assured, management believes it is more likely than not that the recorded deferred tax assets, as adjusted for valuation allowances, will be realized.\nAccounting for uncertain tax positions requires the determination of whether tax benefits claimed or expected to be claimed on a tax return should be recorded in the consolidated financial statements. Companies may recognize the tax benefit from an uncertain tax position only if it is more likely than not that the tax position will be sustained on examination by the taxing authorities, based on the technical merits of the position. The tax benefits recognized in the consolidated financial statements from such a position should be measured based on the largest benefit that has a greater than fifty percent likelihood of being realized upon ultimate settlement.\nCintas is periodically reviewed by domestic and foreign tax authorities regarding the amount of taxes due. These reviews include questions regarding the timing and amount of deductions and the allocation of income among various tax jurisdictions. In evaluating the exposure associated with various filing positions, Cintas records reserves as deemed appropriate. Based on Cintas' evaluation of current tax positions, Cintas believes its tax related accruals are appropriate.",
    "item_7A": "Item 7A. Quantitative and Qualitative Disclosures About Market Risk\nEarnings may be affected by changes in short-term interest rates due to investments, if any, in marketable securities and money market accounts and periodic issuances of commercial paper. If short-term rates changed by one-half percent (or 50 basis points), Cintas' income before income taxes would change by approximately $0.5 million. This estimated exposure considers the effects on investments. This analysis does not consider the effects of a change in economic activity or a change in Cintas' capital structure.\nThrough its foreign operations, Cintas is exposed to foreign currency risk. Foreign currency exposures arise from transactions denominated in a currency other than the functional currency and from foreign denominated revenue and profit translated into U.S. dollars. Foreign denominated revenue and profit represents less than 10% of Cintas' consolidated revenue and profit. Cintas periodically uses foreign currency hedges such as average rate options and forward contracts to mitigate the risk of foreign currency exchange rate movements resulting from foreign currency revenue and from international cash flows. The primary foreign currency to which Cintas is exposed is the Canadian dollar.",
    "item_8": "Item 8. Financial Statements and Supplementary Data\nIndex to Consolidated Financial Statements\nAudited Consolidated Financial Statements for the Fiscal Years Ended May 31, 2021, 2020 and 2019\nManagement's Report on Internal Control over Financial Reporting\nReports of Independent Registered Public Accounting Firm\nConsolidated Statements of Income\nConsolidated Statements of Comprehensive Income\nConsolidated Balance Sheets\nConsolidated Statements of Shareholders' Equity\nConsolidated Statements of Cash Flows\nNotes to Consolidated Financial Statements\nManagement's Report on\nInternal Control over Financial Reporting\nTo the Shareholders of Cintas Corporation:\nOur management is responsible for establishing and maintaining adequate internal control over financial reporting (as defined in Rule 13a-15(f) and 15(d)-15(f) under the Securities Exchange Act of 1934) to provide reasonable assurance regarding the reliability of our financial reporting and the preparation of financial statements for external purposes in accordance with accounting principles generally accepted in the United States. Internal control over financial reporting includes those policies and procedures that: (1) pertain to the maintenance of records that in reasonable detail accurately and fairly reflect the transactions and dispositions of the assets of the company; (2) provide reasonable assurance that transactions are recorded as necessary to permit preparation of financial statements in accordance with generally accepted accounting principles and that receipts and expenditures of the company are being made only in accordance with authorizations of management and directors of the company; and (3) provide reasonable assurance regarding prevention or timely detection of unauthorized acquisition, use or disposition of the company's assets that could have a material effect on the financial statements.\nBecause of its inherent limitations, internal control over financial reporting may not prevent or detect misstatements. Also, projections of any evaluation of effectiveness to future periods are subject to the risk that controls may become inadequate because of changes in conditions, or that the degree of compliance with the policies or procedures may deteriorate. Accordingly, even an effective system of internal control over financial reporting will provide only reasonable assurance with respect to financial statement preparation.\nWith the supervision of our President and Chief Executive Officer and our Chief Financial Officer, management assessed our internal control over financial reporting as of May 31, 2021. Management based its assessment on criteria established in Internal Control - Integrated Framework (2013) issued by the Committee of Sponsoring Organizations of the Treadway Commission (COSO). Management's assessment included evaluation of such elements as the design and operating effectiveness of key financial reporting controls, process documentation, accounting policies and our overall control environment. This assessment is supported by testing and monitoring performed by our internal audit function.\nBased on our assessment, management has concluded that our internal control over financial reporting was effective as of May 31, 2021, to provide reasonable assurance regarding the reliability of financial reporting and the preparation of financial statements for external reporting purposes in accordance with accounting principles generally accepted in the United States.\nWe reviewed the results of management's assessment with the Audit Committee of our Board of Directors. Additionally, our independent registered public accounting firm, Ernst & Young LLP, independently assessed the effectiveness of Cintas Corporation's internal control over financial reporting. Ernst & Young LLP has issued an attestation report, which is included in this Annual Report on Form 10-K.\nTodd M. Schneider\nPresident and Chief Executive Officer\nJ. Michael Hansen\nExecutive Vice President and Chief Financial Officer\nReport of Independent\nRegistered Public Accounting Firm\nTo the Shareholders and the Board of Directors of Cintas Corporation\nOpinion on the Financial Statements\nWe have audited the accompanying consolidated balance sheets of Cintas Corporation (the Company) as of May 31, 2021 and 2020, the related consolidated statements of income, comprehensive income, shareholders’ equity and cash flows for each of the three years in the period ended May 31, 2021, and the related notes and financial statement schedule listed in the Index at Item 15(a) (collectively referred to as the “consolidated financial statements”). In our opinion, the consolidated financial statements present fairly, in all material respects, the financial position of the Company at May 31, 2021 and 2020, and the results of its operations and its cash flows for each of the three years in the period ended May 31, 2021, in conformity with U.S. generally accepted accounting principles.\nWe also have audited, in accordance with the standards of the Public Company Accounting Oversight Board (United States) (PCAOB), the Company’s internal control over financial reporting as of May 31, 2021, based on criteria established in Internal Control-Integrated Framework issued by the Committee of Sponsoring Organizations of the Treadway Commission (2013 framework), and our report dated July 28, 2021, expressed an unqualified opinion thereon.\nBasis for Opinion\nThese financial statements are the responsibility of the Company's management. Our responsibility is to express an opinion on the Company’s financial statements based on our audits. We are a public accounting firm registered with the PCAOB and are required to be independent with respect to the Company in accordance with the U.S. federal securities laws and the applicable rules and regulations of the Securities and Exchange Commission and the PCAOB.\nWe conducted our audits in accordance with the standards of the PCAOB. Those standards require that we plan and perform the audit to obtain reasonable assurance about whether the financial statements are free of material misstatement, whether due to error or fraud. Our audits included performing procedures to assess the risks of material misstatement of the financial statements, whether due to error or fraud, and performing procedures that respond to those risks. Such procedures included examining, on a test basis, evidence regarding the amounts and disclosures in the financial statements. Our audits also included evaluating the accounting principles used and significant estimates made by management, as well as evaluating the overall presentation of the financial statements. We believe that our audits provide a reasonable basis for our opinion.\nCritical Audit Matters\nThe critical audit matter communicated below is a matter arising from the current period audit of the financial statements that was communicated or required to be communicated to the audit committee and that: (1) relates to accounts or disclosures that are material to the financial statements, and (2) involved our especially challenging, subjective or complex judgments. The communication of the critical audit matter does not alter in any way our opinion on the consolidated financial statements, taken as a whole, and we are not, by communicating the critical audit matter below, providing a separate opinion on the critical audit matter or on the account or disclosure to which it relates.\nValuation of Insurance Reserves\nDescription of the Matter At May 31, 2021, the Company's insurance reserve was $156.4 million. As described in Note 1 to the Company’s consolidated financial statements, the Company’s insurance reserve represents the estimated ultimate cost of all asserted and unasserted (incurred but not reported) claims primarily related to workers' compensation, auto liability and other general liability exposure. The incurred but not reported insurance reserve is estimated through actuarial procedures and by using industry assumptions, adjusted for Company specific expectations based on claims history.\nAuditing the Company's estimate of the incurred but not reported insurance reserve is judgmental and complex due to the significant estimation uncertainty of the potential value of unasserted claims, which are developed with the assistance of a third-party actuarial specialist.\nHow We Addressed the Matter in Our Audit We obtained an understanding, evaluated the design and tested the operating effectiveness of internal controls over the Company’s incurred but not reported insurance reserve. This includes internal controls over the claims activity and actuarial methods used to establish the incurred but not reported insurance reserve. Specifically, we tested internal controls related to management’s review of data provided to the actuary, validation of claim activity and review of actuarial methods.\nTo test the incurred but not reported insurance reserve, our audit procedures included, among others, assessing the methodologies used to estimate the incurred but not reported insurance reserve, testing the completeness and accuracy of the underlying claims data, vouching payments made to third parties, and testing the mathematical accuracy of the actuarially determined incurred but not reported insurance reserve. Furthermore, we involved our actuarial specialists to assist in evaluating the methodologies used by management to determine the incurred but not reported insurance reserve and comparing the Company’s recorded incurred but not reported insurance reserve to a range developed based on independently selected actuarial methodologies.\n/s/ Ernst & Young LLP\nWe have served as the Company's auditor since 1968\nCincinnati, Ohio\nJuly 28, 2021\nReport of Independent\nRegistered Public Accounting Firm\nTo the Shareholders and the Board of Directors of Cintas Corporation\nOpinion on Internal Control over Financial Reporting\nWe have audited Cintas Corporation’s internal control over financial reporting as of May 31, 2021, based on criteria established in Internal Control-Integrated Framework issued by the Committee of Sponsoring Organizations of the Treadway Commission (2013 framework) (the COSO criteria). In our opinion, Cintas Corporation (the Company) maintained, in all material respects, effective internal control over financial reporting as of May 31, 2021, based on the COSO criteria.\nWe also have audited, in accordance with the standards of the Public Company Accounting Oversight Board (United States) (PCAOB), the consolidated balance sheets of the Company as of May 31, 2021 and 2020, the related consolidated statements of income, comprehensive income, shareholders’ equity, and cash flows for each of the three years in the period ended May 31, 2021, and the related notes and financial statement schedule listed in the Index at Item 15(a), and our report dated July 28, 2021, expressed an unqualified opinion thereon.\nBasis for Opinion\nThe Company’s management is responsible for maintaining effective internal control over financial reporting and for its assessment of the effectiveness of internal control over financial reporting included in the accompanying “Management's Report on Internal Control over Financial Reporting”. Our responsibility is to express an opinion on the Company’s internal control over financial reporting based on our audit. We are a public accounting firm registered with the PCAOB and are required to be independent with respect to the Company in accordance with the U.S. federal securities laws and the applicable rules and regulations of the Securities and Exchange Commission and the PCAOB.\nWe conducted our audit in accordance with the standards of the PCAOB. Those standards require that we plan and perform the audit to obtain reasonable assurance about whether effective internal control over financial reporting was maintained in all material respects.\nOur audit included obtaining an understanding of internal control over financial reporting, assessing the risk that a material weakness exists, testing and evaluating the design and operating effectiveness of internal control based on the assessed risk, and performing such other procedures as we considered necessary in the circumstances. We believe that our audit provides a reasonable basis for our opinion.\nDefinition and Limitations of Internal Control Over Financial Reporting\nA company’s internal control over financial reporting is a process designed to provide reasonable assurance regarding the reliability of financial reporting and the preparation of financial statements for external purposes in accordance with generally accepted accounting principles. A company’s internal control over financial reporting includes those policies and procedures that (1) pertain to the maintenance of records that, in reasonable detail, accurately and fairly reflect the transactions and dispositions of the assets of the company; (2) provide reasonable assurance that transactions are recorded as necessary to permit preparation of financial statements in accordance with generally accepted accounting principles, and that receipts and expenditures of the company are being made only in accordance with authorizations of management and directors of the company; and (3) provide reasonable assurance regarding prevention or timely detection of unauthorized acquisition, use, or disposition of the company’s assets that could have a material effect on the financial statements.\nBecause of its inherent limitations, internal control over financial reporting may not prevent or detect misstatements. Also, projections of any evaluation of effectiveness to future periods are subject to the risk that controls may become inadequate because of changes in conditions, or that the degree of compliance with the policies or procedures may deteriorate.\n/s/ Ernst & Young LLP\nCincinnati, Ohio\nJuly 28, 2021\nSee accompanying notes.\nSee accompanying notes.\nSee accompanying notes.\nConsolidated\nStatements of Shareholders' Equity\nSee accompanying notes.\nSee accompanying notes.\nNotes to Consolidated Financial Statements\nNote 1. Significant Accounting Policies\nBusiness description. Cintas Corporation (collectively with its majority-owned subsidiaries and any entities over which it has control, Cintas, Company, we, us or our) helps more than one million businesses of all types and sizes, primarily in the United States (U.S.), as well as Canada and Latin America, get READY™ to open their doors with confidence every day by providing a wide range of products and services that enhance our customers’ image and help keep their facilities and employees clean, safe and looking their best. With products and services including uniforms, mats, mops, restroom supplies, first aid and safety products, fire extinguishers and testing, and safety training, Cintas helps customers get Ready for the Workday®. Cintas is also the creator of the Total Clean Program™ - a first-of-its-kind service that includes scheduled delivery of essential cleaning supplies, hygienically clean laundering, and sanitizing and disinfecting projects and services.\nCintas’ reportable operating segments are the Uniform Rental and Facility Services operating segment and the First Aid and Safety Services operating segment. The Uniform Rental and Facility Services reportable operating segment, consists of the rental and servicing of uniforms and other garments including flame resistant clothing, mats, mops and shop towels and other ancillary items. In addition to these rental items, restroom cleaning services and supplies and the sale of items from our catalogs to our customers on route are included within this reportable operating segment. The First Aid and Safety Services reportable operating segment consists of first aid and safety products and services. The remainder of Cintas’ operating segments, which consists of the Fire Protection Services operating segment and the Uniform Direct Sale operating segment, are included in All Other. Cintas evaluates operating segment performance based on revenue and income before income taxes. Revenue and income before income taxes for each of these reportable operating segments for the years ended May 31, 2021, 2020 and 2019 are presented in Note 14 entitled Operating Segment Information. The Company regularly reviews its operating segments for reporting purposes based on the information its chief operating decision maker regularly reviews for purposes of allocating resources and assessing performance and makes changes when appropriate.\nIn December 2019, a novel strain of coronavirus (COVID-19) was reported to have surfaced in Wuhan, China, and has since spread globally. In March 2020, the World Health Organization characterized COVID-19 as a pandemic. Efforts to contain the spread of COVID-19 intensified during our fiscal 2020 fourth quarter and have remained in effect throughout our fiscal 2021. Most states and municipalities within the U.S., as well as Canada, enacted temporary closures of businesses, issued quarantine orders and took other restrictive measures in response to the COVID-19 pandemic. Many of the business closures, quarantine orders and other restrictive measures remained in place through fiscal 2021. Within the U.S., our business was designated an essential business, which allowed us to continue to serve customers that remained open. In these consolidated financial statements and related disclosures, we have assessed the current impact of COVID-19 on our consolidated financial condition, results of operations, and cash flows, as well as our estimates and accounting policies. We have made additional disclosures of these assessments, as necessary. The impact of the COVID-19 pandemic is fluid and continues to evolve, and therefore, we cannot predict the extent to which our business, consolidated results of operations, consolidated financial condition or liquidity will ultimately be impacted.\nPrinciples of consolidation. The consolidated financial statements include the accounts of Cintas controlled majority-owned subsidiaries and any entities over which Cintas has control. Intercompany balances and transactions have been eliminated as appropriate.\nUse of estimates. The preparation of consolidated financial statements in conformity with U.S. generally accepted accounting principles (U.S. GAAP) requires management to make estimates and assumptions that affect the amounts reported in the consolidated financial statements and accompanying notes. The Company’s results are affected by economic, political, legislative, regulatory and legal actions. Economic conditions, such as recessionary trends, inflation, interest and monetary exchange rates, government fiscal policies, government policies surrounding the containment of COVID-19 and changes in the prices of raw materials, can have a significant effect on operations. These factors and other events may cause actual results to differ from management's estimates.\nRevenue recognition. Rental revenue, which is recorded in the Uniform Rental and Facility Services reportable operating segment, is recognized when services are performed or the performance obligation under the terms of a contract with a customer are satisfied. Other revenue, which is recorded in the First Aid and Safety Services reportable operating segment and All Other, is recognized when either services are performed or the performance obligation under the terms of a contract with a customer are satisfied. Revenue is measured as the amount of consideration we expect to receive in exchange for the performance of the service or transfer of the inventory. See Note 2 entitled Revenue Recognition.\nCost of uniform rental and facility services. Cost of uniform rental and facility services consists primarily of production expenses, delivery expenses and the amortization of in service inventory, including uniforms, mats, shop towels and other ancillary items. The Uniform Rental and Facility Services reportable operating segment inbound freight charges, purchasing and receiving costs, inspection costs, warehousing costs and other costs of distribution are included in the cost of uniform rental and facility services.\nCost of other. Cost of other consists primarily of cost of goods sold (predominantly first aid and safety products, uniforms and fire protection products), delivery expenses and distribution expenses in the First Aid and Safety Services reportable operating segment and All Other. Cost of other includes inbound freight charges, purchasing and receiving costs, inspection costs, warehousing costs and other costs of distribution.\nSelling and administrative expenses. Selling and administrative expenses consist primarily of sales labor and commissions, management and administrative labor, payroll taxes, medical expense, insurance expense, legal and professional costs and amortization of finite-lived intangible assets and capitalized contract costs. As a result of the adverse impact that the COVID-19 pandemic has had on the economic environment in North America and the ongoing uncertainty regarding the severity and duration of the pandemic, Cintas initiated certain activities to reduce operating costs and better align its workforce with the needs of its ongoing business. During the fourth quarter of fiscal 2020, Cintas recorded a total of $24.5 million in employee termination costs, of which $20.2 million was recorded in the Uniform Rental and Facility Services reportable operating segment. The amount of employee termination benefits paid during the fiscal year ended May 31, 2021 and 2020 was $10.2 million and $14.3 million, respectively. The related liability balance was $0.0 million at May 31, 2021 and was $10.2 million at May 31, 2020. The May 31, 2020 liability balance was recorded in accrued compensation and related liabilities on the consolidated balance sheets. Cintas did not record employee termination costs during fiscal 2021.\nG&K Services, Inc. integration expenses. As a result of the acquisition of G&K Services, Inc. (G&K) in fiscal 2017, the Company incurred various integration expenses in fiscal 2019, which related primarily to facility closure expenses. No such costs were incurred in fiscal 2021 or 2020. The integration expenses for fiscal 2019 are included in a single line in the consolidated statements of income and are reported by operating segment in Note 14 entitled Operating Segment Information.\nCash and cash equivalents. Cintas considers all highly liquid domestic investments with a maturity of three months or less, at date of purchase, to be cash equivalents. At both May 31, 2021 and 2020, cash and cash equivalents includes $31.8 million of restricted cash used as collateral associated with our insurance reserve.\nAccounts receivable. Accounts receivable is comprised of amounts owed through product shipments and services provided and is presented net of an allowance for doubtful accounts. The allowance includes both an estimate, based on historical rates of collections, and reserves for specific accounts identified as uncollectible. The portion of the allowance that is an estimate based on Cintas' historical rates of collections is recorded for overdue amounts, beginning with a nominal percentage when the account is current and increasing substantially as the account ages. The amount provided as the account ages will differ slightly between the Uniform Rental and Facility Services reportable operating segment, the First Aid and Safety Services reportable operating segment and All Other because of differences in customers served and the nature of each business. As of May 31, 2020, in response to the economic disruption created by the COVID-19 pandemic, Cintas performed an additional evaluation of amounts due from customers in every operating segment that were deemed to be higher collection risk. This evaluation, which occurred in the fourth quarter of fiscal 2020, resulted in an allowance for doubtful accounts in excess of historical rates. The judgment applied to increase the allowance for doubtful accounts beyond our historical policy was deemed to be reasonable and supportable based on the data available as of the consolidated balance sheet date. Certain of the corresponding trade receivables were collected during fiscal 2021, and $14.2 million of incremental allowance for doubtful accounts recorded as of May 31, 2020 was reversed through selling and administrative expenses as the Company's estimates and assumptions related to the impact of COVID-19 changed\nduring fiscal 2021. As of May 31, 2021, no incremental allowance for doubtful accounts was deemed necessary. When an account is considered uncollectible, it is written off against the allowance for doubtful accounts.\nInventories, net. Inventories are valued at the lower of cost (first-in, first-out) or net realizable value. Inventory is comprised of the following amounts at May 31:\nInventories are recorded net of reserves for obsolete inventory (excess and slow-moving) of $111.0 million and $45.5 million at May 31, 2021 and 2020, respectively. The inventory obsolescence reserve is determined by specific identification, as well as an estimate based on Cintas' historical rates of obsolescence. The disruption created by the COVID-19 pandemic beginning in the fourth quarter of fiscal 2020 resulted in larger quantities of inventory on hand as of May 31, 2021 and 2020. As of May 31, 2021, our Uniform Rental and Facility Services and First Aid and Safety reportable operating segments held an excess amount of personal protective equipment inventory on hand. The excess inventory, determined through specific identification, resulted in an increase to the obsolescence reserve of $43.6 million as of May 31, 2021, in comparison to May 31, 2020. As of May 31, 2020, an incremental obsolescence reserve was recorded within our Uniform Direct Sales operating segment due to larger quantities of inventory remaining on hand, at the consolidated balance sheet date, as a result of disruption created by the onset of the COVID-19 pandemic. Obsolete inventory reserves are recorded in selling and administrative expenses on the consolidated statements of income. The judgment applied to increase the obsolete inventory reserve as of May 31, 2021 and 2020, beyond our historical policy was deemed to be reasonable and supportable based on the data available as of the consolidated balance sheet dates. Once a specific inventory item is written down to the lower of cost or net realizable value, a new cost basis has been established, and that inventory item cannot subsequently be marked up.\nUniforms and other rental items in service. These items are valued at cost less amortization, calculated using the straight-line method. Uniforms in service (other than cleanroom and flame resistant clothing) are amortized over their useful life of 18 months. Other rental items, including shop towels, mats, mops, cleanroom garments, flame resistant clothing, linens and restroom dispensers, are amortized over their useful lives, which range from 8 to 60 months. The amortization rates used are based on industry experience, Cintas' specific experience and wear tests performed by Cintas. These factors are critical to determining the amount of in service inventory and related cost of uniforms and facility services that are presented in the consolidated financial statements.\nProperty and equipment. Property and equipment is stated at cost, less accumulated depreciation or at fair value upon acquisition. Depreciation is calculated using the straight-line method primarily over the following estimated useful lives of the assets based on industry and Cintas specific experience:\nWhen events or circumstances indicate that the carrying amount of long-lived assets may not be recoverable, the estimated undiscounted future cash flows are compared to the carrying amount of the assets. If the estimated undiscounted future cash flows are less than the carrying amount of the assets, an impairment loss is recorded based on the excess of the carrying amount of the assets over their respective fair values. Fair value is generally determined by discounted cash flows, prices of similar assets or third-party real estate valuations, as appropriate. As a result of certain activities to eliminate excess capacity and reduce our cost structure in response to COVID-19, an indicator of impairment was identified. Cintas recognized an impairment loss of $9.2 million in the Uniform Rental and Facility Services reportable operating segment during the year ended May 31, 2020. Cintas recognized a long-lived asset impairment loss of $5.1 million in the Uniform Direct Sale operating segment during the year ended May 31, 2021. The long-lived asset impairments in both fiscal years were based on the excess of the carrying amount of\nasset over their respective fair values. The long-lived asset impairment charge was recorded within selling and administrative expenses on the consolidated statements of income. The undiscounted cash flows were estimated, using Level 2 inputs based on both the cost and market approaches, at the lowest discernible level of cash flows, which is at the location level. Cintas did not identify any indicators of impairment for the fiscal year ended May 31, 2019.\nInvestments. Investments consists primarily of the cash surrender value of life insurance policies and equity method investments. The equity method is used to account for an investment if our investment gives us the ability to exercise significant influence over the operating and financial policies of the investee. In general, equity method investments are initially measured at cost. Cintas recognizes its share of the investee’s earnings or losses in income. Equity method investments are reviewed for impairment whenever events or changes in circumstances indicate that the carrying amount of the investment might not be recoverable.\nGoodwill. Goodwill, obtained through acquisitions of businesses, is valued at cost less any impairment. Cintas completes an annual impairment test, that includes an assessment of qualitative factors including, but not limited to, macroeconomic conditions, industry and market conditions, and entity specific factors such as strategies and financial performance. We test for goodwill impairment at the reporting unit level. Cintas has identified four reporting units for purposes of evaluating goodwill impairment: Uniform Rental and Facility Services, First Aid and Safety Services and two reporting units within All Other. Based on the results of the annual impairment tests, Cintas was not required to recognize an impairment of goodwill for the fiscal years ended May 31, 2021, 2020 or 2019. Cintas will continue to perform impairment tests as of March 1 in future years and when indicators of impairment exist.\nService contracts and other assets. Service contracts and other assets, which consist primarily of capitalized contract costs and noncompete and consulting agreements obtained through acquisitions of businesses, are generally amortized by use of the straight-line method over the estimated lives of the agreements, which are generally 5 to 10 years. The G&K service contract asset is being amortized over a period of 15 years, which represents the estimated life of the economic benefit. The G&K service contract asset amortization is based on the annual economic value of the underlying asset which generally decreases over the 15-year term. Certain noncompete agreements, as well as all service contracts, require that a valuation be determined using a discounted cash flow model. The assumptions and judgments used in these models involve estimates of cash flows and discount rates, among other factors. Because of the assumptions used to value these intangible assets, actual results over time could vary from original estimates. Impairment of service contracts and other assets is accomplished through specific identification. No impairment has been recognized by Cintas for the fiscal years ended May 31, 2021, 2020 and 2019.\nDebt issuance costs. Debt issuance costs for the revolving credit facility are included in other assets, net and all other debt issuance costs reduce the carrying amount of debt.\nAccrued liabilities. Current accrued liabilities are recorded when it is probable that a liability has occurred and the amount of the liability can be reasonably estimated. Current accrued liabilities consist of the following at May 31:\nLong-term accrued liabilities consist primarily of retirement obligations, which are described in more detail in Note 10 entitled Employee Benefit Plans, interest rate lock agreements, which are described in more detail in Note 7 entitled Debt and Derivatives, reserves associated with unrecognized tax benefits, which are described in more detail in Note 9 entitled Income Taxes and environmental obligations, which are further described below.\nInsurance reserve. The insurance reserve represents the estimated ultimate cost of all asserted and unasserted claims incurred, primarily related to workers' compensation, auto liability and other general liability exposure through the consolidated balance sheet dates. Our incurred but not reported reserve is estimated through actuarial procedures, with the assistance of third-party actuarial specialists, of the insurance industry and by using industry assumptions, adjusted for specific expectations based on our claims history. Cintas records an increase or decrease in selling and administrative expenses related to development of prior claims, higher claims activity and other environmental factors in the period in which it becomes known. These changes in estimates may be material to the consolidated financial statements.\nEnvironmental obligations. Environmental obligations, including obligations obtained through past business acquisitions, are recorded when it is probable that obligations have been incurred and the costs can be reasonably estimated. Cintas’ environmental obligations are estimated based on an evaluation of various factors, including currently available facts, existing technology, presently enacted laws and regulations, and remediation experience. Where the available information is sufficient to estimate the amount of the obligation, that estimate has been recorded. Where the information is only sufficient to establish a range of probable liability and no point within the range is more likely than any other, the lower end of the range has been used. Management actively monitors all locations for compliance and changes in facts and circumstances. No one location or site is deemed to be material or in violation of the applicable laws and regulations, even though costs are being incurred. Costs estimated for environmental obligations are not discounted to their present value.\nPension plans. The Company assumed G&K's noncontributory, defined benefit pension plan (the Pension Plan) covering substantially all employees who were employed as of July 1, 2005, except certain employees who are covered by union-administered plans. Benefits are based on the number of years of service and each employee's compensation near retirement. G&K froze the Pension Plan effective December 31, 2006. Future growth in benefits will not occur after this date. The Company's funding policy provides for contributions of an amount between the minimum required and maximum amount that can be deducted for federal income tax purposes. The funded status is measured as the difference between the fair value of plan assets and the benefit obligation at May 31, the measurement date. The benefit obligation is the projected benefit obligation (PBO). The PBO represents the actuarial present value of benefits expected to be paid upon retirement based on estimated future compensation levels. The measurement of the PBO is based on the Company’s estimates and actuarial valuations. The fair value of plan assets represents the current market value of assets held by an irrevocable trust fund for the sole benefit of participants. These valuations reflect the terms of the Pension Plan and use participant-specific information such as compensation, age and years of service, as well as certain assumptions that require significant judgment, including estimates of discount rates, expected return on plan assets, rate of compensation increases, interest crediting rates and mortality rates. We recognize, as of a measurement date, any unrecognized actuarial net gains or losses that exceed ten percent of the larger of the projected benefit obligations or the plan assets, defined as the \"corridor.\" Amounts outside the corridor are amortized over the plan participants' life expectancy. We determine the expected return on assets using the fair value of plan assets. See Note 10 entitled Employee Benefit Plans.\nStock-based compensation. Compensation expense is recognized for all share-based payments to employees, including stock options and restricted stock awards, in the consolidated statements of income based on the fair value of the awards that are granted. The fair value of stock options is estimated at the date of grant using the Black-Scholes option-pricing model. Generally, measured compensation cost, net of actual forfeitures, is recognized on a straight-line basis over the vesting period of the related share-based compensation award. See Note 12 entitled Stock-Based Compensation.\nDerivatives and hedging activities. Cintas formally documents all relationships between hedging instruments and hedged items, as well as its risk management objective and strategy for undertaking various hedge transactions. Derivatives are recorded at fair value on the consolidated balance sheet, and gains and losses are recorded as adjustments to income or other comprehensive income, as appropriate. For derivative financial instruments that are designated as a hedge, unrealized gains and losses related to the effective portion are either recognized in income immediately to offset the realized gain or loss on the hedged item, or are deferred and reported as a component of other comprehensive income (loss) in shareholders' equity and subsequently recognized in net income when the hedged item affects net income.\nIncome taxes. The provision for income taxes includes taxes paid, currently payable or receivable and those deferred. Deferred tax assets and liabilities are determined by the differences between the consolidated financial statement carrying amounts and the tax basis of assets and liabilities. Therefore, the Company has not recorded deferred taxes for basis differences expected to reverse in future periods. Cintas accounts for Global Intangible\nLow-Taxed Income (GILTI) as a current-period expense when incurred. See Note 9 entitled Income Taxes for the types of items that give rise to significant deferred income tax assets and liabilities. Deferred income taxes are classified as assets or liabilities based on the classification of the related asset or liability for financial reporting purposes. Cintas regularly reviews deferred tax assets for recoverability based upon projected future taxable income and the expected timing of the reversals of existing temporary differences. Although realization is not assured, management believes it is more likely than not that the recorded deferred tax assets, as adjusted for valuation allowances, will be realized.\nAccounting for uncertain tax positions requires the determination of whether tax benefits claimed or expected to be claimed on a tax return should be recorded in the consolidated financial statements. Companies may recognize the tax benefit from an uncertain tax position only if it is more likely than not that the tax position will be sustained on examination by the taxing authorities, based on the technical merits of the position. The tax benefits recognized in the consolidated financial statements from such a position should be measured based on the largest benefit that has a greater than fifty percent likelihood of being realized upon ultimate settlement.\nCintas is periodically reviewed by domestic and foreign tax authorities regarding the amount of taxes due. These reviews include questions regarding the timing and amount of deductions and the allocation of income among various tax jurisdictions. In evaluating the exposure associated with various filing positions, Cintas records reserves as deemed appropriate. Based on Cintas' evaluation of current tax positions, Cintas believes its tax related accruals are appropriate.\nLitigation and other contingencies. Cintas is subject to legal proceedings and claims arising from the ordinary course of its business, including personal injury, customer contract, environmental and employment claims. U.S. GAAP requires that a liability for contingencies be recorded when it is probable that a liability has occurred and the amount of the liability can be reasonably estimated. In the opinion of management, the aggregate liability, if any, with respect to such ordinary course of business actions will not have a material adverse effect on the consolidated financial position or consolidated results of operations of Cintas.\nFair value measurements. Financial Accounting Standards Board (FASB) Accounting Standards Codification (ASC) Topic 820 defines fair value as the exchange price that would be received for an asset or paid to transfer a liability (an exit price) in the principal or most advantageous market for the asset or liability in an orderly transaction between market participants at the measurement date. When determining the fair value measurements for assets and liabilities, the Company considers the principal or most advantageous market in which the Company would transact and the market-based risk measurements or assumptions that market participants would use in pricing the asset or liability, such as inherent risk, transfer restrictions and credit risk. It also establishes a three-level fair value hierarchy that prioritizes the inputs used to measure fair value. This hierarchy requires entities to maximize the use of observable inputs and minimize the use of unobservable inputs. The three levels of inputs used to measure fair value are as follows:\nLevel 1 - Quoted prices in active markets for identical assets or liabilities.\nLevel 2 - Observable inputs other than quoted prices included in Level 1, such as quoted prices for similar assets and liabilities in active markets; quoted prices for identical or similar assets and liabilities in markets that are not active; or other inputs that are observable or can be corroborated by observable market data.\nLevel 3 - Unobservable inputs that are supported by little or no market activity and that are significant to the fair value of the assets or liabilities. This includes certain pricing models, discounted cash flow methodologies and similar techniques that use significant unobservable inputs.\nIn instances where the determination of the fair value measurement is based on inputs from different levels of the fair value hierarchy, the level in the fair value hierarchy within which the entire fair value measurement falls is based on the lowest level input that is significant to the fair value measurement in its entirety. Cintas' assessment of the significance of a particular input to the fair value measurement in its entirety requires judgment and considers factors specific to the asset or liability. There were no transfers between levels for the years ended May 31, 2021 or 2020. The carrying value of accounts receivable and accounts payable, and other current assets and liabilities, approximate fair value because of the short-term maturity of those instruments.\nIn order to meet the requirements of ASC 820, Cintas utilizes two basic valuation approaches to determine the fair value of its assets and liabilities required to be recorded on a recurring basis at fair value. The first approach is the cost approach. The cost approach is generally the value a market participant would expect to replace the respective\nasset or liability. The second approach is the market approach. The market approach looks at what a market participant would consider valuing an exact or similar asset or liability to that of Cintas, including those traded on exchanges.\nCintas' non-financial assets and liabilities not permitted or required to be measured at fair value on a recurring basis primarily relate to assets revalued in an impairment analysis and to assets and liabilities acquired in a business acquisition unless otherwise noted in Note 3 entitled Fair Value Disclosures. Cintas is required to provide additional disclosures about fair value measurements as part of the consolidated financial statements for each major category of assets and liabilities measured at fair value on a non-recurring basis (including business acquisitions). Based on the nature of Cintas' business acquisitions, which occur regularly throughout the fiscal year, the majority of the assets acquired and liabilities assumed consist of working capital, primarily valued using Level 2 inputs, property and equipment, also primarily valued using Level 2 inputs and goodwill and other identified intangible assets valued using Level 3 inputs. In general, non-recurring fair values determined by Level 1 inputs utilize quoted prices (unadjusted) in active markets for identical assets or liabilities, which generally are not applicable to non-financial assets and liabilities. Fair values determined by Level 2 inputs utilize data points that are observable, such as definitive sales agreements, appraisals or established market values of comparable assets. Fair values determined by Level 3 inputs are unobservable data points for the asset or liability and include situations where there is little, if any, market activity for the asset or liability, such as internal estimates of future cash flows and company specific discount rates.\nNew accounting pronouncements. In April 2019, the FASB issued Accounting Standards Update (ASU) 2016-13, “Financial Instruments-Credit Losses (Topic 326): Measurement of Credit Losses on Financial Instruments.” ASU 2016-13 replaces the incurred loss impairment methodology with a methodology that reflects expected credit losses and requires consideration of a broader range of reasonable and supportable information to inform credit loss estimates. In connection with recognizing credit losses on accounts receivable and other financial instruments, Cintas now uses a forward-looking expected loss model rather than the incurred loss model. Adoption of ASU 2016-13 requires using a modified retrospective approach through a cumulative-effect adjustment to retained earnings as of the effective date to align existing credit loss methodology with the new standard. This standard was adopted by Cintas on June 1, 2020 and did not have a material impact on the Company's consolidated financial statements.\nNo other new accounting pronouncement recently issued or newly effective had or is expected to have a material impact on the consolidated financial statements.\nNote 2. Revenue Recognition\nThe following table presents Cintas' total revenue disaggregated by operating segment for the fiscal years ended May 31:\nFire Protection Services and Uniform Direct Sales operating segments are included within All Other as disclosed in Note 14 entitled Operating Segment Information.\nRevenue Recognition Policy\nApproximately 95% of the Company's revenues are derived from fees for route servicing of Uniform Rental and Facility Services, First Aid and Safety Services and Fire Protection Services, performed by a Cintas employee-partner, at the customer's location of business. Revenue from our route servicing customer contracts represent a single-performance obligation. The Company recognizes revenue over time as services are performed based on the nature of services provided and contractual rates (output method) or at a point in time when the performance\nobligation under the terms of the contract with a customer are satisfied, at the customer's location of business. The Company's remaining revenue, primarily within the Uniform Direct Sales operating segment, and representing approximately 5% of the Company's total revenue, is recognized when the obligations under the terms of a contract with a customer are satisfied. This generally occurs when the goods are transferred to the customer.\nRevenue recorded is presented net of sales and other taxes we collect on behalf of governmental authorities. Shipping and handling costs charged to customers are treated as fulfillment activities and are recorded in both revenue and cost of sales at the time control is transferred to the customer. Certain of our customer contracts include pricing terms and conditions that include components of variable consideration. The variable consideration is typically in the form of consideration paid to a customer based on performance metrics specified within the contract. Specifically, some contracts contain discounts or rebates that the customer can earn through the achievement of specified volume levels. Each component of variable consideration is earned based on the Company's actual performance during the measurement period specified within the contract. To determine the transaction price, the Company estimates the variable consideration using the most likely amount method, based on the specific contract provisions and known performance results during the relevant measurement period. When determining if variable consideration should be constrained, the Company considers whether factors outside its control could result in a significant reversal of revenue. In making these assessments, the Company considers the likelihood and magnitude of a potential reversal. The Company's performance period generally corresponds with the monthly invoice period. No constraints on our revenue recognition were applied during the fiscal years ended May 31, 2021, 2020 or 2019. The Company reassesses these estimates during each reporting period. Cintas maintains a liability for these discounts and rebates within accrued liabilities on the consolidated balance sheets. Variable consideration also includes consideration paid to a customer at the beginning of a contract. Cintas capitalizes this consideration and amortizes it over the life of the contract as a reduction to revenue in accordance with ASU 2014-08, \"Revenue from Contracts with Customers (Topic 606).\" These assets are included in other assets, net on the consolidated balance sheets.\nAdditionally, in accordance with Topic 606, certain Uniform Direct Sales operating segment customer contracts contain a provision with an enforceable right of payment and the underlying product has no alternative use to Cintas. Consequently, when both aforementioned provisions are prevalent in a customer contract, the revenue is recorded for finished goods that the customer is obligated to purchase under the termination terms of the contract.\nCosts to Obtain a Contract\nThe Company capitalizes commission expenses paid to our employee-partners when the commissions are deemed to be incremental for obtaining the route servicing customer contract. As permitted by Topic 606, the Company has elected to apply the guidance to a portfolio of contracts (or performance obligations) with similar characteristics because the Company reasonably expects that the effects on the consolidated financial statements of applying this guidance to the portfolio would not differ materially from applying this guidance to the individual contracts within the portfolio. The Company also continues to expense certain costs to obtain a contract if those costs do not meet the criteria of the new standard or the amortization period of the asset would have been one year or less. The deferred commissions are amortized on a straight-line basis over the expected period of benefit. We review the deferred commission balances for impairment on an ongoing basis. Deferred commissions are classified as current or noncurrent based on the timing of when we expect to recognize the expense. The current portion is included in prepaid expenses and other current assets and the noncurrent portion is included in other assets, net on the Company's consolidated balance sheets. As of May 31, 2021 the current and noncurrent assets related to deferred commissions totaled $79.4 million and $227.1 million, respectively. As of May 31, 2020 the current and noncurrent assets related to deferred commissions totaled $76.2 million and $227.1 million, respectively. We recorded amortization expense related to deferred commissions of $83.1 million, $77.8 million and $71.1 million during the fiscal years ended May 31, 2021, 2020 and 2019, respectively. These expenses are classified in selling and administrative expenses on the consolidated statements of income.\nNote 3. Fair Value Disclosures\nAll financial instruments that are measured at fair value on a recurring basis (at least annually) have been classified within the most appropriate level within the fair value hierarchy based on the inputs used to determine the fair value at the consolidated balance sheet date. These financial instruments measured at fair value on a recurring basis are summarized below:\nCintas' cash and cash equivalents are generally classified within Level 1 or Level 2 of the fair value hierarchy. Financial instruments classified as Level 1 are based on quoted market prices in active markets, and financial instruments classified as Level 2 are based on quoted market prices, broker or dealer quotations or alternative pricing sources with reasonable levels of price transparency. The types of financial instruments Cintas classifies within Level 1 include most bank deposits and money market securities. Cintas does not adjust the quoted market price for such financial instruments.\nThe fair values of outstanding interest rate lock agreements are included in other assets, net and long-term accrued liabilities at both May 31, 2021 and 2020. The fair values of Cintas' interest rate lock agreements are based on similar exchange traded derivatives (market approach) and are, therefore, included within Level 2 of the fair value hierarchy. The fair value was determined by comparing the locked rates against the benchmarked treasury rate. No other amounts included in other asset, net or long-term accrued liabilities are recorded at fair value on a recurring basis.\nThe methods described above may produce a fair value that may not be indicative of net realizable value or reflective of future fair values. Furthermore, while Cintas believes its valuation methods are appropriate and consistent with other market participants, the use of different methodologies or assumptions to determine the fair value of certain financial instruments could result in a different estimate of fair value at the consolidated balance sheet dates.\nIn addition to assets and liabilities that are recorded at fair value on a recurring basis, Cintas records assets and liabilities at fair value on a nonrecurring basis as required under U.S. GAAP. The assets and liabilities measured at fair value on a nonrecurring basis primarily relate to assets revalued in an impairment analysis and assets and liabilities acquired in a business acquisition.\nNote 4. Property and Equipment\nCintas' property and equipment is summarized as follows at May 31:\nCintas capitalizes certain expenditures for software that are purchased or internally developed for use in business. Included in equipment at May 31, 2021 and 2020, were $283.8 million and $273.0 million, respectively, of internal use software. Amortization of internal use software begins when the software is ready for service and continues on the straight-line method over the estimated useful life, generally 10 years. Accumulated amortization related to internal use software was $154.1 million and $131.7 million at May 31, 2021 and 2020, respectively. We recorded amortization expense related to internal use software of $22.3 million, $21.5 million and $21.6 million for the fiscal years ended May 31, 2021, 2020 and 2019, respectively. These expenses are classified in selling and administrative expenses on the consolidated statements of income.\nNote 5. Investments\nAt May 31, 2021, investments were $274.6 million and include the cash surrender value of insurance policies of $252.1 million, equity method investments of $19.4 million and cost method investments of $3.1 million. At May 31, 2020, investments were $214.8 million and include the cash surrender value of insurance policies of $192.7 million, equity method investments of $19.0 million and cost method investments of $3.1 million. Investments are evaluated for impairment on an annual basis or when indicators of impairment exist. For fiscal years 2021, 2020 and 2019, no impairment losses were recorded.\nDuring fiscal 2019, Cintas sold a cost method investment to a third party. Proceeds from the sale were $73.3 million, which resulted in a pre-tax gain of $69.4 million.\nNote 6. Goodwill, Service Contracts and Other Assets\nChanges in the carrying amount of goodwill and service contracts by reportable operating segment and All Other, are presented in the following tables:\nInformation regarding Cintas' service contracts and other assets is as follows as of May 31:\n(1) The current portion of capitalized contract costs, included in prepaid expenses and other current assets on the consolidated balance sheets as of May 31, 2021 and 2020, is $79.4 million and $76.2 million, respectively.\nAmortization expense for service contracts and other assets for continuing operations was $141.9 million, $140.8 million and $134.0 million for the fiscal years ended May 31, 2021, 2020 and 2019, respectively. At May 31, 2021, the weighted average amortization period for service contracts, capitalized contract costs, noncompete and consulting agreements and other was 14 years, 7 years, 5 years and 10 years, respectively. As of May 31, 2021, the estimated future amortization expense for service contracts and other assets for continuing operations, excluding any future acquisitions and commissions to be earned, is as follows:\nNote 7. Debt and Derivatives\nCintas' outstanding debt is summarized as follows at May 31:\n(1) Cintas assumed these senior notes with the acquisition of G&K in the fourth quarter of fiscal 2017, and they were recorded at fair value. The interest rate shown above is the effective interest rate. The principal amount of these notes is $50.0 million with a stated interest rate of 3.73%.\n(2) Cintas assumed these senior notes with the acquisition of G&K in the fourth quarter of fiscal 2017, and they were recorded at fair value. The interest rate shown above is the effective interest rate. The principal amount of these notes is $50.0 million with a stated interest rate of 3.88%.\nThe average interest rate for all Cintas debt at May 31, 2021 was 3.8%, with maturity dates through fiscal year 2037. Cintas' senior notes, excluding the G&K senior notes assumed with the acquisition of G&K in fiscal 2017, are recorded at cost, net of debt issuance costs. The fair value of the long-term debt is estimated using Level 2 inputs based on general market prices. The carrying value and fair value of Cintas' debt as of May 31, 2021 were $2,550.0 million and $2,788.8 million, respectively, and as of May 31, 2020 were $2,550.0 million and $2,804.2 million, respectively. During the fiscal year ended May 31, 2020, Cintas paid a net total of $112.5 million of commercial paper. On June 1, 2021, in accordance with the terms of the notes, Cintas paid the $250.0 million aggregate principal amount of its 4.30%, 10-year senior notes that matured on that date with cash on hand. There was no commercial paper outstanding during fiscal 2021.\nLetters of credit outstanding were $120.6 million at both May 31, 2021 and 2020. Maturities of debt during each of the next five years are $900.0 million, $350.0 million, $0.0 million, $50.0 million and $0.0 million, respectively.\nInterest paid was $98.3 million, $105.5 million and $101.8 million for the fiscal years ended May 31, 2021, 2020 and 2019, respectively.\nThe credit agreement that supports our commercial paper program was amended and restated on May 24, 2019. The amendment increased the capacity of the revolving credit facility from $600.0 million to $1.0 billion and created a new term loan of $200.0 million. The credit agreement has an accordion feature that provides Cintas the ability to request increases to the borrowing commitments under either the revolving credit facility or the term loan of up to $250.0 million in the aggregate, subject to customary conditions. The maturity date of the revolving credit facility is May 23, 2024. As of May 31, 2021 and 2020, there was no commercial paper outstanding and no borrowings on our revolving credit facility.\nCintas uses interest rate locks to manage its overall interest expense as interest rate locks effectively change the interest rate of specific debt issuances. The interest rate locks are entered into to protect against unfavorable movements in the benchmark treasury rate related to forecasted debt issuances. Cintas used interest rate lock agreements to hedge against movements in the treasury rates at the time Cintas issued its senior notes in fiscal 2007, fiscal 2012, fiscal 2013 and fiscal 2017. The amortization of the cash flow hedges resulted in a decrease to other comprehensive income (loss) of $1.4 million, $1.4 million and $1.2 million in the fiscal years ended May 31, 2021, 2020 and 2019, respectively. During fiscal 2020 and 2019, Cintas entered into interest rate lock agreements with a total notional value of $950.0 million and $500.0 million, respectively, for forecasted debt issuances in connection with upcoming debt maturities.\nThe fair values of the outstanding interest rate lock agreements is summarized as follows at May 31:\nThe interest rate locks are also recorded in other comprehensive income (loss), net of tax. These interest rate locks had no impact on net income or cash flows from continuing operations for the fiscal years ended May 31, 2021, 2020 or 2019.\nCintas has certain covenants related to debt agreements. These covenants limit Cintas' ability to incur certain liens, to engage in sale-leaseback transactions and to merge, consolidate or sell all or substantially all of Cintas' assets. These covenants also require Cintas to maintain certain debt to consolidated EBITDA and interest coverage ratios. Cross-default provisions exist between certain debt instruments. If a default of a significant covenant were to occur, the default could result in an acceleration of the maturity of the indebtedness, impair liquidity and limit the ability to raise future capital. Cintas was in compliance with all of the debt covenants for all periods presented.\nAs of May 31, 2020, the Company had unrecognized inventory purchase commitments with various suppliers totaling $117.6 million, respectively. All unrecognized inventory purchase commitments outstanding at May 31, 2020 were satisfied during fiscal 2021.\nNote 8. Leases\nCintas has operating leases for certain operating facilities, vehicles and equipment, which provide the right to use the underlying asset and require lease payments over the term of the lease. Each new contract is evaluated to determine if an arrangement contains a lease and whether that lease meets the classification criteria of a finance or operating lease. All identified leases are recorded on the consolidated balance sheet with a corresponding operating lease right-of-use asset, net, representing the right to use the underlying asset for the lease term and the operating lease liabilities representing the obligation to make lease payments arising from the lease. Short-term operating leases, which have an initial term of 12 months or less, are not recorded on the consolidated balance sheet.\nOperating lease right-of-use assets, net and operating lease liabilities are recognized at the commencement date of the lease based on the present value of lease payments over the lease term and include options to extend or terminate the lease when they are reasonably certain to be exercised. The present value of lease payments is determined primarily using the incremental borrowing rate based on the information available at lease commencement date. Lease expense for operating leases is recorded on a straight-line basis over the lease term and variable lease costs are recorded as incurred. Both lease expense and variable lease costs are primarily recorded in cost of uniform rental and facility services and other on the Company's consolidated statements of income. The Company's lease agreements do not contain any material residual value guarantees or material restrictive covenants.\nOperating lease costs, including short-term lease expense and variable lease costs, which were immaterial in each period, were $71.0 million, $70.4 million and $69.7 million for the fiscal years ended May 31, 2021, 2020 and 2019, respectively.\nThe following table provides supplemental information related to the Company's consolidated statements of cash flows for the fiscal years ended May 31:\nOther information related to the operating lease right-of-use assets, net and operating lease liabilities was as follows at May 31:\nThe contractual future minimum lease payments of Cintas' operating lease liabilities by fiscal year are as follows as of May 31, 2021:\nNote 9. Income Taxes\nIncome before income taxes for continuing operations consists of the following components for the fiscal years ended May 31:\nIncome tax expense (benefit) for continuing operations consists of the following components for the fiscal years ended May 31:\nReconciliation of income tax expense (benefit) for continuing operations using the statutory rate and actual income tax expense is as follows for the fiscal years ended May 31:\n(1) Primarily consists of the excess tax benefits related to stock-based compensation.\n(2) Primarily consists of adjustments for uncertain tax positions and tax credits.\nThe components of deferred income taxes included on the consolidated balance sheets are as follows at May 31:\nAlthough realization is not assured, management has evaluated its deferred tax assets to determine whether a valuation allowance is required or should be adjusted. This evaluation considers, among other items, the nature, frequency and amount of recent losses, reversal periods of taxable temporary differences, duration of statutory periods and tax planning strategies. As a result of this analysis, management believes it is more likely than not that the recorded deferred tax assets, net of valuation allowances, will be realized.\nThe progression of the valuation allowance is as follows at May 31:\nIncome taxes paid were $245.5 million, $160.3 million and $173.2 million for the fiscal years ended May 31, 2021, 2020 and 2019, respectively.\nAs of May 31, 2021 and 2020, there was $34.2 million and $35.9 million, respectively, in total unrecognized tax benefits, which, if recognized, would favorably impact Cintas' effective tax rate. Cintas recognizes interest accrued related to unrecognized tax benefits and penalties in income tax expense in the consolidated statements of income, which is consistent with the recognition of these items in prior reporting periods. The total amount accrued for interest and penalties as of May 31, 2021 and 2020, was $4.2 million and $3.7 million, respectively. Cintas records this tax liability in long-term accrued liabilities on the consolidated balance sheets.\nA reconciliation of the beginning and ending amount of the gross unrecognized tax benefits (exclusive of interest and penalties) is as follows:\nThe majority of Cintas' operations are in North America. Cintas is required to file federal income tax returns, as well as state income tax returns in a majority of the domestic states and also in certain Canadian provinces. At times, Cintas is subject to audits in these jurisdictions. The audits, by nature, are sometimes complex and can require several years to resolve. The final resolution of any such tax audit could result in either a reduction in Cintas' accruals or an increase in its income tax provision, either of which could have an impact on the consolidated results of operation in any given period.\nAll U.S. federal income tax returns are closed to audit through fiscal 2017. Cintas is currently in various audits in certain foreign jurisdictions and certain domestic states. The years under foreign and domestic state audits cover fiscal years back to 2014. Based on the resolution of the various audits and other potential regulatory developments, it is expected that the balance of unrecognized tax benefits will not materially change for the fiscal year ending May 31, 2022.\nForeign Withholding Tax\nThe Company asserts that all foreign earnings will be indefinitely reinvested, with the exception of certain foreign investments in which earnings and cash generation are in excess of local needs. With the passage of the Tax Act in the U.S., dividends of earnings from non-U.S. operations are generally no longer subject to U.S. income tax. Cintas continues to analyze the estimated impact of the non-U.S. income and withholding tax liabilities based on the source of these earnings, as well as the expected means through which those earnings may be taxed; however, the unrecorded tax is not material.\nNote 10. Employee Benefit Plans\nPension Plans\nIn conjunction with the acquisition of G&K in fiscal 2017, Cintas assumed the Pension Plan that covers substantially all legacy G&K employees who were employed as of July 1, 2005, except certain employees who were covered by union-administered plans. Benefits are based on the number of years of service and each employee’s compensation near retirement. We will make annual contributions to the Pension Plan consistent with federal funding requirements. The Pension Plan was frozen by G&K effective December 31, 2006. Future growth in benefits will not occur beyond this date. Applicable accounting standards require that the consolidated balance sheets reflect the funded status of the Pension Plan. The funded status of the Pension Plan is measured as the difference between the plan assets at fair value and the PBO. The PBO represents the actuarial present value of benefits expected to be paid upon retirement based on estimated future compensation levels. The measurement of the PBO is based on the Company’s estimates and actuarial valuations. The net pension liability at May 31, 2021 and 2020 is included in long-term accrued liabilities on the consolidated balance sheets. Unrecognized differences between actual amounts and estimates based on actuarial assumptions are included in accumulated other comprehensive income (loss) on our consolidated balance sheets. The difference between actual amounts and estimates based on actuarial assumptions are recognized in other comprehensive income (loss), net of tax, in the period in which they occur. The estimated amortization from accumulated other comprehensive income (loss) into net periodic benefit cost during fiscal year 2022 is immaterial.\nThe net pension liability of $21.5 million and $37.0 million was included in long-term accrued liabilities on the consolidated balance sheets as of May 31, 2021 and 2020, respectively. An unrecognized net actuarial loss of $5.0 million and $16.2 million related to the Pension Plan was included in \"other\" within the accumulated other comprehensive income (loss) on the consolidated balance sheets at May 31, 2021 and 2020, respectively.\nThe components of net periodic pension benefit are summarized as follows for the fiscal years ended May 31:\nAssumptions\nThe following weighted average assumptions were used to determine benefit obligations for the Pension Plan for the fiscal years ended May 31 :\nThe following weighted average assumptions were used to determine net periodic pension benefit for the Pension Plan for the fiscal years ended May 31:\nPlan Assets\nThe asset allocations in the Pension Plan at May 31, 2021 and 2020 are as follows:\nOur investment committee, assisted by outside consultants, evaluates the objectives and investment policies concerning our long-term investment goals and asset allocation strategies. Plan assets are invested in various asset classes that are expected to produce a sufficient level of diversification and investment return over the long term. To develop the expected long-term rate of return on asset assumptions, we consider the historical returns and future expectations of returns for each asset class, as well as the target asset allocation, changes in investments expenses and investment goals of the pension portfolio. This resulted in the selection of 4.25% expected return on plan assets for fiscal year 2021 and 4.80% expected return on plan assets for fiscal year 2020. The investment goals are (1) to meet or exceed the assumed actuarial rate of return over the long term within reasonable and prudent levels of risk, and (2) to preserve the real purchasing power of assets to meet future obligations. The nature and duration of benefit obligations, along with assumptions concerning asset class returns and return correlations, are considered when determining an appropriate asset allocation to achieve the investment objectives. Pension plan assets for our qualified pension plans are held in a trust for the benefit of the plan participants and are invested in a diversified portfolio of equity investments, fixed income investments and cash. Risk targets are established and monitored against acceptable ranges. All investment policies and procedures are designed to ensure that the plans' investments are in compliance with the Employee Retirement Income Security Act. Guidelines are established defining permitted investments within each asset class.\nThe implementation of the investment strategy discussed above is executed through a variety of investment types, including U.S. government securities, corporate debt and mutual funds. The mutual fund investments are valued at the closing price reported on the active market on which the individual securities are traded and are not adjusted from the quoted active market price at the consolidated balance sheet date. The remaining investments, primarily corporate debt, are valued using unadjusted observable inputs such as third-party quoted prices for similar assets or liabilities, quoted prices in markets that are not active or other inputs that are observable or can be corroborated by observable market data for the assets or liabilities.\nThe methods described above may produce a fair value calculation that may not be indicative of net realizable value or reflective of future fair values. Furthermore, while we believe our valuation methods are appropriate and consistent with other market participants, the use of different methodologies or assumptions to determine the fair value of certain financial instruments could result in a different fair value measurement at the consolidated balance sheet date.\nInformation on the Pension Plan investments, using the fair value hierarchy discussed in Note 1 entitled Significant Accounting Polices, is as follows as of May 31:\nWe expect to make contributions of approximately $0.3 million to the Pension Plan during the next 12 months. The Pension Plan benefit payments expected to be paid for each of the next five years and thereafter are $4.1 million, $4.2 million, $4.4 million, $4.5 million, $4.7 million and $25.0 million, respectively.\nFuture changes in plan asset returns, assumed discount rates and various other factors related to the Pension Plan will impact future net periodic pension benefit (cost) and liabilities. We cannot predict the impact of these changes in the future, and any changes may have a material impact on our consolidated results of operations and consolidated financial position.\nCintas also administers a pension plan that was assumed in a previous acquisition and has historically been deemed immaterial for disclosure purposes. As of May 31, 2021 and 2020, the fair value of this pension plan's total assets was $9.2 million and $7.3 million, respectively, and the PBO was $8.9 million and $9.4 million, respectively.\nNon-Contributory Retirement Plans\nCintas' Partners' Plan (the Plan) is a non-contributory profit sharing plan and Employee Stock Ownership Plan (ESOP) for the benefit of substantially all U.S. Cintas employee-partners who have completed one year of service. The Plan also includes a 401(k) savings feature covering substantially all U.S. employee-partners. The amounts of contributions to the Plan and ESOP, as well as the matching contribution to the 401(k), are made at the discretion of the Board of Directors. Total contributions, including Cintas' matching contributions, which approximate cost, were $75.6 million, $74.3 million and $67.6 million for the fiscal years ended May 31, 2021, 2020 and 2019, respectively. The expense associated with these contributions was recorded in selling and administrative expenses on the consolidated statements of income.\nCintas has a non-contributory deferred profit sharing plan (DPSP), which covers substantially all Canadian employee-partners. In addition, a registered retirement savings plan (RRSP) is offered to those employees. The amounts of contributions to the DPSP, as well as the matching contribution to the RRSP, are made at the discretion of the Board of Directors. Total contributions, which approximate cost, were $3.1 million, $2.6 million and $2.5 million for the fiscal years ended May 31, 2021, 2020 and 2019, respectively.\nCintas has a supplemental executive retirement plan (SERP) subject to Section 409A of the Internal Revenue Code for the benefit of certain highly compensated Cintas employee-partners. The SERP allows participants to defer the receipt of compensation which would otherwise become payable to them. Matching contributions are made at the discretion of the Board of Directors. Total matching contributions, which approximates cost, were $9.1 million, $8.4 million and $8.6 million for the fiscal years ended May 31, 2021, 2020 and 2019, respectively. The expense associated with these contributions was recorded in selling and administrative expenses on the consolidated statements of income.\nNote 11. Earnings per Share\nCintas uses the two-class method to calculate basic and diluted earnings per share as a result of outstanding participating securities in the form of restricted stock awards. See Note 12 entitled Stock-Based Compensation for additional information on restricted stock awards. The following tables set forth the computation of basic and diluted earnings per share from continuing operations using the two-class method for amounts attributable to Cintas' common shares for the fiscal years ended May 31:\nBasic and diluted earnings per share from discontinued operations were calculated using the two-class method. There were no discontinued operations for the fiscal year ended May 31, 2021. Basic earnings per share from discontinued operations rounded to $0.00 and $0.02 for the fiscal years ended May 31, 2020 and 2019, respectively. Diluted earnings per share from discontinued operations rounded to $0.00 and $0.02 for the fiscal years ended May 31, 2020 and 2019, respectively.\nFor the fiscal years ended May 31, 2021, 2020 and 2019, options granted to purchase 0.2 million, 0.2 million and 0.5 million shares of Cintas common stock, respectively, were excluded from the computation of diluted earnings per share. The exercise prices of these options were greater than the average market price of the common shares (anti-dilutive).\nOn August 2, 2016, we announced that the Board of Directors authorized a $500.0 million share buyback program. This program was completed in November 2018. On October 30, 2018, we announced that the Board of Directors authorized a $1.0 billion share buyback program. This program was completed in January 2021. On October 29, 2019, we announced the Board of Directors authorized a new $1.0 billion share buyback program, which does not have an expiration date.\nThe following table summarizes the buyback activity by program and fiscal year ended May 31:\nIn the period subsequent to May 31, 2021, through July 28, 2021, we completed the October 29, 2019 program by purchasing 1.6 million shares of Cintas common stock at an average price of $365.41 for a total purchase price of $581.2 million. From the inception of the October 29, 2019 program through July 28, 2021, Cintas has purchased a total of 2.8 million shares of Cintas common stock at an average price of $358.93 per share for a total purchase price of $1.0 billion.\nIn addition to the buyback programs, Cintas acquired shares of Cintas common stock in satisfaction of employee payroll taxes due on restricted stock awards that vested during the fiscal year. For the fiscal year ended May 31, 2021, Cintas acquired 0.2 million shares at an average price of $302.52 per share for a total purchase price of $74.4 million. For the fiscal year ended May 31, 2020, Cintas acquired 0.3 million shares at an average price of $260.89 per share for a total purchase price of $68.8 million. For the fiscal year ended May 31, 2019, Cintas acquired 0.3 million shares at an average price of $204.50 per share for a total purchase price of $62.9 million.\nNote 12. Stock-Based Compensation\nOn August 2, 2016, the Board of Directors approved and adopted the Cintas Corporation 2016 Equity and Incentive Compensation Plan (the 2016 Plan) to replace the Cintas' 2005 Equity Compensation Plan, as amended (the 2005 Plan). The 2016 Plan was approved by Cintas shareholders at its Annual Meeting on October 18, 2016, at which time the 2016 Plan became effective. Under the 2016 Plan, Cintas may grant officers and key employee-partners equity compensation in the form of stock options, stock appreciation rights, restricted and unrestricted stock awards, performance awards and other stock unit awards representing up to an aggregate of 12,500,000 shares of Cintas' common stock. Any shares of common stock that remained available under the 2005 Plan became part of the total available share balance of 12,500,000 shares under the 2016 Plan. At May 31, 2021, 6,358,437 shares of common stock were reserved for future issuance under the 2016 Plan. Total compensation cost for stock-based awards for continuing operations was $112.0 million, $115.4 million and $139.2 million for the fiscal years ended May 31, 2021, 2020 and 2019, respectively. Cintas accounts for forfeitures of stock-based awards as they occur. The total income tax benefit recognized in the consolidated statements of income for share-based compensation arrangements for continuing operations was $28.6 million, $29.2 million and $34.0 million for the fiscal years ended May 31, 2021, 2020 and 2019, respectively.\nStock Options\nStock options are granted at the fair market value of the underlying common stock on the date of grant. The option terms are determined by the Compensation Committee of the Board of Directors, but no stock option may be exercised later than 10 years after the date of the grant. The option awards generally have 10-year terms with graded vesting in years 3 through 5 based on continuous service during that period. Cintas recognizes compensation expense for these options using the straight-line recognition method over the vesting period.\nThe fair value of options was estimated at the date of grant using a Black-Scholes option-pricing model with the following assumptions for the fiscal years ended May 31:\nThe risk-free interest rate is based on U.S. government issues with a remaining term equal to the expected life of the stock options. The determination of expected volatility is based on historical volatility of Cintas' common stock over the period commensurate with the expected term of stock options, as well as other relevant factors. The weighted average expected term was determined based on the historical employee exercise behavior of the options. The weighted-average fair value of stock options granted during fiscal 2021, 2020 and 2019 was $66.52, $48.20 and $47.68, respectively.\nThe information presented in the following table relates primarily to stock options granted and outstanding under either the 2016 Plan or under previously adopted plans:\nThe intrinsic value of stock options exercised was $402.3 million, $262.1 million and $193.6 million for the fiscal years ended May 31, 2021, 2020 and 2019, respectively. The total cash received from employees as a result of employee stock option exercises for the fiscal years ended May 31, 2021, 2020 and 2019 was $130.0 million, $90.5 million and $65.4 million, respectively.\nThe fair value of stock options vested was $30.5 million, $27.8 million and $22.4 million for the fiscal years ended May 31, 2021, 2020 and 2019, respectively.\nThe following table summarizes the information related to stock options outstanding at May 31, 2021:\nAt May 31, 2021, the aggregate intrinsic value of stock options outstanding and exercisable was $983.6 million and $409.1 million, respectively. The weighted-average remaining contractual term of stock options exercisable is 4.1 years.\nRestricted Stock Awards\nRestricted stock awards consist of Cintas' common stock that is subject to such conditions, restrictions and limitations as the Compensation Committee of the Board of Directors determines to be appropriate. The vesting period is generally three years after the grant date. The recipient of restricted stock awards will have all rights of a shareholder of Cintas, including the right to vote and the right to receive cash dividends during the vesting period. Cintas recognizes compensation expense for these restricted stock awards using the straight-line recognition method over the vesting period.\nThe information presented in the following table relates to restricted stock awards granted and outstanding under either the 2016 Plan or under previously adopted plans:\nThe remaining unrecognized compensation cost related to unvested stock options and restricted stock at May 31, 2021 was $224.0 million. The weighted-average period of time over which this cost will be recognized is 1.98 years.\nNote 13. Accumulated Other Comprehensive Income (Loss)\nThe following table summarizes the changes in the accumulated balances for each component of accumulated other comprehensive income (loss), net of tax:\n(1) Effective June 1, 2019, Cintas adopted ASU 2018-02, on a prospective basis, which resulted in this reclassification adjustment of the stranded tax effects from retained earnings to accumulated other comprehensive income that was determined using a specific identification method.\nThe following table summarizes the reclassifications out of accumulated other comprehensive income (loss) during the fiscal years ended May 31:\nNote 14. Operating Segment Information\nCintas’ reportable operating segments are Uniform Rental and Facility Services and First Aid and Safety Services. The Uniform Rental and Facility Services reportable operating segment, consists of the rental and servicing of uniforms and other garments including flame resistant clothing, mats, mops and shop towels and other ancillary items. In addition to these rental items, restroom cleaning services and supplies, and the sale of items from our catalogs to our customers on route are included within this reportable operating segment. The First Aid and Safety Services reportable operating segment consists of first aid and safety products and services. The remainder of Cintas’ operating segments, which consists of the Fire Protection Services operating segment and the Uniform Direct Sale operating segment, is included in All Other.\nCintas evaluates the performance of each operating segment based on several factors of which the primary financial measures are operating segment revenue and income before income taxes. The accounting policies of the operating segments are the same as those described in Note 1 entitled Significant Accounting Policies. Information related to the operations of Cintas' reportable operating segments and All Other is set forth below:\n(1) Corporate assets represent the consolidated cash balance in all periods presented.",
    "item_9": "Item 9. Changes in and Disagreements with\nAccountants on Accounting and Financial Disclosure\nNone.",
    "item_9A": "Item 9A. Controls and Procedures\nDisclosure Controls and Procedures\nWith the participation of Cintas' management, including Cintas' President and Chief Executive Officer, Chief Financial Officer, General Counsel and Controllers, Cintas has evaluated the effectiveness of the disclosure controls and procedures (as defined in Rules 13a-15(e) and 15d-15(e) under the Securities Exchange Act of 1934 (the Exchange Act) as of May 31, 2021. Based on such evaluation, Cintas' management, including Cintas' President and Chief Executive Officer, Chief Financial Officer, General Counsel and Controllers, have concluded that Cintas' disclosure controls and procedures were effective as of May 31, 2021, in ensuring (i) information required to be disclosed by Cintas in the reports that it files or submits under the Exchange Act is recorded, processed, summarized and reported, within the time periods specified in the SEC's rules and forms and (ii) information required to be disclosed by Cintas in the reports that it files or submits under the Exchange Act is accumulated and communicated to Cintas' management, including its principal executive and principal financial officers, or persons performing similar functions, as appropriate to allow timely decisions regarding required disclosure.\nInternal Control over Financial Reporting\nManagement's Report on Internal Control over Financial Reporting and the Report of Ernst & Young LLP, Independent Registered Public Accounting Firm thereon are set forth in Part II, Item 8 of this Annual Report on Form 10-K and are incorporated by reference herein.\nThere were no changes in Cintas' internal control over financial reporting (as defined in Rules 13a-15(f) and 15d-15(f) under the Exchange Act) during the fiscal quarter ended May 31, 2021, that have materially affected, or are reasonably likely to materially affect, Cintas' internal control over financial reporting.",
    "item_9B": "Item 9B. Other Information\nNone.",
    "item_9C": "Item 9C. Disclosure Regarding\nForeign Jurisdictions that Prevent Inspections\nNot applicable.\nPart III",
    "item_10": "Item 10. Directors, Executive Officers and Corporate Governance\nThe information required under this item is incorporated herein by reference to the material contained in Cintas' definitive proxy statement for the 2021 annual meeting of shareholders to be filed with the SEC pursuant to Regulation 14A not later than 120 days after the close of the fiscal year (the Proxy Statement).",
    "item_11": "Item 11. Executive Compensation\nThe information required under this item is incorporated herein by reference to the material contained in the Proxy Statement.",
    "item_12": "Item 12. Security Ownership of Certain Beneficial\nOwners and Management and Related Stockholder Matters\nThe information required under this item is incorporated herein by reference to the material contained in the Proxy Statement, except that the information required by Item 201(d) of Regulation S-K can be found below.\nThe following table provides information about Cintas' common stock that may be issued under Cintas' equity compensation plans as of May 31, 2021.\n(1) Excludes 1,241,223 unvested restricted stock units.",
    "item_13": "Item 13. Certain Relationships and\nRelated Transactions, and Director Independence\nThe information required under this item is incorporated herein by reference to the material contained in the Proxy Statement.",
    "item_14": "Item 14. Principal Accountant Fees and Services\nThe information required under this item is incorporated herein by reference to the material contained in the Proxy Statement.\nPart IV",
    "item_15": "Item 15. Exhibits and Financial Statement Schedules\n(a) (1) Financial Statements. All financial statements required to be filed by Item 8 of Form 10-K and included in this Annual Report are listed in Item 8. No additional financial statements are filed because the requirements of paragraph (c) under Item 15 are not applicable to Cintas.\n(a) (2) Financial Statement Schedule:\nFor each of the three years in the period ended May 31, 2021.\nSchedule II: Valuation and Qualifying Accounts and Reserves.\nAll other schedules are omitted because they are not applicable, or not required, or because the required information is included in the Consolidated Financial Statements or Notes thereto.\n(a) (3) Exhibits.\nAll documents referenced below were filed pursuant to the Exchange Act by Cintas Corporation, file number 000-11399, unless otherwise noted.\nExhibit\nNumber Description of Exhibit\n2.1\n*** Agreement and Plan of Merger, among Cintas Corporation, G&K Services, Inc. and Bravo Merger Sub, Inc., dated as of August 15, 2016 (Incorporated by reference to Exhibit 2.1 to Cintas' Current Report on Form 8-K filed on August 16, 2016).\n3.1\nRestated Articles of Incorporation, as amended (Incorporated by reference to Exhibit 4.1 to Post Effective Amendment No. 1 to Cintas' Registration Statement No. 333-136631-09 on Form S-3 filed on December 3, 2007).\n3.2\nAmended and Restated By-laws (Incorporated by reference to Exhibit 3.1 to Cintas' Current Report on Form 8-K filed on August 3, 2018).\n4.1\nIndenture dated as of May 28, 2002, among Cintas Corporation No. 2, as issuer, Cintas Corporation, as parent guarantor, the subsidiary guarantors thereto and Wachovia Bank, National Association, as trustee (Incorporated by reference to Exhibit 4.1 to Cintas' Annual Report on Form 10-K for the year ended May 31, 2002).\n4.2\nForm of 6.15% Senior Note due 2036 (Incorporated by reference to Exhibit 4.3 to Cintas' Current Report on Form 8-K filed on August 21, 2006).\n4.3\nForm of 4.30% Senior Note due 2021 (Incorporated by reference to Exhibit 4.2 to Cintas' Current report on Form 8-K filed on May 23, 2011).\n4.4\nForm of 3.25% Senior Note due 2022 (Incorporated by reference to Exhibit 4.1 to Cintas' Current Report on Form 8-K filed on June 8, 2012).\n4.5\nForm of 2.900% Senior Notes due 2022 (Incorporated by reference to Exhibit 4.1 to Cintas' Current Report on Form 8-K filed on March 14, 2017).\n4.6\nForm of 3.700% Senior Notes due 2027 (Incorporated by reference to Exhibit 4.2 to Cintas' Current Report on Form 8-K filed on March 14, 2017).\n4.7\nForm of 3.250% Senior Notes due 2022 (Incorporated by reference to Exhibit 4.3 to Cintas' Current Report on Form 8-K filed on March 14, 2017).\n4.8\nDescription of Securities (Incorporated by reference to Exhibit 4.8 to Cintas' Annual Report on Form 10-K for the year ended May 31, 2019).\n10.1\nSecond Amended and Restated Credit Agreement, dated as of May 24, 2019, among Cintas No. 2, the Lenders party thereto and KeyBank National Association, as Administrative Agent (Incorporated by reference to Exhibit 10.1 to Cintas' Current Report on Form 8-K filed on May 30, 2019).\n10.2\nAmended and Restated Note Purchase Agreement, dated as of March 21, 2017, among G&K Services, Inc. and the Note holders (Incorporated by reference to Exhibit 4.1 to Cintas' Current Report on Form 8-K filed on March 21, 2017).\n10.3 * Partners' Plan (Incorporated by reference to Cintas' Annual Report on Form 10-K for the year ended May 31, 1993).\n10.4\n* First Amendment to Partners' Plan (Incorporated by reference to Exhibit 4.2 to Cintas' Registration Statement No. 33-56623 on Form S-8 filed on November 28, 1994).\n10.5\n* Second Amendment to Partners' Plan (Incorporated by reference to Exhibit 4.3 to Cintas' Registration Statement No. 33-56623 on Form S-8 filed on November 28, 1994).\n10.6\n* Directors' Deferred Compensation Plan (Incorporated by reference to Exhibit 10.12 to Cintas' Quarterly Report on Form 10-Q for the quarter ended November 30, 2000).\n10.7\n* Form of agreement signed by Officers, General/Branch Managers, Professionals and Key Managers, including Executive Officers (Incorporated by reference to Exhibit 10 to Cintas' Quarterly Report on Form 10-Q for the quarter ended February 28, 2005).\n10.8\n* President and CEO Executive Compensation Plan (Incorporated by reference to Exhibit 10.18 to Cintas' Annual Report on Form 10-K for the year ended May 31, 2005).\n10.9\n* 2006 Executive Incentive Plan (Incorporated by reference to Exhibit 10.19 to Cintas' Annual Report on Form 10-K for the year ended May 31, 2005).\n10.10\n* 2005 Equity Compensation Plan (Incorporated by reference to Cintas' Definitive Proxy Statement on Schedule 14A filed on September 1, 2005).\n10.11\n* Criteria for Performance Evaluation of the President and CEO (Incorporated by reference to Exhibit 10.21 to Cintas' Annual Report on Form 10-K for the year ended May 31, 2006).\n10.12\n* 2007 Executive Incentive Plan (Incorporated by reference to Exhibit 10.22 to Cintas' Annual Report on Form 10-K for the year ended May 31, 2006).\n10.13\n* Amendment No. 1 to 2005 Equity Compensation Plan (Incorporated by reference to Exhibit 10.17 to Cintas' Annual Report on Form 10-K for the year ended May 31, 2011).\n10.14\n* Form of Restricted Stock Agreement (Incorporated by reference to Exhibit 10.18 to Cintas' Annual Report on Form 10-K for the year ended May 31, 2011).\n10.15\n* Amendment No. 2 to Cintas Corporation 2005 Equity Compensation Plan (Incorporated by reference to Exhibit 10.1 to Cintas' Current Report on Form 8-K filed on July 27, 2012).\n10.16\n* Form of Restricted Stock Agreement (Incorporated by reference to Exhibit 10.2 to Cintas' Current Report on Form 8-K filed on July 27, 2012).\n10.17\n* Amendment No. 3 to Cintas Corporation 2005 Equity Compensation Plan (Incorporated by reference to Exhibit 10.4 to Cintas' Current Report on Form 8-K filed on October 23, 2013).\n10.18\n* Amendment No. 4 to Cintas Corporation 2005 Equity Compensation Plan (Incorporated by reference to Exhibit 10.5 to Cintas' Current Report on Form 8-K filed on October 22, 2014).\n10.19\n* Cintas Corporation Management Incentive Plan (Incorporated by reference to Exhibit 10.5 to Cintas' Current Report on Form 8-K filed on October 23, 2013).\n10.20\n* Cintas Corporation 2016 Equity and Incentive Compensation Plan (Incorporated by reference to Exhibit 10.1 to Cintas' Current Report on Form 8-K filed on October 20, 2016).\n10.21\n* Amendment No. 1 to Cintas Corporation 2016 Equity and Incentive Compensation Plan (Incorporated by reference to Exhibit 10.1 to Cintas' Quarterly Report on Form 10-Q for the quarter ended November 30, 2017).\nCode of Ethics (Incorporated by reference to Exhibit 14 to Cintas' Annual Report on Form 10-K for the year ended May 31, 2004).\n** Subsidiaries of the Registrant.\n** Subsidiary Guarantors and Issuers of Guaranteed Securities and Affiliates Whose Securities Collateralize Securities of the Registrant.\n** Consent of Independent Registered Public Accounting Firm.\n31.1\n** Certification of Principal Executive Officer, Pursuant to Rule 13a-14(a) of the Securities Exchange Act of 1934.\n31.2\n** Certification of Principal Financial Officer, Pursuant to Rule 13a-14(a) of the Securities Exchange Act of 1934.\n32.1\n** Certification of Chief Executive Officer, Pursuant to 18 U.S.C. § 1350.\n32.2\n** Certification of Chief Financial Officer, Pursuant to 18 U.S.C. § 1350.\n101 The following financial statements from Cintas' Annual Report on Form 10-K for the fiscal year ended May 31, 2021, formatted in Inline XBRL: (i) Consolidated Statements of Income, (ii) Consolidated Statements of Comprehensive Income, (iii) Consolidated Balance Sheets, (iv) Consolidated Statements of Shareholders' Equity, (v) Consolidated Statements of Cash Flows and (vi) Notes to Consolidated Financial Statements, tagged as blocks of text and including detailed tags.\n104 The cover page from Cintas' Annual Report on Form 10-K for the fiscal year ended May 31, 2021, formatted in Inline XBRL (included as Exhibit 101).\n* Management compensatory contracts\n** Filed herewith\n*** Pursuant to Item 601(a)(5), certain exhibits and schedules have been omitted and Cintas agrees to furnish supplementally to the Securities and Exchange Commission a copy of any omitted exhibits upon request.",
    "item_16": "Item 16. Form 10-K Summary\nNone.",
    "stock_ticker": "CTAS"
}