{
    "cik": "804328",
    "company": "QUALCOMM INC/DE",
    "filing_type": "10-K",
    "filing_date": "2020-11-04",
    "period_of_report": "2020-09-27",
    "sic": "3663",
    "state_of_inc": "DE",
    "state_location": "CA",
    "fiscal_year_end": "0927",
    "filing_html_index": "https://www.sec.gov/Archives/edgar/data/804328/0001728949-20-000067-index.html",
    "htm_filing_link": "https://www.sec.gov/Archives/edgar/data/804328/000172894920000067/qcom-20200927.htm",
    "complete_text_filing_link": "https://www.sec.gov/Archives/edgar/data/804328/0001728949-20-000067.txt",
    "filename": "804328_10K_2020_0001728949-20-000067.htm",
    "item_1": "Item 1. Business\nWe incorporated in California in 1985 and reincorporated in Delaware in 1991. We operate and report using a 52-53 week fiscal year ending on the last Sunday in September. Our 52-week fiscal years consist of four equal fiscal quarters of 13 weeks each, and our 53-week fiscal years consist of three 13-week fiscal quarters and one 14-week fiscal quarter. The financial results for our 53-week fiscal years and our 14-week fiscal quarters will not be exactly comparable to our 52-week fiscal years and our 13-week fiscal quarters. The fiscal years ended September 27, 2020 and September 29, 2019 included 52 weeks. The fiscal year ended September 30, 2018 included 53 weeks.\nOverview\nWe are a global leader in the development and commercialization of foundational technologies for the wireless industry. Our technologies and products are used in mobile devices and other wireless products, including network equipment, broadband gateway equipment, consumer electronic devices and other connected devices. Our inventions have helped power the growth in smartphones, which have connected billions of people. We are a leader in 3G (third generation), 4G (fourth generation) and 5G (fifth generation) wireless technologies. Our technologies and products are also used in industry segments or applications beyond mobile, including automotive and internet of things (IoT) (which includes connectivity and networking, computing and fixed wireless broadband), among others. We derive revenues principally from sales of integrated circuit products and licensing of our intellectual property, including patents and other rights.\nThe foundational technologies we invent help power the modern mobile experience, impacting how the world connects, computes and communicates. We share these inventions broadly through our licensing program, enabling wide ecosystem access to technologies at the core of mobile innovation, and through the sale of our wireless integrated circuit platforms (also known as chips or chipsets) and other products. We collaborate across the ecosystem, including manufacturers, operators, developers, system integrators, cloud providers, governments and industry standards organizations, to enable a global environment to drive continued progress and growth.\nWe have a long history of driving innovation. We have played and continue to play a leading role in developing system level inventions that serve as the foundation for 3G, 4G and 5G wireless technologies. This includes the CDMA (Code Division Multiple Access) and OFDMA (Orthogonal Frequency Division Multiple Access) families of technologies, with the latter encompassing LTE (Long Term Evolution) and 5G NR (New Radio), which, along with TDMA (Time Division Multiple Access), are the primary digital technologies currently used to transmit voice or data over radio waves using a public or private cellular wireless network.\nWe own significant intellectual property, including patents, patent applications and trade secrets, applicable to products that implement any version of CDMA and/or OFDMA technologies. Companies in the mobile industry generally recognize that any company seeking to develop, manufacture and/or sell devices or infrastructure equipment that use CDMA-based and/or OFDMA-based technologies will require a license or other rights to use our patents. We also develop and commercialize numerous other key technologies used in mobile and other wireless devices, and we own substantial intellectual property related to these technologies. Some of these inventions are contributed to and commercialized as industry standards, such as certain video and audio codecs, Wi-Fi, GPS (Global Positioning System) and Bluetooth. We have also developed other\ntechnologies that are used by wireless devices that are not related to industry standards, such as operating systems, user interfaces, graphics and camera processing functionality, RF (radio frequency), RFFE (radio frequency front-end) and antenna designs, artificial intelligence (AI) and machine learning techniques and application processor architectures. Our patents cover a wide range of technologies across the entire wireless system (including wireless devices and network infrastructure equipment), not just the portion of such patented technologies incorporated into chipsets.\nWe are organized on the basis of products and services and have three reportable segments. We conduct business primarily through our QCT (Qualcomm CDMA Technologies) semiconductor business and our QTL (Qualcomm Technology Licensing) licensing business. QCT develops and supplies integrated circuits and system software based on 3G/4G/5G and other technologies for use in mobile devices, wireless networks, broadband gateway equipment, consumer electronic devices, other devices used in IoT and automotive systems for telematics and infotainment. QTL grants licenses or otherwise provides rights to use portions of our intellectual property portfolio, which includes certain patent rights essential to and/or useful in the manufacture and sale of certain wireless products. Our QSI (Qualcomm Strategic Initiatives) reportable segment makes strategic investments. We also have nonreportable segments, including Qualcomm Government Technologies or QGOV, our cloud AI inference processing initiative and other technology and service initiatives.\nIndustry Trends\nAs the largest technology platform in the world, mobile has transformed the way we connect, compute and communicate. The scale and pace of innovation in the mobile industry, especially around connectivity and computing technologies, is also impacting industries beyond wireless, empowering new services, new business models and new experiences. Our inventions and licensing program have been integral to, and provided foundational technologies for, the evolution of the mobile industry.\nAdvancing connectivity. 3G and 4G mobile broadband technologies have been key innovations of mobile, providing users with fast, reliable, always-on connectivity. As of September 30, 2020, there were approximately 6.2 billion 3G/4G connections globally, representing 78% of total mobile connections (GSMA Intelligence, November 2020). By 2024, global 3G/4G connections are projected to reach 6.5 billion, with approximately 89% of these connections in emerging regions and China (GSMA Intelligence, November 2020).\n3G networks, first launched in the early 2000s, ushered in the mobile broadband era, serving as a true alternative to traditional desktop internet service, allowing users to experience the internet from virtually anywhere. The combination of faster processing and larger screens with mobile broadband connectivity has transformed how people interact with information and with each other. The launch of 4G in 2010 brought true mobile broadband connectivity to wireless networks. With its faster data rates and greater capacity, 4G has become the foundational technology to many of the applications and services used today, including e-commerce, video streaming, video calling, social media and gaming. 3G and 4G mobile broadband technologies have also helped to strengthen economic and social development globally by providing access to government and healthcare resources and creating new educational and entrepreneurial opportunities.\nWith the first 5G global specifications defined in 2018 by 3GPP (3rd Generation Partnership Project), an industry standards development organization, initial commercial 5G network deployments and device launches, which focus on enhanced mobile broadband services, began in 2019 and will continue into 2021 and beyond. As of September 30, 2020, more than 110 operators have deployed 5G commercial networks in nearly 50 countries and territories, and over 400 operators are investing in 5G (GSA, October 2020). Calendar year 2020 5G global smartphone shipments are expected to reach more than 200 million units (IDC, Mobile Phone Tracker, 2020Q2). With support for multi-gigabit data rates, low latency and greater capacity, 5G enhances mobile broadband services, including ultra-high definition (4K) video streaming and sharing, near-instantaneous access to cloud services, multi-player cloud gaming and AR/VR/XR (augmented reality/virtual reality/extended reality) applications. 5G also brings more capacity and efficiency to cellular networks, which may enable operators to reduce their operating costs and offer new unlimited mobile data plans.\nThe second 5G global specifications defined in 2020 by 3GPP (Release 16) and future releases of 5G are expected to expand the reach of the technology to industries beyond mobile to create new services, business models and experiences, such as automated driving built on the concepts of computer vision, sensor fusion and vehicle-to-vehicle communications. We believe 5G will also enable artificial intelligence-based platforms designed to bring greater autonomy and wireless connectivity to factory automation for more reconfigurable manufacturing and other industrial applications (known as industrial IoT) through ultra-reliable, ultra-low latency communication links. We also expect 5G to connect a significant number of “things” (also known as IoT), including among others, consumer, enterprise, retail, wearable and voice and music devices, with connectivity designed to meet diverse (low) power and cost requirements, as well as to address both low- and high-complexity applications.\nMost 5G devices include multimode support for 3G, 4G and Wi-Fi, enabling service continuity where 5G has yet to be deployed and simultaneous connectivity across 4G technology, while also allowing mobile operators to utilize current network deployments. At the same time, 4G is expected to continue to evolve in parallel with the further development of 5G and become fundamental to many of the key 5G technologies (through multi-connectivity), such as 5G massive IoT leveraging LTE IoT, support for unlicensed spectrum and gigabit LTE user data speeds. The first phase of 5G networks predominantly supports mobile broadband services for smartphones, both in lower spectrum bands below 7 GHz (commonly referred to as sub-6, sub-7 or Frequency Range 1) and in higher bands above 24 GHz (commonly referred to as millimeter wave (mmWave) or Frequency Range 2). As with previous generations of mobile networks, it will take time to deploy new\n5G networks; however, we expect that deployment of 5G networks will be at a faster pace as compared to the transition from 3G to 4G technologies.\nConsumer demand in smartphones. From October 2019 through September 2020, approximately 1.2 billion smartphones are estimated to have shipped globally, representing a year-over-year decrease of approximately 9% primarily driven by the global spread of the coronavirus (COVID-19) pandemic, which negatively impacted consumer demand for smartphones and replacement rates (IDC, Mobile Phone Tracker, 2020Q2). Smartphone shipments in calendar 2021 are expected to increase by approximately 9% year-over-year (IDC Quarterly Mobile Phone Tracker, 2020Q2), reflecting a gradual recovery in demand for smartphones and replacement rates from the negative effects of the COVID-19 pandemic. Looking beyond 2021, we expect replacement rates to moderately lengthen when compared to pre-COVID-19 levels, particularly in developed regions and China, as consumer demand is increasingly driven by new product launches and/or innovation cycles. Consumer demand for new types of experiences, combined with the needs of mobile operators and device manufacturers to provide differentiated features and services, is driving continued innovation within the smartphone industry, across connectivity, processing, AI, multimedia, imaging, audio and more. As a result, the smartphone continues to be the go-to device for social networking, music and video streaming, gaming, email and web browsing, among others. It is expected that the evolution of 5G will fuel further innovation within the smartphone industry to support more intuitive and immersive experiences.\nTransforming other industries. With their significant scale and highly integrated solutions, industries beyond mobile, including automotive and IoT, among others, are leveraging the same technology innovations found in today’s leading smartphones to enhance existing products and services as well as to create new products and services. Our inventions that contribute to the formation of advanced cellular technologies, such as 3G, 4G and now 5G connectivity, are helping to drive, and in the case of 5G accelerate the pace of, this transformation. For example, in the automotive industry, approximately 70% of new vehicles produced in 2025 are projected to have cellular connectivity, compared to 48% in 2019 (Strategy Analytics, October 2020). In addition, the installed base of non-mobile devices with cellular connectivity, which includes IoT devices among others, is projected to grow 190% between 2020 and 2024 (ABI Research, October 2020).\nWireless Technologies Overview\nThe demand in the use of wireless devices worldwide and the demand for data services and applications requires continuous innovation to improve the user experience, support new services, increase network capacity, make use of different frequency bands and allow for dense network deployments. To meet these requirements, different wireless communications technologies continue to evolve. We have a long history of heavily investing in research and development and have developed foundational technologies that drive the continued evolution of the wireless industry, including CDMA and OFDMA. As a result, we have developed and acquired (and continue to develop and acquire) significant related intellectual property. This intellectual property has been incorporated into the most widely accepted and deployed cellular wireless communications technology standards, and we have licensed it to several hundred licensees, including leading wireless device and infrastructure manufacturers.\nCellular wireless technologies. Relevant cellular wireless technologies can be grouped into the following categories.\nTDMA-based. TDMA-based technologies are characterized by their access method allowing several users to share the same frequency channel by dividing the signal into different time slots. Most of these systems are classified as 2G technology. The main example of TDMA-based technologies is GSM (Global System for Mobile Communications).\nThe transition of wireless devices from 2G to 3G/4G and the deployment of 5G technologies continued around the world with estimated 3G/4G/5G connections up 7% year-over-year (GSMA Intelligence, November 2020). As of September 30, 2020, there were approximately 1.6 billion GSM connections worldwide, representing approximately 20% of total cellular connections, down from 25% as of September 30, 2019 (GSMA Intelligence, November 2020).\nCDMA-based. CDMA-based technologies are characterized by their access method allowing several users to share the same frequency and time by allocating different orthogonal codes to individual users. Most of the CDMA-based technologies are classified as 3G technology.\nThere are a number of variants of CDMA-based technologies deployed around the world, in particular CDMA2000, EV-DO (Evolution Data Optimized), WCDMA (Wideband CDMA) and TD-SCDMA (Time Division-Synchronous CDMA) (deployed exclusively in China). CDMA-based technologies provide vastly improved capacity for voice and low-rate data services as compared to analog technologies and significant improvements over 2G technology.\nAs of September 30, 2020, there were approximately 1.9 billion CDMA-based connections worldwide, representing approximately 24% of total cellular connections, down from 26% as of September 30, 2019 as consumers migrate to OFDMA-based technologies (GSMA Intelligence, November 2020).\nOFDMA-based. OFDMA-based technologies are characterized by their access method allowing several users to share the same frequency band and time by allocating different subcarriers to individual users. Most of the OFDMA-based technologies deployed prior to 2020 are classified as 4G technology. 5G heavily leverages OFDMA-based technologies. 3GPP developed 4G specifications through the standardization of the radio component (LTE) and the core network component (Enhanced Packet Core or EPC). Similarly, 3GPP has developed 5G specifications through the specification of the radio component (NR) and the core network component (5G Core or 5GC). Unlike 4G that has fixed Orthogonal Frequency Division Multiplexing (OFDM) parameterization, 5G has multiple OFDM parameterizations to address a wide range of spectrum and use cases. We continue to play a significant role in the further development of LTE-based technologies, such as Narrowband IoT (NB-IoT), enhanced Machine Type Communications (eMTC) and Enhanced TV broadcast (EnTV), in addition to the core LTE operation evolution, such as enhancements for mobility and massive multiple-input multiple-output (MIMO) operation.\nLTE is incorporated in 3GPP specifications beginning with Release 8 and uses OFDMA in the downlink and single carrier FDMA (Frequency Division Multiple Access) in the uplink. LTE has two modes, FDD (Frequency Division Duplex) and TDD (Time Division Duplex), to support paired and unpaired spectrum, respectively, and continues to evolve as 3GPP defines new specifications. The principal benefit of LTE is its ability to leverage a wide range of spectrum (bandwidths of up to 20 MHz or more through aggregation). LTE is designed to seamlessly interwork with 3G technologies through multimode devices.\nLTE Advanced brings many more enhancements, including carrier aggregation, advanced multi-antenna techniques and optimizations for small cells. Apart from improving the performance of existing networks, there are also enhancements under the umbrella of LTE Advanced Pro, including LTE Direct for proximity-based device-to-device discovery, improved LTE broadcast, optimizations of narrowband communications designed for IoT (known as eMTC and NB-IoT) and the ability to use LTE Advanced in unlicensed spectrum (LTE Unlicensed), as well as in shared spectrum bands in various regions (such as the Citizens Broadband Radio Service, or CBRS, in the United States). There are multiple options for deploying LTE Unlicensed for different deployment scenarios.\n•LAA (Licensed Assisted Access), introduced as part of 3GPP Release 13, aggregates unlicensed and licensed spectrum in the downlink and is being deployed globally by mobile operators. LAA is a key technology for many operators with limited licensed spectrum to deliver Gigabit LTE speeds.\n•eLAA (enhanced LAA), introduced as part of 3GPP Release 14, is an evolution of LAA. eLAA enables aggregation of unlicensed and licensed spectrum in the uplink.\nBeginning with Release 14, 3GPP specifications provide enhancements specifically for vehicular communications known as cellular vehicle-to-everything (C-V2X), which includes both direct communication (vehicle-to-vehicle, vehicle-to-infrastructure and vehicle-to-pedestrian) in dedicated spectrum that is independent of a cellular network and cellular communications with networks in traditional mobile broadband licensed spectrum. C-V2X is designed to serve as the foundation for Intelligent Transportation Systems (ITS), enabling vehicles to communicate with each other and everything around them, providing non-line-of-sight awareness for enhanced road safety and traffic efficiency. 3GPP Release 16, which was completed in July 2020, incorporates 5G features for C-V2X, such as higher throughput, lower latency and increased reliability capabilities to enable a higher level of performance and predictability required for automated driving and other advanced safety use cases.\nAs of September 30, 2020, there were approximately 4.3 billion global LTE connections worldwide, representing approximately 55% of total cellular connections, up from 49% as of September 30, 2019 (GSMA Intelligence, November 2020).\nThe wireless industry is actively developing and commercializing 5G technologies. Initial commercial 5G network deployments and device launches began in calendar 2019 and continued throughout 2020. We expect that 5G network deployments and device launches will increase over the next several years. Many of our inventions at the core of 3G and 4G serve as foundational technologies for 5G. 5G is designed to transform the role of wireless technologies and already incorporates or soon will incorporate advancements on 3G/4G features available today, including device-to-device capabilities and the use of all different types of spectrum (including licensed, unlicensed and shared spectrum). We continue to play a significant role in driving advancements in 5G, including contributing to 3GPP standardization activities that are defining the continued evolution of 5G NR and 5GC standards.\nThe first global set of 5G standards is incorporated in 3GPP specifications starting from Release 15, which was initially completed in March 2018. Release 15 enables different architecture deployment choices of 5G networks while sharing the same radio access technology. This is due to 5G’s ability to target diverse services with very different technical requirements (from enhanced mobile broadband to massive IoT to mission critical services), its utilization of diverse types of spectrum (from the low bands to mmWave bands) and its ability to support diverse types of deployment scenarios. Predominant technological components of 5G include the ability to address ultra-reliable, low-latency communication, new channel coding schemes to efficiently support large data blocks, MIMO to increase coverage and network capacity and mobile mmWave to increase the data rate offered to users. 5G uses OFDMA in the downlink and either OFDMA or single carrier FDMA in the uplink depending on the use case. Like 3G and 4G, 5G supports carrier aggregation across spectrum bands, across FDD and TDD and across licensed and unlicensed spectrum (starting with Release 16), and 5G also supports dual connectivity across 4G and 5G. A key benefit of 5G is its ability to take advantage of very wide channel bandwidth such as 400/100 MHz\n(compared to LTE’s 20 MHz maximum bandwidth, which requires carrier aggregation to combine spectrum beyond 20 MHz). As with previous cellular generations, 5G is designed to support seamless compatibility with 2G/3G/4G technologies through multimode devices.\n5G is the first generation of cellular wireless communication systems to use transmissions at mmWave bands, which creates certain challenges including coverage limitations and blockages, heightened costs and power constraints. In order to address these challenges, we have been a leader in designing RFFE modules and RF filter products that use adaptive beamforming (which spatially concentrates radio energy in a given beam direction to extend the range) and that enable the efficient tracking and switching of beams in accordance with varying radio conditions. mmWave deployments rely on small cells (low-powered cellular base stations typically used for increased system capacity and which may have already incorporated Gigabit LTE) to allow for faster, more reliable mobile service with transmissions at mmWave bands.\nRelease 16 not only introduced enhancements to 5G mobile broadband experiences (e.g., more capacity, improved coverage, mobility and better device power efficiency), but also expanded 5G technologies into new use cases and industries. For example, to better enable new industrial IoT use cases, such as factory automation and other mission critical applications, Release 16 added support for private 5G networks, efficient wireless Ethernet over 5G, 5G Time-Sensitive Networking (TSN) and further enhanced ultra-reliable low latency communications. Release 16 also fulfilled the 5G vision of supporting different spectrum types by expanding 5G into unlicensed spectrum with 5G NR Unlicensed (NR-U). Release 16 NR-U focused on sub-7GHz operation, specifically 5GHz and 6GHz bands, and Release 17 will expand NR-U to support higher bands such as 60 GHz. High-precision positioning was another focus area in Release 16. Accurate device positioning is a key enabler for many applications, such as public safety and indoor navigation. Release 16 added new capabilities for 5G positioning, supporting techniques such as multi-cell roundtrip time, angle of arrival/departure and time difference of arrival. Release 16 addressed the growing needs of low-power, wide-area IoT use cases by allowing in-band deployments of NB-IoT and eMTC in 5G carriers, as well as supporting these low-complexity IoT technologies with the new 5G core network. Additionally, to make mmWave densification more cost efficient, Release 16 introduced integrated access and backhaul that allows a base station to provide both wireless access for devices and wireless backhaul connectivity, thereby eliminating the need for a wired backhaul.\nOther (non-cellular) wireless technologies. There are other, non-cellular wireless technologies that have also been broadly adopted.\nWireless Local Area Networks. Wireless Local Area Networks (WLAN), such as Wi-Fi, link two or more nearby devices wirelessly and usually provide connectivity through an access point. We are actively involved in innovative programs developed in the context of the Wi-Fi Alliance, a non-profit organization that drives global Wi-Fi adoption and evolution. Wi-Fi systems are based primarily on standards developed by the Institute of Electrical and Electronics Engineers 802.11 Working Group. Amendments of the 802.11 standard are commonly referred to by the names made popular by the Wi-Fi Alliance (for example, 802.11ax is known as Wi-Fi 6). Wi-Fi 6, a recent amendment to 802.11, adds advanced features such as downlink and uplink OFDMA and uplink multiple-user MIMO. This technology primarily targets connectivity for mobile devices, tablets, laptops and other consumer electronic devices using the 2.4 GHz and 5 GHz spectrums. Up to 1200MHz of new spectrum has been added in the 6GHz band in the United States, which triples the available spectrum for Wi-Fi, which can be used by new Wi-Fi 6 extended devices. For 60GHz mmWave technology, 802.11ay adds wider channel bandwidth and the use of MIMO to the existing 802.11ad (also known as Gigabit Wi-Fi or WiGig) standard. 802.11ah targets sub-1 GHz spectrum. We played a leading role in the development of 802.11ac, 802.11ax, 802.11ay, 802.11ah and 802.11ad, and continue to play a lead role in the evolution of the 802.11 family of standards with the development of the new 802.11be standard, which is expected to be known as Wi-Fi 7.\nBluetooth. Bluetooth is a wireless personal area network that provides wireless connectivity between devices over short distances ranging from a few centimeters to approximately one hundred meters. Bluetooth technology provides wireless connectivity to a wide range of fixed or mobile consumer electronic devices. Bluetooth functionalities are standardized by the Bluetooth Special Interest Group in various versions of the specification (from 1.0 to 5.2), which include different functionalities, such as enhanced data rate, low energy and mesh technologies. We are a leading contributor to Bluetooth technologies in the areas of mobile devices, audio and mesh technologies.\nLocation Positioning Technologies. Location positioning technologies continue to evolve in order to deliver an enhanced commercial location experience and comply with new mandates on location for E911 (enhanced 911) calls. We are a key developer of the Assisted-GPS (A-GPS), Assisted Global Navigation Satellite System (A-GNSS) and WLAN positioning technologies used in most cellular handsets today. For uses requiring the best reliability and accuracy for E911 services and navigational based services, A-GPS, A-GNSS and WLAN provide leading-edge solutions. In 3GPP Release 16, we led the standardization of many 4G and 5G-based positioning capabilities.\nThe industry continues to evolve to support additional inputs for improving the location experience. Our products and intellectual property now support multiple constellations for A-GNSS, including: GPS, GLONASS, Galileo, NavIC and BeiDou; Wi-Fi-based and Bluetooth-based positioning for WLAN, including Wi-Fi RSSI (received signal strength indication) and Wi-Fi RTT (round-trip time) signals for indoor location; observed time difference of arrival positioning for LTE access (e.g., in rural and indoor areas); and third-party inertial sensors. The combination of these different location solutions is used to ensure accurate location availability in all areas.\nOther Significant Technologies used in Cellular and Certain Consumer Electronic Devices and Networks. We have played and continue to play a leading role in developing and/or have acquired many of the other technologies used across the wireless system, including in cellular handsets and certain other consumer electronic devices and networks, such as:\n•on-device AI features, including machine learning platforms and the application of AI and machine learning techniques to edge computing and other use cases;\n•graphics and display processing functionality;\n•video coding based on the HEVC (High Efficiency Video Codec) standard, which is being deployed to support 4K video and immersive media content and the next generation VVC (Versatile Video Codec) standard, which is designed to power the creation and consumption of rich digital media experiences;\n•audio coding, including EVS (enhanced voice services) and MPEG-H 3D Audio;\n•the latest version of 3GPP’s codec for multimedia use and for voice/speech use;\n•multimedia transport, including MPEG-DASH (Dynamic Adaptive Streaming over HTTP) enabling advanced multimedia experiences;\n•camera and camcorder functions;\n•operating system and user interface features;\n•AR/VR/XR features enabling new types of user experiences;\n•security and content protection systems for enhanced device security without compromising the user experience and ultrasonic fingerprint readers for single touch authentication;\n•volatile (LP-DDR4, 5) and non-volatile (eMMC) memory and related controllers;\n•fast charging features, enabling devices to charge quickly, safely and efficiently;\n•power management systems for improved battery life and device charging; and\n•System on Chip (SoC) architecture, low-power computing and other optimization techniques.\nOperating Segments\nWe have three reportable segments. We conduct business primarily through QCT and QTL, while QSI makes strategic investments. Revenues in fiscal 2020, 2019 and 2018 for our reportable segments were as follows (in millions, except percentages):\nQCT Segment. QCT is a leading developer and supplier of integrated circuits and system software based on 3G/4G/5G and other technologies for use in wireless voice and data communications, networking, application processing, multimedia and global positioning system products. QCT’s integrated circuit products are sold and its system software is licensed to manufacturers that use our products in a broad range of devices, from low-tier, entry-level devices primarily for emerging regions to premium-tier devices, including mobile devices (primarily smartphones), tablets, laptops, data modules, handheld wireless computers and gaming devices, other consumer electronics, other IoT devices and applications, automotive systems for telematics and infotainment, access points and routers, broadband gateway equipment, data cards and infrastructure equipment and sensor hubs. Our 3G/4G/5G modem roadmap delivers the latest network technologies across multiple product tiers and devices. This roadmap is the result of extensive collaboration with manufacturers, operators, developers, systems integrators, cloud providers, governments and industry standards organizations, as well as our years of research into emerging network standards and the development of integrated circuits that take advantage of these new standards, while maintaining backward compatibility with existing standards.\nThe Qualcomm® Snapdragon™ family of highly-integrated, system-based solutions include the Snapdragon mobile, compute and automotive platforms. Each platform consists of application processors and wireless connectivity capabilities, including our cellular modem that provides core baseband modem functionality for voice and data communications, non-cellular wireless connectivity (such as Wi-Fi and Bluetooth) and global positioning functions. Our Snapdragon application processor functions include security, graphics, display, audio, video, camera and AI. Our central processing units are designed based on ARM architecture and are designed to deliver high levels of compute performance with optimized power consumption. Our Qualcomm® Hexagon™ processors are designed to support a variety of signal processing applications, including AI, audio and sensor processing. Our Qualcomm® Adreno™ graphics processing units are designed to deliver high quality graphics performance for visually rich 3D gaming and user interfaces. In addition to the highly integrated core system-on-chip (SoC), we also design and supply supporting components, including the RF, PM (power management), audio, codecs, speaker amps and additional wireless connectivity integrated circuits. These supporting components, in addition to our cellular modems and application processors comprising our core SoC, are also sold as individual components. The\ncombination of the Snapdragon SoC, system software and supporting components provide an overall platform with optimized performance and efficiency, enabling manufacturers to design and deliver powerful, slim and power-efficient devices ready for integration with the complex cellular networks worldwide. We have also integrated our Snapdragon platform with our RFFE components to create our Snapdragon 5G modem-RF systems, the world’s first commercial modem-to-antenna 5G solution designed to maximize data speeds and performance, support superior call connectivity and coverage, and extend battery life on mobile devices.\nOur portfolio of RF products includes Qualcomm® RFFE components that are designed to simplify the RF design for 5G front-end, LTE multimode and multiband mobile devices, including sub-6 GHz and mmWave devices, to reduce power consumption and to improve radio performance. QCT offers an advanced portfolio of RFFE products primarily for mobile devices, in addition to broadband gateway equipment, infrastructure equipment, laptops, automotive, industrial IoT and other IoT applications. Our technologies provide comprehensive RFFE product offerings with system level performance from the modem and transceiver to the antenna that include complex 4G/5G transmit and receive modules, power tracking, tuning systems, filtering, multimode-multiband power amplification, low noise amplifiers and mmWave antenna solutions, in addition to discrete filtering products across mobile, automotive, industrial IoT and other IoT industries.\nOur wireless connectivity products also consist of integrated circuits and system software for Wi-Fi, Bluetooth and frequency modulation (FM), as well as technologies that support location data and services, including GPS, GLONASS, Galileo, NavIC and BeiDou. Our wireless connectivity products provide additional connectivity for mobile devices, tablets, laptops, other consumer electronics, other IoT applications and automotive telematics and infotainment systems. QCT also offers standalone Wi-Fi, Bluetooth, fingerprint sensor, applications processor and Ethernet products for mobile devices, consumer electronics, computers, other IoT applications, other connected devices and automotive telematics and infotainment systems. Our networking products include Wi-Fi, Ethernet and Powerline chips, network processors and software. These products help enable home and business networks to support the growing number of connected devices, digital media and data services.\nOther than for our RFFE modules and RF filter products, QCT utilizes a fabless production model, which means that we do not own or operate foundries for the production of silicon wafers from which our integrated circuits are made. Therefore, we primarily rely on third-parties to perform the manufacturing and assembly, and most of the testing, of our integrated circuits based primarily on our proprietary designs and test programs. Our suppliers also are responsible for the procurement of most of the raw materials used in the production of our integrated circuits. Integrated circuits are die cut from silicon wafers that have completed the package assembly and test manufacturing processes. The semiconductor package supports the electrical contacts that connect the integrated circuit to a circuit board. Die cut from silicon wafers are the essential components of all of our integrated circuits and a significant portion of the total integrated circuit cost. We employ both turnkey and two-stage manufacturing models to purchase our integrated circuits. Under the turnkey model, our foundry suppliers are responsible for delivering fully assembled and tested integrated circuits. Under the two-stage manufacturing model, we purchase die in singular or wafer form from semiconductor manufacturing foundries and contract with separate third-parties for manufacturing services such as wafer bump, probe, assembly and the majority of our final test requirements. The primary foundry suppliers for our various digital, analog/mixed-signal, RF and PM integrated circuits are Global Foundries, Samsung Electronics, Semiconductor Manufacturing International Corporation (SMIC), Taiwan Semiconductor Manufacturing Company (TSMC) and United Microelectronics. The primary semiconductor assembly and test suppliers are Advanced Semiconductor Engineering, Amkor Technology, Siliconware Precision Industries and STATSChipPAC. The majority of our foundry and semiconductor assembly and test suppliers are located in the Asia-Pacific region.\nQCT primarily uses internal fabrication facilities to manufacture RFFE modules and RF filter products, and its manufacturing operations consist of front-end and back-end processes. The front-end processes primarily take place at manufacturing facilities located in Germany and Singapore and involve the imprinting of substrate wafers with the structure and circuitry required for the products to function (also known as wafer fabrication). The back-end processes include the assembly, packaging and test of RFFE modules and RF filter products and their preparation for distribution. The back-end manufacturing facilities are located in China and Singapore.\nQCT’s sales are primarily made through standard purchase orders for delivery of products. QCT generally allows customers to reschedule delivery dates within a defined time frame and to cancel orders prior to shipment with or without payment of a penalty, depending on when the order is canceled. The industry in which QCT operates is intensely competitive. QCT competes worldwide with a number of U.S. and international designers and manufacturers of semiconductors. As a result of global expansion by foreign and domestic competitors, technological changes, lengthening replacement cycles for mobile devices, device manufacturer concentrations and the potential for further industry consolidation, we anticipate the industry to remain very competitive. We believe that the principal competitive factors for our products include performance, level of integration, quality, compliance with industry standards, price, time-to-market, system cost, design and engineering capabilities, new product innovation, growth and scaling of distribution channels, desire by certain customers to use multiple suppliers and customer support. QCT also competes in both single-mode and multimode environments against alternative communications technologies. Additional competitive factors exist for QCT product offerings that have expanded into adjacent industry segments or applications beyond mobile, including automotive and IoT. The automotive industry is subject to long design-in time frames, long product life cycles and a high degree of regulatory and safety requirements, necessitating suppliers to the industry to comply with stringent qualification processes, very low defect rates and high reliability standards, all of which results in a significant barrier to entry and may result in increased costs.\nQCT’s current competitors include, but are not limited to, companies such as Broadcom, HiSilicon, MediaTek, Nvidia, NXP Semiconductors, Qorvo, Samsung, Skyworks, Texas Instruments and UNISOC (formally known as Spreadtrum Communications). QCT also faces competition from products internally developed by our customers, including some of our largest customers, and from some early-stage companies. Our competitors devote significant amounts of their financial, technical and other resources to develop and market competitive products and, in some cases, to develop and adopt competitive digital communication or signal processing technologies, and those efforts may materially and adversely affect us. Although we have attained a significant position in the wireless industry, many of our current and potential competitors may have advantages over us that include, among others: motivation by our customers in certain circumstances to use our competitors’ integrated circuit products, to utilize their own internally-developed integrated circuit products, or sell such products to others, or to utilize alternative technologies; lower cost structures or a willingness and ability to accept lower prices or lower margins for their products, particularly in China; foreign government support of other technologies, competitors or OEMs that sell devices that do not contain our integrated circuit products; better known brand names; ownership and control of manufacturing facilities and greater expertise in manufacturing processes; more extensive relationships with local distribution companies and OEMs in certain geographic regions (such as China); more experience in adjacent industry segments or applications beyond mobile (such as automotive and IoT); and a more established presence in certain regions.\nQTL Segment. QTL grants licenses or otherwise provides rights to use portions of our intellectual property portfolio, which, among other rights, includes certain patent rights essential to and/or useful in the manufacture, sale and/or use of certain wireless products, including, without limitation, products implementing CDMA2000, WCDMA, CDMA TDD, LTE and/or OFDMA-based 5G standards and their derivatives. We grant licenses or otherwise provide rights to use our cellular standard-essential patents (including 3G, 4G and 5G) for both single-mode and multimode devices on a worldwide basis, and our standard practice in China is to offer our cellular standard-essential Chinese patents (for 3G, 4G and, now, 5G) for devices sold for use in China separately from our other patents. We also offer licenses to our cellular standard-essential patents together with other Qualcomm patents that may be useful to such licensed products for licensees that desire to obtain the commercial benefits of receiving such broad patent rights from us. Since 2018, an increasing number of new and existing licensees have elected to enter into worldwide license agreements covering only our cellular standard-essential patents. Going forward, we continue to anticipate that a significant portion of QTL’s licensing revenues will be derived from licensees that have entered into license agreements covering only Qualcomm’s cellular standard-essential patents. Our licensees manufacture wireless products including mobile devices (including handsets), other consumer devices (e.g., tablets and laptops), plug-in end user data modem cards and embedded modules for incorporation into machine-to-machine devices and certain end user products (excluding handsets and tablets), as well as infrastructure equipment required to establish and operate a network and equipment to test networks and cellular devices.\nSince our founding in 1985, we have focused heavily on technology development and innovation. These efforts have resulted in a leading intellectual property portfolio related to foundational, system level technologies for the wireless industry. We have an extensive portfolio of United States and foreign patents, and we continue to pursue patent applications around the world. Our patents have broad coverage in many countries, including Brazil, China, India, Japan, South Korea, Taiwan, the United States and countries in Europe. A substantial portion of our patents and patent applications relate to digital wireless communications technologies, including patents that are essential or may be important to the commercial implementation of CDMA2000, WCDMA (UMTS), TD-SCDMA, TD-CDMA (Time Division CDMA), OFDMA-based LTE and OFDMA-based 5G products. Our patent portfolio is the most widely and extensively licensed in the industry, with more than 300 licensees. Additionally, we have a substantial patent portfolio related to key technologies used in communications and other devices and/or related services, some of which were developed in industry standards development bodies. These include certain video codecs, audio codecs, Wi-Fi, memory interfaces, wireless power, GPS and positioning, broadcast and streaming protocols, and short-range communication functionalities, including NFC and Bluetooth. Our patents cover a wide range of technologies across the entire wireless system, including the device (handsets and other wireless devices), not just the portion of such patented technologies incorporated into chipsets, and the network. Over the years, a number of companies have challenged our patent position, but companies in the mobile communications industry generally recognize that any company seeking to develop, manufacture and/or sell certain wireless products that use CDMA-based and/or OFDMA-based technologies will require a license or other rights to use our patents.\nWe have licensed or otherwise provided rights to use our patents to hundreds of companies on industry-accepted terms. Unlike some other companies in our industry that hold back certain key technologies, we offer companies substantially our entire patent portfolio for use in cellular devices and cell site infrastructure equipment. Our strategy to make our patented technologies broadly available has been a catalyst for industry growth, helping to enable a wide range of companies offering a broad array of wireless products and features while increasing the capabilities of and/or driving down average and low-end selling prices for 3G and 3G/4G multimode handsets and other wireless devices. By licensing or otherwise providing rights to use our patents to a wide range of equipment manufacturers, encouraging innovative applications, supporting equipment manufacturers with integrated chipset and software products and focusing on improving the efficiency of the airlink for wireless operators, we have helped 3G and 3G/4G multimode evolve and grow and reduce device pricing. 5G network deployments and commercial 3G/4G/5G multimode device sales began in 2019 and continued throughout 2020. By licensing or otherwise providing rights to use our patents to a wide range of equipment manufacturers, 5G will continue to encourage innovative applications through enhanced mobile broadband services with lower latency and multi-gigabit user data speeds and bring more capacity and efficiency to wireless networks.\nUpon the initial deployment of OFDMA-based networks, the products implementing such technologies generally have been multimode and implement OFDMA-based and CDMA-based technologies. The licenses granted under our existing license agreements generally cover multimode CDMA/OFDMA (3G/4G/5G) devices, and our licensees are obligated to pay royalties under their license agreements for such devices.\nStandards bodies have been informed that we hold: patents that might be essential for all 3G standards that are based on CDMA; patents and pending patent applications that are potentially essential for LTE standards, including FDD and TDD versions; and patents and pending patent applications that are potentially essential for 5G technologies. We have committed to such standards bodies that we will offer to license our essential patents for these standards consistent with our commitments to those bodies. We have made similar commitments with respect to certain other technologies implemented in industry standards.\nQTL licensing revenues include royalties and, to a lesser extent, license fees. Licensees pay quarterly royalties based on their sales of products incorporating or using our licensed intellectual property and may also pay a fixed license fee in one or more installments. Sales-based royalties are generally based upon a percentage of the wholesale (i.e., licensee’s) selling price of complete licensed products, net of certain permissible deductions (including transportation, insurance, packing costs and other items). We broadly provide per unit royalty caps that apply to certain categories of complete wireless devices, namely smartphones, tablets, laptops and smartwatches, and provide for a maximum royalty amount payable per device. Revenues generated from royalties are subject to quarterly and annual fluctuations.\nThe vast majority of QTL revenues have been generated through our licensees’ sales of CDMA2000-based, WCDMA-based and OFDMA-based products (including 3G, 3G/4G and 3G/4G/5G multimode devices), such as smartphones and feature phones. We have invested and continue to invest in both the acquisition and development of OFDMA technology and intellectual property and have generated the industry leading patent portfolio applicable to LTE, LTE Advanced, LTE Advanced Pro and 5G-NR. Some of our inventions that serve as foundational technologies for 3G and 4G also serve as foundational technologies for 5G. We have invested and continue to invest in the development of 5G and continue to play a significant role in driving advancements of 5G. Nevertheless, we face competition in the development of intellectual property for future generations of digital wireless communications technologies and services.\nSeparate and apart from licensing manufacturers of wireless devices and network equipment, we have entered into certain arrangements with competitors of our QCT segment. A principal purpose of these arrangements is to provide our QCT segment and the counterparties certain freedom of operation with respect to each party’s integrated circuits business. In every case, these agreements expressly reserve the right for QTL to seek royalties from the customers of such integrated circuit suppliers with respect to such suppliers’ customers’ sales of CDMA-, WCDMA- and OFDMA-based wireless devices into which such suppliers’ integrated circuits are incorporated.\nOur license agreements also may provide us with rights to use certain of our licensees’ technology and intellectual property to manufacture, sell and/or use certain components (e.g., application-specific integrated circuits) and related software, cellular devices and/or infrastructure equipment.\nWe are currently subject to certain governmental investigations and private legal proceedings challenging our patent licensing practices, including those described in this Annual Report under the heading “Notes to Consolidated Financial Statements, Note 7. Commitments and Contingencies,” which may require us to change our patent licensing practices as described more fully herein in “Part I, Item 1A. Risk Factors” under the heading “Changes in our patent licensing practices, whether due to governmental investigations or private legal proceedings challenging those practices, or otherwise, could adversely impact our business and results of operations.”\nQSI Segment. QSI makes strategic investments primarily through our Qualcomm Ventures arm that are focused on expanding or opening new opportunities for our technologies as well as supporting the design and introduction of new products and services (or enhancing existing products or services). Many of these strategic investments are in early-stage companies in a variety of industries and applications, including, but not limited to, artificial intelligence, automotive, digital healthcare, enterprise, IoT, mobile and networking. Investments primarily include non-marketable equity securities and to a lesser extent, marketable equity securities (the majority of which resulted from initial public offerings of certain non-marketable equity investments) and convertible debt instruments. In addition, QSI segment results include revenues and related costs associated with development contracts with one of our investees (OneWeb). As part of our strategic investment activities, we intend to pursue various exit strategies for each of our QSI investments in the foreseeable future.\nOther Businesses. Nonreportable segments include our Qualcomm Government Technologies or QGOV business, our cloud AI inference processing initiative and other technology and service initiatives. QGOV provides development and other services and sells related products to U.S. government agencies and their contractors. Additional information regarding our operating segments is provided in this Annual Report in “Notes to Consolidated Financial Statements, Note 8. Segment Information.” Information regarding seasonality is provided in this Annual Report in “Part II, Item 7. Management’s Discussion and Analysis of Financial Condition and Results of Operations” in the “Our Business and Operating Segments” section under the heading “Seasonality.”\nCorporate Structure\nWe operate our businesses through our parent company, QUALCOMM Incorporated, and multiple direct and indirect subsidiaries. We have developed our corporate structure in order to address various legal, regulatory, tax, contractual compliance, operational and other matters. Substantially all of our products and services businesses, including QCT, and substantially all of our engineering, research and development functions, are operated by Qualcomm Technologies, Inc. (QTI), a wholly-owned subsidiary of QUALCOMM Incorporated, and QTI’s subsidiaries. QTL is operated by QUALCOMM Incorporated, which owns the vast majority of our patent portfolio. Neither QTI nor any of its subsidiaries has any right, power or authority to grant any licenses or other rights under or to any patents owned by QUALCOMM Incorporated.\nRevenue Concentrations and Significant Customers\nA small number of customers/licensees historically have accounted for a significant portion of our consolidated revenues. In fiscal 2020, 2019 and 2018, revenues from Apple and its contract manufacturers, combined revenues from Guangdong OPPO Mobile Telecommunications Corp., Ltd. (Oppo) and BBK Communication Technology Co., Ltd. (vivo), and their respective affiliates (including BBK), Samsung and Xiaomi each comprised 10% or more of consolidated revenues. Revenues from Huawei also comprised 10% or more of consolidated revenues in fiscal 2020, which were positively impacted by the settlement of our prior dispute. Revenues in fiscal 2018 were negatively impacted by our prior dispute with Apple and its contract manufacturers. Additional information regarding the settlements is provided in this Annual Report in “Part II, Item 7. Management’s Discussion and Analysis of Financial Condition and Results of Operations.”\nResearch and Development\nThe wireless communications industry is characterized by rapid technological change, evolving industry standards, frequent new product introductions and, with the introduction of 5G, the expansion into new industry segments or applications such as automotive and IoT, requiring a continuous effort to enhance existing products and technologies and to develop new products and technologies. We have significant engineering resources, including engineers with substantial expertise in CDMA, OFDMA and a broad range of other technologies. Using these engineering resources, we expect to continue to invest in research and development in a variety of ways in an effort to extend the demand for our products, and to utilize that research and development in adjacent industry segments or applications beyond mobile (such as automotive and IoT), including continuing the development of CDMA, OFDMA and other technologies (such as RFFE), developing alternative technologies for certain specialized applications, participating in the formulation of new voice and data communication standards and technologies, and assisting in deploying digital voice and data communications networks around the world. Our research and development team has a demonstrated track record of innovation in voice and data communication technologies and application processor technology, among others.\nWe continue to invest significant resources towards advancements in OFDMA-based technologies and products (including LTE and 5G). We also engage in acquisitions and other transactions, such as joint ventures, to meet certain technology needs, to obtain development resources or open or expand opportunities for our technologies and to support the design and introduction of new products and services (or enhancing existing products and services) for voice and data communications and new industry segments or applications beyond mobile. We make investments to provide our integrated circuit customers with chipsets designed on leading-edge technology nodes that combine multiple technologies for use in consumer electronic devices (e.g., smartphones, tablets, laptops, AR/VR/XR devices) and other products (e.g., access points and routers, data cards and infrastructure equipment). In addition to 3G, 4G and 5G technologies, our chipsets support other wireless and wired connectivity technologies, including Wi-Fi, Bluetooth, Ethernet, location positioning and Powerline communication. Our integrated chipsets often include multiple technologies, including advanced multimode modems, application processors and graphics engines, as well as the tools to connect these diverse technologies. We continue to support Android, Windows and other client software environments in our chipsets.\nWe develop on our own, and with our partners, innovations that are integrated into our product portfolio to further expand the opportunity for wireless communications and enhance the value of our products and services. These innovations are expected to enable our customers to improve the performance or value of their existing services, offer these services more affordably and introduce revenue-generating broadband data services ahead of their competition.\nWe have research and development centers in various locations throughout the world that support our global development activities and ongoing efforts to develop and/or advance 4G, 5G and a broad range of other technologies. We continue to use our substantial engineering resources and expertise to develop new technologies, applications and services and make them available to licensees to help grow the communications industry and generate new or expanded licensing opportunities.\nSales and Marketing\nSales and marketing activities of our operating segments are discussed under Operating Segments. Other marketing activities include public relations, branding, digital marketing and social media, technical marketing, product marketing, participation in technical conferences and trade shows, development of use cases and white papers, competitive analyses and industry intelligence and other marketing programs, such as co-marketing with our customers or licensees. Our Corporate Marketing department provides information on our company website and through other channels regarding our products, strategies and technology to investors, industry analysts, media, prospective job applicants, consumers and others.\nCompetition\nCompetition faced by our operating segments is discussed under Operating Segments. Competition in the wireless communications industry throughout the world continues to increase at a rapid pace as consumers, businesses and governments realize the potential of wireless communications products and services.\nWe expect competition to increase as our current competitors expand their product offerings and introduce new technologies and services in the future and as additional companies compete with our products and/or services based on 3G, 4G, 5G and/or other technologies. Although we intend to continue to make substantial investments in developing new products and technologies and improving existing products and technologies to strengthen and/or maintain our competitive position, our competitors may introduce alternative products, services or technologies that threaten our business. It is also possible that the prices we charge for our products and services may continue to decline as competition continues to intensify. See also the Risk Factor entitled “Our industry is subject to intense competition in an environment of rapid technological change. Our success depends in part on our ability to adapt to such change and compete effectively; and such change and competition could result in decreased demand for our products and technologies or declining average selling prices for our products or those of our customers or licensees.”\nEnvironmental, Social and Governance (ESG) and Human Capital\nFor decades, our innovations have helped transform industries, enhance the lives of billions of people and address some of society’s biggest challenges. With the world becoming increasingly connected, we have a tremendous opportunity to shape a better future. We believe in the power of technology. As such, our corporate responsibility vision is to be a facilitator of innovation for a sustainable world, connected wirelessly.\nESG\nOur sustained investment in R&D has helped revolutionize the way people connect; our approach to innovation is strategic and purposeful. We understand that the success of our business is fundamentally connected to the well-being of our world. We focus our efforts in four key areas where we believe we can have the biggest impact:\n•Responsible Business. We integrate responsible and sustainable practices throughout our organization. Our products are designed to not harm individuals, communities or the environment. We continually look for ways to conserve water, minimize energy consumption, lower emissions and reduce waste. Because privacy and security are critical for success in the wireless industry, we constantly seek to promote data protection across the mobile ecosystem.\n•Our People. We strive to make Qualcomm an inspiring and inclusive workplace to advance the development of leading-edge technologies. Our success is only possible with the hard work and dedication of our employees. We celebrate diversity among our workforce and recognize that our varied backgrounds, experiences and ideas are critical to innovation. We foster inclusive practices in our operations around the world in order to reflect the communities in which we do business.\n•Purposeful Innovation. We invent breakthrough technologies that enable life-changing products and experiences. We’re building on our legacy of technology leadership with 5G, which we believe will serve as the technological foundation for connected cars, industrial IoT, smart homes and cities, networking and mobility. We also work to broaden our impact by bringing advanced wireless technologies to underserved communities around the world. In doing so, we believe that we have enriched the lives of millions of people while creating new opportunities for our business.\n•STEM Education. We seek to inspire the next generation of inventors and advance workforce development for STEM-related careers (science, technology, engineering and mathematics). Our initiatives are designed to promote and improve STEM education at all levels and to expand opportunities for underrepresented students.\nWe encourage you to review our March 2020 Corporate Responsibility Report (located on our Internet site at www.qualcomm.com) for more detailed information regarding our ESG programs and initiatives. Nothing on our website, including our Corporate Responsibility Report or sections thereof, shall be deemed incorporated by reference into this Annual Report.\nHuman Capital\nIn order to continue to produce the innovative, breakthrough technologies for which we are known, it is crucial that we continue to attract and retain top talent. To facilitate talent attraction and retention, we strive to make Qualcomm a diverse, inclusive and safe workplace, with opportunities for our employees to grow and develop in their careers, supported by strong compensation, benefits and health and wellness programs, and by programs that build connections between our employees and their communities.\nAt September 27, 2020, we had approximately 41,000 full-time, part-time and temporary employees, the overwhelming majority of which were full-time employees. During fiscal 2020, the number of employees increased by approximately 4,000, primarily due to increases in engineering resources. Our employees are represented by more than 100 self-identified nationalities working in over 150 locations in 32 different countries around the world. Collectively, we speak more than 60 different languages. Our global workforce is highly educated, with the substantial majority of our employees working in engineering or technical roles (many of whom help develop foundational technologies for both our QCT semiconductor business and our QTL licensing business). During fiscal 2020, our voluntary turnover rate was less than 5%, below the\ntechnology industry benchmark, which is comprised of certain of our key competitors (Aon, 2020 Salary Increase and Turnover Study - Second Edition, September 2020).\nDiversity and Inclusion. We believe that a diverse workforce is critical to our success, and we continue to focus on the hiring, retention and advancement of women and underrepresented populations. Our recent efforts have been focused in three areas: inspiring innovation through an inclusive and diverse culture; expanding our efforts to recruit and hire world-class diverse talent; and identifying strategic partners to accelerate our inclusion and diversity programs.\nWe have a number of employee networks that enhance our inclusive and diverse culture, including those supporting Women, Africans and African Americans, Latinos, Veterans, the LGBTQ+ community and employees with disabilities.\nWe continue to recruit technical talent in diverse communities, including by engaging as a high-level sponsor of professional conferences, such as the Grace Hopper Celebration, the Society of Hispanic Professional Engineers National Convention and the National Society of Black Engineers National Convention. We also continue to recruit from a variety of colleges including Hispanic-Serving Institutions, Historically Black Colleges and Universities and Women’s Colleges.\nOur continued engagement with organizations that work with diverse communities has been vital to our efforts to increase women and minority representation in our workforce. For example, we partner with AnitaB.org to benchmark our progress and identify promising practices for recruiting, retaining and advancing women technologists and support its research initiatives related to attracting and retaining women and underrepresented minority students in computing majors. We, alongside other top technology companies, helped form the Reboot Representation Tech Coalition, which aims to double the number of Black, Latinx and Native American women receiving computing degrees by 2025. In collaboration with the National Foundation for Autism Research, we started an internship program to welcome those with autism into our Company. Through our collaboration with Disability:IN’s Inclusion Works program, we have increased our ability to address the needs of individuals with disabilities.\nIn an effort to provide additional transparency into our efforts to increase underrepresented populations in our workforce, we intend to disclose our 2020 Consolidated EEO-1 Report after our submission of the report to the U.S. Equal Employment Opportunity Commission.\nFrom a governance perspective, our HR and Compensation Committee, through its charter, provides oversight of our policies, programs and initiatives focusing on workforce diversity and inclusion.\nHealth, Safety and Wellness. The success of our business is fundamentally connected to the well-being of our people. Accordingly, we are committed to the health, safety and wellness of our employees. We provide our employees and their families with access to a variety of innovative, flexible and convenient health and wellness programs, including benefits that provide protection and security so they can have peace of mind concerning events that may require time away from work or that impact their financial well-being; that support their physical and mental health by providing tools and resources to help them improve or maintain their health status and encourage engagement in healthy behaviors; and that offer choice where possible so they can customize their benefits to meet their needs and the needs of their families. In response to the COVID-19 pandemic, we implemented significant changes that we determined were in the best interest of our employees, as well as the communities in which we operate, and which comply with government regulations. This includes having the vast majority of our employees work from home, while implementing additional safety measures for employees continuing critical on-site work.\nCompensation and Benefits. We provide robust compensation and benefits programs to help meet the needs of our employees. In addition to salaries, these programs (which vary by country/region) include annual bonuses, stock awards, an Employee Stock Purchase Plan, a 401(k) Plan, healthcare and insurance benefits, health savings and flexible spending accounts, paid time off, family leave, family care resources, flexible work schedules, adoption and surrogacy assistance, employee assistance programs, tuition assistance and on-site services, such as health centers and fitness centers, among many others. In addition to our broad-based equity award programs, we have used targeted equity-based grants with vesting conditions to facilitate retention of personnel, particularly those with critical engineering skills and experience.\nTalent Development. We invest significant resources to develop the talent needed to remain a world-leading wireless innovator. We deliver numerous training opportunities, provide rotational assignment opportunities, have expanded our focus on continuous learning and development, and implemented “industry-leading” methodologies to manage performance, provide feedback and develop talent.\nOur talent development programs provide employees with the resources they need to help achieve their career goals, build management skills and lead their organizations. We provide a series of employee workshops around the globe that support professional growth and development. Additionally, our manager and employee forum programs provide an ongoing opportunity for employees to practice and apply learning around conversations aligned with our annual review process. We also have an employee development website that provides quick access to learning resources that are personalized to the individual's development needs.\nBuilding Connections - With Each Other and our Communities. We believe that building connections between our employees, their families and our communities creates a more meaningful, fulfilling and enjoyable workplace. Through our engagement programs, our employees can pursue their interests and hobbies, connect to volunteering and giving opportunities and enjoy unique recreational experiences with family members. Leveraging our partnerships with various local\narts and culture organizations, we have created numerous unique experiences for employees and their families around the world.\nSince our employees are passionate about many causes, our corporate giving and volunteering programs support and encourage employees by engaging with those causes. In our offices around the world, our employee-led Giving Committees select local organizations to support, often in the form of grants that are primarily funded by the Qualcomm Foundation (which was established in 2011 to support charitable giving and volunteerism). We also frequently collaborate with these organizations on volunteer activities for our employees. Additionally, during fiscal 2020, thousands of our employees around the world utilized our charitable match program, benefiting more than 1,500 charitable organizations.\nWe encourage you to review the “Our People” section of our March 2020 Corporate Responsibility Report (located on our website) for more detailed information regarding our Human Capital programs and initiatives. Nothing on our website, including our Corporate Responsibility Report or sections thereof, shall be deemed incorporated by reference into this Annual Report.\nAvailable Information\nOur Internet address is www.qualcomm.com. There we make available, free of charge, our Annual Report on Form 10-K, quarterly reports on Form 10-Q, current reports on Form 8-K, proxy statements and any amendments to those reports (among others), as soon as reasonably practicable after we electronically file such material with, or furnish it to, the Securities and Exchange Commission (SEC). We also make available on our Internet site public financial information for which a report is not required to be filed with or furnished to the SEC. Our SEC reports and other financial information can be accessed through the investor relations section of our Internet site. The information found on our Internet site is not part of this or any other report we file with or furnish to the SEC.\nInformation about our Executive Officers\nOur executive officers (and their ages at September 27, 2020) are as follows:\nSteve Mollenkopf, age 51, has served as Chief Executive Officer since March 2014 and as a director since December 2013. He served as Chief Executive Officer-elect and President from December 2013 to March 2014 and as President and Chief Operating Officer from November 2011 to December 2013. In addition, he served as Executive Vice President and Group President from September 2010 to November 2011 and as Executive Vice President and President, QCT from August 2008 to September 2010. Mr. Mollenkopf joined Qualcomm in 1994 as an engineer and throughout his tenure at Qualcomm has held several other technical and leadership roles. Mr. Mollenkopf has been a member of the board of directors of Boeing Company since April 2020. Mr. Mollenkopf served as a member of the board of directors of General Electric Company from November 2016 to April 2018. Mr. Mollenkopf holds a B.S. in Electrical Engineering from Virginia Tech and an M.S. in Electrical Engineering from the University of Michigan.\nHeather Ace, age 50, has served as Executive Vice President, Human Resources since March 2020. Prior to joining Qualcomm, Ms. Ace was Senior Vice President, Human Resources at DexCom, Inc., a provider of continuous glucose monitoring, from July 2016 to March 2020. Prior to DexCom, she was Executive Vice President, Human Resources at Orexigen Therapeutics, Inc., a developer of treatments for obesity, from January 2016 to July 2016. Ms. Ace was Integration Leader for Royal Philips, leading the cross-functional integration of Philips Healthcare’s acquisition of Volcano Corporation, from January 2015 to January 2016. She was Executive Vice President, Human Resources at Volcano Corporation from May 2012 to January 2015. Prior to May 2012, Ms. Ace served in various senior executive roles in human resources, post-acquisition/merger integration and employment law at Life Technologies Corporation. She began her career at Gray Cary Ware & Freidenrich (now DLA Piper) as a litigation and transactional employment attorney, specializing in mergers and acquisitions. Ms. Ace holds a B.A. in Law & Society from the University of California, Santa Barbara and a J.D. from Santa Clara School of Law.\nCristiano R. Amon, age 50, has served as President, Qualcomm Incorporated since January 2018. He served as Executive Vice President, Qualcomm Technologies, Inc., a subsidiary of Qualcomm Incorporated (QTI), and President, QCT, from November 2015 to January 2018. He served as Executive Vice President, QTI and Co-President, QCT from October 2012 to November 2015, Senior Vice President, Qualcomm Incorporated and Co-President, QCT from June 2012 to October 2012 and as Senior Vice President, QCT Product Management from October 2007 to June 2012, with responsibility for QTI’s product roadmap, including the Qualcomm Snapdragon platforms. Mr. Amon joined Qualcomm in 1995 as an engineer and throughout his tenure at Qualcomm has held several other technical and leadership positions. Mr. Amon holds a B.S. in Electrical Engineering and an honorary doctorate from UNICAMP, the State University of Campinas, Brazil.\nBrian T. Modoff, age 61, has served as Executive Vice President, Strategy and Mergers & Acquisitions, which includes responsibility for Qualcomm Ventures, since October 2015. Prior to joining Qualcomm, Mr. Modoff was a Managing Director in Equity Research at Deutsche Bank Securities Inc., a provider of financial services, from March 1999 to October 2015. Prior to joining Deutsche Bank, Mr. Modoff was a research analyst at several financial institutions from November 1993 to March 1999. Mr. Modoff previously worked in defense electronics, including at Rockwell International in manufacturing management, and for the U.S. Navy as a communications technician. Mr. Modoff holds a B.A. in Economics from California State University, Fullerton and a Master of International Management from the Thunderbird School of Global Management.\nAkash Palkhiwala, age 45, has served as Executive Vice President and Chief Financial Officer since November 2019. He served as Senior Vice President and Interim Chief Financial Officer from August 2019 to November 2019. He served as Senior Vice President, QCT Finance from December 2015 to August 2019 and Senior Vice President and Treasurer, Qualcomm Incorporated from October 2014 to December 2015. Mr. Palkhiwala served as Vice President, QCT Finance from October 2012 to October 2014 and Vice President, QCT Finance from October 2009 to October 2012. He served in various other finance roles since joining Qualcomm in March 2001. Prior to joining Qualcomm, Mr. Palkhiwala was an Analyst at KeyBank. Mr. Palkhiwala has an undergraduate degree in Mechanical Engineering from L.D. College of Engineering in India and an M.B.A from the University of Maryland.\nAlexander H. Rogers, age 63, has served as Executive Vice President and President, QTL since October 2016. He served as Senior Vice President and President, QTL from September 2016 to October 2016, Senior Vice President, Deputy General Counsel and General Manager, QTL from March 2016 to September 2016, Senior Vice President and Deputy General Counsel from October 2015 to March 2016 and Senior Vice President and Legal Counsel from April 2007 to October 2015. Prior to transitioning to QTL, Mr. Rogers led Qualcomm’s litigation group. Mr. Rogers joined Qualcomm in January 2001 as an attorney. Prior to joining Qualcomm, Mr. Rogers was a partner at the law firm of Gray, Cary, Ware & Freidenrich (now DLA Piper), specializing in intellectual property and commercial litigation. Mr. Rogers holds a B.A. and an M.A. in English Literature from Georgetown University and a J.D. from Georgetown University Law Center.\nDonald J. Rosenberg, age 69, has served as Executive Vice President, General Counsel and Corporate Secretary since October 2007. He served as Senior Vice President, General Counsel and Corporate Secretary of Apple Inc. from November 2006 to October 2007. From May 1975 to November 2006, Mr. Rosenberg held numerous positions at IBM Corporation, including Senior Vice President and General Counsel. Mr. Rosenberg has served as a member of the board of directors of NuVasive, Inc. since February 2016. Mr. Rosenberg holds a B.S. in Mathematics from the State University of New York at Stony Brook and a J.D. from St. John’s University School of Law.\nJames H. Thompson, age 56, has served as Executive Vice President, Engineering, QTI and Chief Technology Officer since March 2017. He served as Executive Vice President, Engineering, QTI from October 2012 to March 2017 and as Senior Vice President, Engineering, Qualcomm Incorporated from July 1998 to October 2012. Dr. Thompson joined Qualcomm in 1992 as a senior engineer and throughout his tenure at Qualcomm held several other technical and leadership positions. Dr. Thompson holds a B.S., an M.S. and a Ph.D. in Electrical Engineering from the University of Wisconsin.",
    "item_1A": "Item 1A. Risk Factors\nYou should consider each of the following factors in evaluating our business and our prospects. However, the risks and uncertainties described below are not the only ones we face. Additional risks and uncertainties not presently known to us or that we currently consider immaterial may also negatively impact our business, results of operations, cash flows and financial condition, and require significant management time and attention. In that case, the trading price of our common stock could decline. In addition to the risks and uncertainties set forth in the Risk Factor below entitled “The recent coronavirus (COVID-19) pandemic has had an adverse effect on our business and results of operations, and we expect its impact will continue, at least in the near term,” many of the risks and uncertainties set forth in the other Risk Factors below are exacerbated by the COVID-19 pandemic, government and business responses thereto and any further resulting decline in the global business and economic environment, and may be impacted by the extent and speed of the global economic recovery. You should also consider the other information set forth in this Annual Report in evaluating our business and our prospects, including but not limited to our financial statements and the related notes, and “Part II, Item 7. Management’s Discussion and Analysis of Financial Condition and Results of Operations.” References to “and,” “or” and “and/or” should be read to include the others, as appropriate.\nRISKS RELATED TO THE CORONAVIRUS (COVID-19) PANDEMIC\nThe recent coronavirus (COVID-19) pandemic has had an adverse effect on our business and results of operations, and we expect its impact will continue, at least in the near term.\nThe rapid, global spread of COVID-19 and the fear it has created has resulted in significant economic uncertainty, significant declines in business and consumer confidence and global demand in the wireless industry (among others), a global economic slowdown, and has led to a global recession. Specifically, the decline in demand for smartphones and other consumer devices sold by our customers or licensees has resulted in decreased demand for our integrated circuit products (which are incorporated into such devices) and a decrease in the royalties we earn on the licensing of our intellectual property (which is dependent upon the number of such devices sold that utilize our intellectual property). We expect that demand for our products and demand for the products of our customers and licensees will continue to be negatively impacted in the near term.\nFurther, while to date we have not seen a significant impact on our manufacturing facilities or our supply chain, the ability of our suppliers to deliver on their commitments to us, or our ability to ship our products to our customers, may be negatively impacted by the pandemic and/or government responses thereto, such as travel bans and restrictions, quarantines, shelter-in-place and social distancing orders, declarations of states of emergency and shutdowns.\nAlthough the spread of COVID-19 has caused us to modify our workforce practices, such as having the vast majority of our employees working from home, we have not experienced a significant negative impact to our business or results of\noperations. However, we could be negatively affected in the future if, among others, a significant number of our employees, or employees who perform critical functions, become ill and/or are quarantined as the result of exposure to COVID-19, or if government policies restrict the ability of those employees to perform their critical functions.\nThe COVID-19 pandemic could also impact our business, results of operations and financial condition through delayed, reduced or cancelled customer orders; the inability of our customers or licensees to purchase or pay for our products or technologies; the insolvency of key suppliers, customers or licensees; delays in reporting or payments from our customers or licensees; or failures by other counterparties. Additionally, state or federal governments may in the future increase corporate tax rates, increase employer payroll tax obligations and/or otherwise change tax laws to pay for stimulus and other actions that may be taken as a result of COVID-19.\nThe degree to which the COVID-19 pandemic impacts our future business, results of operations and financial condition will depend on future developments, which are uncertain, including but not limited to the duration, spread and severity of the pandemic, government responses and other actions to mitigate the spread of and to treat COVID-19, and when and to what extent normal business, economic and social activity and conditions resume. We are similarly unable to predict the extent to which the pandemic impacts our customers, licensees, suppliers and other partners and their financial conditions, but adverse effects on these parties could also adversely affect us. Finally, the COVID-19 pandemic makes it challenging for management to estimate the future performance of our business.\nRISKS RELATED TO INDUSTRY DYNAMICS AND COMPETITION\nOur revenues depend on our customers’ and licensees’ sales of products and services based on CDMA, OFDMA and other communications technologies, including 5G, and customer demand for our products based on these technologies.\nWe develop, patent and commercialize technology and products based on CDMA, OFDMA and other communications technologies, which are primarily wireless. We depend on our customers and licensees to develop devices and services based on these technologies with value-added features to drive consumer demand for new 3G/4G and 3G/4G/5G multimode devices, as well as 3G, 4G and 5G single-mode devices, and to establish the selling prices for such devices. Further, the timing of our shipment of our products is dependent on the timing of our customers’ and licensees’ deployments of new devices and services based on these technologies. Increasingly, we also depend on operators of wireless networks, our customers and licensees and other third parties to incorporate these technologies into new device types and into industries and applications beyond mobile, such as automotive and IoT, among others.\nWe have historically been successful during wireless technology transitions, including 3G, 4G and now 5G. Commercial deployments of 5G networks and devices have begun and will continue. However, the timing and scale of such deployments, in certain regions, have been and may in the future be delayed due to the COVID-19 pandemic.\nWe believe it is critical that we remain a leader in 5G technology development, standardization, intellectual property creation and technology licensing, and that we develop, commercialize and be a leading supplier of 5G integrated circuit products, in order to sustain and grow our business long-term.\nOur revenues and growth in revenues could be negatively impacted, our business may be harmed and our substantial investments in these technologies may not provide us an adequate return, if our customers’ and licensees’ revenues and sales of products, particularly premium-tier products, and services using these technologies, and average selling prices of such products, decline due to, for example, the maturity of smartphone penetration in developed regions and China; our intellectual property and technical leadership included in the continued 5G standardization effort is less than in 3G and 4G standards; we are unable to drive the adoption of our products into networks and devices, including devices beyond mobile; or consumers’ rates of replacement of smartphones and other computing devices decline.\nOur industry is subject to intense competition in an environment of rapid technological change. Our success depends in part on our ability to adapt to such change and compete effectively; and such change and competition could result in decreased demand for our products and technologies or declining average selling prices for our products or those of our customers or licensees.\nOur products and technologies face significant competition. We expect competition to increase as our current competitors expand their product offerings, improve their products or reduce the prices of their products as part of a strategy to maintain existing business and customers or attract new business and customers, as new opportunities develop, and as new competitors enter the industry. Competition in wireless communications is affected by various factors that include, among others: OEM concentrations; vertical integration; competition in certain geographic regions; government intervention or support of national industries or competitors; the ability to maintain product differentiation as the result of evolving industry standards and speed of technological change (including the transition to smaller geometry process technologies and the demand for always on, always connected capabilities); and value-added features that drive selling prices and consumer demand for new 3G/4G and 3G/4G/5G multimode devices, as well as 3G and 4G single-mode devices.\nWe anticipate that additional competitors will introduce products as a result of growth opportunities in wireless communications, the trend toward global expansion by foreign and domestic competitors, and technological and public policy changes. Additionally, the semiconductor industry has experienced and may continue to experience consolidation, which could result in significant changes to the competitive landscape. For example, if any key supplier of technologies and intellectual property to the semiconductor industry was sold to one of our competitors, it could negatively affect our ability to\nprocure or license such technologies and intellectual property in the future, which could have wide-ranging impacts on our business and operations.\nWe expect that our future success will depend on, among other factors, our ability to:\n•differentiate our integrated circuit products with innovative technologies across multiple products and features (e.g., modem, radio frequency front-end (RFFE), including mmWave, graphics and other processors, camera and connectivity) and with smaller geometry process technologies that drive both performance and lower power consumption;\n•develop and offer integrated circuit products at competitive cost and price points to effectively cover all geographic regions and all device tiers;\n•continue to be a leader in mobile, and drive the adoption of our technologies and integrated circuit products, including RFFE, into the most popular device models and across a broad spectrum of devices in mobile, such as smartphones, tablets, laptops and other mobile computing devices;\n•increase or accelerate adoption of our technologies and products in industry segments or applications outside of mobile, including automotive and IoT;\n•maintain or accelerate demand for our integrated circuit products at the premium device tier, while also driving the adoption of our products into high, mid- and low-tier devices across all regions;\n•remain a leader in 5G (and 4G) technology development, standardization, intellectual property creation and licensing, and develop, commercialize and remain a leading supplier of 5G (and 4G) integrated circuit products, including RFFE products;\n•create standalone value and contribute to the success of our existing businesses through acquisitions, joint ventures and other transactions, and by developing customer, licensee, vendor, distributor and other channel relationships in new industry segments or applications and with disruptive technologies and products;\n•identify potential acquisition targets that will grow or sustain our business or address strategic needs, reach agreement on terms acceptable to us, close the transactions and effectively integrate these new businesses, products and technologies;\n•provide leading products and technologies to OEMs, high level operating systems (HLOS) providers, operators, cloud providers and other industry participants as competitors, new industry entrants and other factors continue to affect the industry landscape;\n•be a preferred partner and sustain preferred relationships providing integrated circuit products that support multiple operating system and infrastructure platforms to industry participants that effectively commercialize new devices using these platforms; and\n•continue to develop brand recognition to effectively compete against better known companies in computing and other consumer driven segments and to deepen our presence in significant emerging regions and China.\nWe compete with many different semiconductor companies, ranging from multinational companies with integrated research and development, manufacturing, sales and marketing organizations across a broad spectrum of product lines, to companies that are focused on a single application, industry segment or standard product, including those that produce products for mobile, automotive and IoT, among others. Most of these competitors compete with us with respect to some, but not all, of our businesses. Companies that design integrated circuits based on CDMA, OFDMA, Wi-Fi or their derivatives are generally competitors or potential competitors. Examples (some of which are strategic partners of ours in other areas) include Broadcom, HiSilicon, MediaTek, Nvidia, NXP Semiconductors, Qorvo, Samsung, Skyworks, Texas Instruments and UNISOC (formally known as Spreadtrum Communications). Some of these current and potential competitors may have advantages over us that include, among others: motivation by our customers in certain circumstances to use our competitors’ integrated circuit products, to utilize their own internally-developed integrated circuit products, or sell such products to others, or to utilize alternative technologies; lower cost structures or a willingness and ability to accept lower prices or lower margins for their products, particularly in China; foreign government support of other technologies, competitors or OEMs that sell devices that do not contain our integrated circuit products; better known brand names; ownership and control of manufacturing facilities and greater expertise in manufacturing processes; more extensive relationships with local distribution companies and OEMs in certain geographic regions (such as China); more experience in adjacent industry segments or applications beyond mobile (such as automotive and IoT); and a more established presence in certain regions.\nIn addition, certain of our largest integrated circuit customers have in the past utilized, currently utilize and may in the future utilize our competitors’ integrated circuit products in some (or all) of their devices, rather than our products. Further, certain of those customers have developed, are developing or may develop their own integrated circuit products (effectively making them competitors), which they have in the past utilized, currently utilize and may in the future utilize in some (or all) of their devices, rather than our products. See also the Risk Factor entitled “Our business, particularly our semiconductor business, may suffer as a result of our customers vertically integrating (i.e., developing their own integrated circuit products).” Further, political actions, including trade and/or national security protection policies, or other actions by governments, particularly the U.S. and Chinese governments, have in the past, currently are and could in the future limit or\nprevent us from transacting business with certain of our customers or suppliers, limit, prevent or discourage certain of our customers or suppliers from transacting business with us, or make it more expensive to do so. This could advantage our competitors by enabling them with increased sales, economies of scale, operating income and/or cash flows and/or enable critical technology transfer, allowing them to increase their investments in technology development, research and development and commercialization of products. See also the Risk Factor entitled “A significant portion of our business is concentrated in China, and the risks of such concentration are exacerbated by U.S./China trade and national security tensions.” Further, certain of our competitors develop and sell multiple components (including integrated circuit products) for use in devices and sell those components together to OEMs. Our competitors’ sales of multiple components put us (and our discrete integrated circuit products) at a competitive disadvantage. Certain of our competitors also develop and sell infrastructure equipment for wireless networks and can optimize their integrated circuit products to perform on such networks to a degree that we are not able to, which again puts us at a competitive disadvantage.\nCompetition in any or all product tiers may result in the loss of business or customers, which would negatively impact our business, revenues, results of operations, cash flows and financial condition. Such competition may also reduce average selling prices for our chipset products or the products of our customers and licensees. Certain of these dynamics are particularly pronounced in emerging regions and China where competitors may have lower cost structures or may have a willingness and ability to accept lower prices or lower margins on their products. Reductions in the average selling prices of our chipset products, without a corresponding increase in volumes, would negatively impact our revenues, and without corresponding decreases in average unit costs, would negatively impact our margins. In addition, reductions in the average selling prices of our licensees’ products, unless offset by an increase in volumes, would generally decrease total royalties payable to us, negatively impacting our licensing revenues.\nRISKS RELATED TO OUR OPERATING BUSINESSES\nWe derive a significant portion of our revenues from a small number of customers and licensees, and particularly from their sale of premium tier devices. If revenues derived from these customers or licensees decrease or the timing of such revenues fluctuates, our business and results of operations could be negatively affected.\nWe derive a significant portion of our revenues from a small number of customers, and particularly from their sale of premium tier devices, and we expect this trend to continue in the foreseeable future. Our industry is experiencing and may continue to experience concentration of device share among a few companies, particularly at the premium tier, contributing to this trend. Chinese OEMs continue to grow their device share in China and are increasing their device share in regions outside of China, and we derive a significant portion of our revenues from a small number of these OEMs as well.\nIn addition, a number of our largest integrated circuit customers have developed, are developing or may develop their own integrated circuit products, or may choose our competitors’ integrated circuit products, which they have in the past utilized, currently utilize and may in the future utilize in some (or all) of their devices, rather than our products, which could significantly reduce the revenues we derive from these customers. See also the Risk Factor entitled “Our business, particularly our semiconductor business, may suffer as a result of our customers vertically integrating (i.e., developing their own integrated circuit products).”\nFurther, political actions, including trade and/or national security protection policies, or other actions by governments, particularly the U.S. and Chinese governments, have in the past and could in the future limit or prevent us from transacting business with some of our largest customers, limit, prevent or discourage those customers from transacting business with us, or make it more expensive to do so, any of which could also significantly reduce the revenues we derive from these customers. See also the Risk Factor entitled “A significant portion of our business is concentrated in China, and the risks of such concentration are exacerbated by U.S./China trade and national security tensions.”\nIn addition, we spend a significant amount of engineering and development time, funds and resources in understanding our key customers’ feedback and/or specifications and attempt to incorporate such input into our product launches and technologies. These efforts may not require or result in purchase commitments from such customers or we may have lower purchases from such customers than expected, and consequently, we may not achieve the anticipated revenues from these efforts, or these efforts may result in non-recoverable costs.\nThe loss of any one of our significant customers, a reduction in the purchases of our products by such customers or the cancelation of significant purchases by any of these customers, whether due to the use of their own integrated circuit products or our competitors’ integrated circuit products, government restrictions, the COVID-19 pandemic or otherwise, would reduce our revenues and could harm our ability to achieve or sustain expected results of operations, and a delay of significant purchases, even if only temporary, would reduce our revenues in the period of the delay. Any such reduction in revenues would also impact our cash resources available for other purposes, such as research and development.\nFurther, the concentration of device share among a few companies, and the corresponding purchasing power of these companies, may result in lower prices for our products which, if not accompanied by a sufficient increase in the volume of purchases of our products, could have an adverse effect on our revenues and margins. In addition, the timing and size of purchases by our significant customers may be impacted by the timing of such customers’ new or next generation product introductions, over which we have no control, and the timing and success of such introductions may cause our revenues and results of operations to fluctuate.\nApple purchases our MDM (or thin modem) products, which do not include our integrated application processor technology, and which have lower revenue and margin contributions than our combined modem and application processor products. Further, to the extent Apple takes device share from our customers who purchase our integrated modem and application processor products, our revenues and margins may be negatively impacted.\nOur industry has also experienced, and we expect it will continue to experience, slowing growth in the premium-tier device segment due to, among other factors, lengthening replacement cycles in developed regions, where premium-tier smartphones are common; increasing consumer demand in emerging regions where premium-tier smartphones are less common and replacement cycles are on average longer than in developed regions and are continuing to lengthen; and a maturing premium-tier smartphone industry in which demand is increasingly driven by new product launches and innovation cycles.\nA reduction in sales of premium-tier devices, a reduction in sales of our premium-tier integrated circuit products (which have a higher revenue and margin contribution than our lower-tier integrated circuit products), or a shift in share away from OEMs that utilize our premium-tier products, would reduce our revenues and margins and may harm our ability to achieve or sustain expected financial results. Any such reduction in revenues would also impact our cash resources available for other purposes, such as research and development.\nAlthough we have more than 300 licensees, we derive a significant portion of our licensing revenues from a limited number of licensees, which includes a small number of Chinese OEMs. In the event that one or more of our significant licensees fail to meet their reporting and payment obligations, or we are unable to renew or modify one or more of their license agreements under similar terms as their existing agreements, our revenues, results of operations and cash flows would be adversely impacted. Moreover, the future growth and success of our core licensing business will depend in part on the ability of our licensees to develop, introduce and deliver high-volume products that achieve and sustain customer acceptance. We do not have control over the product development, sales efforts or pricing of products by our licensees, and our licensees might not be successful. Reductions in sales of our licensees’ products, or reductions in the average selling prices of wireless devices sold by our licensees without a sufficient increase in the volumes of such devices sold, would generally have an adverse effect on our licensing revenues. Such adverse impact may be mitigated by our per unit royalty caps that apply to certain categories of our licensees’ complete wireless devices, namely smartphones, tablets, laptops and smartwatches.\nOur business, particularly our semiconductor business, may suffer as a result of our customers vertically integrating (i.e., developing their own integrated circuit products).\nCertain of our largest integrated circuit customers (for example, Samsung) develop their own integrated circuit products, which they have in the past utilized, and currently utilize, in certain of their devices and may in the future utilize in some (or all) of their devices, rather than our products (and they have and may continue to sell their integrated circuit products to third parties, discretely or together with certain of their other products, in competition with us).\nApple has utilized modem products of one of our competitors in some of its devices rather than our products, and solely utilized one of our competitors’ products in several of its recent device launches. In April 2019, we entered into a new multi-year chipset supply agreement with Apple and began shipping modems under this agreement in the third quarter of fiscal 2020. In December 2019, Apple acquired Intel’s modem assets and is developing its own modem products using these assets. Accordingly, Apple is expected to use its own modem products, rather than our products, in some (or all) of its future devices.\nSimilarly, we derive a significant portion of our revenues from Chinese OEMs. Certain of our customers in China have developed, and others may in the future develop, their own integrated circuit products and use such integrated circuit products in their devices rather than our integrated circuit products, including due to pressure from or policies of the Chinese government (whose Made in China 2025 campaign targets 70% semiconductor self-sufficiency by 2025), concerns over losing access to our integrated circuit products as a result of actual, threatened or potential U.S. or Chinese government actions or policies, including trade protection or national security policies, or other reasons.\nIf some or all of our largest customers and/or the largest smartphone OEMs utilize their own integrated circuit/modem products in some (or all) of their devices rather than our products, our business, revenues, results of operations, cash flows and financial position could be materially adversely impacted. See also the Risk Factor entitled “We derive a significant portion of our revenues from a small number of customers and licensees, and particularly from their sale of premium tier devices. If revenues derived from these customers or licensees decrease or the timing of such revenues fluctuates, our business and results of operations could be negatively affected.”\nA significant portion of our business is concentrated in China, and the risks of such concentration are exacerbated by U.S./China trade and national security tensions.\nWe derive a significant portion of our revenues from Chinese OEMs, and from non-Chinese OEMs that utilize our integrated circuit products in their devices and sell those devices into China, which has the largest number of smartphone users in the world. We also source certain critical integrated circuit products from suppliers in China.\nDue to various factors, including pressure, encouragement or incentives from, or policies of, the Chinese government (including its Made in China 2025 campaign), concerns over losing access to our integrated circuit products as a result of actual, threatened or potential U.S. or Chinese government actions or policies, including trade protection or national security\npolicies, or other reasons, some of our Chinese integrated circuit customers have developed, and others may in the future develop, their own integrated circuit products and use such integrated circuit products in their devices, or use our competitors’ integrated circuit products in their devices, rather than our products.\nPolitical actions, including trade protection and national security policies of the U.S. and Chinese governments, such as tariffs, bans or placing companies on restricted entity lists, have in the past, currently are and could in the future limit or prevent us from transacting business with certain of our Chinese customers or suppliers, limit, prevent or discourage certain of our Chinese customers or suppliers from transacting business with us, or make it more expensive to do so. Given our revenue concentration in China, if, due to actual, threatened or potential U.S. or Chinese government actions or policies, we were further limited in, or prohibited from, obtaining critical integrated circuit products from suppliers in China or selling our integrated circuit products to Chinese OEMs; if our non-Chinese OEM customers were limited in, or prohibited from, selling devices into China that incorporate our integrated circuit products; if Chinese OEMs develop and use their own integrated circuit products or use our competitors’ integrated circuit products in some (or all) of their devices rather than our integrated circuit products; if Chinese tariffs on our integrated circuit products or on devices which incorporate our integrated circuit products made purchasing such products or devices more expensive to Chinese OEMs or Chinese consumers; or if our Chinese licensees delay or cease making payments of license fees they owe us, our business, revenues, results of operations, cash flows and financial position could be materially harmed.\nFinally, government policies in China that regulate the amount and timing of funds that may flow out of the country have impacted and may continue to impact the timing of our receipt of, and/or ability to receive, payments from our customers and licensees in China, which may negatively impact our cash flows.\nRISKS SPECIFIC TO OUR LICENSING BUSINESS\nEfforts by some OEMs to avoid paying fair and reasonable royalties for the use of our intellectual property may require the investment of substantial management time and financial resources and may result in legal decisions or actions by governments, courts, regulators or agencies, Standards Development Organizations (SDOs) or other industry organizations that harm our business.\nFrom time to time, companies initiate various strategies to attempt to negotiate, renegotiate, reduce and/or eliminate their need to pay royalties to us for the use of our intellectual property. These strategies have included: (i) litigation, often alleging infringement of patents held by such companies, patent misuse, patent exhaustion, patent invalidity or unenforceability of our patents or licenses, alleging that we do not license our patents on fair, reasonable and nondiscriminatory (FRAND) terms, or alleging some form of unfair competition or competition law violation; (ii) taking positions contrary to our understanding (and/or the plain language) of their contracts with us; (iii) appeals to governmental authorities; (iv) collective action, including working with wireless operators, standards bodies, other like-minded companies and organizations, on both formal and informal bases, to adopt intellectual property policies and practices that could have the effect of limiting returns on intellectual property innovations; (v) lobbying governmental regulators and elected officials for the purpose of seeking the reduction of royalty rates or the base on which royalties are calculated, seeking to impose some form of compulsory licensing or weakening a patent holder’s ability to enforce its rights or obtain a fair return for such rights; and (vi) attempts by licensees to shift their royalty obligation to their suppliers in order to lower the wholesale (i.e., licensee’s) selling price on which the royalty is calculated.\nIn addition, certain licensees have disputed, underreported, underpaid, not reported or not paid royalties owed to us under their license agreements or reported to us in a manner that is not in compliance with their contractual obligations, and certain companies have yet to enter into or have delayed entering into or renewing license agreements with us for their use of our intellectual property, and they or others may engage in such behavior in the future. The fact that one or more licensees dispute, underreport, underpay, do not report or do not pay royalties owed to us may encourage other licensees to take similar actions or not renew their existing license agreements, and may encourage other licensees or unlicensed companies to delay entering into, or to not enter into, new license agreements. Further, to the extent such licensees and companies increase their device share, the negative impact of their underreporting, underpayment, non-payment or non-reporting on our business, revenues, results of operations, cash flows and financial condition will be exacerbated.\nWe have been in the past and are currently subject to various litigation and governmental investigations and proceedings. Certain of these matters are described more fully in this Annual Report in “Notes to Consolidated Financial Statements, Note 7. Commitments and Contingencies.” We may become subject to other litigation or governmental investigations or proceedings in the future. Additionally, certain of our direct and indirect customers and licensees have pursued, and others may in the future pursue, litigation or arbitration against us related to our business. Unfavorable resolutions of one or more of these matters have had and could in the future have a material adverse effect on our business, revenues, results of operations, cash flows and financial condition. See also the Risk Factors below entitled “Our business may suffer as a result of adverse rulings in government investigations or proceedings” and “Changes in our patent licensing practices, whether due to governmental investigations or private legal proceedings challenging those practices, or otherwise, could adversely impact our business and results of operations.”\nIn addition, in connection with our participation in SDOs, we, like other patent owners, generally have made contractual commitments to such organizations to license those of our patents that would necessarily be infringed by standard-compliant products as set forth in those commitments. Some manufacturers and users of standard-compliant products advance\ninterpretations of these commitments that are adverse to our licensing business, including interpretations that would limit the amount of royalties that we could collect on the licensing of our standard-essential patent portfolio.\nFurther, some companies or entities have proposed significant changes to existing intellectual property policies for implementation by SDOs and other industry organizations with the goal of significantly devaluing standard-essential patents. For example, some have put forth proposals which would require a maximum aggregate intellectual property royalty rate for the use of all standard-essential patents owned by all of the member companies to be applied to the selling price of any product implementing the relevant standard. They have further proposed that such maximum aggregate royalty rate be apportioned to each member company with standard-essential patents based upon the number of standard-essential patents held by such company. Others have proposed that injunctions should not be an available remedy for infringement of standard-essential patents and have made proposals that could severely limit damage awards and other remedies by courts for patent infringement (e.g., by severely limiting the base upon which the royalty rate may be applied). A number of these strategies are purportedly based on interpretations of the policies of certain SDOs concerning the licensing of patents that are or may be essential to industry standards and on our (or other companies’) alleged failure to abide by these policies. Some SDOs, courts and governmental agencies have adopted, and may in the future adopt, some or all of these interpretations or proposals in a manner adverse to our interests, including in litigation to which we may not be a party.\nWe expect that such proposals, interpretations and strategies will continue in the future, and if successful, our business model would be harmed, either by limiting or eliminating our ability to collect royalties (or by reducing the royalties we can collect) on all or a portion of our standard-essential patent portfolio, limiting our return on investment with respect to new technologies, limiting our ability to seek injunctions against infringers of our standard-essential patents, constraining our ability to make licensing commitments when submitting our technologies for inclusion in future standards (which could make our technologies less likely to be included in such standards) or forcing us to work outside of SDOs or other industry groups to promote our new technologies, and our revenues, results of operations and cash flows could be negatively impacted. In addition, the legal and other costs associated with asserting or defending our positions have been and continue to be significant. We expect that such challenges, regardless of their merits, will continue into the foreseeable future and will require the investment of substantial management time and financial resources.\nChanges in our patent licensing practices, whether due to governmental investigations or private legal proceedings challenging those practices, or otherwise, could adversely impact our business and results of operations.\nAs described in the Risk Factor “Our business may suffer as a result of adverse rulings in government investigations or proceedings” below, we have been in the past and are currently subject to various governmental investigations and proceedings, as well as private legal proceedings, challenging our patent licensing and chipset sales practices. Certain of these matters are described more fully in this Annual Report in “Notes to Consolidated Financial Statements, Note 7. Commitments and Contingencies.” We believe that one intent of certain of these investigations and legal proceedings has been to reduce the amount of royalties that licensees are required to pay to us for their use of our intellectual property. We may become subject to other litigation or governmental investigations or proceedings in the future.\nIf we were required to reduce the royalty rates in our patent license agreements, our revenues, earnings and cash flows would be negatively impacted absent a sufficient increase in the volume of sales of devices upon which royalties are paid. Similarly, if we were required to reduce the base on which our royalties are calculated, our revenues, results of operations and cash flows would be negatively impacted unless there was a sufficient increase in the volume of sales of devices upon which royalties are paid or we were able to increase our royalty rates to offset the decrease in revenues resulting from such lower royalty base (assuming the absolute royalty dollars were below any relevant royalty caps).\nIf we were required to grant patent licenses to chipset manufacturers (which could lead to implementing a more complex, multi-level licensing structure in which we license certain portions of our patent portfolio to chipset manufacturers and other portions to OEMs), we would incur additional transaction costs, which may be significant, and we could incur delays in recognizing revenues until license negotiations were completed. In addition, our licensing revenues and earnings would be negatively impacted if we were not able to obtain, in the aggregate, equivalent revenues under such a multi-level licensing structure.\nIf we were required to sell chipsets to OEMs that do not have a license to our patents, our licensing program could be negatively impacted by patent exhaustion claims raised by such unlicensed OEMs (i.e., claims that our sale of chipsets to such OEMs forecloses us from asserting any patents substantially embodied by the chipsets against such OEMs). Such sales would provide OEMs with a defense in the event we asserted our patents against them to obtain licensing revenue for those patents. This could have a material adverse effect on our licensing program and our results of operations, cash flows and financial condition.\nTo the extent that we were required to implement any of these new licensing and/or business practices, including by modifying or renegotiating our existing license agreements or pursuing other commercial arrangements, we would incur additional transaction costs, which may be significant, we could incur delays in recognizing revenues until license negotiations were completed, and our business, revenues, results of operations, cash flows and financial condition could be harmed. The impact of any such changes to our licensing practices could vary widely and by jurisdiction, depending on the specific outcomes and the geographic scope of such outcomes. In addition, if we were required to make modifications to our licensing practices in one jurisdiction, licensees or governmental agencies in other jurisdictions may attempt to obtain similar outcomes for themselves or for such other jurisdictions, as applicable.\nThe continued and future success of our licensing programs requires us to continue to evolve our patent portfolio and to renew or renegotiate license agreements that are expiring or to cover additional future patents.\nWe own a very strong portfolio of issued and pending patents related to 3G, 4G, 5G and other technologies. It is critical that we continue to evolve our patent portfolio, particularly in 5G. If we do not maintain a strong portfolio that is applicable to current and future standards, products and services, our future licensing revenues could be negatively impacted.\nFurther, the licenses granted to and from us under a number of our license agreements include only patents that are either filed or issued prior to a certain date. As a result, there are agreements with some licensees where later patents are not licensed by or to us. Additionally, our patent license agreements in effect that constitute a significant portion of our licensing revenues are effective for a specified term. In order to license or to obtain a license to such later patents or after the expiration of the specified term, and to receive royalties after the expiration date of the specified term, we will need to extend or modify such license agreements or enter into new license agreements with such licensees more frequently than we have done historically. We might not be able to extend or modify license agreements, or enter into new license agreements, in the future without negatively affecting the material terms and conditions of our license agreements with such licensees, and such modifications or new agreements may negatively impact our revenues. In some circumstances, we may extend, modify or enter into new license agreements as a result of arbitration or litigation, and terms imposed by arbitrators or courts may be less favorable to us than existing terms and may impact the financial or other terms of license agreements not subject to the litigation or arbitration. If there is a delay in extending, modifying or entering into a new license agreement with a licensee, there would be a delay in our ability to recognize revenues related to that licensee’s product sales. Further, if we are unable to reach agreement on such modifications or new agreements, it could result in patent infringement litigation with such companies.\nRISKS RELATED TO REGULATORY AND LEGAL CHALLENGES\nOur business may suffer as a result of adverse rulings in government investigations or proceedings.\nWe have been in the past and are currently subject to various governmental investigations and proceedings. Certain of these matters are described more fully in this Annual Report in “Notes to Consolidated Financial Statements, Note 7. Commitments and Contingencies.” Key allegations or findings in those matters include, among others, that we violate FRAND licensing commitments by refusing to grant licenses to chipset manufacturers; that our royalty rates are too high; that the base on which our royalties are calculated should be something less than the wholesale (i.e., licensee’s) selling price of the applicable device (minus certain permitted deductions); that we unlawfully require customers to execute a patent license before we sell them cellular modem chipsets; that we have entered into exclusive agreements with chipset customers that foreclose competition; that we leverage our position in baseband chipsets in the RFFE space; and that we violate antitrust laws, engage in anticompetitive conduct and unfair methods of competition. We may become subject to other litigation or governmental investigations or proceedings in the future.\nUnfavorable resolutions of one or more of these matters have had and could in the future have a material adverse effect on our business, revenues, results of operations, cash flows and financial condition. Depending on the matter, various remedies that could result from an unfavorable resolution include, among others, the loss of our ability to enforce one or more of our patents; injunctions; monetary damages or fines or other orders to pay money; the issuance of orders to cease certain conduct or modify our business practices, such as requiring us to reduce our royalty rates, reduce the base on which our royalties are calculated, grant patent licenses to chipset manufacturers, sell chipsets to unlicensed OEMs or modify or renegotiate some or all of our existing license agreements; and determinations that some or all of our license agreements are invalid or unenforceable. If some or all of our license agreements are declared invalid or unenforceable and/or we are required to renegotiate these license agreements, we may not receive, or may not be able to recognize, some or any licensing or royalty revenues under the impacted license agreements unless and until we enter into new license agreements; and even licensees whose license agreements are not impacted may demand to renegotiate their agreements or invoke the dispute resolution provision in their agreements, and we may not be able to recognize some or any licensing or royalty revenues under such agreements. The renegotiation of license agreements could result in terms which are less favorable to us than existing terms, or lead to arbitration or litigation to resolve the licensing terms, which could also be less favorable to us than existing terms, and each of which could take months or possibly years. Licensees may underreport, underpay, not report or not pay royalties owed to us pending the conclusion of such negotiations, arbitration or litigation. In addition, we may be sued for alleged overpayments of past royalties paid to us, including private antitrust actions seeking treble damages under U.S. antitrust laws. The occurrence of any of the above could have a material adverse effect on our business, revenues, results of operations, cash flows and financial condition, and our stock price could decline, possibly significantly, in which case we may have to significantly cut costs and other uses of cash, including in research and development, significantly impairing our ability to maintain product and technology leadership and invest in next generation technologies such as 5G. Further, depending on the breadth and severity of the circumstances above, we may have to reduce, suspend or eliminate our capital return programs, and our ability to timely pay our indebtedness may be impacted. In addition, a governmental body in a particular country or region may successfully assert and impose remedies with effects that extend beyond the borders of that country or region.\nThese challenges have required, and we expect that they will continue to require, the investment of significant management time and attention and have resulted, and we expect that they will continue to result, in significant legal costs until the respective matters are resolved.\nRISKS RELATED TO SUPPLY AND MANUFACTURING\nWe depend on a limited number of third-party suppliers for the procurement, manufacture and testing of our products manufactured in a fabless production model. If we fail to execute supply strategies that provide supply assurance, technology leadership and reasonable margins, our business and results of operations may be harmed. We are also subject to order and shipment uncertainties that could negatively impact our results of operations.\nWe primarily utilize a fabless production model, which means that we do not own or operate foundries for the production of silicon wafers from which our integrated circuits are made. Other than the facilities we own that manufacture certain of our RFFE modules and RF filter products, we rely on third-party suppliers to perform the manufacturing and assembly, and most of the testing, of our integrated circuits. Our suppliers are also responsible for the procurement of most of the raw materials used in the production of our integrated circuits. There are a limited number of such third-party suppliers, and even fewer who are capable of manufacturing at the leading process technology nodes. We employ both turnkey and two-stage manufacturing models to purchase our integrated circuits. Under the turnkey model, our foundry suppliers are responsible for delivering fully assembled and tested integrated circuits. Under the two-stage manufacturing model, we purchase die in singular or wafer form from semiconductor manufacturing foundries and contract with separate third-party suppliers for manufacturing services such as wafer bump, probe, assembly and the majority of our final test requirements. The semiconductor manufacturing foundries that supply our products are primarily located in Asia, as are our primary warehouses where we store finished goods for fulfillment of customer orders.\nThe following could have an adverse effect on our ability to meet customer demand and negatively impact our revenues, business operations, profitability and cash flows:\n•a reduction, interruption, delay or limitation in our product supply sources;\n•a failure by our suppliers to procure raw materials or allocate adequate raw materials for our products;\n•a failure by our suppliers to allocate adequate manufacturing or test capacity for our products;\n•our suppliers’ inability to react to shifts in product demand or an increase in raw material or component prices;\n•our suppliers’ inability to develop or maintain, or a delay in developing or building out manufacturing capacity for leading process technologies, including transitions to smaller geometry process technologies;\n•the loss of a supplier or the inability of a supplier to meet performance, quality or yield specifications or delivery schedules;\n•additional expense or production delays as a result of qualifying a new supplier and commencing volume production or testing in the event of a loss of, or a decision to add or change, a supplier;\n•natural disasters or geopolitical conflicts impacting our suppliers;\n•health crises, including epidemics or pandemics, such as the COVID-19 pandemic, and government and business responses thereto, which impact our suppliers, including as a result of quarantines or closure; and\n•trade or national security protection policies, particularly U.S. or Chinese government policies, that limit or prevent us from transacting business with suppliers of critical integrated circuit products, or that limit or prevent such suppliers from transacting business with us or from procuring materials, machinery or technology necessary to manufacture goods for us.\nWhile we have established alternate suppliers for certain technologies, there are a limited number of such suppliers, and even fewer who are capable of operating at the leading process technology nodes. We rely on sole- or limited-source suppliers for certain products, which may exacerbate the aforementioned risks or subject us to other significant risks, including: poor product performance and reduced control over delivery schedules, manufacturing capability and yields, quality assurance, quantity and costs. To the extent we have established alternate suppliers, these suppliers may require significant levels of time and support to bring such technologies to production, both of which may increase for complex or leading process technologies. As a result, we may invest a significant amount of effort and resources and incur higher costs to support and maintain such alternate suppliers. Further, any future consolidation of foundry suppliers, or limitation in a foundry supplier’s ability to manufacture products for us due to trade or national security protection policies, could increase our vulnerability to sole- or limited-source arrangements and reduce our suppliers’ willingness to negotiate pricing, which could negatively impact our ability to achieve cost reductions and could increase our manufacturing costs, and limit the amount of capacity available to us. Our arrangements with our suppliers may obligate us to incur costs to manufacture and test our products that do not decrease at the same rate as decreases in pricing to our customers. Our ability, and that of our suppliers, to develop or maintain leading process technologies, including transitions to smaller geometry process technologies (which adds risk to manufacturing yields and reliability), and to effectively compete with the manufacturing processes and performance of our competitors, could impact our ability to introduce new products and meet customer demand, could increase our costs (possibly decreasing our margins) and could subject us to the risk of excess inventories. Any of the above could negatively impact our business, results of operations and cash flows.\nAlthough we have long-term contracts with our suppliers, most of these contracts do not provide for long-term capacity commitments. To the extent we do not have firm commitments from our suppliers over a specific time period or for any\nspecific quantity, our suppliers may allocate, and in the past have allocated, capacity to the production and testing of products for their other customers while reducing or limiting capacity to manufacture or test our products, and such capacity may be limited based on our suppliers’ ability and willingness to invest in the capital required to manufacture in the leading process technologies. Accordingly, capacity for our products may not be available when we need it or at reasonable prices. To the extent we do obtain long-term capacity commitments, we may incur additional costs related to those commitments or make non-refundable payments for capacity commitments that are not used.\nOur suppliers or potential alternate suppliers may manufacture CDMA- or OFDMA-based integrated circuits, for themselves or for other companies, that compete with our products. Such suppliers have in the past and could again elect to allocate raw materials and manufacturing capacity to their own products or products of our competitors and reduce or limit the production of our products.\nIn addition, we may not receive reasonable pricing, manufacturing or delivery terms from our suppliers. We cannot guarantee that the actions of our suppliers will not cause disruptions in our operations that could harm our ability to meet our delivery obligations to our customers or increase our cost of sales. To the extent we are unable to obtain adequate supply, we may be obligated to make payment to our customers for such shortfalls.\nAdditionally, we place orders with our suppliers using our and our customers’ forecasts of demand for our products, which are based on a number of assumptions and estimates. As we move to smaller geometry process technologies, the manufacturing lead-time increases. As a result, the orders we place with our suppliers are generally only partially covered by commitments from our customers. If we, or our customers, overestimate demand, or if demand is impacted by factors outside of our or our customers’ control, such as the COVID-19 pandemic, that is not under a binding commitment from our customers, we may experience increased excess or obsolete inventory, which would negatively impact our results of operations.\nThere are numerous risks associated with the operation and control of our manufacturing facilities, including a higher portion of fixed costs relative to a fabless model, environmental compliance and liability, impacts related to climate change, exposure to natural disasters, timely supply of equipment and materials, and various manufacturing issues.\nWe own and operate various facilities that manufacture certain of our RFFE modules and RF filter products. Manufacturing facilities are characterized by a higher portion of fixed costs relative to a fabless model. We may be faced with a decline in the utilization rates of our manufacturing facilities due to decreases in demand for our products, including in less favorable industry environments. During such periods, our manufacturing facilities could operate at lower capacity levels, while the fixed costs associated with such facilities would continue to be incurred, resulting in lower gross profit.\nWe are subject to many environmental, health and safety laws and regulations in each jurisdiction in which we operate our manufacturing facilities, which govern, among other things, emissions of pollutants into the air; wastewater discharges; the use, storage, generation, handling and disposal of hazardous substances and other waste; the investigation and remediation of soil and ground water contamination; and the health and safety of our employees. Certain environmental laws impose strict, and in certain circumstances joint and several, liability on current or previous owners or operators of real property, or parties who arranged for hazardous substances to be sent to disposal or treatment facilities, for the cost of investigation, removal or remediation of hazardous substances. As a result, we may incur clean-up costs in connection with any such removal or remediation efforts, as well as other third-party claims in connection with contaminated sites. In addition, we could be held liable for consequences arising out of human exposure to hazardous substances or other environmental damage. If we, or companies or facilities we acquire or have acquired, in the past failed or in the future fail to comply with any such laws and regulations, then we could incur liabilities, fines or prohibitions on the sale of products we manufacture, and our operations could be suspended. Such laws and regulations could also restrict our ability to modify or expand our facilities, could require us to acquire costly equipment, or could require other significant expenditures. We are also required to obtain and maintain environmental permits from governmental authorities for certain of our operations. While we have policies and procedures designed to ensure compliance with applicable laws, regulations and permits, we cannot make assurances that we, or our employees, contractors or agents, will at all times be in compliance with such laws, regulations and permits, or our related policies and procedures.\nClimate change concerns and the potential resulting environmental impact may result in new environmental, health and safety laws and regulations that may affect us, our suppliers and our customers. Such laws or regulations could cause us to incur additional direct costs for compliance, as well as increased indirect costs resulting from our customers, suppliers or both incurring additional compliance costs that are passed on to us. These costs may adversely impact our results of operations and financial condition. In addition, climate change may pose physical risks to our manufacturing facilities or our suppliers’ facilities, including increased extreme weather events that could result in supply delays or disruptions.\nWe have manufacturing facilities in Asia and Europe. If tsunamis, flooding, earthquakes, volcanic eruptions or other natural disasters, effects of climate change or geopolitical conflicts, were to damage, destroy or disrupt our manufacturing facilities, it could disrupt our operations, delay production and shipments of inventory and result in costly repairs, replacements or other costs. In addition, natural disasters, effects of climate change or geopolitical conflicts may result in disruptions in transportation, distribution channels and supply chains, and significant increases in the prices of raw materials. Further, health crises, including epidemics or pandemics, such as the COVID-19 pandemic, and government and business responses thereto, could affect our manufacturing facilities, including by resulting in quarantines and/or closures, which would result in disruptions to and potential closures of our manufacturing operations.\nOur manufacturing operations depend on securing raw materials and other supplies in adequate quality and quantity in a timely manner from multiple suppliers, and in some cases, we rely on a limited number of suppliers, particularly in Asia. Accordingly, there may be cases where supplies of raw materials and other products are interrupted by disaster, accident or some other event at a supplier, supply is suspended due to quality or other issues, or there is a shortage of supply due to a rapid increase in demand, among others, which could impact production and prevent us from supplying our products to our customers. If the supply-demand balance is disrupted, it may considerably increase costs of manufacturing due to increased prices we pay for raw materials. From time to time, suppliers may extend lead times, limit amounts supplied to us or increase prices due to capacity constraints or other factors. Additionally, supply and costs of raw materials may be negatively impacted by trade and/or national security protection policies, such as tariffs, or actions by governments that limit or prevent us from transacting business with certain companies or that limit or prevent certain companies from transacting business with us, or trade tensions, particularly with countries in Asia. Further, it may be difficult or impossible to substitute one piece of equipment for another or replace one type of material with another. A failure by our suppliers to deliver our requirements could result in disruptions to our manufacturing operations.\nOur manufacturing processes are highly complex, require advanced and costly equipment and must be continuously modified to improve yields and performance. Difficulties in the production process can reduce yields or interrupt production, and as a result, we may not be able to deliver our products or do so in a timely, cost-effective or competitive manner. Further, to remain competitive and meet customer demand, we may be required to improve our facilities and process technologies and carry out extensive research and development, each of which may require investment of significant amounts of capital and may have a material adverse effect on our results of operations, cash flows and financial condition.\nFinally, we typically begin manufacturing our products using our or our customers’ forecasts of demand for our products, which are based on a number of assumptions and estimates and are generally not covered by purchase commitments. As a result, we incur inventory and manufacturing costs in advance of anticipated sales, which sales ultimately may not materialize or may be lower than expected. If we or our customers overestimate demand, or if demand is impacted by factors outside of our or our customers’ control such as the COVID-19 pandemic or trade or national security protection policies, that is not under a binding commitment from our customers, we may experience higher inventory carrying and operating costs and/or increased excess or obsolete inventory, which would negatively impact our results of operations.\nRISKS RELATED TO NEW AND ADJACENT INITIATIVES\nOur growth depends in part on our ability to extend our technologies and products into new and expanded product areas, and adjacent industry segments or applications beyond mobile. Our research, development and other investments in these new and expanded product areas, industry segments or applications, and related technologies and products, as well as in our existing technologies and products, and new technologies, may not generate operating income or contribute to future results of operations that meet our expectations.\nWhile we continue to invest significant resources toward advancements primarily in support of 4G- and 5G-based technologies, we also invest in new and expanded product areas, and adjacent industry segments or applications, by utilizing our existing technical and business expertise and through acquisitions.\nIn particular, our future growth depends in part on new and expanded product areas, such as RFFE, and adjacent industry segments or applications beyond mobile, such as automotive and IoT; our ability to develop leading and cost-effective technologies and products for new and expanded product areas, adjacent industry segments or applications; and third parties incorporating our technologies and products into devices used in these product areas, industry segments or applications. Accordingly, we intend to continue to make substantial investments in these new and expanded product areas and adjacent industry segments or applications, and in developing new products and technologies for these product areas, industry segments or applications. Our growth also depends significantly on our ability to develop and patent 5G technologies, and to develop and commercialize products using 5G technologies.\nHowever, our research, development and other investments in these new and expanded product areas and adjacent industry segments or applications, and corresponding technologies and products, as well as in our existing, technologies and products and new technologies, such as 5G, use of licensed, shared and unlicensed spectrum and convergence of cellular and Wi-Fi, may not succeed because, among other reasons: we may not be issued patents on the technologies we develop; the technologies we develop may not be incorporated into relevant standards; new and expanded product areas, adjacent industry segments or applications, and consumer demand therein, may not develop or grow as anticipated; our strategies or the strategies of our customers, licensees or partners may not be successful; alternate technologies may be better or may reduce the advantages we anticipate from our investments; competitors’ technologies or products may be more cost effective, have more capabilities or fewer limitations or are brought to market faster than our new technologies or products; we may not be able to develop, or our competitors may have more established and/or stronger, customer, vendor, distributor or other channel relationships; and competitors may have longer operating histories in industry segments or applications that are new to us. We may also underestimate the costs of or overestimate the future revenues or margins that could result from these investments, and these investments may not, or may take many years to, generate material returns.\nFurther, the automotive industry is subject to long design-in time frames, long product life cycles and a high degree of regulatory and safety requirements, necessitating suppliers to the industry to comply with stringent qualification processes, very low defect rates and high reliability standards, all of which results in significant barriers to entry and increased costs.\nIf our new technologies and products are not successful, or are not successful in the time frames we anticipate, we may incur significant costs and asset impairments, our business and revenues may not grow or grow as anticipated, our revenues and margins may be negatively impacted, our stock price may decline and our reputation may be harmed.\nWe may engage in strategic acquisitions and other transactions or make investments, or be unable to consummate planned strategic acquisitions, which could adversely affect our results of operations or fail to enhance stockholder value.\nWe engage in strategic acquisitions and other transactions, including joint ventures, and make investments, which we believe are important to the future of our business, with the goal of maximizing stockholder value. From time to time, we acquire businesses and other assets, including patents, technology and other intangible assets, enter into joint ventures or other strategic transactions and purchase minority equity interests in or make loans to companies, including those that may be private and early-stage. Our strategic activities are generally focused on opening or expanding opportunities for our products and technologies and supporting the design and introduction of new products (or enhancing existing products) for mobile, and for new industry segments or applications beyond mobile. Many of our strategic activities entail a high degree of risk and require the use of significant amounts of capital, and investments may not become liquid for several years after the date of the investment, if at all. Our strategic activities may not generate financial returns or result in increased adoption or continued use of our technologies or products. We may underestimate the costs or overestimate the benefits, including product, revenue, cost and other synergies and growth opportunities that we expect to realize, and we may not achieve those benefits. In some cases, we may be required to consolidate or record our share of the earnings or losses of companies in which we have acquired ownership interests. In addition, we have in the past and may record impairment charges in the future related to our strategic activities. Any losses or impairment charges that we incur related to strategic activities will have a negative impact on our results of operations and financial condition, and we may continue to incur new or additional losses related to strategic assets or investments that we have not fully impaired or exited.\nAchieving the anticipated benefits of business acquisitions, including joint ventures and other strategic investments in which we have management and operational control, depends in part upon our ability to integrate the businesses in an efficient and effective manner and achieve anticipated synergies, and we may not be successful in these efforts. Such integration is complex and time consuming and involves significant challenges, including, among others: retaining key employees; successfully integrating new employees, facilities, technology, products, processes, operations (including supply and manufacturing operations), sales and distribution channels, business models and business systems; retaining customers and suppliers of the businesses; consolidating research and development operations; minimizing the diversion of management’s attention from ongoing business matters; consolidating corporate and administrative infrastructures; and managing the increased scale, complexity and globalization of our business, operations and employee base. We may not derive any commercial value from associated technologies or products or from future technologies or products based on these technologies, and we may be subject to liabilities that are not covered by indemnification protection that we may obtain, and we may become subject to litigation. Additionally, we may not be successful in entering or expanding into new sales or distribution channels, business or operational models, geographic regions, industry segments or applications served by or adjacent to the associated businesses or in addressing potential new opportunities that may arise out of our strategic acquisitions.\nIf we do not achieve the anticipated benefits of business acquisitions or other strategic activities, our business and results of operations may be adversely affected, and we may not enhance stockholder value by engaging in these transactions.\nMany of our acquisitions and other strategic investments require approval by the United States and foreign government agencies. Certain agencies in the past have, and may in the future, deny the transaction or fail to approve in a timely manner, resulting in us not realizing the anticipated benefits of the proposed transaction. Future acquisitions or other strategic investments may be more difficult, complex or expensive to the extent that our reputation for our ability to consummate acquisitions has been harmed. Further, if U.S./China relations remain strained, our ability to consummate any transaction that would require approval from the relevant regulatory agency(ies) in China may be severely impacted.\nRISKS RELATED TO CYBERSECURITY OR MISAPPROPRIATION OF OUR CRITICAL INFORMATION\nOur business and operations could suffer in the event of security breaches of our information technology systems, or other misappropriation of our technology, intellectual property or other proprietary or confidential information.\nThird parties regularly attempt to gain unauthorized access to our information technology systems, and many such attempts are increasingly more sophisticated. The perception that the COVID-19 pandemic has made companies’ information technology systems more vulnerable has increased the already significant volume of such attempts. These attempts, which might be related to industrial, corporate or other espionage, criminal hackers or state-sponsored intrusions, include trying to covertly introduce malware to our computers and networks, including those in our manufacturing operations, and impersonating authorized users, among others. We may also be subject to ransom-style cyber-attacks, which could impact our information technology systems and cause widespread disruption to our business, including our manufacturing operations, and expose our confidential or propriety information. In addition, third parties that we may rely on to store and/or process our confidential information may also be subject to similar threats. Such threats could result in the misappropriation, theft, misuse, disclosure, loss or destruction of the technology, intellectual property, or the proprietary, confidential or personal information, of us or our employees, customers, licensees, suppliers or other third parties, as well as damage to or disruptions in our information technology systems. These threats are constantly evolving, increasing the difficulty of successfully defending against them or implementing adequate preventative measures. We seek to detect and investigate all security\nincidents and to prevent their recurrence, but attempts to gain unauthorized access to our information technology systems or other attacks may be successful, and in some cases, we might be unaware of an incident or its magnitude and effects.\nIn addition, employees and former employees, in particular former employees who become employees of our competitors, customers, licensees or other third parties, including state actors, have in the past and may in the future misappropriate, use, publish or provide to our competitors, customers, licensees or other third parties, including state actors, our technology, intellectual property or other proprietary or confidential information. This risk is exacerbated as competitors for talent, particularly engineering talent, increasingly attempt to hire our employees. See also the Risk Factor entitled “We may not be able to attract and retain qualified employees.” Similarly, we provide access to certain of our technology, intellectual property and other proprietary or confidential information to our direct and indirect customers and licensees and certain of our consultants, who have in the past and may in the future wrongfully use such technology, intellectual property or information, or wrongfully disclose such technology, intellectual property or information to third parties, including our competitors or state actors. We also provide access to certain of our technology, intellectual property and other proprietary or confidential information to certain of our joint venture partners, including those affiliated with state actors and including in foreign jurisdictions where ownership restrictions may require us to take a minority ownership interest in the joint venture. Such joint venture partners may wrongfully use such technology, intellectual property or information, or wrongfully disclose such technology, intellectual property or information to third parties, including our competitors or state actors.\nThe misappropriation, theft, misuse, disclosure, loss or destruction of the technology, intellectual property, or the proprietary, confidential or personal information, of us or our employees, customers, licensees, suppliers or other third parties, could harm our competitive position, reduce the value of our investment in research and development and other strategic initiatives, cause us to lose business, damage our reputation, subject us to legal or regulatory proceedings, cause us to incur other loss or liability and otherwise adversely affect our business. We expect to continue to devote significant resources to the security of our information technology systems, and our technology, intellectual property and proprietary and confidential information.\nFurther, China has implemented, and other countries or regions may implement, cybersecurity laws that require our overall information technology security environment to meet certain standards and/or be certified. Such laws may be complex, ambiguous and subject to interpretation, which may create uncertainty regarding compliance. As a result, our efforts to comply with such laws may be expensive and may fail, which could adversely affect our business, results of operations and cash flows.\nRISKS RELATED TO INTELLECTUAL PROPERTY\nThe enforcement and protection of our intellectual property may be expensive, could fail to prevent misappropriation or unauthorized use of our intellectual property, could result in the loss of our ability to enforce one or more patents, and could be adversely affected by changes in patent laws, by laws in certain foreign jurisdictions that may not effectively protect our intellectual property and by ineffective enforcement of laws in such jurisdictions.\nWe rely primarily on patent, copyright, trademark and trade secret laws, as well as nondisclosure and confidentiality agreements, international treaties and other methods, to protect our intellectual property, including our patent portfolio. Policing unauthorized use of our products, technologies and intellectual property is difficult and time consuming. The steps we have taken have not always prevented, and we cannot be certain the steps we will take in the future will prevent, the misappropriation or unauthorized use of our products, technologies or intellectual property, particularly in foreign countries where the laws may not protect our rights as fully or as readily as U.S. laws or where the enforcement of such laws may be lacking or ineffective. See also the Risk Factor entitled “Our business and operations could suffer in the event of security breaches of our information technology systems, or other misappropriation of our technology, intellectual property or other proprietary or confidential information.”\nSome industry participants who have a vested interest in devaluing patents in general, or standard-essential patents in particular, have mounted attacks on certain patent systems, increasing the likelihood of changes to established patent laws. In the United States, there is continued discussion regarding potential patent law changes and current and potential future litigation regarding patents, the outcomes of which could be detrimental to our licensing business. The laws in certain foreign countries in which our products are or may be manufactured or sold, including certain countries in Asia, may not protect our intellectual property rights to the same extent as the laws in the United States. We cannot predict with certainty the long-term effects of any potential changes. In addition, we cannot be certain that the laws and policies of any country or the practices of any standards bodies, foreign or domestic, with respect to intellectual property enforcement or licensing or the adoption of standards, will not be changed in the future in a way detrimental to our licensing program or to the sale or use of our products or technologies.\nWe have had and may in the future have difficulty in certain circumstances in protecting or enforcing our intellectual property and contracts, including collecting royalties for use of our patent portfolio due to, among others: refusal by certain licensees to report and pay all or a portion of the royalties they owe to us; policies or political actions of governments, including trade protection and national security policies; challenges to our licensing practices under competition laws; adoption of mandatory licensing provisions by foreign jurisdictions; failure of foreign courts to recognize and enforce judgments of contract breach and damages issued by courts in the United States; and challenges before competition agencies to our licensing business and the pricing and integration of additional features and functionality into our chipset products. See also the Risk Factors entitled “Efforts by some OEMs to avoid paying fair and reasonable royalties for the use of our\nintellectual property may require the investment of substantial management time and financial resources and may result in legal decisions or actions by governments, courts, regulators or agencies, Standards Development Organizations (SDOs) or other industry organizations that harm our business” and “Our business may suffer as a result of adverse rulings in government investigations or proceedings.”\nWe have engaged in litigation and arbitration in the past and may need to further litigate or arbitrate in the future to enforce our contract and intellectual property rights, protect our trade secrets or determine the validity and scope of proprietary rights of others. As a result of any such litigation or arbitration, we could lose our ability to enforce one or more patents, portions of our license agreements could be determined to be invalid or unenforceable (which may in turn result in other licensees either not complying with their existing license agreements or initiating litigation or arbitration), license terms (including but not limited to royalty rates for the use of our intellectual property) could be imposed that are less favorable to us than existing terms, and we could incur substantial costs. Any action we take to enforce our contract or intellectual property rights could be costly and could absorb significant management time and attention, which, in turn, could negatively impact our results of operations and cash flows. Further, even a positive resolution to our enforcement efforts may take time to conclude, which may reduce our revenues and cash resources available for other purposes, such as research and development, in the periods prior to conclusion.\nAdditionally, although our license agreements provide us with the right to audit the books and records of licensees, audits can be expensive, time consuming, incomplete and subject to dispute. Further, certain licensees may not comply with the obligation to provide full access to their books and records. To the extent we do not aggressively enforce our rights under our license agreements, licensees may not comply with their existing license agreements, and to the extent we do not aggressively pursue unlicensed companies to enter into license agreements with us for their use of our intellectual property, other unlicensed companies may not enter into license agreements. Similarly, we provide access to certain of our intellectual property and proprietary and confidential business information to our direct and indirect customers and licensees, who have in the past and may in the future wrongfully use such intellectual property and information or wrongfully disclose such intellectual property and information to third parties, including our competitors. See also the Risk Factor entitled “Efforts by some OEMs to avoid paying fair and reasonable royalties for the use of our intellectual property may require the investment of substantial management time and financial resources and may result in legal decisions or actions by governments, courts, regulators or agencies, Standards Development Organizations (SDOs) or other industry organizations that harm our business.”\nClaims by other companies that we infringe their intellectual property could adversely affect our business.\nFrom time to time, companies have asserted, and may again assert, patent, copyright and other intellectual property claims against our products or products using our technologies or other technologies used in our industry. These claims have resulted and may again result in our involvement in litigation. We may not prevail in such litigation given, among other factors, the complex technical issues and inherent uncertainties in intellectual property litigation. If any of our products were found to infringe another company’s intellectual property, we could be subject to an injunction or be required to redesign our products, or to license such intellectual property or pay damages or other compensation to such other company (any of which could be costly). If we are unable to redesign our products, license such intellectual property used in our products or otherwise distribute our products (e.g., through a licensed supplier), we could be prohibited from making and selling our products. Similarly, our suppliers could be found to infringe another company’s intellectual property, and such suppliers could then be enjoined from providing products or services to us.\nIn any potential dispute involving us and another company’s patents or other intellectual property, our chipset foundries, semiconductor assembly and test providers and customers could also become the targets of litigation. We are contingently liable under certain product sales, services, license and other agreements to indemnify certain customers, chipset foundries and semiconductor assembly and test service providers against certain types of liability and damages arising from qualifying claims of patent infringement by products sold by us, or by intellectual property provided by us to our chipset foundries and semiconductor assembly and test service providers. Reimbursements under indemnification arrangements could have an adverse effect on our results of operations and cash flows. Furthermore, any such litigation could severely disrupt the supply of our products and the businesses of our chipset customers and their customers, which in turn could harm our relationships with them and could result in a decline in our chipset sales or a reduction in our licensees’ sales, causing a corresponding decline in our chipset or licensing revenues. Any claims, regardless of their merit, could be time consuming to address, result in costly litigation, divert the efforts of our technical and management personnel or cause product release or shipment delays, any of which could have an adverse effect on our results of operations and cash flows.\nWe may continue to be involved in litigation and may have to appear in front of administrative bodies (such as the United States International Trade Commission) to defend against patent assertions against our products by companies, some of whom are attempting to gain competitive advantage or leverage in licensing negotiations. We may not be successful in such proceedings, and if we are not, the range of possible outcomes is very broad and may include, for example, monetary damages or fines or other orders to pay money, royalty payments, injunctions on the sale of certain of our integrated circuit products (or on the sale of our customers’ devices using such products) or the issuance of orders to cease certain conduct or modify our business practices. Further, a governmental body in a particular country or region may assert, and may be successful in imposing, remedies with effects that extend beyond the borders of that country or region. In addition, a negative outcome in any such proceeding could severely disrupt the business of our chipset customers and their wireless operator\ncustomers, which in turn could harm our relationships with them and could result in a decline in our chipset sales or a reduction in our licensees’ sales to wireless operators, causing corresponding declines in our chipset or licensing revenues.\nCertain legal matters, which may include certain claims by other companies that we infringe their intellectual property, are described more fully in this Annual Report in “Notes to Consolidated Financial Statements, Note 7. Commitments and Contingencies.”\nOur use of open source software may harm our business.\nCertain of our software and our suppliers’ software may contain or may be derived from “open source” software, and we have seen, and believe that we will continue to see, an increase in customers requesting that we develop products, including software associated with our integrated circuit products, that incorporate open source software elements and operate in an open source environment, which, under certain open source licenses, may offer accessibility to a portion of our products’ source code and may expose our related intellectual property to adverse licensing conditions. Licensing of such software may impose certain obligations on us if we were to distribute derivative works of that software. For example, these obligations may require us to make source code for the derivative works available to our customers in a manner that allows them to make such source code available to their customers or license such derivative works under a particular type of license that is different than what we customarily use to license our software. Furthermore, in the course of product development, we may make contributions to third-party open source projects that could obligate our intellectual property to adverse licensing conditions. For example, to encourage the growth of a software ecosystem that is interoperable with our products, we may need to contribute certain implementations under the open source licensing terms that govern such projects, which may adversely impact our associated intellectual property. Developing open source products, while adequately protecting the intellectual property upon which our licensing program depends, may prove burdensome and time-consuming under certain circumstances, thereby placing us at a competitive disadvantage, and we may not adequately protect our intellectual property. Also, our use and our customers’ use of open source software may subject our products and our customers’ products to governmental and third-party scrutiny and delays in product certification, which could cause customers to view our products as less desirable than our competitors’ products. While we believe we have taken appropriate steps and employ adequate controls to protect our intellectual property, our contributions to and use of open source software presents risks that could have an adverse effect on these and on our business.\nRISKS RELATED TO HUMAN CAPITAL MANAGEMENT\nWe may not be able to attract and retain qualified employees.\nOur future success depends upon the continued service of our executive officers and other key management and technical personnel, and on our ability to continue to identify, attract, retain and motivate them. Implementing our business strategy requires specialized engineering and other talent, as our revenues are highly dependent on technological and product innovations. The market for employees in our industry is extremely competitive, and competitors for talent, particularly engineering talent, increasingly attempt to hire, and to varying degrees have been successful in hiring, our employees, including by establishing local offices near our headquarters in San Diego, California. A number of such competitors for talent are significantly larger than us and are able to offer compensation in excess of what we are able to offer. Further, existing immigration laws make it more difficult for us to recruit and retain highly skilled foreign national graduates of universities in the United States, making the pool of available talent even smaller. If we are unable to attract and retain qualified employees, our business may be harmed.\nRISKS RELATED TO PRODUCT DEFECTS OR SECURITY VULNERABILITIES\nFailures in our products, or in the products of our customers or licensees, including those resulting from security vulnerabilities, defects or errors, could harm our business.\nOur products (including related software) are complex and may contain defects, errors or security vulnerabilities, or experience failures or unsatisfactory performance, due to any number of issues, including issues in materials, design, fabrication, packaging and/or use within a system. Further, because of the complexity of our products, defects or errors might only be detected when the products are in use. Development of products in new domains of technology, such as the transition to 5G, and the migration to integrated circuit technologies with smaller geometric feature sizes, increases complexity and adds risk to manufacturing yields and reliability, and increases the likelihood of product defects or errors. Risks associated with product defects, errors or security vulnerabilities are exacerbated by the fact that our customers typically integrate our products into consumer and other devices.\nThe use of devices containing our products to interact with untrusted systems or otherwise access untrusted content creates a risk of exposing the system hardware and software in those devices to malicious attacks. Security vulnerabilities in our products could expose our customers or end users to hackers or other unscrupulous third parties who develop and deploy viruses, worms and other malicious software programs that could attack our products or those of our customers. While we continue to focus on this issue and take measures to safeguard our products from cybersecurity threats, device capabilities continue to evolve, enabling more elaborate functionality and applications, and increasing the risk of security failures.\nOur products may be responsible for critical functions in our customers’ products and networks. Failure of our products to perform to specifications, or other product defects, errors or security vulnerabilities, could lead to substantial damage to the products we sell to our customers, the devices into which our products are integrated and to the end users of such devices.\nSuch defects, errors or security vulnerabilities could give rise to significant costs, including costs related to developing solutions, recalling products, repairing or replacing defective products, writing down defective inventory, or the indemnification clauses in our agreements, and could result in the loss of sales and divert the attention of our engineering personnel from our product development efforts. In addition, defects, errors or security vulnerabilities in our products could result in failure to achieve market acceptance, a loss of design wins, a shifting of business to our competitors, and litigation or regulatory action against us, and could harm our reputation, our relationships with customers and partners and our ability to attract new customers, as well as the perceptions of our brand. Other potential adverse impacts of product defects, errors or security vulnerabilities include shipment delays, write-offs of property, plant and equipment and intangible assets, and losses on unfavorable purchase commitments. In addition, defects, errors or security vulnerabilities in the products of our customers or licensees could cause a delay or decrease in demand for the products into which our products are integrated, and thus for our products.\nIn addition, the occurrence of defects may give rise to product liability claims, particularly if defects in our products or the products into which they are integrated result in personal injury or death, and could result in significant costs, expenses and losses. If a product liability claim is brought against us, the cost of defending the claim could be significant, and could divert the efforts of our technical and management personnel and harm our business, even if we are successful. We may be named in product liability claims even if there is no evidence that our products caused the damage in question, and even though we may have indemnity from our customers, and such claims could result in significant costs and expenses. Further, our business liability insurance may be inadequate, or future coverage may be unavailable on acceptable terms, which could adversely impact our financial results. The above is exacerbated by the fact that our products may be used, and perform critical functions, in various high-risk applications such as automobiles, including autonomous driver assistance programs; cameras and artificial intelligence, including home and enterprise security; home automation, including smoke and noxious gas detectors; medical condition monitoring; location and asset tracking and management, including wearables for child safety and elderly health; robotics, including public safety drones and autonomous municipality vehicles; and extended reality (XR) for treatment of phobias or PTSD, early detection of disorders or special needs, among others.\nAccordingly, defects, errors or security vulnerabilities in our products could have an adverse impact on us, on our customers and the end users of our customers’ products. If any of these risks materialize, there could be a material adverse effect on our business, results of operations and financial condition.\nGENERAL RISK FACTORS\nWe operate in the highly cyclical semiconductor industry, which is subject to significant downturns. We are also susceptible to declines in global, regional and local economic conditions generally. Our stock price and financial results are subject to substantial quarterly and annual fluctuations due to these dynamics, among others.\nThe semiconductor industry is highly cyclical, volatile, subject to downturns and characterized by constant and rapid technological change, price erosion, evolving technical standards, frequent new product introductions, short product life cycles and fluctuations in product supply and demand. Periods of downturns have been characterized by diminished demand for end-user products, high inventory levels, excess or obsolete inventory adjustments, underutilization of manufacturing capacity, changes in revenue mix and erosion of average selling prices. We expect our business to continue to be subject to such cyclical downturns. Consequently, our revenues may decline, and our results of operations and financial condition may be adversely impacted.\nA decline in global, regional or local economic conditions or a slow-down in economic growth, particularly in geographic regions with high concentrations of wireless voice and data users or high concentrations of our customers or licensees, could have adverse, wide-ranging effects on our business and financial results, including a decrease in demand for our products and technologies; a decrease in demand for the products and services of our customers or licensees; the inability of our suppliers to deliver on their supply commitments to us, our inability to supply our products to our customers and/or the inability of our customers or licensees to supply their products to end users; the insolvency of key suppliers, customers or licensees; delays in reporting or payments from our customers or licensees; failures by counterparties; and/or negative effects on wireless device inventories. In addition, our customers’ and licensees’ ability to purchase or pay for our products and intellectual property and network operators’ ability to upgrade their wireless networks could be adversely affected, potentially leading to a reduction, cancellation or delay of orders for our products.\nOur stock price and financial results have fluctuated in the past and are likely to fluctuate in the future. Factors that may have a significant impact on the market price of our stock and our financial results include those identified above and throughout this Risk Factors section; volatility of the stock market in general and technology and semiconductor companies in particular; announcements concerning us, our suppliers, our competitors or our customers or licensees; and variations between our actual financial results or guidance and expectations of securities analysts or investors, among others. In the past, securities class action litigation has been brought against companies following periods of volatility in the market price of their securities, among other reasons. We are and may in the future be the target of securities litigation. Securities litigation could result in substantial uninsured costs and divert management’s attention and our resources. Certain legal matters, including certain securities litigation brought against us, are described more fully in this Annual Report in “Notes to Consolidated Financial Statements, Note 7. Commitments and Contingencies.”\nOur business may suffer due to the impact of, or our failure to comply with, the various existing, new or amended laws, regulations, policies or standards to which we are subject.\nOur business and products, and those of our customers and licensees, are subject to various laws, rules and regulations globally as well as government policies and the specifications of international, national and regional communications standards bodies (collectively, Regulations). Compliance with, or changes in the interpretation of, existing Regulations, changes in the oversight of our activities by governments or standards bodies, or rulings in court, regulatory, administrative or other proceedings relating to such Regulations, including, among others, Regulations affecting patent licensing practices; antitrust, competition and competitive business practices; the flow of funds out of certain countries (e.g., China); cybersecurity; import and export regulations such as the U.S. Export Administration Regulations administered by the U.S. Department of Commerce; protection of intellectual property; trade and trade protection including tariffs; foreign policy and national security; environmental protection, health and safety; supply chain, responsible sourcing, including the use of conflict minerals, and human rights; spectrum availability and license issuance; adoption of standards; taxation; privacy and data protection; labor, employment and human capital; corporate governance; public disclosure; or business conduct, could have an adverse effect on our business and results of operations. See also the Risk Factors entitled “Our business may suffer as a result of adverse rulings in government investigations or proceedings,” “Changes in our patent licensing practices, whether due to governmental investigations or private legal proceedings challenging those practices, or otherwise, could adversely impact our business and results of operations,” “A significant portion of our business is concentrated in China, and the risks of such concentration are exacerbated by U.S./China trade and national security tensions,” “There are numerous risks associated with the operation and control of our manufacturing facilities, including a higher portion of fixed costs relative to a fabless model, environmental compliance and liability, issues related to climate change, exposure to natural disasters, timely supply of equipment and materials, and various manufacturing issues,” and “Tax liabilities could adversely affect our results of operations.”\nRegulations are complex and changing (which may create uncertainty regarding compliance), are subject to varying interpretations, and their application in practice may evolve over time. As a result, our efforts to comply with Regulations may fail, particularly if there is ambiguity as to how they should be applied in practice. Failure to comply with any Regulation may adversely affect our business, results of operations and cash flows. New Regulations or evolving interpretations thereof, may cause us to incur higher costs as we revise current practices, policies or procedures and may divert management time and attention to compliance activities.\nThere are risks associated with our debt.\nOur outstanding debt and any additional debt we incur may have negative consequences on our business, including, among others: requiring us to use cash to pay the principal of and interest on our debt, thereby reducing the amount of cash available for other purposes; limiting our ability to obtain additional financing for working capital, capital expenditures, acquisitions, stock repurchases, dividends, general corporate or other purposes; and limiting our flexibility in planning for, or reacting to, changes in our business, industries or the market. Our ability to make payments of principal and interest on our indebtedness depends upon our future performance, which is subject to economic and political conditions, industry cycles and financial, business and other factors, many of which are beyond our control. If we are unable to generate sufficient cash flow from operations to service our debt, we may be required to, among other things: refinance or restructure all or a portion of our debt; reduce or delay planned capital or operating expenditures; reduce, suspend or eliminate our dividend payments and/or our stock repurchase program; or sell selected assets. Such measures might not be sufficient to enable us to service our debt. In addition, any such refinancing, restructuring or sale of assets might not be available on economically favorable terms or at all, and if prevailing interest rates at the time of any such refinancing or restructuring are higher than our current rates, interest expense related to such refinancing or restructuring would increase. Further, if there are adverse changes in the ratings assigned to our debt securities by credit rating agencies, our borrowing costs, our ability to access debt in the future and the terms of such debt could be adversely affected.\nTax liabilities could adversely affect our results of operations.\nWe are subject to income taxes in the United States and numerous foreign jurisdictions. Significant judgment is required in determining our provision for income taxes. We regularly are subject to examination of our tax returns and reports by taxing authorities in the United States federal jurisdiction and various state and foreign jurisdictions, most notably in countries where we earn a routine return and the tax authorities believe substantial value-add activities are performed. Although we believe that our tax estimates are reasonable, the final determination of tax audits and any related legal proceedings could materially differ from amounts reflected in our income tax provisions and accruals. In such case, our income tax provision, results of operations and cash flows in the period or periods in which that determination is made could be negatively affected.\nTax rules may change in a manner that adversely affects our future reported results of operations or the way we conduct our business. In response to the 2017 Tax Cuts and Jobs Act and to better align our profits with our activities, we implemented certain restructuring in fiscal 2018 and 2019. After our restructuring, most of our income is taxable in the United States with a significant portion qualifying for preferential treatment as FDII (foreign-derived intangible income). Beginning in fiscal 2027, the effective tax rate for FDII increases from 13% to 16%. Further, if U.S. tax rates increase or the FDII deduction is eliminated or reduced, our provision for income taxes, results of operations and cash flows would be adversely affected. Also, if our customers move manufacturing operations to the United States, our FDII deduction will be reduced.\nWe have tax incentives in Singapore that require we meet specified employment and other criteria. Although our profit in Singapore has declined as a result of our 2018 restructuring, failure to meet these incentive requirements through March 2022 could result in a retroactive Singapore tax increase for 2017 and 2018.\nFurther changes in the tax laws of foreign jurisdictions could arise as a result of the base erosion and profit shifting (BEPS) project that was undertaken by the Organization for Economic Co-operation and Development (OECD). The OECD, which represents a coalition of member countries, recommended changes to numerous long-standing tax principles related to transfer pricing and continues to develop new proposals including allocating greater taxing rights to countries where customers are located and establishing a minimum tax on global income. These changes, as adopted by countries, may increase tax uncertainty and may adversely affect our provision for income taxes, results of operations and cash flows. Partially to address BEPS, we moved certain intellectual property from Singapore to the United States as part of our 2018 and 2019 restructuring.",
    "item_1B": "Item 1B. Unresolved Staff Comments\nNone.",
    "item_1C": "",
    "item_2": "Item 2. Properties\nAt September 27, 2020, we occupied the following facilities (square footage in millions):\nOur headquarters and certain research and development, manufacturing and network management hub operations are located in San Diego, California. Additionally, our QCT segment’s non-United States headquarters is located in Singapore. We also operate leased manufacturing facilities in Germany, China and Singapore. We also own and lease properties around the world for use as sales and administrative offices and research and development centers, primarily in the United States, India and China. Our facility leases expire at varying dates through 2032, not including renewals that are at our option. Several other owned and leased facilities are under construction totaling approximately 750 thousand additional square feet, primarily related to the construction of new facilities in India and Taiwan.\nWe do not identify or allocate facilities by operating segment. In response to the COVID-19 pandemic, we modified certain of our workforce practices, such as having the vast majority of our employees work from home. Such changes have impacted the physical utilization of certain of our non-manufacturing facilities; however, we believe that collectively our facilities are suitable and adequate for our present purposes. We continue to assess the impacts of COVID-19 on the suitability, adequacy, productive capacity and utilization of our existing principal physical properties, and we are in the process of evaluating the future state of our workforce practices, which may result in changes to our physical property needs. Additional information on our additional capital requirements is provided in this Annual Report in “Part II, Item 7. Management’s Discussion and Analysis of Financial Condition and Results of Operations” in the “Liquidity and Capital Resources” section under the heading “Additional Capital Requirements.” Additional information on net property, plant and equipment by geography is provided in this Annual Report in “Notes to Consolidated Financial Statements, Note 8. Segment Information.”",
    "item_3": "Item 3. Legal and Regulatory Proceedings\nInformation regarding legal and regulatory proceedings is provided in this Annual Report in “Notes to Consolidated Financial Statements, Note 7. Commitments and Contingencies.” We are also engaged in numerous other legal actions arising in the ordinary course of our business (such as, for example, proceedings relating to employment matters or the initiation or defense of proceedings relating to intellectual property rights) and, while there can be no assurance, we believe that the ultimate outcome of these other legal actions will not have a material adverse effect on our business, results of operations, financial condition or cash flows.",
    "item_4": "Item 4. Mine Safety Disclosures\nNot applicable.\nPart II",
    "item_5": "Item 5. Market for Registrant’s Common Equity, Related Stockholder Matters and Issuer Purchases of Equity Securities\nMarket Information and Dividends\nOur common stock is traded on the NASDAQ Global Select Market (NASDAQ) under the symbol “QCOM.” At November 2, 2020, there were 6,609 holders of record of our common stock.\nWe intend to continue to pay quarterly dividends, subject to capital availability and our view that cash dividends are in the best interests of our stockholders. Future dividends may be affected by, among other items, our views on potential future capital availability and requirements, including those relating to research and development, creation and expansion of sales and distribution channels, investments and acquisitions, legal risks, withholding of payments by one or more of our significant licensees and/or customers, fines by government agencies and/or adverse rulings by a court or arbitrator in a legal matter, stock repurchase programs, debt issuances, changes in federal and state income tax law, trade and/or national security protection policies, volatility in economies and financial markets globally, including as impacted by the COVID-19 pandemic, and changes to our business model.\nShare-Based Compensation\nWe primarily issue restricted stock units under our equity compensation plans, which are part of a broad-based, long-term retention program that is intended to attract and retain talented employees and directors and align stockholder and employee interests.\nOur 2016 Long-Term Incentive Plan (2016 Plan) provides for the grant of incentive and nonstatutory stock options, stock appreciation rights, restricted stock, unrestricted stock, restricted stock units, performance units, performance shares, deferred compensation awards and other stock-based awards. We primarily grant restricted stock units, which generally vest over periods of three years from the date of grant. Our Board of Directors may amend or terminate the 2016 Plan at any time, with certain amendments also requiring stockholder approval.\nAdditional information regarding our share-based compensation plans and plan activity for fiscal 2020, 2019 and 2018 is provided in this Annual Report in “Notes to Consolidated Financial Statements, Note 5. Employee Benefit Plans.”\nIssuer Purchases of Equity Securities\nOn July 26, 2018, we announced a repurchase program authorizing us to repurchase up to $30 billion of our common stock. We did not repurchase any of our shares in the fourth quarter of fiscal 2020. At September 27, 2020, $4.6 billion remained authorized for repurchase. In the first quarter of fiscal 2021, we resumed stock repurchases under the stock repurchase program, which we had suspended in the third quarter of fiscal 2020 in light of COVID-19 to maintain our financial liquidity position and flexibility. The stock repurchase program has no expiration date. Shares withheld to satisfy statutory tax withholding requirements related to the vesting of share-based awards are not issued or considered stock repurchases under our stock repurchase program.",
    "item_6": "Item 6. Selected Financial Data\nThe following data should be read in conjunction with the annual consolidated financial statements, related notes and other financial information appearing elsewhere herein.\n(1)Our fiscal year ends on the last Sunday in September. The fiscal years ended September 27, 2020, September 29, 2019, September 24, 2017 and September 25, 2016 each included 52 weeks. The fiscal year ended September 30, 2018 included 53 weeks.\n(2)Revenues in fiscal 2020 included $1.8 billion resulting from the settlement with Huawei. Net income for fiscal 2020 was impacted by $405 million in non-marketable investment impairments.\nRevenues in fiscal 2019 included $4.7 billion resulting from the settlement with Apple and its contract manufacturers. Revenues in fiscal 2019 also reflected the impact of the adoption of the new revenue recognition guidance in the first quarter of fiscal 2019. Operating income in fiscal 2019 was impacted by a $275 million charge attributed to a fine imposed by the European Commission (EC) and $213 million in net charges related to our cost plan that concluded in fiscal 2019 (Cost Plan). Additionally, net income for fiscal 2019 was impacted by a $2.5 billion charge to income tax expense resulting from the derecognition of a deferred tax asset related to the distributed intellectual property and a tax benefit of $570 million due to establishing new U.S. net deferred tax assets from making certain check-the-box elections.\nRevenues in fiscal 2018 were negatively impacted by our prior dispute with Apple and its contract manufacturers, partially offset by $600 million paid under an interim agreement with Huawei. Operating income in fiscal 2018 was further impacted by a $2.0 billion charge related to a fee in connection with the termination of a purchase agreement to acquire NXP Semiconductors N.V., a $1.2 billion charge related to a fine imposed by the EC and $629 million in charges related to our Cost Plan, partially offset by a $676 million benefit resulting from a settlement with the Taiwan Fair Trade Commission (TFTC). Additionally, net loss for fiscal 2018 was impacted by a $5.7 billion charge related to the Tax Legislation.\nRevenues in fiscal 2017 were negatively impacted by actions taken by Apple and its contract manufacturers and Huawei, who did not fully report or fully pay royalties due in the last three quarters of fiscal 2017, as well as a $940 million reduction to revenues recorded related to the BlackBerry arbitration. Operating income was further impacted by $927 million and $778 million in charges related to the fines imposed by the Korea Fair Trade Commission and the TFTC, respectively.\n(3)In the fourth quarter of fiscal 2018, we announced a stock repurchase program authorizing us to repurchase up to $30 billion of our common stock. Under this program, we completed a tender offer and paid an aggregate of $5.1 billion to repurchase shares of our common stock and entered into three accelerated share repurchase agreements to repurchase an aggregate of $16.0 billion of our common stock, resulting in significant reductions to the balances of our cash, cash equivalents and marketable securities, total assets and total stockholders’ equity.\n(4)Short-term debt was comprised of outstanding commercial paper and, in fiscal 2019 and 2017, the current portion of long-term debt.\n(5)Long-term debt was comprised of floating- and fixed-rate notes.\n(6)Other long-term liabilities in this balance sheet data includes noncurrent income taxes payable and noncurrent liabilities for uncertain tax positions and excludes unearned revenues.",
    "item_7": "Item 7. Management’s Discussion and Analysis of Financial Condition and Results of Operations\nIn addition to historical information, the following discussion contains forward-looking statements that are subject to risks and uncertainties. Actual results may differ materially from those referred to herein due to a number of factors, including but not limited to risks described in “Part I, Item 1A. Risk Factors” and elsewhere in this Annual Report.\nThe following discussion and analysis of our financial condition and results of operations should be read in conjunction with our consolidated financial statements and related notes included in “Part II, Item 8. Financial Statements and Supplementary Data” of this Annual Report.\nFiscal 2020 Overview and Other Recent Events\nRevenues were $23.5 billion, a decrease of 3% compared to revenues of $24.3 billion in fiscal 2019, with net income of $5.2 billion, an increase of 19% compared to net income of $4.4 billion in fiscal 2019. Highlights and other events from fiscal 2020 and other recent events included:\n•The rapid, global spread of COVID-19 has negatively impacted consumer demand for certain devices that incorporate our products and intellectual property, which negatively impacted our business and results of operations in fiscal 2020. The impact of the COVID-19 pandemic on sales of devices that incorporate our products and intellectual property was most significant in the March 2020 and June 2020 quarters. The impact of COVID-19 on our ability to fulfill customer orders has been minimal. Workforce changes that we implemented in the second quarter of fiscal 2020 remained in effect throughout fiscal 2020.\n•In July 2020, we entered into a settlement agreement with Huawei to resolve our prior dispute related to our license agreement that expired on December 31, 2019. We also entered into a new long-term, global patent license agreement that contains a cross license granting rights to certain of Huawei’s patents and applies to sales of certain wireless products by Huawei beginning on January 1, 2020. Amounts due under the settlement agreement (which are incremental to the $1.2 billion previously paid under two interim agreements) are to be paid in installments by the end of June 2021 in accordance with an agreed upon payment schedule. We recorded revenues of $1.8 billion in fiscal 2020, which were not allocated to our segment results, related to the amounts due from Huawei under the settlement agreement and royalties for sales made in the March 2020 and June 2020 quarters under the new global patent license agreement. In the fourth quarter of fiscal 2020, Huawei paid the first installment under the settlement agreement and the royalties due for the March 2020 and June 2020 quarters.\n•QCT results in fiscal 2020 benefited from an increase in demand for 5G and IoT products, partially offset by the negative impact of COVID-19. Additionally, in the second half of fiscal 2020, QCT began shipments under the multi-year chipset supply agreement with Apple to support 2020 iPhone product launches.\n•QTL results in fiscal 2020 benefited from the inclusion of a full year of royalties from Apple (as a result of the settlement with Apple and its contract manufacturers in April 2019) and an estimate of royalties due from Huawei for sales made in the September 2020 quarter, partially offset by the negative impact of COVID-19.\n•We entered into new long-term, world-wide patent license agreements with Guangdong OPPO Mobile Telecommunications Corp., Ltd. (Oppo) and BBK Communication Technology Co., Ltd. (vivo) (who were previously disclosed as two key Chinese licensees), effective as of April 1, 2020. We also reached agreements with these licensees to provide for scheduled payments of amounts due under the license agreements that expired on March 31, 2020 and for which certain of such amounts for prior periods were withheld while good faith negotiations occurred. Oppo and vivo paid all such amounts due under the settlement agreements by the end of September 2020.\n•In May 2019, in United States Federal Trade Commission (FTC) v. QUALCOMM Incorporated, the district court issued an Order ruling against us and imposing certain injunctive relief. On August 11, 2020, on appeal, the Ninth Circuit reversed the district court’s judgment, vacated its injunction and vacated its partial grant of summary judgment. On September 25, 2020, the FTC filed a Petition for Rehearing En Banc. On October 28, 2020, the Ninth Circuit denied the FTC’s petition.\n•In fiscal 2020, we recorded $405 million in non-marketable investment impairments, a portion of which was due in part from the impacts of COVID-19 on certain of our investees.\nOur Business and Operating Segments\nWe develop and commercialize foundational technologies and products used in mobile devices and other wireless products. We derive revenues principally from sales of integrated circuit products and licensing our intellectual property, including patents and other rights.\nWe are organized on the basis of products and services and have three reportable segments. We conduct business primarily through our QCT (Qualcomm CDMA Technologies) semiconductor business and our QTL (Qualcomm\nTechnology Licensing) licensing business. Our QSI (Qualcomm Strategic Initiatives) reportable segment makes strategic investments. We also have nonreportable segments, including QGOV (Qualcomm Government Technologies), our cloud AI inference processing initiative and other technology and service initiatives.\nFurther information regarding our business and operating segments is provided in “Part I, Item 1. Business” of this Annual Report.\nSeasonality. Many of our products and much of our intellectual property are incorporated into consumer wireless devices, which are subject to seasonality and other fluctuations in demand. Our revenues have historically fluctuated based on consumer demand for devices, as well as on the timing of customer/licensee device launches and/or innovation cycles (such as the transition to the next generation of wireless technologies). This has resulted in fluctuations in QCT revenues in advance of and during device launches incorporating our products and in QTL revenues when the related royalties were recognized, which prior to fiscal 2019 was when licensees reported their sales and beginning in fiscal 2019 when the licensees’ sales occurred. Our historical trends were impacted by our prior dispute with Apple and its contract manufacturers (which was settled in April 2019). Looking forward, we expect QCT revenues to be impacted by seasonal trends related to product launch timing for sales made to Apple under our multi-year chipset supply agreement. These trends may or may not continue in the future and have been impacted by the decline in consumer demand resulting from COVID-19. Further, the trends for QTL have been, and may in the future be, impacted by disputes and/or resolutions with licensees and/or governmental investigations or proceedings, including the lawsuit filed against us by the FTC.\nResults of Operations\n2020 vs. 2019\nThe decrease in revenues in fiscal 2020 was primarily due to:\n- $4.7 billion in licensing revenues recorded in the third quarter of fiscal 2019 resulting from the settlement with Apple and its contract manufacturers (which were not allocated to our segment results)\n- $116 million in lower equipment and services revenues from our QSI segment\n+ $1.8 billion in licensing revenues from Huawei recorded in the fourth quarter of fiscal 2020 resulting from amounts due under the settlement agreement and royalties for sales made in the March 2020 and June 2020 quarters under the new global patent license agreement (which were not allocated to our segment results)\n+ $1.8 billion in higher equipment and services revenues from our QCT segment\n+ $437 million in higher licensing revenues from our QTL segment\n2019 vs. 2018\nThe increase in revenues in fiscal 2019 was primarily due to:\n+ $4.7 billion in licensing revenues recorded in the third quarter of fiscal 2019 resulting from the settlement with Apple and its contract manufacturers\n- $2.7 billion in lower equipment and services revenues from our QCT segment\n- $451 million in lower licensing revenues from our QTL segment\n2020 vs. 2019\nThe decrease in margin percentage in fiscal 2020 was primarily due to:\n- lower licensing revenues resulting from the settlement with Apple and its contract manufacturers in fiscal 2019\n+ higher licensing revenues from Huawei recorded in fiscal 2020 resulting from amounts due under the settlement agreement and royalties for sales made in the March 2020 and June 2020 quarters under the new global patent license agreement\n2019 vs. 2018\nThe increase in margin percentage in fiscal 2019 was primarily due to:\n+ higher licensing revenues resulting from the settlement with Apple and its contract manufacturers in fiscal 2019\n2020 vs. 2019\nThe increase in research and development expenses in fiscal 2020 was primarily due to:\n+ $426 million increase driven by higher costs related to the development of wireless and integrated circuit technologies, including 5G and application processor technologies, partially offset by lower employee cash incentive program costs\n+ $148 million in higher share-based compensation expense\n2019 vs. 2018\nThe decrease in research and development expenses in fiscal 2019 was primarily due to:\n- $221 million decrease primarily driven by actions taken under our Cost Plan that concluded in fiscal 2019, partially offset by higher share-based compensation expense and higher employee cash incentive program costs\nIn fiscal 2018, all of the costs ($474 million) related to pre-commercial research and development of 5G technologies were included in unallocated corporate research and development expenses. Beginning in fiscal 2019, all research and development costs associated with 5G technologies were included in segment results. Additionally, beginning in fiscal 2019, certain research and development costs associated with early research and development that were historically included in our QCT segment were allocated to our QTL segment. The net effect of these changes negatively impacted QTL’s EBT by $489 million in fiscal 2019 and positively impacted QCT’s EBT by $160 million in fiscal 2019.\n2020 vs. 2019\nThe decrease in selling, general and administrative expenses in fiscal 2020 was primarily due to:\n- $167 million in lower litigation costs, primarily resulting from the settlement of our prior dispute with Apple and its contract manufacturers in April 2019\n+ $44 million in higher patent costs, primarily resulting from 5G patent filings\n2019 vs. 2018\nThe decrease in selling, general and administrative expenses in fiscal 2019 was primarily due to:\n- $287 million in lower professional fees and costs, primarily driven by Broadcom’s withdrawn takeover proposal in fiscal 2018 and our then proposed acquisition of NXP Semiconductors N.V. (NXP) in fiscal 2018\n- $235 million in lower litigation costs, primarily resulting from the settlement of our prior dispute with Apple and its contract manufacturers and the end of the District Court trial in the lawsuit filed against us by the FTC\n- $162 million in lower employee-related expenses, primarily driven by actions taken under our Cost Plan\n- $75 million in lower sales and marketing expenses, primarily driven by actions taken under our Cost Plan\nOther income in fiscal 2020 consisted of $28 million in gains related to a favorable legal settlement.\nOther expenses in fiscal 2019 consisted of:\n+ $275 million charge related to a fine imposed by the European Commission (EC) related to the Icera complaint\n+ $213 million in net charges related to our Cost Plan\n- $43 million gain due to the partial recovery of a fine imposed in fiscal 2009 resulting from our appeal of the Korea Fair Trade Commission (KFTC) decision\n- $31 million gain related to a favorable legal settlement\nOther expenses in fiscal 2018 consisted of:\n+ $2.0 billion charge related to a fee in connection with the termination of the purchase agreement to acquire NXP\n+ $1.2 billion charge related to a fine imposed by the EC\n+ $629 million in restructuring and restructuring-related charges related to our Cost Plan\n- $676 million benefit related to the settlement of the Taiwan Fair Trade Commission (TFTC) investigation\nThe increase in impairment losses in fiscal 2020 was due in part to the impact COVID-19 had on certain of our investees. A significant portion of the impairment losses related to our investment in OneWeb who filed for bankruptcy in the second quarter of fiscal 2020. The decrease in interest and dividend income in fiscal 2020 was primarily driven by lower interest rates earned on interest-bearing securities. The decrease in net gains on marketable securities in fiscal 2020 was primarily driven by prior year gains resulting from the initial public offering of certain non-marketable equity investments in fiscal 2019.\nIn the fourth quarter of fiscal 2018, we implemented a stock repurchase program to repurchase up to $30 billion of our outstanding common stock. Stock repurchases made under this program significantly reduced the amount of our cash, cash equivalents and marketable securities, resulting in a decrease to interest and dividend income in fiscal 2019. The increase in net gains on marketable securities in fiscal 2019 was primarily driven by gains resulting from the initial public offering of certain non-marketable equity investments.\nIncome Tax Expense (in millions, except percentages)\nThe following table summarizes the primary factors that caused our annual tax provision to differ from the expected income tax provision at the U.S. federal statutory rate:\nN/M - Not meaningful\nThe 2017 Tax Cuts and Jobs Act (the Tax Legislation) was enacted in fiscal 2018, which, among other things, lowered the corporate income tax rate to 21%, and as a fiscal-year taxpayer, certain provisions of the Tax Legislation became effective for us at the beginning of fiscal 2019, including FDII (foreign-derived intangible income). In response to the Tax Legislation and to better align our profits with our activities, we implemented certain tax restructuring in fiscal 2018 and 2019. As a result, beginning in fiscal 2019, substantially all of our income is in the U.S., of which a significant portion qualifies for preferential treatment as FDII at a 13% effective tax rate. Our annual effective tax rate for fiscal 2018 reflected a blended federal statutory rate of approximately 25%.\nIn the fourth quarter of fiscal 2020, the United States Treasury Department issued final regulations on deductions for FDII, which are retroactive to fiscal 2019. As a result of these regulations, our fiscal 2020 annual effective tax rate increased by approximately 1%. In the first quarter of fiscal 2021, the United States Treasury Department issued final regulations on the foreign tax credit, which we anticipate will adversely affect our effective tax rate. The impact of these regulations, which are retroactive to fiscal 2019, has not been included in our fiscal 2020 effective tax rate. While we continue to evaluate these new regulations, we currently do not expect the adverse impact to fiscal 2019 and 2020 to be significant.\nAs a result of the Tax Legislation, in fiscal 2019, several of our foreign subsidiaries made tax elections to be treated as U.S. branches for federal income tax purposes (commonly referred to as “check-the-box” elections) effective beginning in fiscal 2018 and 2019. As a result of making these check-the-box elections, we recorded a tax benefit of $570 million in fiscal 2019. Additionally, in fiscal 2019, the United States Treasury Department issued new temporary regulations that resulted in a change to the deductibility of dividend income received by a U.S. stockholder from a foreign corporation. As a result of this change, pursuant to an agreement with the Internal Revenue Service, we relinquished the federal tax basis step-up of intellectual property that was distributed in fiscal 2018 by one of our foreign subsidiaries to a U.S. subsidiary. Therefore, the related deferred tax asset was derecognized, resulting in a $2.5 billion charge to income tax expense in fiscal 2019.\nIn fiscal 2018, as a result of the Tax Legislation, we recorded a charge of $5.7 billion to income tax expense, comprised of $5.2 billion related to the estimated one-time repatriation tax on deemed repatriated earnings and profits of U.S.-owned foreign subsidiaries (the Toll Charge) and $438 million resulting from the remeasurement of U.S. deferred tax assets and liabilities that existed at the end of fiscal 2017 at a lower enacted corporate income tax rate, which included a $135 million tax benefit in fiscal 2018 related to the remeasurement of a U.S. deferred tax liability that was established as a result of a change in one of our positions due to the Tax Legislation.\nUnrecognized tax benefits were $1.9 billion and $1.7 billion at September 27, 2020 and September 29, 2019, respectively. The increase in unrecognized tax benefits in fiscal 2020 was primarily due to our decision in fiscal 2019 to request a refund of Korean withholding taxes as licensees in Korea continue to withhold taxes on payments due under their licensing agreements at a rate higher than we believe is owed (which had an insignificant impact to our income tax provision). If successful, the refund will result in a corresponding reduction in U.S. foreign tax credits. We are subject to\nincome taxes in the United States and numerous foreign jurisdictions and are currently under examination by various tax authorities worldwide, primarily related to transfer pricing. These examinations are at various stages with respect to assessments, claims, deficiencies and refunds. We continually assess the likelihood and amount of potential adjustments and adjust the income tax provision, income taxes payable and deferred taxes in the period in which the facts give rise to a revision become known. As of September 27, 2020, we believe that adequate amounts have been reserved for based on facts known. However, the final determination of tax audits and any related legal proceedings could materially differ from amounts reflected in our income tax provision and the related accruals.\nSegment Results\nThe following should be read in conjunction with the fiscal 2020, 2019 and 2018 results of operations for each reportable segment included in this Annual Report in “Notes to Consolidated Financial Statements, Note 8. Segment Information.”\nQCT Segment (in millions, except percentages)\n(1)Earnings (loss) before taxes.\nEquipment and services revenues are predominantly related to sales of products used in mobile devices and mostly relate to sales of Mobile Station Modem (MSM™), radio frequency (RF), power management (PM) and wireless connectivity integrated chipsets. MSM integrated circuits include our stand-alone Mobile Data Modems and Snapdragon platforms, which include processors and modems. Approximately 575 million, 650 million and 855 million MSM integrated circuits were sold during fiscal 2020, 2019 and 2018, respectively. Through fiscal 2020, we provided the volume of MSM integrated circuit shipments to allow management and investors to, in part, evaluate, assess and benchmark our QCT segment’s performance. Beginning in fiscal 2021, we will no longer provide MSM integrated circuit shipments since such measure is becoming increasingly less meaningful in understanding and evaluating the performance of our QCT segment, which can be impacted by other factors including changes in mix and average selling price of our MSM integrated circuits and revenues generated from products other than MSM integrated circuits, such as RFFE products, among others.\n2020 vs. 2019\nThe increase in QCT equipment and services revenues was primarily due to:\n+ $1.6 billion in higher revenues per MSM and accompanying RF, PM and wireless connectivity chipset shipments, primarily driven by a favorable mix due to an increase in demand for 5G products\n+ $864 million in higher RFFE product revenues, primarily driven by an increase in demand for 5G products\n- $764 million in lower MSM and accompanying chipset shipments, primarily driven by a decrease in demand due to COVID-19, lower legacy MDM sales to Apple and lower sales to Huawei, partially offset by an increase in shipments to Apple under the multi-year chipset supply agreement and an increase in demand for IoT products\nQCT EBT as a percentage of revenues increased in fiscal 2020 primarily due to:\n+ higher revenues and gross margin, primarily driven by a favorable shift in product mix due to an increase in demand for 5G products\n- higher operating expenses, primarily driven by higher research and development costs\nQCT accounts receivable increased by 53% in fiscal 2020 from $908 million to $1.39 billion, primarily driven by an increase in revenues. QCT inventories increased by 86% in fiscal 2020 from $1.40 billion to $2.60 billion, primarily driven by the ramp in 5G demand.\n2019 vs. 2018\nThe decrease in QCT equipment and services revenues was primarily due to:\n- $2.7 billion in lower MSM and accompanying unit shipments, primarily driven by lower modem sales to Apple and a decline in demand from OEMs in China\n- $515 million in lower connectivity product revenues, primarily driven by a decline in demand for Wi-Fi and Bluetooth products from OEMs in China\n+ $552 million in higher revenues per MSM and accompanying unit shipment, primarily driven by a favorable shift in mix related to our premium-tier products\nQCT EBT as a percentage of revenues decreased in fiscal 2019 primarily due to:\n- lower QCT revenues\n+ decrease in operating expenses, primarily driven by a decrease in the amount of research and development expense allocated to QCT in fiscal 2019 and actions under our Cost Plan\nQTL Segment (in millions, except percentages)\nQTL results in fiscal 2020 and fiscal 2019 reflected the adoption of new revenue recognition guidance that requires us to estimate and recognize QTL royalties in the period in which the associated sales occur, resulting in an acceleration of royalty revenues by one quarter as compared to fiscal 2018. QTL results in fiscal 2018 have not been adjusted for the adoption of the new accounting guidance.\nAs a result of the settlement with Apple and its contract manufacturers in April 2019, QTL results for fiscal 2020 and the second half of fiscal 2019 included royalties from Apple and its contract manufactures. Revenues in the first six months of fiscal 2019 and all of fiscal 2018 did not include royalties from sales of Apple or other products by Apple’s contract manufacturers due to our prior dispute. Revenues of $4.7 billion recorded in the third quarter of fiscal 2019 resulting from the settlement with Apple and its contract manufacturers were not allocated to our segment results.\nQTL revenues for fiscal 2020 included royalties from Huawei for sales made in the September 2020 quarter under the new long-term, global patent license agreement. QTL revenues in fiscal 2019 included $450 million of royalties due under a second interim agreement with Huawei that concluded in the third quarter of fiscal 2019. Due to our prior dispute that was resolved in July 2020, we did not record any revenues in the first three quarters of fiscal 2020 or the fourth quarter of fiscal 2019 for royalties due on the sales of Huawei’s consumer wireless products. QTL revenues in fiscal 2018 included $600 million paid under an interim agreement with Huawei. Revenues of $1.8 billion recorded in the fourth quarter of fiscal 2020 resulting from the settlement agreement with Huawei and royalties for sales made in the March 2020 and June 2020 quarters under the new global patent license agreement with Huawei were not allocated to our segment results.\n2020 vs. 2019\nThe increase in QTL licensing revenues in fiscal 2020 was primarily due to:\n+ $906 million increase in estimated sales of 3G/4G/5G-based multimode products, primarily due to new license agreements with Apple and Huawei signed in April 2019 and July 2020, respectively, partially offset by the negative impact of COVID-19 on demand for licensees’ products that incorporate our intellectual property\n+ $110 million increase in royalty revenues recognized related to devices sold in prior periods\n- $450 million in licensing revenues recorded in fiscal 2019 resulting from the second interim agreement with Huawei\n- $129 million in lower estimated revenues per unit, in part reflecting licensees entering into new 5G multimode license agreements with rights to our cellular standard-essential patents only (compared to previous licenses that also included rights to certain other non-cellular essential patents) and decreases in our per unit royalty caps\nQTL EBT as a percentage of revenues increased in fiscal 2020 primarily due to:\n+ higher QTL revenues\n+ lower selling, general and administrative expenses, primarily from lower litigation costs\n- higher research and development expenses\nQTL accounts receivable increased by 4% in fiscal 2020 from $1.54 billion to $1.60 billion, primarily driven by an increase in estimated royalties for the September 2020 quarter (in part due to the new license agreement with Huawei), partially offset by scheduled payments received from Oppo and vivo for amounts due under agreements reached in fiscal 2020 related to license agreements that expired on March 31, 2020 (for which payments were withheld while good faith negotiations occurred).\n2019 vs. 2018\nQTL licensing revenues in fiscal 2019, which primarily related to royalties due on sales made by our licensees in the December 2018, March 2019, June 2019 and September 2019 quarters, decreased compared to licensing revenues in fiscal 2018, which primarily related to royalties due on sales made by our licensees in the September 2017, December 2017, March 2018 and June 2018 quarters, primarily due to:\n- $757 million in lower estimated revenues per unit compared to revenues per reported unit, in part reflecting licensees entering into new 5G multimode license agreements with rights to our cellular standard-essential patents only (compared to previous licenses that also included rights to certain other non-cellular essential patents), and decreases in our per unit royalty caps\n- $150 million in lower royalty revenues from Huawei under the interim agreements\n+ $484 million increase in estimated sales of 3G/4G/5G-based multimode products compared to reported sales of 3G/4G-based products, primarily due to the April 2019 license agreement with Apple, partially offset by a decline in unit demand and a shift in OEM share towards Huawei\nQTL EBT as a percentage of revenues decreased in fiscal 2019 primarily due to:\n- higher research and development costs due to an increase in the amount of research and development expense allocated to QTL in fiscal 2019\n- lower QTL revenues\n+ lower selling, general and administrative expenses, primarily from lower litigation costs and lower bad debt expense\nQSI Segment (in millions)\n2020 vs. 2019\nThe decrease in QSI EBT in of fiscal 2020 was primarily due to:\n- $248 million increase in impairment losses on other investments, of which a significant portion related to our investment in OneWeb\n- $116 million decrease in revenues associated with certain development contracts with OneWeb\n- $60 million decrease in net gains on investments, primarily driven by a gain in fiscal 2019 resulting from the initial public offering of certain of our non-marketable equity investments\n+ $50 million decrease in our share of equity method investee losses\nQSI segment assets, which primarily consist of marketable and non-marketable equity investments, decreased by 20% in fiscal 2020 from $1.71 billion to $1.37 billion, primarily due to impairments of certain non-marketable investments and sale of marketable securities.\n2019 vs. 2018\nThe increase in QSI EBT in fiscal 2019 was primarily due to:\n+ $270 million increase in net gains on investments, primarily driven by gains resulting from the initial public offering of certain non-marketable equity investments\n+ $91 million increase resulting from higher revenues and lower costs associated with certain development contracts with OneWeb\n- $41 million increase in impairment losses on investments, primarily related to our investment in OneWeb\nLooking Forward\nIn the coming years, we expect new consumer demand for 3G/4G/5G multimode and 5G products and services to ramp around the world as we transition from 3G/4G multimode and 4G products and services. We believe that 5G will drive growth and transformation in emerging device categories and industries that will create new business models and new services, resulting from the expanding adoption of certain technologies that are already commonly used in smartphones by industry segments or applications beyond mobile, such as automotive and IoT. We believe it is important that we remain a leader in 5G technology development, standardization, intellectual property creation and licensing of 5G technologies, and to be a leading developer and supplier of 5G integrated circuit products in order to sustain and grow our business long term.\nAs we look forward to the next several months and beyond, we expect our business to be impacted by the following key items:\n•The COVID-19 pandemic has resulted in significant economic uncertainty and has led to a global recession. We expect the pandemic will continue to have a negative impact on QTL and QCT revenues in the near term based on a reduction in consumer demand for smartphones and other products. We have not experienced, and we currently do not anticipate a material adverse impact on our ability, or our suppliers’ ability, to manufacture and test our products or on our ability to provide our products to our customers. Workforce changes that we implemented in the second quarter of fiscal 2020 are expected to remain in effect in the near term. The degree to which the COVID-19 pandemic impacts our business, financial condition and results of operations will depend on future developments, which are highly uncertain. See “Risk Factors” in this Annual Report, specifically the Risk Factor entitled “The recent coronavirus (COVID-19) pandemic has had an adverse effect on our business and results of operations, and we expect its impact will continue, at least in the near term.”\n•In May 2019, in United States Federal Trade Commission (FTC) v. QUALCOMM Incorporated, the district court issued an Order ruling against us and imposing certain injunctive relief. On August 11, 2020, on appeal, the Ninth Circuit reversed the district court’s judgment, vacated its injunction and vacated its partial grant of summary judgment. On September 25, 2020, the FTC filed a Petition for Rehearing En Banc. On October 28, 2020, the Ninth Circuit denied the FTC’s petition. Regulatory authorities in certain other jurisdictions are investigating and/or have investigated our business practices and instituted proceedings against us, and they or other regulatory authorities may do so in the future. Unfavorable resolutions of one or more of these matters have had and could in the future have a material adverse effect on our business, revenues, results of operations, financial condition and cash flows. See “Notes to Consolidated Financial Statements, Note 7. Commitments and Contingencies” and “Risk Factors” in\nthis Annual Report, including the Risk Factor entitled “Changes in our patent licensing practices, whether due to governmental investigations or private legal proceedings challenging those practices, or otherwise, could adversely impact our business and results of operations.”\n•We have not been the sole supplier of modems for iPhone products beginning with products that launched in September 2016, and Apple is not utilizing our modems for iPhone products that launched in September 2019. We expect QCT revenues to be favorably impacted in the near-term as we anticipate a ramp in volume of shipments to support Apple’s 2020 iPhone product launches.\n•We expect our research and development costs will increase in the near-term primarily due to increased investment towards advancements in 5G and application processor technologies and certain other long-term initiatives, as well as an increase in share-based compensation expense.\n•We expect increased demand in the December quarter from certain Chinese OEMs as they position to gain device share, particularly in China. Since it will take time for us to adapt our supply chain process, we do not expect to realize the full benefit from this increased demand from OEMs.\n•We expect continued intense competition, particularly in China, as our competitors expand their product offerings and/or reduce the prices of their products as part of a strategy to attract new and/or retain existing customers;\n•Current U.S./China trade relations and/or national security protection policies may negatively impact our business, growth prospects and results of operations. See “Risk Factors” in this Annual Report, including the Risk Factor entitled “A significant portion of our business is concentrated in China, and the risks of such concentration are exacerbated by U.S./China trade and national security tensions.”\n•Commercial 5G network deployments and device launches will continue into calendar 2021 and beyond.\nIn addition to the foregoing business and market-based matters, we continue to devote resources to working with and educating participants in the wireless value chain and governments as to the benefits of our licensing program and our extensive technology investments in promoting a highly competitive and innovative wireless industry. However, we expect that certain companies may continue to be dissatisfied with the need to pay reasonable royalties for the use of our technology and not welcome the success of our licensing program in enabling new, highly cost-effective competitors to their products. Accordingly, such companies, and/or governments or regulators, may continue to challenge our business model in various forums throughout the world.\nFurther discussion of risks related to our business is provided in “Part I, Item 1A. Risk Factors” included in this Annual Report.\nLiquidity and Capital Resources\nOur principal sources of liquidity are our existing cash, cash equivalents and marketable securities, cash generated from operations and cash provided by our debt programs. The following table presents selected financial information related to our liquidity as of and for the years ended September 27, 2020 and September 29, 2019 (in millions):\nThe net decrease in cash, cash equivalents and marketable securities was primarily due to $2.9 billion in cash dividends paid, $2.4 billion to repurchase shares of our common stock, $1.4 billion in capital expenditures and $344 million in payments of tax withholdings related to the vesting of share-based awards, partially offset by net cash provided by operating activities and $329 million in proceeds from issuance of common stock.\nThe increase in accounts receivable was primarily due to the remaining amounts due under the settlement agreement with Huawei and increases in QCT and QTL accounts receivable. The increase in inventories was primarily driven by the ramp in 5G demand.\nDebt. In May 2020, we issued an aggregate principal amount of $2.0 billion of unsecured fixed-rate notes with varying maturities (May 2020 Notes). The net proceeds were used to repay the $250 million floating-rate and $1.75 billion fixed-rate notes that matured on May 20, 2020, which were classified as short-term debt at September 29, 2019. In August 2020, we completed an exchange of $2.0 billion of our outstanding fixed-rate notes maturing between 2022 and 2025 (Old Notes) for $2.2 billion of fixed-rate notes maturing in 2028 and 2032 (August 2020 Notes). We also repurchased $202 million of the Old Notes from holders not eligible to participate in the exchange. At September 27, 2020, we had $15.5 billion of principal floating- and fixed-rate notes outstanding, with maturity dates in 2022 through 2050.\nWe have an unsecured commercial paper program, which provides for the issuance of up to $4.5 billion of commercial paper. Net proceeds from this program are used for general corporate purposes. At September 27, 2020, we had $500 million of commercial paper outstanding.\nOur Amended and Restated Revolving Credit Facility (Revolving Credit Facility) provides for unsecured revolving facility loans, swing line loans and letters of credit in the aggregate amount of up to $4.5 billion and expires on November 8, 2021. At September 27, 2020, no amounts were outstanding under the Revolving Credit Facility.\nWe may issue new debt in the future. COVID-19 has led to disruption and volatility in the global capital markets, which may adversely impact the cost of and access to capital. The amount and timing of such borrowings will be subject to a number of factors, including acquisitions and strategic investments, acceptable interest rates and changes in corporate income tax law, among other factors.\nAdditional information regarding our outstanding debt at September 27, 2020 is provided in this Annual Report in “Notes to Consolidated Financial Statements, Note 6. Debt.”\nIncome Taxes. At September 27, 2020, we estimated remaining future payments of $2.0 billion for a one-time U.S. repatriation tax accrued in fiscal 2018 (Toll Charge), after application of certain tax credits, which is payable in installments over the next six years. At September 27, 2020, other current liabilities included $174 million for the next installment due in January 2021.\nAdditional information regarding our income taxes is provided in this Annual Report in “Notes to Consolidated Financial Statements, Note 3. Income Taxes.”\nCapital Return Program. The following table summarizes stock repurchases, before commissions, and dividends paid during fiscal 2020, 2019 and 2018 (in millions, except per-share amounts):\n(1)Average Price Paid Per Share in fiscal 2018 and 2019 excludes the impact of the three accelerated share repurchase agreements (the ASR Agreements) executed in September 2018 and completed in September 2019. The average price per share under the ASR Agreements was $64.76.\nIn fiscal 2018, we announced a stock repurchase program authorizing us to repurchase up to $30 billion of our common stock. At September 27, 2020, $4.6 billion remained authorized for repurchase under the stock repurchase program. The stock repurchase program has no expiration date. Subsequent to September 27, 2020, we resumed stock repurchases under the stock repurchase program, which we had suspended in the third quarter of fiscal 2020 in light of COVID-19 to maintain our financial liquidity position and flexibility. We periodically evaluate repurchases as a means of returning capital to stockholders to determine when and if repurchases are in the best interests of our stockholders and may reinstate, accelerate, suspend, delay or discontinue repurchases at any time.\nOn October 14, 2020, we announced a cash dividend of $0.65 per share on our common stock, payable on December 17, 2020 to stockholders of record as of the close of business on December 3, 2020. We intend to continue to use cash dividends as a means of returning capital to stockholders, subject to capital availability, which may be impacted by COVID-19, and our view that cash dividends are in the best interests of our stockholders, among other factors.\nAdditional Capital Requirements. We believe our cash, cash equivalents and marketable securities, our expected cash flow generated from operations and our expected financing activities will satisfy our working and other capital requirements\nfor at least the next 12 months based on our current business plans. Recent and expected working and other capital requirements, in addition to the above matters, also include the items described below:\n•Our purchase obligations at September 27, 2020, some of which relate to research and development activities and capital expenditures, totaled $5.5 billion and $350 million for fiscal 2021 and 2022, respectively, and $242 million thereafter.\n•Our research and development expenditures were $6.0 billion in fiscal 2020 and $5.4 billion in fiscal 2019, and we expect to increase our investment in research and development in fiscal 2021, including in advancements in existing and new technologies and products.\n•Cash outflows for capital expenditures were $1.4 billion in fiscal 2020 and $887 million in fiscal 2019. We expect capital expenditures to increase in the near term to support the increase in our manufacturing and production capacity needs primarily resulting from the ramp in 5G devices.\n•At September 27, 2020, $1.5 billion was accrued related to two fines imposed by the EC (based on the exchange rate at September 27, 2020, including related foreign currency gains and accrued interest). We have provided financial guarantees in lieu of cash payment to satisfy the obligations while we appeal the EU’s decisions.\n•We expect to continue making strategic investments and acquisitions, the amounts of which could vary significantly, to open new opportunities for our technologies, obtain development resources, grow our patent portfolio or pursue new businesses.\nFurther, regulatory authorities in certain jurisdictions have investigated our business practices and instituted proceedings against us and they or other regulatory authorities may do so in the future. Additionally, certain of our direct and indirect customers and licensees, have pursued, and others may in the future pursue, litigation or arbitration against us related to our business. Unfavorable resolutions of one or more of these matters have had and could in the future have a material adverse effect on our business, revenues, results of operations, financial condition and cash flows. See “Notes to Consolidated Financial Statements, Note 7. Commitments and Contingencies” and “Part I, Item 1A. Risk Factors” in this Annual Report.\nContractual Obligations/Off-Balance Sheet Arrangements\nWe have no significant contractual obligations not fully recorded on our consolidated balance sheets or fully disclosed in the notes to our consolidated financial statements. We have no material off-balance sheet arrangements as defined in Regulation S-K 303(a)(4)(ii).\nThe following table summarizes the payments due by fiscal period for our outstanding contractual obligations at September 27, 2020 (in millions):\n(1)Purchase obligations primarily relate to integrated circuit product inventory obligations, which represent purchase commitments for raw materials, semiconductor die, finished goods and manufacturing services, such as wafer bump, probe, assembly and final test. Under our manufacturing relationships with our foundry suppliers and assembly and test service providers, cancellation of outstanding purchase commitments is generally allowed but requires payment of costs incurred through the date of cancellation, and in some cases, incremental fees related to capacity underutilization.\n(2)Amounts represent future lease payments. Operating and finance lease obligations include the related current portions. Operating and finance lease liabilities were included in other current liabilities and other noncurrent liabilities in the consolidated balance sheet at September 27, 2020.\n(3)Certain of these commitments do not have fixed funding dates and are subject to certain conditions and have, therefore, been presented as having no expiration date. Commitments represent the maximum amounts to be funded under these arrangements; actual funding may be in lesser amounts or not at all.\n(4)Amounts represent contractual payments of principal and interest.\n(5)Amounts represent contractual payments of amounts recorded on our consolidated balance sheet. Certain long-term liabilities reflected on our balance sheet, such as unearned revenues, are not presented in this table because they do not require cash settlement in the future. Other long-term liabilities as presented in this table include the related current portions, as applicable. These amounts do not include the EC fines recorded as current liabilities on our consolidated balance sheet. For further information regarding these fines, refer to “Notes to Consolidated Financial Statements, Note 7. Commitments and Contingencies.”\n(6)Our consolidated balance sheet at September 27, 2020 included $1.8 billion in other noncurrent liabilities for uncertain tax positions, which primarily relate to a reduction of U.S. foreign tax credits that will occur if we are successful in our claim for a refund of Korean withholding tax (for which a $1.6 billion receivable was recorded at September 27, 2020). If we are successful in our claim for a refund, the majority of this liability will be payable when we receive the Korean tax refund, with the remainder payable over periods up to and including the last payment of the Toll Charge in January 2026. The future payments related to uncertain tax positions recorded as other noncurrent liabilities have not been presented in the table above due to the uncertainty of the amounts and timing of cash settlement with the taxing authorities.\nAdditional information regarding our financial commitments at September 27, 2020 is provided in this Annual Report in “Notes to Consolidated Financial Statements, Note 3. Income Taxes,” “Note 6. Debt” and “Note 7. Commitments and Contingencies.”\nCritical Accounting Estimates\nThe preparation of our consolidated financial statements in accordance with accounting principles generally accepted in the United States requires us to make estimates and judgments that affect the reported amounts of assets, liabilities, revenues and expenses, and disclosure of contingent assets and liabilities. We base our estimates on historical and anticipated results and trends and on various other assumptions that we believe are reasonable under the circumstances, including assumptions as to future events. By their nature, estimates are subject to an inherent degree of uncertainty. Although we believe that our estimates and the assumptions supporting our assessments are reasonable, actual results that differ from our estimates could be material to our consolidated financial statements.\nRefer to “Note 1. Significant Accounting Policies” and “Note 2. Composition of Certain Financial Statement Items” included in this Annual Report in “Notes to Consolidated Financial Statements” for further information on our critical accounting estimates and policies, which are as follows. In addition, if the impact of changes in our critical accounting estimates are material or considered necessary to understand our results of operations for the periods presented, then such information is disclosed within this Annual Report in “Item 7. Management’s Discussion and Analysis of Financial Condition and Results of Operations, Results of Operations.”\nRevenue Recognition. We grant licenses or otherwise provide rights to use portions of our intellectual property portfolio, which, among other rights, includes certain patent rights essential to and/or useful in the manufacture, sale or use of certain wireless products. Since the adoption of ASC 606 in fiscal 2019, we estimate and recognize sales-based royalties on such licensed products in the period in which the licensees’ sales occur, which is based largely on preliminary royalty estimates provided by our licensees. Actual amounts for sales-based royalties have been materially consistent with such estimates, and no significant reversals of revenues have been required as a result of adjustments to prior period royalty estimates. Additionally, with respect to our settlement agreement and new global patent license agreement with Huawei, significant evaluation and judgment were required in determining the appropriate accounting.\nImpairment of Non-marketable Equity Investments. We monitor our investments for events or circumstances that could indicate impairment and observable price adjustments. In fiscal 2020, we recorded impairment losses on other investments of $405 million, an increase of $270 million compared to fiscal 2019, a portion of which was due in part to the impacts of COVID-19 on certain companies in which we hold non-marketable investments. For a significant portion of these impairments, the estimated fair values resulted in a full write-off of the carrying values.\nInventories. We measure inventory at the lower of cost or net realizable value considering judgments related to future demand and market conditions, such as COVID-19 in fiscal 2020 that negatively impacted consumer demand for devices that incorporate our products. For fiscal 2020, 2019 and 2018, the overall net effect on our operating results from changes in this estimate were not material.\nImpairment of Goodwill and Long-Lived Assets. We monitor our goodwill and long-lived assets for the existence of impairment indicators and apply judgments in the valuation methods and underlying assumptions utilized in such assessments. During fiscal 2020, we did not record any impairment charges for goodwill and long-lived assets. Additionally, the estimated fair values of our QCT and QTL reporting units were substantially in excess of their respective carrying values at September 27, 2020. In fiscal 2019 and 2018, we recorded $203 million and $273 million, respectively, of impairment charges for goodwill and long-lived assets.\nLegal and Regulatory Proceedings. We record our best estimate of a loss related to pending legal and regulatory proceedings when the loss is considered probable and the amount can be reasonably estimated. We face difficulties in evaluating or estimating likely outcomes or the amount of possible loss in certain legal and regulatory proceedings.\nIncome Taxes. We make significant judgments and estimates in determining our provision for income taxes, including our assessment of our income tax positions given the uncertainties involved in the interpretation and application of complex tax laws and regulations in various taxing jurisdictions.\nRecent Accounting Pronouncements\nInformation regarding recent accounting pronouncements and the impact of those pronouncements, if any, on our consolidated financial statements is provided in this Annual Report in “Notes to Consolidated Financial Statements, Note 1. Significant Accounting Policies.”",
    "item_7A": "Item 7A. Quantitative and Qualitative Disclosures about Market Risk\nMarketable Securities\nWe have made investments in marketable equity securities of companies of varying size, style, industry and geography and changes in investment allocations may affect the price volatility of our investments. In fiscal 2018, we announced that we had been authorized to repurchase up to $30 billion of our common stock. The actions taken pursuant to our stock repurchase program have significantly reduced the amount of cash available to fund our investments in marketable securities.\nEquity Price Risk. At September 27, 2020, the recorded value of our marketable equity securities was $352 million. A 10% decrease in the market price of our marketable equity securities at September 27, 2020 would have caused a decrease in the carrying amounts of these securities of $35 million. A 10% decrease in the market price of our marketable equity securities at September 29, 2019 would have caused a decrease in the carrying amounts of these securities of $42 million.\nInterest Rate Risk. We invest a portion of our cash in a number of diversified fixed- and floating-rate securities consisting of cash equivalents, marketable debt securities and time and demand deposits that are subject to interest rate risk. At September 27, 2020, a hypothetical increase in interest rates of 100 basis points across the entire yield curve on our holdings would have resulted in a decrease of $32 million in the fair value of our holdings. At September 29, 2019, a hypothetical increase in interest rates of 100 basis points across the entire yield curve on our holdings would have resulted in a negligible decrease in the fair value of our holdings.\nOther Investments\nEquity Price Risk. We hold investments in non-marketable equity instruments in privately held companies that may be impacted by equity price risks. Beginning in the second quarter of fiscal 2020, the rapid, global spread of COVID-19 and the uncertainty it has created has resulted in significant volatility in the condition of economies and financial markets globally and has led to a global recession. This has adversely affected certain of our non-marketable equity investments. Volatility in the equity markets could negatively affect our investees’ ability to raise additional capital as well as our ability to realize value from our investments through initial public offerings, mergers and private sales. Consequently, we could incur significant losses on our non-marketable equity investments. At September 27, 2020, the aggregate carrying value of our non-marketable equity investments was included in other noncurrent assets and was $982 million.\nDebt\nInterest Rate Risk. As substantially all of our debt is comprised of unsecured fixed-rate notes, we are not subject to significant interest rate risk. At September 27, 2020, we had an aggregate principal amount of $500 million in unsecured floating-rate notes due January 30, 2023. The interest rates on our floating-rate notes are based on LIBOR. At September 27, 2020, a hypothetical increase in LIBOR-based interest rates of 100 basis points would cause a negligible increase to interest expense on an annualized basis as it relates to our floating-rate notes. At September 27, 2020, we also had $500 million in commercial paper outstanding, for which our exposure to interest rate risk is negligible based on the original maturities of approximately three months or less.\nAdditional information regarding our notes and commercial paper program is provided in this Annual Report in “Notes to Consolidated Financial Statements, Note 1. Significant Accounting Policies” and “Notes to Consolidated Financial Statements, Note 6. Debt.”\nForeign Exchange Risk\nWe manage our exposure to foreign exchange market risks, when deemed appropriate, through the use of derivative financial instruments, including foreign currency forward and option contracts with financial counterparties. We utilize such derivative financial instruments for hedging or risk management purposes rather than for speculative purposes. Counterparties to our derivative contracts are all major banking institutions. In the event of the financial insolvency or distress of a counterparty to our derivative financial instruments, we may be unable to settle transactions if the counterparty does not provide us with sufficient collateral to secure its net settlement obligations to us, which could have a negative impact on our results. A description of our foreign currency accounting policies is provided in this Annual Report in “Notes to Consolidated Financial Statements, Note 1. Significant Accounting Policies.”\nForeign Currency Options. At September 27, 2020, our net liability related to foreign currency options designated as hedges of foreign currency risk on royalties earned from certain licensees was negligible. If our forecasted royalty revenues for currencies in which we hedge were to decline by 10% and foreign exchange rates were to change unfavorably by 10% in our hedged foreign currency, we would not incur a loss as our hedge positions would continue to be fully effective. Based on forecasts at September 29, 2019, assuming the same hypothetical market conditions, we would also not have incurred a loss.\nForeign Currency Forwards. At September 27, 2020, our net asset related to foreign currency forward contracts designated as hedges of foreign currency risk on certain operating expenditure transactions was $49 million. If our forecasted operating expenditures for currencies in which we hedge were to decline by 10% and foreign exchange rates were to change unfavorably by 10% in our hedged foreign currency, we would not incur a loss as our hedge positions would continue to be fully effective. Based on forecasts at September 29, 2019, assuming the same hypothetical market conditions, we would also not have incurred a loss.\nAt September 27, 2020, our net liability related to foreign currency forward contracts not designated as hedging instruments used to manage foreign currency risk on certain receivables and payables was negligible. If the foreign exchange rates were to change unfavorably by 10% in our hedged foreign currency, we would not incur a loss as the change in the fair value of the foreign currency option and forward contracts would be offset by the change in fair value of the related receivables and/or payables being economically hedged. Based on forecasts at September 29, 2019, assuming the same hypothetical market conditions, we would also not have incurred a loss.\nNet Investment Hedges. At September 27, 2020, we have designated $1.4 billion of foreign currency-denominated liabilities, excluding accrued interest, as hedges of our net investment in certain foreign subsidiaries. If foreign exchange rates were to change unfavorably by 10% in our hedged foreign currency, there would be an increase of $144 million in the accumulated other comprehensive loss attributable to the cumulative foreign currency translation adjustment at September 27, 2020 related to our net investment hedges. The change in value recorded in cumulative foreign currency translation adjustment would be expected to offset a corresponding foreign currency translation gain or loss from our investment in foreign subsidiaries.\nFunctional Currency. Financial assets and liabilities held by consolidated subsidiaries that are not denominated in the functional currency of those entities are subject to the effects of currency fluctuations and may affect reported earnings. As a global company, we face exposure to adverse movements in foreign currency exchange rates. We may hedge currency exposures associated with certain assets and liabilities denominated in nonfunctional currencies and certain anticipated nonfunctional currency transactions. As a result, we could experience unanticipated gains or losses on anticipated foreign currency cash flows, as well as economic loss with respect to the recoverability of investments. While we may hedge certain transactions with non-U.S. customers, declines in currency values in certain regions may, if not reversed, adversely affect future product sales because our products may become more expensive to purchase in the countries of the affected currencies.\nOur analysis methods used to assess and mitigate the risks discussed above should not be considered projections of future risks.",
    "item_8": "Item 8. Financial Statements and Supplementary Data\nOur consolidated financial statements at September 27, 2020 and September 29, 2019 and for each of the three years in the period ended September 27, 2020 and the Report of PricewaterhouseCoopers LLP, Independent Registered Public Accounting Firm, are included in this Annual Report on pages through.",
    "item_9": "Item 9. Changes in and Disagreements with Accountants on Accounting and Financial Disclosure\nNone.",
    "item_9A": "Item 9A. Controls and Procedures\nConclusion Regarding the Effectiveness of Disclosure Controls and Procedures\nUnder the supervision and with the participation of our management, including our principal executive officer and our principal financial officer, we conducted an evaluation of our disclosure controls and procedures, as such terms are defined under Rule 13a-15(e) promulgated under the Securities Exchange Act of 1934, as amended (the Exchange Act). Based on this evaluation, our principal executive officer and our principal financial officer concluded that our disclosure controls and procedures were effective as of the end of the period covered by this Annual Report.\nManagement’s Report on Internal Control over Financial Reporting\nOur management is responsible for establishing and maintaining adequate internal control over financial reporting, as such term is defined in Exchange Act Rule 13a-15(f). Under the supervision and with the participation of our management, including our principal executive officer and our principal financial officer, we conducted an evaluation of the effectiveness of our internal control over financial reporting based on the framework in Internal Control - Integrated Framework (2013) issued by the Committee of Sponsoring Organizations of the Treadway Commission. Based on our evaluation under this framework, our management concluded that our internal control over financial reporting was effective as of September 27, 2020.\nPricewaterhouseCoopers LLP, the independent registered public accounting firm that audited our consolidated financial statements included in this Annual Report, has also audited the effectiveness of our internal control over financial reporting as of September 27, 2020, as stated in its report which appears on pages through in this Annual Report.\nInherent Limitations over Internal Controls\nOur internal control over financial reporting is designed to provide reasonable assurance regarding the reliability of financial reporting and the preparation of consolidated financial statements for external purposes in accordance with generally accepted accounting principles. Our internal control over financial reporting includes those policies and procedures that:\ni.pertain to the maintenance of records that, in reasonable detail, accurately and fairly reflect the transactions and dispositions of our assets;\nii.provide reasonable assurance that transactions are recorded as necessary to permit preparation of consolidated financial statements in accordance with generally accepted accounting principles, and that our receipts and expenditures are being made only in accordance with authorizations of our management and directors; and\niii.provide reasonable assurance regarding prevention or timely detection of unauthorized acquisition, use or disposition of our assets that could have a material effect on the consolidated financial statements.\nInternal control over financial reporting cannot provide absolute assurance of achieving financial reporting objectives because of its inherent limitations, including the possibility of human error and circumvention by collusion or overriding of controls. Accordingly, even an effective internal control system may not prevent or detect material misstatements on a timely basis. Also, projections of any evaluation of effectiveness to future periods are subject to the risk that controls may become inadequate because of changes in conditions or that the degree of compliance with the policies or procedures may deteriorate.\nChanges in Internal Control over Financial Reporting\nThere were no changes in our internal control over financial reporting during the fourth quarter of fiscal 2020 that have materially affected, or are reasonably likely to materially affect, our internal control over financial reporting.",
    "item_9B": "Item 9B. Other Information\nNone.\nPart III",
    "item_9C": "",
    "item_10": "Item 10. Directors, Executive Officers and Corporate Governance\nThe information required by this item regarding directors is incorporated by reference to our 2021 Proxy Statement to be filed with the SEC in connection with our 2021 Annual Meeting of Stockholders (2021 Proxy Statement) in “Proposal 1: Election of Directors” under the subheading “Nominees for Election.” Certain information required by this item regarding executive officers is set forth in Item 1 of Part I of this Report under the heading “Information about our Executive Officers.” The information required by this item regarding corporate governance is incorporated by reference to our 2021 Proxy Statement in the section titled “Corporate Governance” under the headings “Code of Ethics and Corporate Governance Principles and Practices” and “Board Meetings, Committees and Attendance.”",
    "item_11": "Item 11. Executive Compensation\nThe information required by this item is incorporated by reference to our 2021 Proxy Statement in the sections titled “Executive Compensation and Related Information,” “HR and Compensation Committee Report” and “Director Compensation,” and in the section titled “Stock Ownership of Certain Beneficial Owners and Management” under the subheading “Compensation Committee Interlocks and Insider Participation.”",
    "item_12": "Item 12. Security Ownership of Certain Beneficial Owners and Management and Related Stockholder Matters\nThe information required by this item is incorporated by reference to our 2021 Proxy Statement in the section titled “Stock Ownership of Certain Beneficial Owners and Management” including under the subheading “Equity Compensation Plan Information.”",
    "item_13": "Item 13. Certain Relationships and Related Transactions, and Director Independence\nThe information required by this item is incorporated by reference to our 2021 Proxy Statement in the section titled “Certain Relationships and Related-Person Transactions,” and in the section titled “Corporate Governance” under the subheadings “Director Independence” and “Board Meetings, Committees and Attendance.”",
    "item_14": "Item 14. Principal Accounting Fees and Services\nThe information required by this item is incorporated by reference to our 2021 Proxy Statement in “Proposal 2: Ratification of Selection of Independent Public Accountants.”\nPART IV",
    "item_15": "Item 15. Exhibits and Financial Statement Schedules\nThe following documents are filed as part of this report:\n(a) Financial Statements:\nPage\nNumber\n(1) Report of Independent Registered Public Accounting Firm\nConsolidated Balance Sheets at September 27, 2020 and September 29, 2019\nConsolidated Statements of Operations for Fiscal 2020, 2019 and 2018\nConsolidated Statements of Comprehensive Income (Loss) for Fiscal 2020, 2019 and 2018\nConsolidated Statements of Cash Flows for Fiscal 2020, 2019 and 2018\nConsolidated Statements of Stockholders’ Equity for Fiscal 2020, 2019 and 2018\nNotes to Consolidated Financial Statements\n(2) Schedule II - Valuation and Qualifying Accounts for Fiscal 2020, 2019 and 2018 S-1\nFinancial statement schedules other than those listed above have been omitted because they are either not required, not applicable or the information is otherwise included in the notes to the consolidated financial statements.\n(b) Exhibits\n(1)We shall furnish supplementally a copy of any omitted schedule to the Commission upon request.\n(2)Indicates management contract or compensatory plan or arrangement required to be identified pursuant to Item 15(a).",
    "item_16": "Item 16. Form 10-K Summary\nNone.",
    "stock_ticker": "QCOM"
}