{
    "cik": "829224",
    "company": "STARBUCKS CORP",
    "filing_type": "10-K",
    "filing_date": "2020-11-12",
    "period_of_report": "2020-09-27",
    "sic": "5810",
    "state_of_inc": "WA",
    "state_location": "WA",
    "fiscal_year_end": "0927",
    "filing_html_index": "https://www.sec.gov/Archives/edgar/data/829224/0000829224-20-000078-index.html",
    "htm_filing_link": "https://www.sec.gov/Archives/edgar/data/829224/000082922420000078/sbux-20200927.htm",
    "complete_text_filing_link": "https://www.sec.gov/Archives/edgar/data/829224/0000829224-20-000078.txt",
    "filename": "829224_10K_2020_0000829224-20-000078.htm",
    "item_1": "Item 1. Business\nGeneral\nStarbucks is the premier roaster, marketer and retailer of specialty coffee in the world, operating in 83 markets. Formed in 1985, Starbucks Corporation’s common stock trades on the NASDAQ Global Select Market (“NASDAQ”) under the symbol “SBUX.” We purchase and roast high-quality coffees that we sell, along with handcrafted coffee, tea and other beverages and a variety of high-quality food items through company-operated stores. We also sell a variety of coffee and tea products and license our trademarks through other channels such as licensed stores, as well as grocery and foodservice through our Global Coffee Alliance with Nestlé S. A. (“Nestlé”). In addition to our flagship Starbucks Coffee brand, we sell goods and services under the following brands: Teavana, Seattle’s Best Coffee, Evolution Fresh, Ethos, Starbucks Reserve and Princi.\nOur objective is to maintain Starbucks standing as one of the most recognized and respected brands in the world. To achieve this, we are continuing the disciplined expansion of our global store base, adding stores in both existing, developed markets such as the U.S. and in newer, higher growth markets such as China, as well as optimizing the mix of company-operated and licensed stores around the world. In addition, by leveraging the experience gained through our traditional store model, we continue to offer consumers new coffee and other products in a variety of forms, across new categories, diverse channels and alternative store formats. We also believe our Starbucks Global Social Impact strategy, commitments related to ethically sourcing high-quality coffee, contributing positively to the communities we do business in and being an employer of choice are contributors to our objective.\nIn this Annual Report on Form 10-K (“10-K” or “Report”) for the fiscal year ended September 27, 2020 (“fiscal 2020”), Starbucks Corporation (together with its subsidiaries) is referred to as “Starbucks,” the “Company,” “we,” “us” or “our.”\nSegment Financial Information\nWe have three reportable operating segments: 1) Americas, which is inclusive of the U.S., Canada and Latin America; 2) International, which is inclusive of China, Japan, Asia Pacific, Europe, Middle East and Africa; and 3) Channel Development. Non-reportable operating segments such as Evolution Fresh and unallocated corporate expenses are reported within Corporate and Other. Revenues from our reportable operating segments as a percentage of total net revenues for fiscal 2020 were as follows: Americas (70%), International (22%) and Channel Development (8%).\nOur Americas and International segments include both company-operated and licensed stores. Our Americas segment is our most mature business and has achieved significant scale. Certain markets within our International operations are in various stages of development and may require more extensive support, relative to their current levels of revenue and operating income, than our Americas operations.\nOur Channel Development segment includes roasted whole bean and ground coffees, Seattle's Best Coffee®, Starbucks- and Teavana-branded single-serve products, a variety of ready-to-drink beverages, such as Frappuccino®, Starbucks Doubleshot®, Starbucks Refreshers® beverages and TeavanaTM/MC iced tea, and other branded products sold worldwide outside of our company-operated and licensed stores. A large portion of our Channel Development business operates under a licensed model of the Global Coffee Alliance with Nestlé, while our global ready-to-drink businesses operate under collaborative relationships with PepsiCo, Inc., Anheuser-Busch Companies, LLC, Tingyi-Ashi Beverages Holding Co., Ltd., Arla Foods amba and others.\nRevenue Components\nWe generate the majority of our revenues through company-operated stores and licensed stores.\nCompany-operated and Licensed Store Summary as of September 27, 2020\nThe mix of company-operated versus licensed stores in a given market will vary based on several factors, including our ability to access desirable local retail space, the complexity, profitability and expected ultimate size of the market for Starbucks and our ability to leverage the support infrastructure within a geographic region.\nCompany-operated Stores\nRevenue from company-operated stores accounted for 81% of total net revenues during fiscal 2020. Our retail objective is to be the leading retailer and brand of coffee and tea in each of our target markets by selling the finest quality coffee, tea and related products, as well as complementary food offerings, and by providing each customer with a unique Starbucks Experience. The Starbucks Experience is built upon superior customer service, convenience and a seamless digital experience as well as safe, clean and well-maintained stores that reflect the personalities of the communities in which they operate, thereby building a high degree of customer loyalty.\nOur strategy for expanding our global retail business is to increase our category share in a disciplined manner, by selectively opening additional stores in new and existing markets, as well as increasing sales in existing stores, to support our long-term strategic objective to maintain Starbucks standing as one of the most recognized and respected brands in the world. Store growth in specific existing markets will vary due to many factors, including expected financial returns, the maturity of the market, economic conditions, consumer behavior and local business practices.\nCompany-operated store data for the year-ended September 27, 2020:\nStarbucks® company-operated stores are typically located in high-traffic, high-visibility locations. Our ability to vary the size and format of our stores allows us to locate them in or near a variety of settings, including downtown and suburban retail centers, office buildings, university campuses and rural and off-highway locations. We are continuing the expansion of our stores, particularly drive-thru formats that provide a higher degree of access and convenience, and alternative store formats, which are designed to provide a more streamlined customer experience in dense metropolitan areas.\nPrior to the novel coronavirus outbreak, known as the global pandemic COVID-19, approximately 80% of Starbucks transactions in U.S. company-operated stores were “on-the-go” occasions. This has prompted us to reexamine our U.S. store footprint and evolve our retail presence over time through targeted store renovations, relocations and new stores. We have since introduced a new store format, Starbucks® Pickup, to enhance the “on-the-go” customer experience and improve operating efficiency across Starbucks® stores in certain major metropolitan areas in the Americas. New store formats, such as Starbucks Pickup, are suitable for customers who prefer to order ahead and pay through the Starbucks® Mobile App for pick-up. In our major international markets, we continue to invest in technology and establish partnerships with third parties with relevant expertise to increase digital adoption to provide convenience and elevate the customer experience. In China, the introduction of Starbucks NowTM stores enables a seamless integration of physical and digital customer touchpoints. Orders may be placed in advance through the Starbucks Mobile App or Starbucks DeliversTM and can be conveniently picked up by customers and delivery riders in these express retail format locations. These strategies align closely with rapidly evolving customer preferences, including higher levels of mobile ordering, more contactless pick-up experiences and reduced in-store congestion, all of which naturally allow for greater physical distancing. We believe our continued efforts to transform our store portfolio and elevate technology will enhance the customer experience and position Starbucks for long-term growth.\nRetail sales mix by product type for company-operated stores:\n(1)“Other” primarily consists of sales of serveware and ready-to-drink beverages, among other items.\nStored Value Cards and Loyalty Program\nThe Starbucks Card, our branded stored value card program, is designed to provide customers with a convenient payment method, support gifting and increase the frequency of store visits by cardholders, in part through the related Starbucks® Rewards loyalty program where available, as discussed below. Stored value cards are issued to customers when they initially load them with an account balance. They can be obtained in our company-operated and most licensed stores in North America, China, Japan and many of our markets in our International segment. Stored value cards can also be obtained online, via the Starbucks® Mobile App and through other U.S. and international retailers. Customers may access their card balances by utilizing their stored value card or the Starbucks® Mobile App in participating stores. Using the Mobile Order and Pay functionality of the Starbucks® Mobile App, customers can also place orders in advance for pick-up at certain participating locations in several markets. In nearly all markets, including the U.S. and Canada, customers who register their Starbucks Cards are automatically enrolled in the Starbucks Rewards program. Registered members can receive various benefits depending on factors such as the number of reward points (“Stars”) earned. Beginning in the fourth quarter of fiscal 2020, in addition to using their Starbucks Cards, Starbucks® Rewards members can earn Stars by paying with cash, credit or debit cards, or selected mobile wallets at company-operated stores in the U.S. and Canada. Refer to Note 1, Summary of Significant Accounting Policies, included in Item 8 of Part II of this 10-K, for further discussion of our stored value cards and loyalty program.\nLicensed Stores\nRevenues from our licensed stores accounted for 10% of total net revenues in fiscal 2020. Licensed stores generally have a lower gross margin and a higher operating margin than company-operated stores. Under the licensed model, Starbucks receives a margin on branded products and supplies sold to the licensed store operator along with a royalty on retail sales. Licensees are responsible for operating costs and capital investments which more than offset the lower revenues we receive under the licensed store model.\nIn our licensed store operations, we leverage the expertise of our local partners and share our operating and store development experience. Licensees provide improved, and at times the only, access to desirable retail space. Most licensees are prominent retailers with in-depth market knowledge and access. As part of these arrangements, we sell coffee, tea, food and related products to licensees for resale to customers and receive royalties and license fees from the licensees. We also sell certain equipment, such as coffee brewers and espresso machines, to our licensees for use in their operations. Employees working in licensed retail locations are required to follow our detailed store operating procedures and attend training classes similar to those given to employees in company-operated stores. In a limited number of international markets, we also use traditional franchising and include these stores in the results of operations from our other licensed stores.\nLicensed store data for the year-ended September 27, 2020:\nOther Revenues\nOther revenues primarily are recorded in our Channel Development segment and include sales of packaged coffee, tea and ready-to-drink beverages to customers outside of our company-operated and licensed stores, as well as royalties received from Nestlé under the Global Coffee Alliance and other collaborative partnerships.\nProduct Supply\nStarbucks is committed to selling the finest whole bean coffees and coffee beverages. To ensure compliance with our rigorous coffee standards, we control substantially all coffee purchasing, roasting and packaging and the global distribution of coffee used in our operations. We purchase green coffee beans from multiple coffee-producing regions around the world and custom roast them to our exacting standards for our many blends and single origin coffees.\nThe price of coffee is subject to significant volatility. Although most coffee trades in the commodity market, high-altitude arabica coffee of the quality sought by Starbucks tends to trade on a negotiated basis at a premium above the “C” coffee commodity price. Both the premium and the commodity price depend upon the supply and demand at the time of purchase. Supply and price can be affected by multiple factors in the producing countries, including weather, natural disasters, crop disease, general increase in farm inputs and costs of production, inventory levels and political and economic conditions. Price is also impacted by trading activities in the arabica coffee futures market, including hedge funds and commodity index funds. In addition, green coffee prices have been affected in the past, and may be affected in the future, by the actions of certain organizations and associations that have historically attempted to influence prices of green coffee through agreements establishing export quotas or by restricting coffee supplies.\nWe buy coffee using fixed-price and price-to-be-fixed purchase commitments, depending on market conditions, to secure an adequate supply of quality green coffee. We also utilize forward contracts, futures contracts and collars to hedge \"C\" price exposure under our price-to-be-fixed green coffee contracts and our long-term forecasted coffee demand where underlying fixed price and price-to-be-fixed contracts are not yet available. Total purchase commitments, together with existing inventory, are expected to provide an adequate supply of green coffee through fiscal 2022.\nWe depend upon our relationships with coffee producers, outside trading companies and exporters for our supply of green coffee. We believe, based on relationships established with our suppliers, the risk of non-delivery on such purchase commitments is remote.\nTo help ensure the future supply of high-quality green coffee and to reinforce our leadership role in the coffee industry, Starbucks operates nine farmer support centers, including our China Farmer Support Center located in the Yunnan Province of\nthis high-growth market. All farmer support centers are staffed with agronomists and sustainability experts who work with coffee farming communities to promote best practices in coffee production designed to improve both coffee quality and yields and agronomy support to address climate and other impacts.\nIn addition to coffee, we also purchase significant amounts of dairy products, particularly fluid milk, to support the needs of our company-operated stores. We believe, based on relationships established with our dairy suppliers, that the risk of non-delivery of sufficient fluid milk to support our stores is remote.\nProducts other than whole bean coffees and coffee beverages sold in Starbucks® stores include tea and a number of ready-to-drink beverages that are purchased from several specialty suppliers, usually under long-term supply contracts. Food products, such as pastries, breakfast sandwiches and lunch items, are purchased from national, regional and local sources. We also purchase a broad range of paper and plastic products, such as cups and cutlery, from several companies to support the needs of our retail stores as well as our manufacturing and distribution operations. We believe, based on relationships established with these suppliers and manufacturers, that the risk of non-delivery of sufficient amounts of these items is remote.\nCompetition\nOur primary competitors for coffee beverage sales are specialty coffee shops. We believe that our customers choose among specialty coffee retailers primarily on the basis of product quality, service and convenience, as well as price. We continue to experience direct competition from large competitors in the quick-service restaurant sector and the ready-to-drink coffee beverage market, in addition to both well-established and start-up companies in many international markets. We also compete with restaurants and other specialty retailers for prime retail locations and qualified personnel to operate both new and existing stores.\nOur coffee and tea products sold through our Channel Development segment compete directly against specialty coffees and teas sold through grocery stores, warehouse clubs, specialty retailers, convenience stores and foodservice accounts and compete indirectly against all other coffees and teas on the market.\nTrademarks, Copyrights, Patents and Domain Names\nStarbucks owns and has applied to register numerous trademarks and service marks in the U.S. and in other countries throughout the world. Some of our trademarks, including Starbucks, the Starbucks logo, Starbucks Reserve, Seattle’s Best Coffee, Teavana and Frappuccino are of material importance. The duration of trademark registrations varies from country to country. However, trademarks are generally valid and may be renewed indefinitely as long as they are in use and/or their registrations are properly maintained.\nWe own numerous copyrights for items such as product packaging, promotional materials, in-store graphics and training materials. We also hold patents on certain products, systems and designs. In addition, Starbucks has registered and maintains numerous Internet domain names, including “Starbucks.com,” “Starbucks.net,” “Starbucksreserve.com,” “Seattlesbest.com” and “Teavana.com.”\nSeasonality and Quarterly Results\nOur business is subject to moderate seasonal fluctuations, of which our fiscal second quarter typically experiences lower revenues and operating income. However, the COVID-19 outbreak may have an impact on consumer behaviors and customer traffic that may result in temporary changes in the seasonal fluctuations of our business. Additionally, as Starbucks Cards are issued to and loaded by customers during the holiday season, we tend to have higher cash flows from operations during the first quarter of the fiscal year. However, since revenues from Starbucks Cards are recognized upon redemption and not when cash is loaded onto the Card, the impact of seasonal fluctuations on the consolidated statements of earnings is much less pronounced. As a result of moderate seasonal fluctuations, results for any quarter are not necessarily indicative of the results that may be achieved for the full fiscal year.\nGovernment Regulation\nAs a company with global operations, we are subject to the laws of the United States and multiple foreign jurisdictions in which we operate and the rules and regulations of various governing bodies, which may differ among jurisdictions. Compliance with these laws, rules and regulation has not had, and is not expected to have, a material effect on our capital expenditures, results of operations and competitive position as compared to prior periods.\nHuman Capital Management\nAs a company, Starbucks mission is not only to deliver outstanding financial results by offering exceptional and unique products and services, but to also create a strong connection with the communities where we operate. We believe the strength of our workforce is one of the significant contributors to our success as a global brand that leads with purpose. This is largely attributed to our partners (employees) who strive every day to create a welcoming and inclusive environment for our customers. Therefore, one of our core strategies is to invest in and support our partners to differentiate our brand, products and services in the competitive specialty coffee market, including the following areas of focus:\nOversight and Management\nWe recognize the diversity of customers, partners and communities, and believe in creating an inclusive and equitable environment that represents a broad spectrum of backgrounds and cultures. Working under these principles, our Partner Resources Organization is tasked with managing employment-related matters, including recruiting and hiring, onboarding and training, compensation planning, performance management and professional development. Our Board of Directors and Board committees provide oversight on certain human capital matters, including our Inclusion and Diversity programs and initiatives. As noted in its charter, our Compensation and Management Development Committee is responsible for periodically reviewing Starbucks partner resource programs and initiatives, including healthcare and other benefits, as well as our management development and succession planning practices and strategies. Our Audit and Compliance Committee works closely with the Risk Management Committee, led by Starbucks cfo and general counsel, to monitor current and emerging labor and human capital management risks and to mitigate exposure to those risks. Furthermore, our Nominating and Corporate Governance Committee annually evaluates the effectiveness of our social responsibility policies, goals and programs, which also include partner-related issues. These reports and recommendations to the Board and its committees are part of the broader framework that guides how Starbucks should attract, retain and develop a workforce that aligns with our values and strategies.\nWe regularly conduct anonymous surveys to seek feedback from our retail and non-retail partners on a variety of topics, including but not limited to, confidence in company leadership, competitiveness of our compensation and benefits package, career growth opportunities and improvements on how we could make our company an employer of choice. The results are shared with our partners and reviewed by senior leadership, who analyze areas of progress or deterioration and prioritize actions and activities in response to this feedback to drive meaningful improvements in partner engagement. Our management and cross-functional teams also work closely to evaluate human capital management issues such as partner retention, workplace safety, harassment and bullying, as well as to implement measures to mitigate these risks.\nTotal Rewards\nWe have demonstrated a history of investing in our workforce by offering competitive salaries and wages. To foster a stronger sense of ownership and align the interests of partners with shareholders, restricted stock units are provided to eligible non-executive partners under our broad-based stock incentive programs. Furthermore, we offer comprehensive, locally relevant and innovative benefits to all eligible partners. In the U.S, our largest and most mature market, these include, among other benefits:\n•Comprehensive health insurance coverage is offered to partners working an average of 20 hours or more each week.\n•100% tuition coverage is provided to partners who earn a bachelor's degree online at Arizona State University through the Starbucks College Achievement Program.\n•Parental leaves are provided to all new parents for birth, adoption or foster placement.\n•A Partner and Family Sick Time program is provided and allows partners to accrue paid sick time based on hours worked and use that time for themselves or family members in need of care.\n•Care@Work benefit provides partners with subsidized child, adult or senior care planning services. This benefit includes up to 20 days of subsidized backup care services through the end of fiscal 2021, in light of the COVID-19 pandemic.\n•We view mental health as a fundamental part of our humanity and implemented a comprehensive suite of related programs and benefits in fiscal 2020. These include Headspace, an online application that enables guided mediation, Lyra, which provides mental health coaching, and Starbucks Mental Health Fundamental Training, created in partnership with National Council for Behavioral Health, which offers ongoing training to help partners recognize and respond to signs of mental health and substance use issues.\nOutside of the U.S., we have provided other innovative benefits to help address market-specific needs, such as providing interest-free loans to our U.K. partners to help cover rental deposits, mental health services in Canada, and in China, a monthly housing subsidy for full-time Starbucks baristas and shift supervisors, as well as comprehensive health insurance coverage for parents of partners.\nRole-based Support\nTo help our partners succeed in their roles, we emphasize continuous training and development opportunities. These include, but are not limited to, safety and security protocols, updates on new products and service offerings and deployment of technologies. Training provided through our Pour Over sessions include a wide variety of topics such as achievable goal setting, giving and receiving constructive feedback and effective engagement with customers and communities. To help further promote an inclusive culture and to better serve our customers, we encourage U.S.-based partners to enroll in the To Be Welcoming courses we created in partnership with Arizona State University to address different forms of bias and discrimination.\nPay Equity\nTo be an employer of choice and maintain the strength of our workforce, we consistently assess the current business environment and labor market to refine our compensation and benefits programs and other resources available to our partners.\nWe previously achieved and currently maintain 100 percent pay equity in the U.S. for women and men and people of all races for partners performing similar work. We have also achieved gender pay equity in China and Canada, two of our largest markets outside of the U.S., and we made a commitment to achieve gender pay equity in all company-operated markets.\nAs of September 27, 2020, Starbucks employed approximately 349,000 people worldwide. In the U.S., Starbucks employed approximately 228,000 people, with approximately 220,000 in company-operated stores and the remainder in corporate support, store development, roasting, manufacturing, warehousing and distribution operations. Approximately 121,000 employees were employed outside of the U.S., with approximately 118,000 in company-operated stores and the remainder in regional support operations. The number of Starbucks partners represented by unions is not significant. We believe our efforts in managing our workforce have been effective, evidenced by a strong Starbucks culture and a good relationship between the company and our partners.\nInformation about our Executive Officers\nKevin R. Johnson has served as president and chief executive officer since April 2017, and has been a Starbucks director since March 2009. Mr. Johnson served as president and chief operating officer from March 2015 to April 2017. Mr. Johnson served as Chief Executive Officer of Juniper Networks, Inc., a leading provider of high-performance networking products and services, from September 2008 to December 2013. He also served on the Board of Directors of Juniper Networks from September 2008 through February 2014. Prior to joining Juniper Networks, Mr. Johnson served as President, Platforms and Services Division for Microsoft Corporation, a worldwide provider of software, services and solutions. Mr. Johnson was a member of Microsoft’s Senior Leadership Team and held several senior executive positions over the course of his 16 years at Microsoft. Prior to joining Microsoft in 1992, Mr. Johnson worked in International Business Machine Corp.’s systems integration and consulting business.\nRosalind G. Brewer has served as group president, Americas and chief operating officer since October 2017, and has been a director of Starbucks since March 2017. Ms. Brewer served as President and Chief Executive Officer of Sam's Club, a membership-only retail warehouse club and a division of Walmart Inc., a multinational retail corporation, from February 2012 to February 2017. Previously, Ms. Brewer was Executive Vice President and President of Walmart's East Business Unit from February 2011 to January 2012; Executive Vice President and President of Walmart South from February 2010 to February 2011; Senior Vice President and Division President of the Southeast Operating Division from March 2007 to January 2010; and Regional General Manager, Georgia Operations, from 2006 to February 2007. Prior to joining Walmart, Ms. Brewer was President of Global Nonwovens Division for Kimberly-Clark Corporation, a global health and hygiene products company, from 2004 to 2006 and held various management positions at Kimberly-Clark Corporation from 1984 to 2006. She currently serves as the Chair of the Board of Trustees for Spelman College and as a director on the Board of Directors of Amazon.com, Inc. She formerly served on the Board of Directors for Lockheed Martin Corporation and Molson Coors Brewing Company.\nJohn Culver joined Starbucks in August 2002 and has served as group president, International, Channel Development and Global Coffee & Tea, since July 2018. From October 2017 to July 2018, Mr. Culver served as group president, International and Channels. From September 2016 to October 2017, he served as group president, Starbucks Global Retail. From May 2013\nto September 2016, he served as group president, China, Asia Pacific, Channel Development and Emerging Brands. Mr. Culver served as president, Starbucks Coffee China and Asia Pacific from October 2011 to May 2013. From December 2009 to October 2011, he served as president, Starbucks Coffee International. Mr. Culver served as executive vice president; president, Global Consumer Products, Foodservice and Seattle’s Best Coffee from February 2009 to September 2009, and then as president, Global Consumer Products and Foodservice from October 2009 to November 2009. He previously served as senior vice president; president, Starbucks Coffee Asia Pacific from January 2007 to February 2009, and vice president; general manager, Foodservice from August 2002 to January 2007. Mr. Culver serves on the Board of Directors of Kimberly-Clark Corporation.\nRachel A. Gonzalez joined Starbucks and has served as executive vice president, general counsel and secretary since joining Starbucks in April 2018. Prior to joining Starbucks, Ms. Gonzalez served as executive vice president and chief administrative officer of Sabre Corporation, a technology provider to the travel industry, from May 2017 to April 2018 and as Sabre’s executive vice president and general counsel from September 2014 to May 2017. From March 2013 to September 2014, Ms. Gonzalez served as executive vice president, general counsel and corporate secretary of Dean Foods Company, a food and beverage company, and as its executive vice president, general counsel designate from November 2012 to March 2013. She served as chief counsel, corporate and securities of Dean Foods from 2008 to November 2012. From 2006 to 2008, Ms. Gonzalez served as senior vice president and group counsel for Affiliated Computer Services, Inc., an information technology service provider. Prior to that, Ms. Gonzalez was a partner with the law firm of Morgan, Lewis & Bockius LLP, where she focused on corporate finance, mergers and acquisitions, SEC compliance and corporate governance. Ms. Gonzalez serves on the Board of Directors of Dana Incorporated.\nPatrick J. Grismer joined Starbucks in November 2018 as executive vice president, chief financial officer. From March 2016 to November 2018, Mr. Grismer served as Executive Vice President, Chief Financial Officer of Hyatt Hotels Corporation, a global hospitality company. From May 2012 to February 2016, Mr. Grismer served as Chief Financial Officer at Yum! Brands, Inc., a global restaurant company. He previously held a number of roles at Yum!, including Chief Planning and Control Officer and Chief Financial Officer for Yum! Restaurants International. Prior to that, Mr. Grismer served in various roles at The Walt Disney Company including Vice President, Business Planning and Development for The Disneyland Resort and Chief Financial Officer for the Disney Vacation Club. Mr. Grismer began his career with Price Waterhouse.\nAngela Lis joined Starbucks in 1992 as a part-time barista and has served as executive vice president, chief partner officer since November 2, 2020. From September 2016 to October 2020, Ms. Lis served as senior vice president, global business partners. In this role she was responsible for talent and partner strategies that drive our global retail operations business. Prior to this role, she served as a vice president of partner resources for corporate business functions and global supply chain. During her tenure at Starbucks, Ms. Lis has led partner resources business partners across the globe. She has supported both retail and all non-retail business units and was instrumental in the startup of our Channel Development business.\nGlobal Social Impact\nWe are committed to being a deeply responsible company in the communities where we do business. Our focus is on ethically sourcing high-quality coffee and tea, reducing our environmental impacts and contributing positively to communities around the world. Starbucks Global Social Impact strategy and commitments are integral to our overall business strategy. As a result, we believe we deliver benefits to our stakeholders, including employees, business partners, customers, suppliers, shareholders, community members and others. For an overview of Starbucks Global Social Impact strategy and commitments, please visit www.starbucks.com/responsibility.\nAvailable Information\nStarbucks 10-K reports, along with all other reports and amendments filed with or furnished to the Securities and Exchange Commission (“SEC”), are publicly available free of charge on the Investor Relations section of our website at investor.starbucks.com or at www.sec.gov as soon as reasonably practicable after these materials are filed with or furnished to the SEC. Our corporate governance policies, code of ethics and Board committee charters and policies are also posted on the Investor Relations section of Starbucks website. The information on our website is not part of this or any other report Starbucks files with, or furnishes to, the SEC.",
    "item_1A": "Item 1A. Risk Factors\nYou should carefully consider the risks described below in addition to the other information set forth in this Annual Report on Form 10-K, including the Management’s Discussion and Analysis of Financial Conditions and Results of Operations section and the consolidated financial statements and related notes. If any of the risks and uncertainties described in the cautionary factors described below actually occur or continue to occur, our business, financial condition and results of operations and the trading price of our common stock could be materially and adversely affected. Moreover, the risks below are not the only risks we face and additional risks not currently known to us or that we presently deem immaterial may emerge or become material at\nany time and may negatively impact our business, reputation, financial condition, results of operations or the trading price of our common stock.\nRisks Related to Macroeconomic Conditions\n•Our financial condition and results of operations have been and are expected to continue to be adversely affected by the COVID-19 pandemic.\nIn December 2019, a novel strain of coronavirus, known as COVID-19, was first reported and was subsequently declared a pandemic by the World Health Organization in March 2020. To date, this outbreak has surfaced in nearly all regions around the world, and as the pandemic continues to spread, particularly in the United States, businesses as well as federal, state and local governments have implemented significant actions to attempt to mitigate this public health crisis. Our operations have been and will continue to be disrupted to varying degrees in many markets (from limited operations including only drive-thru and delivery to full store closures in some markets). While we cannot predict the duration or scope of the COVID-19 pandemic, it has negatively impacted our business and such impact has been and is expected to continue to be material to our financial results, condition and outlook.\nThe further spread of COVID-19, and the requirements to take action to mitigate the spread of the pandemic, will impact our ability to carry out our business as usual and may materially adversely impact our business, results of operations, cash flows and financial condition. Even in regions where we have reopened stores, our stores may be subject to modified hours and operations and/or reduced customer traffic. Moreover, certain of those regions, including parts of China and the United States, have suffered a COVID-19 relapse after reopening. If those regions fail to fully contain COVID-19, or if additional regions suffer multiple COVID-19 relapses, any of those markets may not recover quickly or at all, which could have a material adverse effect on our business and results of operations. As a result, we may incur additional impairment charges to our inventory, store and corporate assets- and our ability to realize the benefits from deferred tax assets may become limited- any of which may have a significant or material impact on our financial results. On March 27, 2020, the U.S. government enacted the Coronavirus Aid, Relief and Economic Security Act (“CARES Act”), which among other things, provides employer payroll tax credits for wages paid to employees who are unable to work during the COVID-19 outbreak and options to defer payroll tax payments for a limited period. Based on our evaluation of the CARES Act, we qualify for certain employer payroll tax credits as well as the deferral of payroll tax payments in the future. Additionally, the Canadian government enacted the Canada Emergency Wage Subsidy (“CEWS”) to help employers offset a portion of their employee wages for a limited period. We elected to treat qualified government subsidies from the U.S., Canada and other governments as offsets to the related operating expenses. There is no guarantee that we will continue to meet the eligibility requirements to participate in any current or future government relief programs or that the benefits will meaningfully offset the lost revenues and incremental costs incurred. Increased volatility or significant disruption of global financial markets due in part to the COVID-19 pandemic could have a negative impact on our ability to access capital markets and other funding sources, on acceptable terms or at all and impede our ability to comply with debt covenants.\nThe extent to which COVID-19 impacts our business, results of operations, cash flows and financial condition will depend on future developments, which are highly uncertain and cannot be predicted, including new information which may emerge concerning the severity of COVID-19 and the efficacy, scope and duration of actions to limit the spread of COVID-19 or treat its impact, among others. While such actions have been relaxed or rolled back in certain markets, the actions have been reinstated in certain regions that have suffered relapse, and may be reinstated in additional regions as the pandemic continues to evolve. The scope and timing of any such reinstatements are difficult to predict and may materially affect our future operations.\n•Our financial condition and results of operations are subject to, and may be adversely affected by, a number of other factors, many of which are also largely outside our control.\nIn addition to the COVID-19 pandemic, our operating results have been in the past and will continue to be subject to a number of other factors, many of which are largely outside our control. Any one or more of the factors listed below or described elsewhere in this risk factors section could have a material adverse impact our business, financial condition and/or results of operations:\n•increases in real estate costs in certain domestic and international markets;\n•adverse outcomes of litigation;\n•severe weather or other natural or man-made disasters affecting a large market or several closely located markets that may temporarily but significantly affect our retail business in such markets; and\n•especially in our large markets, labor discord or disruption, geopolitical events (including escalating U.S.-China tensions), war, terrorism (including incidents targeting us), political instability, acts of public violence, boycotts, increasing anti-American sentiment in certain markets, hostilities and social unrest and other health pandemics that lead to avoidance of public places or restrictions on public gatherings such as in our stores.\n•Economic conditions in the U.S. and international markets could adversely affect our business and financial results.\nAs a retailer that is dependent upon consumer discretionary spending, our results of operations are sensitive to changes in or uncertainty about macro-economic conditions. Our customers may have or in the future have less money for discretionary purchases and may stop or reduce their purchases of our products or switch to Starbucks or competitors' lower-priced products as a result of various factors, including job losses, inflation, higher taxes, reduced access to credit, changes in federal economic policy and recent international trade disputes. Due to the COVID-19 pandemic, we may experience a reduction and/or increased volatility in demand for our products, which may be caused by, among other things: store closures or modified operating hours and business model, reduced customer traffic due to illness, quarantine or government or self-imposed restrictions placed on our stores' operations and changes in consumer spending behaviors (e.g. continued practice of social distancing, decrease in consumer confidence in general macroeconomic conditions and a decrease in consumer discretionary spending). Decreases in customer traffic and/or average value per transaction without a corresponding decrease in costs would put downward pressure on margins and would negatively impact our financial results. There is also a risk that if negative economic conditions or uncertainty, as a result of the COVID-19 pandemic or otherwise, persist for a long period of time or worsen, consumers may make long-lasting changes to their discretionary purchasing behavior, including less frequent discretionary purchases on a more permanent basis or there may be a general downturn in the restaurant industry.\n•Failure to meet market expectations for our financial performance and fluctuations in the stock market as a whole will likely adversely affect the market price and volatility of our stock.\nFailure to meet market expectations going forward, particularly with respect to net revenues, operating margins, earnings per share, comparable store sales growth, operating cash flows and shareholder returns, will likely result in a decline and/or increased volatility in the market price of our stock. In addition, price and volume fluctuations in the stock market as a whole may affect the market price of our stock in ways that may be unrelated to our financial performance.\nRisks Related to Brand Relevance and Brand Execution\n•Our success depends substantially on the value of our brands and failure to preserve their value could have a negative impact on our financial results.\nWe believe we have built an excellent reputation globally for the quality of our products, for delivery of a consistently positive consumer experience and for our global social impact programs. The Starbucks brand is recognized throughout the world, and we have received high ratings in global brand value studies. To be successful in the future, particularly outside of the U.S. where the Starbucks brand and our other brands are less well-known, we believe we must preserve, grow and leverage the value of our brands across all sales channels. Brand value is based in part on consumer perceptions on a variety of subjective qualities.\nBusiness incidents, whether isolated or recurring and whether originating from us or our business partners, that erode consumer trust can significantly reduce brand value, potentially trigger boycotts of our stores or result in civil or criminal liability and can have a negative impact on our financial results. Such incidents include actual or perceived breaches of privacy or violations of domestic or international privacy laws, contaminated food, product recalls, store employees or other food handlers infected with communicable diseases, such as COVID-19, or other potential incidents discussed in this risk factors section. The impact of such incidents may be exacerbated if they receive considerable publicity, including rapidly through social or digital media (including for malicious reasons) or result in litigation. Consumer demand for our products and our brand equity could diminish significantly if we, our employees, licensees or other business partners fail to preserve the quality of our products, act or are perceived to act in an unethical, illegal, racially-biased, unequal or socially irresponsible manner, including with respect to the sourcing, content or sale of our products, service and treatment of customers at Starbucks stores, or the use of customer data for general or direct marketing or other purposes. Additionally, if we fail to comply with laws and regulations, publicly take controversial positions or actions or fail to deliver a consistently positive consumer experience in each of our markets, including by failing to invest in the right balance of wages and benefits to attract and retain employees that represent the brand well or foster an inclusive and diverse environment, our brand value may be diminished.\n•If our business partners and third-party providers do not satisfactorily fulfill their responsibilities and commitments, it could damage our brand and our financial results could suffer.\nOur global business strategy, including our plans for new stores, branded products and other initiatives, relies significantly on a variety of business partners, including licensee and joint venture relationships, third-party manufacturers, distributors and retailers, particularly for our entire global Channel Development business. Licensees, retailers and foodservice operators are often authorized to use our logos and provide branded food, beverage and other products directly to customers. We believe our customers expect the same quality of service regardless of whether they visit a licensed or company-operated store, so we provide training and support to, and monitor the operations of, certain of these licensees and other business partners. However, the product quality and service they deliver may still be diminished by any number of factors beyond our control. We do not have direct control over our business partners, including in their adherence to additional sanitation protocols and guidelines as a result of the COVID-19 pandemic, and may not have visibility into their practices.\nWe also source our food, beverage and other products from a wide variety of domestic and international business partners and in certain cases such products are produced or sourced by our licensees directly. And although foodservice operators are authorized to use our logos and provide branded products as part of their foodservice business, we do not monitor the quality of non-Starbucks products served in those locations. Additionally, inconsistent uses of our brand and other of our intellectual property assets, as well as failure to protect our intellectual property, can erode consumer trust and our brand value and have a material negative impact on our financial results.\n•Incidents involving food or beverage-borne illnesses, tampering, adulteration, contamination or mislabeling, whether or not accurate, as well as adverse public or medical opinions about the health effects of consuming our products, could harm our business.\nInstances or reports, whether true or not, of unclean water supply or food-safety issues, such as food or beverage-borne illnesses, tampering, adulteration, contamination or mislabeling, either during growing, manufacturing, packaging, storing or preparation, have in the past severely injured the reputations of companies in the food and beverage processing, grocery and quick-service restaurant sectors. Any report linking us to such instances could severely hurt our sales and could possibly lead to product liability claims, litigation (including class actions) and/or temporary store closures. Clean water is critical to the preparation of coffee, tea and other beverages, as well as ice for our cold beverages, and our ability to ensure a clean water and ice supply to our stores can be limited, particularly in some international locations. We are also continuing to incorporate more products in our food and beverage lineup that require freezing or refrigeration, which increases the risk of food safety related incidents if correct temperatures are not maintained due to mechanical malfunction or human error.\nWe also face risk by relying on third-party food suppliers to provide and transport ingredients and finished products to our stores. We monitor the operations of certain of these business partners, but the product quality and service they deliver may be diminished by any number of factors beyond our control and it may be difficult to detect contamination or other defect in these products. Furthermore, due to the COVID-19 pandemic, there are stricter health regulations and guidelines and increased public concern over food safety standards and controls. Potential food safety incidents, whether at our stores or involving our business partners, could lead to wide public exposure, which could materially harm our business.\nAdditionally, we are evolving our product lineup to include more local or smaller suppliers for some of our products who may not have as rigorous quality and safety systems and protocols as larger or more national suppliers, especially in light of the heightened safety protocols as a result of the COVID-19 pandemic. In addition, instances of food or beverage-safety issues, even those involving solely the restaurants or stores of competitors or of suppliers or distributors (regardless of whether we use or have used those suppliers or distributors), could, by resulting in negative publicity about us or the foodservice industry in general, adversely affect our sales on a regional or global basis. A decrease in customer traffic as a result of food-safety concerns or negative publicity, or as a result of a temporary closure of any of our stores, product recalls, viral-contaminated food or beverage claims or other food or beverage-safety claims or litigation, could materially harm our business and results of operations.\n•We may not be successful in implementing important strategic initiatives or effectively managing growth, which may have an adverse impact on our business and financial results.\nThere is no assurance that we will be able to implement important strategic initiatives in accordance with our expectations or that they will generate expected returns, which may result in an adverse impact on our business and financial results. These strategic initiatives are designed to create growth, improve our results of operations and drive long-term shareholder value, and include:\n•being an employer of choice and investing in employees to deliver a superior customer experience;\n•building our leadership position around coffee;\n•driving convenience, brand engagement and digital relationships through our mobile, loyalty, delivery and digital capabilities both domestically and internationally;\n•simplifying store administrative tasks to allow store partners to better engage with customers;\n•increasing the scale of the Starbucks store footprint with disciplined global expansion and introducing flexible and unique store formats, including the accelerated development of alternative store formats (such as Starbucks® Pickup stores, Starbucks Now stores and curbside pickup) in light of the COVID-19 pandemic;\n•adjusting rapidly to changing customer preferences and behaviors in light of the COVID-19 pandemic;\n•moving to a more licensed store model in some markets and a more company-owned model in other markets;\n•creating new occasions in stores across all dayparts with new product offerings, including our growing lunch food and beverage product lineup;\n•continuing the global growth of our Channel Development business through our supply, distribution and licensing agreements with Nestlé and other Channel Development business partners;\n•delivering continued growth in our cold beverage business, including our tea business through the Teavana brand in our Starbucks® retail stores and other channels and internationally; and\n•reducing our operating costs, particularly general and administrative expenses.\nIn addition to other factors listed in this risk factors section, factors that may adversely affect the successful implementation of these initiatives, which could have a material adverse impact on our business and financial results, include the following:\n•imposition of additional taxes by jurisdictions, such as on certain types of beverages or based on number of employees;\n•construction cost increases associated with new store openings and remodeling of existing stores; delays in store openings for reasons beyond our control or a lack of desirable real estate locations available for lease at reasonable rates, either of which could keep us from meeting annual store opening targets in the U.S. and internationally;\n•governmental regulations or other health guidelines concerning operations of stores due to the COVID-19 pandemic;\n•not successfully scaling our supply chain infrastructure as our product offerings increase and as we continue to expand, including our emphasis on a broad range of high-quality food offerings; and\n•the deterioration in our credit ratings, which could limit the availability of additional financing and increase the cost of obtaining financing to fund our initiatives.\nEffectively managing growth can be challenging, particularly as we expand into new markets internationally where we must balance the need for flexibility and a degree of autonomy for local management against the need for consistency with our goals, philosophy and standards. If we are not successful in implementing our strategic initiatives, such as large acquisitions and integrations, we may be required to evaluate whether certain assets, including goodwill and other intangibles, have become impaired. In the event we record an impairment charge, it could have a material impact on our financial results.\n•Evolving consumer preferences and tastes may adversely affect our business.\nOur continued success depends on our ability to retain and convert customers. Our financial results could be adversely affected by a shift in consumer spending away from outside-the-home food and beverages (such as the disruption caused by online commerce that results in reduced foot traffic to “brick & mortar” retail stores); lack of customer acceptance of new products (including due to price increases necessary to cover the costs of new products or higher input costs), brands (such as the global expansion of the Starbucks brand) and platforms (such as features of our mobile technology, changes in our loyalty rewards programs and our delivery services initiatives); or customers reducing their demand for our current offerings as new products are introduced. In addition, some of our products contain caffeine, dairy products, sugar and other compounds and allergens, the health effects of which are the subject of public and regulatory scrutiny, including the suggestion of linkages to a variety of adverse health effects. Particularly in the U.S., there is increasing consumer awareness of health risks, including obesity, as well as increased consumer litigation based on alleged adverse health impacts of consumption of various food and beverage products. While we have a variety of beverage and food items, including items that are coffee-free and have reduced calories, an unfavorable report on the health effects of caffeine or other compounds present in our products, whether accurate or not, imposition of additional taxes on certain types of food and beverage components, or negative publicity or litigation arising from certain health risks could significantly reduce the demand for our beverages and food products and could materially harm our business and results of operations. Furthermore, our financial results have been and could continue to be adversely affected by the impact of the COVID-19 pandemic, which has resulted in a disruption of customer routines, changes to employer “work-\nfrom-home” policies, reduced business and recreational travel and changes in consumer behavior and the ability or willingness to spend discretionary income on our products.\nRisks Related to Cybersecurity and Data Privacy\n•The unauthorized access, use, theft or destruction of customer or employee personal, financial or other data or of Starbucks proprietary or confidential information that is stored in our information systems or by third parties on our behalf could impact our reputation and brand and expose us to potential liability and loss of revenues.\nMany of our information technology systems (and those of our licensees and other third-party business partners, whether cloud-based or hosted in proprietary servers), including those used for our point-of-sale, web and mobile platforms, online and mobile payment systems, delivery services and rewards programs and administrative functions, contain personal, financial or other information that is entrusted to us by our customers and employees. Many of our information technology systems also contain Starbucks proprietary and other confidential information related to our business, such as business plans, product development initiatives and designs. Similar to many other retail companies and because of the prominence of our brand, we are consistently subject to attempts to compromise our information technology systems. Similar to other companies, the number and frequency of these attempts varies from year to year but could be exacerbated to some extent by an increase in our digital operations in our efforts to comply with state and local mandates in response to COVID-19. To the extent we or a third party were to experience a material breach of our or such third parties' information technology systems that result in the unauthorized access, theft, use, destruction or other compromises of customers' or employees' data or confidential information of the Company stored in such systems, including through cyber-attacks or other external or internal methods, it could result in a material loss of revenues from the potential adverse impact to our reputation and brand, our ability to retain or attract new customers and the potential disruption to our business and plans. Such security breaches also could result in a violation of applicable U.S. and international privacy and other laws, and subject us to private consumer, business partner, or securities litigation and governmental investigations and proceedings, any of which could result in our exposure to material civil or criminal liability. For example, the European Union adopted a new regulation that became effective in May 2018, called the General Data Protection Regulation (“GDPR”), which requires companies to meet new requirements regarding the handling of personal data, including its use, protection and transfer and the ability of persons whose data is stored to correct or delete such data about themselves. Failure to meet the GDPR requirements could result in penalties of up to 4% of annual worldwide revenue. The GDPR also confers a private right of action on certain individuals and associations. Additionally, the California Privacy Act of 2018 (“CCPA”), which was enacted in June 2018 and came into effect on January 1, 2020, provides a new private right of action for data breaches and requires companies that process information on California residents to make new disclosures to consumers about their data collection, use and sharing practices and allow consumers to opt out of certain data sharing with third parties. Our reputation and brand and our ability to attract new customers could also be adversely impacted if we fail, or are perceived to have failed, to properly respond to security breaches of our or third party’s information technology systems. Such failure to properly respond could also result in similar exposure to liability.\nCompliance with the GDPR, the CCPA and other current and future applicable international and U.S. privacy, cybersecurity and related laws can be costly and time-consuming. Significant capital investments and other expenditures could also be required to remedy cybersecurity problems and prevent future breaches, including costs associated with additional security technologies, personnel, experts and credit monitoring services for those whose data has been breached. These costs, which could be material, could adversely impact our results of operations in the period in which they are incurred and may not meaningfully limit the success of future attempts to breach our information technology systems.\nMedia or other reports of existing or perceived security vulnerabilities in our systems or those of our third-party business partners or service providers can also adversely impact our brand and reputation and materially impact our business. Additionally, the techniques and sophistication used to conduct cyber-attacks and breach information technology systems, as well as the sources and targets of these attacks, change frequently and are often not recognized until such attacks are launched or have been in place for a period of time. We continue to make significant investments in technology, third-party services and personnel to develop and implement systems and processes that are designed to anticipate cyber-attacks and to prevent or minimize breaches of our information technology systems or data loss, but these security measures cannot provide assurance that we will be successful in preventing such breaches or data loss.\n•We rely heavily on information technology in our operations and growth initiatives, and any material failure, inadequacy, interruption or security failure of that technology could harm our ability to effectively operate and grow our business and could adversely affect our financial results.\nWe rely heavily on information technology systems across our operations for numerous purposes including for administrative functions, point-of-sale processing and payment in our stores and online, management of our supply chain, Starbucks Cards, online business, delivery services, mobile technology, including mobile payments and ordering apps, reloads and loyalty functionality and various other processes and transactions, and many of these systems are interdependent on one another for their functionality. Additionally, the success of several of our initiatives to drive growth, including our ability to increase digital\nrelationships with our customers to drive incremental traffic and spend, is highly dependent on our technology systems. Furthermore, due to social distancing measures put in place as a result of the COVID-19 pandemic, we have accelerated the transformation of our store portfolio by expanding convenience-led formats, which depend heavily on our mobile ordering capabilities. We also rely on third-party providers and platforms for some of these information technology systems and support. Additionally, our systems hardware, software and services provided by third-party service providers are not fully redundant within a market or across our markets. Although we have operational safeguards in place, they may not be effective in preventing the failure of these systems or platforms to operate effectively and be available. Such failures may be caused by various factors, including power outages, catastrophic events, physical theft, computer and network failures, inadequate or ineffective redundancy, problems with transitioning to upgraded or replacement systems or platforms, flaws in third-party software or services, errors or improper use by our employees or third party service providers, or a breach in the security of these systems or platforms, including through cyber-attacks such as those that result in the blockage of our or our third-party business partners’ or service providers’ systems and platforms and those discussed in more detail in this risk factors section. If our incident response, disaster recovery and business continuity plans do not resolve these issues in an effective manner they could result in an interruption in our operations and could cause material negative impacts to our product availability and sales, the efficiency of our operations and our financial results. In addition, remediation of any problems with our systems could result in significant, unplanned expenses.\nRisks Related to Labor and Supply Chain\n• Our reliance on key business partners may adversely affect our business and operations.\nThe growth of our business relies on the ability of our licensee partners to implement our growth platforms and product innovations as well as on the degree to which we are able to enter into, maintain, develop and negotiate appropriate terms and conditions of, and enforce, commercial and other agreements and the performance of our business partners under such agreements. Our international joint venture partners or licensees may face capital constraints or other factors that may limit the speed at which they are able to expand and develop in a certain market. Our Channel Development business is heavily reliant on Nestlé, which acquired the right to sell and distribute our packaged goods and foodservice products to retailers and operators, with few exceptions. If Nestlé fails to perform its distribution and marketing commitments under our agreements and/or fails to support, protect and grow our brand in Channel Development, our Channel Development business could be adversely impacted for a period of time, present long-term challenges to our brand, limit our ability to grow our Channel Development business and have a material adverse impact on our business and financial results. Additionally, the growth of our Channel Development business is in part dependent on the level of discretionary support provided by our retail and licensed store businesses.\nThere are generally a relatively small number of licensee partners operating in specific markets. If they are not able to access sufficient funds or financing, or are otherwise unable or unwilling to successfully operate and grow their businesses it could have a material adverse effect on our results in the markets. Our business partners may be materially adversely impacted by the COVID-19 pandemic and may not have sufficient financial support and capital to remain financially solvent and may not have the ability to meet their development goals and targets.\nDue to the COVID-19 pandemic, our financial results have been and could continue to be adversely affected by the disruption to the operations of our business partners, including licensee and joint venture relationships, third-party manufacturers, distributors and retailers, through the effects of business and facilities closures, reductions in operating hours, social, economic, political or labor instability in affected areas, transportation delays, travel restrictions and changes in operating procedures, including for additional cleaning and safety protocols.\n•Increases in the cost of high-quality arabica coffee beans or other commodities or decreases in the availability of high-quality arabica coffee beans or other commodities could have an adverse impact on our business and financial results.\nThe availability and prices of coffee beans and other commodities are subject to significant volatility. We purchase, roast and sell high-quality whole bean arabica coffee beans and related coffee products. The high-quality arabica coffee of the quality we seek tends to trade on a negotiated basis at a premium above the “C” price. This premium depends upon the supply and demand at the time of purchase and the amount of the premium can vary significantly. Increases in the “C” coffee commodity price increase the price of high-quality arabica coffee and also impact our ability to enter into fixed-price purchase commitments. We frequently enter into supply contracts whereby the quality, quantity, delivery period and other negotiated terms are agreed upon, but the date, and therefore price, at which the base “C” coffee commodity price component will be fixed has not yet been established.\nThe supply and price of coffee we purchase can also be affected by multiple factors in the producing countries, such as weather (including the potential effects of climate change), natural disasters, crop disease, general increase in farm inputs and costs of production, inventory levels, political and economic conditions and the actions of certain organizations and associations that have historically attempted to influence prices of green coffee through agreements establishing export quotas or by restricting coffee supplies. Speculative trading in coffee commodities can also influence coffee prices. Because of the significance of\ncoffee beans to our operations, combined with our ability to only partially mitigate future price risk through purchasing practices and hedging activities, increases in the cost of high-quality arabica coffee beans could have a material adverse impact on our profitability. In addition, if we are not able to purchase sufficient quantities of green coffee due to any of the above factors or to a worldwide or regional shortage, we may not be able to fulfill the demand for our coffee, which could have a material adverse impact on our profitability.\nWe also purchase significant amounts of dairy products, particularly fluid milk, to support the needs of our company-operated retail stores. Additionally, and although less significant to our operations than coffee or dairy, other commodities, including but not limited to tea and those related to food and beverage inputs, such as cocoa, produce, baking ingredients, meats, eggs and energy, as well as the processing of these inputs, are important to our operations. Increases in the cost of dairy products and other commodities, or lack of availability, whether due to supply shortages, delays or interruptions in processing, or otherwise, especially in international markets, could have a material adverse impact on our profitability.\n•Interruption of our supply chain could affect our ability to produce or deliver our products and could negatively impact our business and profitability.\nAny material interruption in our supply chain, such as material interruption of roasted coffee supply due to the casualty loss of any of our roasting plants, interruptions in service by our third-party logistic service providers or common carriers that ship goods within our distribution channels, trade restrictions, such as increased tariffs or quotas, embargoes or customs restrictions, pandemics, social or labor unrest, natural disasters or political disputes and military conflicts that cause a material disruption in our supply chain could have a negative material impact on our business and our profitability. Additionally, our food, beverage and other products are sourced from a wide variety of domestic and international business partners in our supply chain operations, and in certain cases are produced or sourced by our licensees directly. We rely on these suppliers to provide high quality products and to comply with applicable laws. Our ability to find qualified suppliers who meet our standards and supply products in a timely and efficient manner is a significant challenge as we increase our fresh and prepared food offerings, especially with respect to goods sourced from outside the U.S. and from countries or regions with diminished infrastructure, developing or failing economies or which are experiencing political instability or social unrest. For certain products, we may rely on one or very few suppliers. A supplier's failure to meet our standards, provide products in a timely and efficient manner, or comply with applicable laws is beyond our control. These issues could have a material negative impact on our business and profitability.\n•Changes in the availability of and the cost of labor could adversely affect our business.\nOur business could be adversely impacted by increases in labor costs, including wages and benefits, which, in a retail business such as ours, are two of our most significant costs, both domestically and internationally, including those increases triggered by regulatory actions regarding wages, scheduling and benefits; increased health care and workers’ compensation insurance costs; increased wages and costs of other benefits necessary to attract and retain high quality employees with the right skill sets and increased wages, benefits and costs related to the COVID-19 pandemic. The growth of our business can make it increasingly difficult to locate and hire sufficient numbers of key employees, to maintain an effective system of internal controls for a globally dispersed enterprise and to train employees worldwide to deliver a consistently high-quality product and customer experience, which could materially harm our business and results of operations. Furthermore, due to the COVID-19 pandemic, we could experience a shortage of labor for store positions as concern over exposure to COVID-19 and other factors could decrease the pool of available qualified talent for key functions. In addition, our wages and benefits programs, combined with the challenging conditions due to the COVID-19 pandemic, may be insufficient to attract and retain the best talent.\n•The loss of key personnel or difficulties recruiting and retaining qualified personnel could adversely impact our business and financial results.\nMuch of our future success depends on the continued availability and service of senior management personnel. The loss of any of our executive officers or other key senior management personnel could harm our business. Our success also depends substantially on the contributions and abilities of our retail store employees on whom we rely to give customers a superior in-store experience and elevate our brand. Accordingly, our performance depends on our ability to recruit and retain high quality management personnel and other employees to work in and manage our stores, both domestically and internationally. Our ability to attract and retain both corporate and retail personnel is also acutely impacted in certain international and domestic markets where the competition for a relatively small number of qualified employees is intense or in markets where large high-tech companies are able to offer more competitive salaries and benefits. Additionally, there is intense competition for qualified technology systems developers necessary to develop and implement new technologies for our growth initiatives, including increasing our digital relationships with customers. If we are unable to recruit, retain and motivate employees sufficiently to maintain our current business and support our projected growth, our business and financial performance may be adversely affected.\nRisks Related to Competition\n•We face intense competition in each of our channels and markets, which could lead to reduced profitability.\nThe specialty coffee market is intensely competitive, including with respect to product quality, innovation, service, convenience, such as delivery service and mobile ordering, and price, and we face significant and increasing competition in all these areas in each of our channels and markets. Accordingly, we do not have leadership positions in all channels and markets. In the U.S., the ongoing focus by large competitors in the quick-service restaurant sector on selling high-quality specialty coffee beverages could lead to decreases in customer traffic to Starbucks® stores and/or average value per transaction adversely affecting our sales and results of operations. Similarly, continued competition from well-established competitors, or competition from large new entrants or well-funded smaller companies in our domestic and international markets could hinder growth and adversely affect our sales and results of operations in those markets. Many small competitors also continue to open coffee specialty stores in many of our markets across the world, which in the aggregate may also lead to significant decreases of customer traffic to our stores in those markets. Increased competition globally in packaged coffee and tea and single-serve and ready-to-drink coffee beverage markets, including from new and large entrants to this market, could adversely affect the profitability of the Channel Development segment. Furthermore, declines in general consumer demand for specialty coffee products for any reason, including due to consumer preference for other products, flattening demand for our products, changed customer daily routines or traffic to stores as a result of the COVID-19 pandemic, or changed customer spending behaviors due to challenging economic conditions, could have a negative effect on our business.\nRisks Related to Operating a Global Business\n•We are highly dependent on the financial performance of our Americas operating segment.\nOur financial performance is highly dependent on our Americas operating segment, as it comprised approximately 70% of consolidated total net revenues in fiscal 2020. If the Americas operating segment revenue trends slow or decline, or does not successfully recover in the post COVID-19 environment, especially in our U.S. market, our other segments may be unable to make up any significant shortfall and our business and financial results could be adversely affected. And because the Americas segment is relatively mature and produces the large majority of our operating cash flows, such a slowdown or decline could result in reduced cash flows for funding the expansion of our international businesses and other initiatives and for returning cash to shareholders.\n•We are increasingly dependent on the success of certain international markets in order to achieve our growth targets.\nOur future growth increasingly depends on the growth and sustained profitability of certain international markets. Some or all of our international market business units (“MBUs”), which we generally define by the countries in which they operate, may not be successful in their operations or in achieving expected growth, which ultimately requires achieving consistent, stable net revenues and earnings. The performance of these international operations may be adversely affected by economic downturns in one or more of the countries in which our large MBUs operate. A decline in performance of one or more of our significant international MBUs could have a material adverse impact on our consolidated results.\nThe International segment is a significant profit center driving our global returns, along with our Americas segment. In particular, our China MBU contributes meaningfully to both consolidated and International net revenues and operating income. China is currently our fastest growing market, our second largest market overall and 100% company-owned. Due to the significance of our China market for our profit and growth, we are exposed to risks in China, including the risks mentioned elsewhere and the following:\n•the effects of current U.S.-China relations, including rounds of tariff increases and retaliations and increasing restrictive regulations, potential boycotts and increasing anti-Americanism;\n•escalating U.S.-China tension and increasing political sensitivities in China;\n•the effects of the COVID-19 pandemic and related governmental regulations and restrictions on our operations in China;\n•entry of new competitors to the specialty coffee market in China;\n•changes in economic conditions in China and potential negative effects to the growth of its middle class, wages, labor, inflation discretionary spending and real estate and supply chain costs;\n•ongoing government regulatory reform, including relating to public health, food safety, tariffs and tax, sustainability, bringing uncertainty and inconsistent interpretations, which may be contrary to ours, as well as potential significant increases in compliance costs; and\n•food-safety related matters, including compliance with food-safety regulations and ability to ensure product quality and safety.\nAdditionally, some factors that will be critical to the success of our international operations overall are different than those affecting our U.S. stores and licensees. Tastes naturally vary by region, and consumers in some MBUs may not embrace our products to the same extent as consumers in the U.S. or other international markets. Occupancy costs and store operating expenses can be higher internationally than in the U.S. due to higher rents for prime store locations or costs of compliance with country-specific regulatory requirements. Because many of our international operations are in an early phase of development, operating expenses as a percentage of related revenues are often higher compared to more developed operations.\n•We face risks as a global business that could adversely affect our financial performance.\nWe operate in over 80 markets globally. Our international operations are also subject to additional inherent risks of conducting business abroad, such as:\n•foreign currency exchange rate fluctuations, or requirements to transact in specific currencies;\n•changes or uncertainties in economic, legal, regulatory, social and political conditions in our markets, as well as negative effects on U.S. businesses due to increasing anti-American sentiment in certain markets;\n•interpretation and application of laws and regulations, including tax, tariffs, labor, merchandise, anti-bribery and privacy laws and regulations;\n•uncertainties and effects of the implementation of the United Kingdom's referendum to withdraw membership from the European Union (referred to as “Brexit”), including financial, legal, tax and trade implications;\n•restrictive actions of foreign or U.S. governmental authorities affecting trade and foreign investment, especially during periods of heightened tension between the U.S. and such foreign governmental authorities, including protective measures such as export and customs duties and tariffs, government intervention favoring local competitors and restrictions on the level of foreign ownership;\n•import or other business licensing requirements;\n•the enforceability of intellectual property and contract rights;\n•limitations on the repatriation of funds and foreign currency exchange restrictions due to current or new U.S. and international regulations;\n•in developing economies, the growth rate in the portion of the population achieving sufficient levels of disposable income may not be as fast as we forecast;\n•difficulty in staffing, developing and managing foreign operations and supply chain logistics, including ensuring the consistency of product quality and service, due to governmental actions affecting supply chain logistics, distance, language and cultural differences, as well as challenges in recruiting and retaining high quality employees in local markets;\n•local laws that make it more expensive and complex to negotiate with, retain or terminate employees;\n•local regulations, health guidelines and safety protocols related to the COVID-19 pandemic affecting our store operations; and\n•delays in store openings for reasons beyond our control, competition with locally relevant competitors or a lack of desirable real estate locations available for lease at reasonable rates, any of which could keep us from meeting annual store opening targets and, in turn, negatively impact net revenues, operating income and earnings per share.\nMoreover, many of the foregoing risks are particularly acute in developing countries, which are important to our long-term growth prospects.\nRisks Related to Governmental and Regulatory Changes\n•Failure to comply with applicable laws and changing legal and regulatory requirements could harm our business and financial results.\nOur policies and procedures are designed to comply with all applicable laws, accounting and reporting requirements, tax rules and other regulations and requirements, including those imposed by the SEC, Nasdaq and foreign countries, as well as applicable trade, labor, healthcare, food and beverage, sanitation, safety, environmental, labeling, anti-bribery and corruption and merchandise laws. Changes in applicable environmental regulations, including increased or additional regulations to limit carbon dioxide and other greenhouse gas emissions, to discourage the use of plastic or to limit or impose additional costs on commercial water use, may result in increased compliance costs, capital expenditures, incremental investments and other financial obligations for us and our business partners, which could affect our profitability. Furthermore, due to the COVID-19\npandemic, we are subject to additional domestic and foreign governmental regulations and health guidelines, as well as any other voluntary safety protocols.\nIn addition, our business is subject to complex and rapidly evolving U.S. and international laws and regulations regarding data privacy and data protection, and companies are under increased regulatory scrutiny relating to these matters. The Federal Trade Commission and many state attorneys general are also interpreting federal and state consumer protection laws to impose standards for the online collection, use, dissemination and security of data. The interpretation and application of existing laws and regulations regarding data privacy and data protection are in flux and authorities around the world are considering a number of additional legislative and regulatory proposals in this area. Current and future data privacy and data protection laws and regulations (including the GDPR and the CCPA, discussed in more detail in this risk factors section, and other applicable international and U.S. privacy laws), or new interpretations of existing laws and regulations, may limit our ability to collect and use data, require us to otherwise modify our data processing practices and policies or result in the possibility of fines, litigation or orders, which may have an adverse effect on our business and results of operations. The burdens imposed by these and other laws and regulations that may be enacted, or new interpretations of existing and future laws and regulations, may also require us to incur substantial costs in reaching compliance in a manner adverse to our business.\nIn addition, the European Commission in July 2016 and the Swiss Government in January 2017 approved the EU-U.S. and the Swiss-U.S. Privacy Shield frameworks, respectively, which are designed to allow U.S. companies that self-certify to the U.S. Department of Commerce and publicly commit to comply with the Privacy Shield requirements to freely import personal data from the EU and Switzerland. However, these frameworks face a number of legal challenges and their validity remains subject to legal, regulatory and political developments in both Europe and the U.S. The EU-U.S. Privacy Shield framework approved by the European Commission, which is relied upon for transfers of personal data outside the European Economic Area could be invalidated by the Court of Justice of the European Union. The potential invalidation of this mechanism could have a significant adverse impact on our ability to process and transfer personal data outside of the European Economic Area.\nThe complexity of the regulatory environment in which we operate and the related cost of compliance are both increasing due to additional or changing legal and regulatory requirements, our ongoing expansion into new markets and new channels and the fact that foreign laws occasionally conflict with domestic laws. In addition to potential damage to our reputation and brand, failure by us or our business partners to comply with the various applicable laws and regulations, as well as changes in laws and regulations or the manner in which they are interpreted or applied, may result in litigation, civil and criminal liability, damages, fines and penalties, increased cost of regulatory compliance and restatements of our financial statements and have an adverse impact on our business and financial results.",
    "item_1B": "Item 1B. Unresolved Staff Comments\nNone.",
    "item_1C": "",
    "item_2": "Item 2.Properties\nThe material properties used by Starbucks in connection with its roasting, manufacturing, warehousing, distribution and corporate administrative operations, serving all segments, are as follows:\nWe own most of our roasting facilities and lease the majority of our warehousing and distribution locations. As of September 27, 2020, Starbucks had 16,637 company-operated stores, almost all of which are leased. We also lease space in various locations worldwide for regional, district and other administrative offices, training facilities and storage. In addition to the locations listed above, we hold inventory at various locations managed by third-party warehouses.",
    "item_3": "Item 3.Legal Proceedings\nSee Note 16, Commitments and Contingencies, to the consolidated financial statements included in Item 8 of Part II of this 10-K for information regarding certain legal proceedings in which we are involved.",
    "item_4": "Item 4.Mine Safety Disclosures\nNot applicable.\nPART II",
    "item_5": "Item 5. Market for the Registrant’s Common Equity, Related Shareholder Matters and Issuer Purchases of Equity Securities\nSHAREHOLDER INFORMATION\nMARKET INFORMATION AND DIVIDEND POLICY\nStarbucks common stock is traded on NASDAQ, under the symbol “SBUX.”\nAs of November 6, 2020, we had approximately 18,000 shareholders of record. This does not include persons whose stock is in nominee or “street name” accounts through brokers.\nFuture decisions to pay cash dividends continue to be at the discretion of the Board of Directors and will be dependent on our operating performance, financial condition, capital expenditure requirements and other factors that the Board of Directors considers relevant.\nISSUER PURCHASES OF EQUITY SECURITIES\nShares under our ongoing share repurchase program may be repurchased in open market transactions, including pursuant to a trading plan adopted in accordance with Rule 10b5-1 of the Securities Exchange Act of 1934, or through privately negotiated transactions. The timing, manner, price and amount of repurchases will be determined at our discretion, and the share repurchase program may be suspended, terminated or modified at any time for any reason. On April 8, 2020, we announced a temporary suspension of our share repurchase program. Repurchases pursuant to this program were last made in March 2020. During the fourth fiscal quarter ended September 27, 2020, there was no share repurchase activity.\nPerformance Comparison Graph\nThe following graph depicts the total return to shareholders from September 27, 2015 through September 27, 2020, relative to the performance of the Standard & Poor’s 500 Index, the NASDAQ Composite Index and the Standard & Poor’s 500 Consumer Discretionary Sector, a peer group that includes Starbucks. All indices shown in the graph have been reset to a base of 100 as of September 27, 2015, and assume an investment of $100 on that date and the reinvestment of dividends paid since that date. The stock price performance shown in the graph is not necessarily indicative of future price performance.",
    "item_6": "Item 6. Selected Financial Data\nThe following selected financial data is derived from the consolidated financial statements. The data below should be read in conjunction with “Management’s Discussion and Analysis of Financial Condition and Results of Operations,” “Risk Factors,” and the consolidated financial statements and notes.\nFinancial Information (in millions, except per share data):\n(1)Our fiscal year ends on the Sunday closest to September 30. The fiscal year ending on October 2, 2016 included 53 weeks, with the 53rd week falling in our fourth fiscal quarter.\n(2)Fiscal 2018 results include a gain not subject to income tax of $1.4 billion resulting from the acquisition of our East China joint venture. The impact of the gain to our diluted EPS was $0.99.\n(3)Subsequent to our year-end, on September 30, 2020, we declared a cash dividend of $0.45 per share payable on November 27, 2020 to shareholders of record on November 12, 2020.\n(4)Net cash provided by operating activities for fiscal 2016 and fiscal 2017 has been adjusted for the adoption of new accounting guidance related to excess tax benefits as discussed in Note 1, Summary of Significant Accounting Policies.\nComparable Store Sales:\n(1)Includes only Starbucks® company-operated stores open 13 months or longer. Comparable store sales exclude the effect of fluctuations in foreign currency exchange rates and the results of our global Siren Retail operations. For fiscal year 2016, comparable store sales percentages were calculated excluding the 53rd week. For fiscal year 2020, stores that were temporarily closed or operating at reduced hours due to the COVID-19 outbreak remained in comparable store sales while stores identified for permanent closure were removed.\n(2)Beginning in February of fiscal 2019, comparable store sales include the results of the transfer of 1,477 licensed stores in East China to company-operated retail stores as a result of the purchase of our East China joint venture in the first quarter of fiscal 2018. Beginning in December of fiscal 2016, comparable store sales include the results of the 1,009 company-operated stores acquired as part of the acquisition of Starbucks Japan in the first quarter of fiscal 2015.\nStore Count Data:\n(1)Americas store data includes the transfer of 112 company-operated retail stores in Brazil to licensed stores as a result of the sale of our Brazil retail operations in the second quarter of fiscal 2018.\n(2)International store data includes in fiscal 2019 the transfer of 82 company-operated stores in France and the Netherlands to licensed stores as a result of the sales of operations in the second quarter and the transfer of 377 company-operated stores in Thailand to licensed stores as a result of the sale of operations late in the third quarter. Additionally, store data includes the transfer of 1,477 licensed stores in East China to company-operated retail stores as a result of the purchase of our East China joint venture in the first quarter of fiscal 2018, the transfer of 133 Singapore stores from company-operated stores to licensed stores in fiscal 2017 and the transfer of 144 Germany company-operated stores to licensed stores in fiscal 2016.\n(3)Corporate and Other store data includes the closure of 313 Teavana retail stores in fiscal 2018 and 12 Teavana retail stores in the first quarter of fiscal 2019.",
    "item_7": "Item 7.Management’s Discussion and Analysis of Financial Condition and Results of Operations\nGeneral\nOur fiscal year ends on the Sunday closest to September 30. All references to store counts, including data for new store openings, are reported net of related store closures, unless otherwise noted.\nOverview\nStarbucks results for fiscal 2020 reflect the challenges our business faced with the COVID-19 pandemic, which severely impacted our results, particularly during the second and third fiscal quarters. Consolidated revenues declined 11% to $23.5 billion in fiscal 2020 compared to $26.5 billion in fiscal 2019 driven by temporary closures of a significant number of our company-operated and licensed stores, as well as modified business operations and reduced customer traffic. We gradually reopened our stores and, since then, have seen sequential improvements in comparable store sales in both our Americas and International segments as transaction volumes continue to climb, reflecting the resilience of our business model and the strength of our brand.\nComparable store sales for the Americas segment declined by 12% for fiscal 2020, primarily due to the temporary store closures, reduced customer traffic and shortened store hours. The most negative impacts occurred during the third quarter of fiscal 2020. Most company-operated and licensed stores were re-opened as of early May, and over 60% of company-operated stores in the U.S. provided limited seating by the end of the fiscal year. To help protect the health and welfare of our partners, we incurred incremental labor costs, including paying the wages and benefits to partners who were either unable or uncomfortable working from mid-March through May, a temporary wage increase for partners who continued working during this period and additional benefits to furloughed or separated partners resulting from reduced store hours. The incremental wages incurred were partially offset by qualified tax credits provided by the Coronavirus Aid, Relief and Economic Security Act (“CARES Act”) and the Canada Emergency Wage Subsidy (“CEWS”). In June 2020, we announced a plan to optimize our North America store portfolio, primarily in dense, metropolitan markets, by blending store formats to better cater to changing customer tastes and preferences. During the fourth quarter of fiscal 2020, we closed approximately 100 stores in the U.S. and Canada, and we expect to close an additional 700 stores in those markets over the next 18 months. This reflects an additional 200 store closures than the initial announcement estimate of 600 stores. Costs incurred related to the restructuring efforts are recorded as restructuring and impairments on our consolidated statement of earnings and will continue to be recorded in accordance with the anticipated timeline of store closures.\nFor the International segment, comparable store sales declined by 19% for fiscal 2020, mostly due to the 31% and 37% reduction in comparable store sales during the second and third fiscal quarters of 2020, respectively. Company-operated stores in the China market began re-opening in the fiscal second quarter, and nearly all company-operated stores were open by the end of the fiscal third quarter. To support our international licensees in their recovery efforts, we extended more flexible development and financial terms, including waiving royalty payments during the fiscal third quarter.\nRevenue for our Channel Development segment declined $68 million, or 3%, when compared with fiscal 2019. This is largely due to the lapping of Global Coffee Alliance transition-related activities, including higher inventory sales in the prior year as Nestlé prepared to fulfill customer orders. These are partially offset by the continued growth of the Global Coffee Alliance during fiscal 2020.\nThroughout the second half of fiscal 2020, we experienced initial business recovery as our stores gradually reopened under modified operations to meet public health guidelines and evolving customer behaviors and expectations. As of September 27, 2020, nearly all of our company-operated and licensed stores were re-opened. Those that have remained closed are located in travel or transportation hubs as well as central business districts. Our global business is recovering steadily, with China approaching comparable store sales recovery and the U.S. demonstrating continued upward momentum in sales and profitability. Our Channel Development segment continues to grow category share as customers adjust to their at-home routines. In fiscal 2021, we expect lower revenues for the segment as we transitioned our single-serve coffee business to a more royalty-based model. We do not expect the change to have a material impact on our earnings. However, the change is anticipated to have an accretive impact on operating margin for the segment.\nWe continue to invest in technologies and innovations to elevate the customer and partner experience and to drive long-term growth. By reimagining our store formats, we are moving swiftly to adapt to new customer behaviors. Absent significant COVID-19 relapses or global economic disruptions, and based on the current trend of our retail business recovery and our focused efforts to expand contactless customer experiences, digital capabilities and beverage innovation, we believe we are well positioned to regain the positive business momentum we had demonstrated prior to the pandemic.\nFinancial Highlights\n•Total net revenues decreased 11% to $23.5 billion in fiscal 2020 compared to $26.5 billion in fiscal 2019.\n•Consolidated operating income decreased to $1.6 billion in fiscal 2020 compared to operating income of $4.1 billion in fiscal 2019. Fiscal 2020 operating margin was 6.6% compared to 15.4% in fiscal 2019. Operating margin contraction was primarily driven by sales deleverage and additional costs incurred attributable to COVID-19, including catastrophe pay and enhanced pay programs for retail store partners, net of benefits provided by government subsidies. Higher restructuring activities related to our Americas store portfolio optimization and investments to support key business partners also contributed. These decreases were partially offset by sales leverage realized in the first quarter of fiscal 2020 prior to the onset of COVID-19 impacts and supply chain efficiencies.\n•Earnings per share (“EPS”) for fiscal 2020 decreased to $0.79, compared to EPS of $2.92 in fiscal 2019. The decrease was primarily driven by the adverse impacts of COVID-19, including lower revenues due to temporary store closures, reduced customer traffic and modified operations, as well as incremental labor expenses and restructuring costs.\n•Capital expenditures were $1.5 billion in fiscal 2020 compared to $1.8 billion in fiscal 2019 primarily due to a pause in new store openings due to COVID-19.\n•We returned $3.6 billion to our shareholders in fiscal 2020 through share repurchases and dividends compared to $12.0 billion in fiscal 2019. We temporarily suspended our share repurchase program in March 2020.\nAcquisitions and Divestitures\nSee Note 2, Acquisitions, Divestitures and Strategic Alliance, to the consolidated financial statements included in Item 8 of Part II of this 10-K for information regarding acquisitions and divestitures.\nRESULTS OF OPERATIONS - FISCAL 2020 COMPARED TO FISCAL 2019\nConsolidated results of operations (in millions):\nRevenues\nTotal net revenues decreased $3.0 billion, or 11%, over fiscal 2019, primarily due to lower revenues from company-operated stores ($2.4 billion). The decline in company-operated store revenue was due to a 14% decrease in comparable store sales ($2.9 billion), attributable to a 22% decrease in comparable transactions, partially offset by a 10% increase in average ticket. Also contributing to the decrease were the conversions of our retail businesses in Thailand, France and the Netherlands to fully licensed markets during fiscal 2019 ($204 million). Partially offsetting these decreases were the incremental revenues from 806 net new Starbucks® company-operated store openings, or a 5% increase, over the past 12 months ($718 million).\nLicensed stores revenue declined by $548 million, driven by lower product and equipment sales to and royalty revenues from our licensees.\nOther revenues decreased $63 million, primarily due to the lapping of a higher volume of transition activities related to the Global Coffee Alliance and the Tazo brand sale, partially offset by higher sales from the growth of the Global Coffee Alliance.\nOperating Expenses\nProduct and distribution costs as a percentage of total net revenues increased 50 basis points, primarily due to sales deleverage attributable to COVID-19 impacts, which included inventory write-offs and product waste (approximately 10 basis points), partially offset by supply chain efficiencies (approximately 60 basis points).\nStore operating expenses as a percentage of total net revenues increased 620 basis points. Store operating expenses as a percentage of company-operated store revenues increased 750 basis points, primarily due to sales deleverage attributable to COVID-19 impacts, which included catastrophe pay and enhanced pay programs for retail partners, net of benefits provided by temporary subsidies from the U.S. and certain foreign governments (approximately 150 basis points).\nOther operating expenses increased $59 million, primarily due to incremental costs to develop and grow the Global Coffee Alliance.\nDepreciation and amortization expenses as a percentage of total net revenues increased 90 basis points, primarily due to sales deleverage.\nGeneral and administrative expenses decreased $145 million, primarily driven by lower performance-based compensation ($63 million), lapping of the 2018 U.S stock award granted in fiscal 2018, which was funded by savings from the Tax Cuts and Jobs Act enacted in December 2017 (“Tax Act”) and vested in fiscal 2019 ($61 million), and lapping of the 2019 Starbucks Leadership Experience in Chicago ($52 million), partially offset by incremental strategic investments in technology.\nRestructuring and impairment expenses increased $143 million, primarily due to higher asset impairment related to our North America store portfolio optimization ($136 million), higher lease-related costs associated with the closure of certain company-operated stores ($28 million) and intangible asset impairment related to changes in our branding and marketing strategies ($22 million). Partially offsetting theses increases were lower severance costs ($38 million) and lapping the impairment related to our Switzerland retail market ($10 million).\nIncome from equity investees increased $25 million, primarily due to higher income from our North American Coffee Partnership joint venture and growth in our South Korea joint venture.\nThe combination of these changes resulted in an overall decrease in operating margin of 880 basis points in fiscal 2020 when compared to fiscal 2019.\nOther Income and Expenses\nNet gain resulting from divestiture of certain operations decreased $623 million due to lapping the sale of retail operations in Thailand, France and the Netherlands in fiscal 2019.\nInterest income and other, net decreased $57 million, primarily due to lower interest rates and lapping the gain on the sale of a non-operating asset.\nInterest expense increased $106 million primarily due to additional interest incurred on long-term debt issued in March 2020 and May 2020.\nThe effective tax rate for fiscal 2020 was 20.6% compared to 19.5% for fiscal 2019. The increase was primarily due to the valuation allowances recorded against deferred tax assets of certain international jurisdictions (approximately 980 basis points). This unfavorable impact was partially offset by lower pre-tax earnings including the foreign rate differential on our jurisdictional mix of earnings (approximately 340 basis points), stock-based compensation excess tax benefits in relation to pre-tax earnings (approximately 250 basis points), remeasurement of deferred tax assets due to enacted corporate rate change (approximately 220 basis points) and the impact of changes in indefinite reinvestment assertions for certain foreign subsidiaries in the first quarter of fiscal 2019 (approximately 170 basis points). See Note 14, Income Taxes, for further discussion.\nSegment Information\nResults of operations by segment (in millions):\nAmericas\nRevenues\nAmericas total net revenues for fiscal 2020 decreased $1.9 billion, or 10%, primarily due to a 12% decrease in comparable store sales ($1.9 billion) driven by a 21% decrease in transactions, partially offset by an 11% increase in average ticket. Also contributing were lower product and equipment sales to and royalty revenues from our licensees ($354 million). These decreases were partially offset by 134 net new Starbucks® company-operated stores, or a 1% increase, over the past 12 months ($436 million).\nOperating Margin\nAmericas operating income for fiscal 2020 decreased 52% to $1.8 billion, compared to $3.8 billion in fiscal 2019. Operating margin decreased 960 basis points to 11.1%, primarily due to sales deleverage attributed to reduced labor productivity and additional costs incurred as a result of COVID-19, mainly catastrophe pay and enhanced pay programs for retail store partners incurred primarily during the fiscal third quarter, net of benefits provided by the CARES Act and CEWS (approximately 180 basis points). Higher restructuring expenses relating to our North America portfolio optimization (approximately 130 basis points) also contributed to the decrease. Partially offsetting these decreases were sales leverage realized prior to the onset of COVID-19 and pricing increases.\nInternational\nRevenues\nInternational total net revenues for fiscal 2020 decreased $1.0 billion, or 17%, primarily due to a 19% decrease in comparable store sales ($931 million) driven by a 23% decrease in transactions, partially offset by a 5% increase in average ticket. Also contributing were lower product sales and equipment sales to and royalty revenues from licensees ($199 million) and the conversions of our retail businesses in Thailand, France and the Netherlands to fully licensed markets during fiscal 2019 ($186 million). These decreases were partially offset by 672 net new Starbucks® company-operated stores, or an 11% increase, over the past 12 months ($282 million).\nOperating Margin\nInternational operating income for fiscal 2020 decreased 63% to $354 million, compared to $965 million in fiscal 2019. Operating margin decreased 870 basis points to 6.9%, primarily driven by sales deleverage concentrated in the second and third quarters of fiscal 2020 attributable to COVID-19, including continued partner wages and benefits as well as occupancy costs. Royalty relief granted to licensees during the third fiscal quarter also contributed to the decline (approximately 80 basis points).\nChannel Development\nRevenues\nChannel Development total net revenues for fiscal 2020 decreased $68 million, or 3% compared to fiscal 2019, primarily due to the lapping of higher transition activities related to the Global Coffee Alliance ($115 million) and product sales to Unilever as a result of the sale and transition of the Tazo brand ($34 million). These were partially offset by the expansion of the Global Coffee Alliance ($70 million), as at-home coffee consumption grew while the Foodservice business experienced softening due to COVID-19.\nOperating Margin\nChannel Development operating income for fiscal 2020 decreased 1% to $687 million, compared to $698 million in fiscal 2019. Operating margin increased 70 basis points to 35.7%, primarily due to the transfer of certain single-serve products to Nestlé as part of the Global Coffee Alliance (approximately 150 basis points), strong performance from our North American Coffee Partnership joint venture (approximately 80 basis points) and lapping the correction of amortization expense (approximately 60 basis points) in the prior year, partially offset by certain transition items related to the Global Coffee Alliance (approximately 190 basis points).\nCorporate and Other\nCorporate and Other primarily consists of our unallocated corporate expenses and Evolution Fresh. Unallocated corporate expenses include corporate administrative functions that support the operating segments but are not specifically attributable to or managed by any segment and are not included in the reported financial results of the operating segments.\nCorporate and Other operating loss decreased to $1.3 billion for fiscal 2020, or 5%, compared to $1.4 billion in fiscal 2019. This decrease was primarily driven by lower performance-based compensation and lapping of the 2018 U.S stock award granted in fiscal 2018, which was funded by savings from the Tax Act and vested in fiscal 2019, partially offset by incremental strategic investments in technology.\nRESULTS OF OPERATIONS - FISCAL 2019 COMPARED TO FISCAL 2018\nConsolidated results of operations (in millions):\nRevenues\nTotal net revenues increased $1.8 billion, or 7%, over fiscal 2018, primarily driven by higher revenues from company-operated stores ($1.9 billion). The growth in company-operated store revenues was driven by incremental revenues from 947 net new Starbucks® company-operated store openings over the past 12 months ($957 million) and a 5% increase in comparable store sales ($879 million), attributable to a 3% increase in average ticket and a 2% increase in comparable transactions. These increases were partially offset by unfavorable foreign currency translation ($189 million) and the conversion of our Thailand, France and the Netherlands retail businesses to fully licensed markets during fiscal 2019 ($161 million).\nLicensed store revenue growth also contributed to the increase in total net revenues ($223 million), primarily due to higher product and equipment sales to and royalty revenues from our licensees ($228 million), largely due to the opening of 992 net new Starbucks® licensed stores over the past 12 months, and the conversion of our Thailand, France and the Netherlands retail businesses to fully licensed markets ($35 million), partially offset by unfavorable foreign currency translation ($41 million).\nOther revenues decreased $288 million, primarily driven by the licensing of our CPG and Foodservice businesses to Nestlé. Partially offsetting this decrease was growth in product revenue, primarily premium single-serve products, in connection with the Global Coffee Alliance.\nOperating Expenses\nProduct and distribution costs as a percentage of total net revenues increased 10 basis points, primarily due to licensing our CPG and Foodservice businesses to Nestlé (approximately 80 basis points), partially offset by cost savings initiatives (approximately 70 basis points) and leverage on product and distribution costs, largely driven by price increases.\nStore operating expenses as a percentage of total net revenues increased 130 basis points. Store operating expenses as a percentage of company-operated store revenues increased 60 basis points, primarily driven by investments in our store partners that are funded by savings from the Tax Act and growth in wages and benefits (approximately 120 basis points), largely in the Americas segment, partially offset by sales leverage driven by price increases and the impact of the adoption of new revenue recognition guidance on stored value card breakage.\nOther operating expenses decreased $184 million, primarily due to cost savings related to licensing our CPG and Foodservice businesses to Nestlé ($176 million) and lapping prior year costs associated with the establishment of the Global Coffee Alliance ($34 million), including business taxes associated with the up-front prepaid royalty from Nestlé and headcount-related costs, primarily relating to employee bonus and retention costs.\nDepreciation and amortization expenses as a percentage of total net revenues increased 20 basis points, primarily due to the impact of our ownership change in East China (approximately 20 basis points).\nGeneral and administrative expenses increased $116 million, primarily driven by higher performance-based compensation ($89 million) and the 2019 Starbucks Leadership Experience in Chicago, heavily concentrated in our fiscal fourth quarter ($52 million).\nRestructuring and impairment expenses decreased $89 million, primarily due to lower restructuring and impairment costs related to TeavanaTM/MC retail store closures ($128 million) and lower impairments related to our Switzerland retail market ($27 million), partially offset by higher exit costs associated with the closure of certain Starbucks® company-operated stores ($32 million) and severance costs ($25 million).\nIncome from equity investees decreased $3 million, primarily due to the impact of our ownership changes in East China. This decrease was partially offset by improved comparable store sales from our joint venture in South Korea and higher income from our North American Coffee Partnership joint venture.\nThe combination of these changes resulted in an overall decrease in operating margin of 30 basis points in fiscal 2019 when compared to fiscal 2018.\nOther Income and Expenses\nGain resulting from acquisition of joint venture in fiscal 2018 was due to remeasuring our preexisting 50% ownership interest in our East China joint venture to fair value upon acquisition.\nNet gain resulting from divestiture of certain operations was primarily due to the sale of our Thailand, France and the Netherlands retail operations in fiscal 2019. The gain in fiscal 2018 was primarily due to the sale of our Tazo brand and Taiwan joint venture, partially offset by the net loss from the sale of our Brazil retail operations in fiscal 2018.\nInterest income and other, net decreased $95 million, primarily due to the adoption of the new revenue recognition guidance on a prospective basis, which required estimated breakage on unredeemed store value cards to be recorded as revenue. We recorded stored value card breakage in interest income and other, net in the prior year.\nInterest expense increased $161 million primarily due to additional interest incurred on long-term debt issued in November 2017, March 2018, August 2018 and May 2019.\nThe effective tax rate for fiscal 2019 was 19.5% compared to 21.8% for fiscal 2018. The decrease in the effective tax rate was primarily due to the lower corporate tax rate as a result of the Tax Act (approximately 350 basis points), lapping prior year's transition tax on our accumulated undistributed foreign earnings and remeasurement of our deferred tax liabilities (approximately 300 basis points), higher stock-based compensation excess tax benefit (approximately 140 basis points), the release of income tax reserves related to the settlement of a U.S. tax examination and the expiration of statute of limitations (approximately 130 basis points) and the tax impacts of the gain on the sale of our Thailand retail operations (approximately 130 basis points). These favorable impacts were partially offset by the lapping of prior year's gain on the purchase of our East China joint venture that was not subject to income tax (approximately 580 basis points) and the impact of changes in indefinite reinvestment assertions for certain foreign subsidiaries during the first quarter of fiscal 2019 (approximately 170 basis points). See Note 14, Income Taxes, for further discussion.\nSegment Information\nResults of operations by segment (in millions):\nAmericas\nRevenues\nAmericas total net revenues for fiscal 2019 increased $1.5 billion, or 9%, primarily driven by a 5% increase in comparable store sales ($744 million) and 282 net new Starbucks® company-operated stores, or a 3% increase, over the past 12 months ($580 million). Also contributing were higher product sales to and royalty revenues from our licensees ($144 million), primarily resulting from comparable store sales growth and the opening of 323 net new Starbucks® licensed stores, or 4% increase, over the past 12 months and the impact of the adoption of revenue recognition guidance on stored value card breakage ($119 million).\nOperating Margin\nAmericas operating income for fiscal 2019 increased 9% to $3.8 billion, compared to $3.5 billion in fiscal 2018. Operating margin decreased 10 basis points to 20.7%, primarily driven by higher partner investments, largely funded by savings from the Tax Act, growth in wages and benefits (approximately 130 basis points) and to a much lesser extent, investments in labor hours heavily concentrated in our fiscal fourth quarter. Partially offsetting these were cost savings initiatives, primarily in product and distribution costs (approximately 90 basis points), the impact of the adoption of revenue recognition guidance on stored value card breakage (approximately 50 basis points) and sales leverage.\nInternational\nDiscussion of our International segment results below reflects the impact of fully consolidating our East China business from an equity method joint venture to a company-operated market since the acquisition date of December 31, 2017. Under the joint venture model, we recognized royalties and product sales within revenue and related product and distribution costs as well as our proportionate share of East China's net earnings, which resulted in a higher margin business. Under the company-operated ownership model, East China’s operating results are reflected in most income statement lines of this segment.\nRevenues\nInternational total net revenues for fiscal 2019 increased $640 million, or 12%%, primarily driven by 665 net new Starbucks® company-operated stores, or a 12% increase, over the past 12 months ($377 million), the ownership change in East China ($280 million) and a 3% increase in comparable store sales ($135 million). Also contributing were increased product sales to and royalty revenues from licensees ($84 million), primarily resulting from opening of 669 net new Starbucks® licensed stores, or an 11% increase, over the past 12 months and the impact of the adoption of revenue recognition guidance on stored value card breakage ($20 million). These increases were partially offset by unfavorable foreign currency translation ($183 million) and the conversion of our Thailand, France and the Netherlands retail businesses to fully licensed markets ($126 million).\nOperating Margin\nInternational operating income for fiscal 2019 increased 11% to $965 million, compared to $873 million in fiscal 2018. Operating margin decreased 10 basis points to 15.6%, primarily driven by strategic investments to support growth in China (approximately 80 basis points) and growth in wages and benefits (approximately 70 basis points), primarily offset by cost savings initiatives (approximately 80 basis points) and labor efficiencies (approximately 70 basis points).\nChannel Development\nOur Channel Development segment results reflect the impact of the licensing of our CPG and Foodservice businesses to Nestlé late in the fourth quarter of fiscal 2018, which we lapped late in the fourth quarter of fiscal 2019. Our collaborative business relationships for our global ready-to-drink products and the associated revenues remain unchanged due to the Global Coffee Alliance.\nRevenues\nChannel Development net revenues for fiscal 2019 decreased $305 million, or 13%, when compared to the prior year period, primarily driven by licensing our CPG and Foodservice businesses to Nestlé ($329 million), offset by growth in product revenue, primarily premium single-serve products, in connection with our Global Coffee Alliance ($25 million).\nOperating Margin\nChannel Development operating income for fiscal 2019 decreased 25% to $698 million, compared to $927 million in fiscal 2018. Operating margin decreased 540 basis points to 35.0%, primarily driven by licensing our CPG and Foodservice businesses to Nestlé (approximately 640 basis points), partially offset by lapping prior year costs associated with the establishment of the Global Coffee Alliance (approximately 140 basis points), including business taxes associated with the up-front prepaid royalty and headcount-related costs, primarily related to employee bonus and retention costs.\nCorporate and Other\nCorporate and Other primarily consists of our unallocated corporate expenses, as well as Evolution Fresh and the legacy operations of the Teavana retail business, which substantially ceased during fiscal 2018. Unallocated corporate expenses include corporate administrative functions that support the operating segments but are not specifically attributable to or managed by any segment and are not included in the reported financial results of the operating segments.\nFINANCIAL CONDITION, LIQUIDITY AND CAPITAL RESOURCES\nCash and Investment Overview\nOur cash and investments were $4.8 billion and $3.0 billion as of September 27, 2020 and September 29, 2019, respectively. In fiscal 2020, cash and investments increased by $1.8 billion primarily due to the issuance of short-term and long-term debt as well as lower share repurchases following the temporary suspension of our share repurchase program in March 2020. These liquidity increases offset lower retail cash inflows due to temporary store closures and modified operations resulting from the COVID-19 pandemic. We actively manage our cash and investments in order to internally fund operating needs, make scheduled interest and principal payments on our borrowings, make acquisitions and return cash to shareholders through common stock cash dividend payments and share repurchases. Our investment portfolio primarily includes highly liquid available-for-sale securities, including corporate debt securities, government treasury securities (domestic and foreign) and commercial paper. As of September 27, 2020, approximately $2.0 billion of cash was held in foreign subsidiaries.\nBorrowing capacity\nCredit Facilities and Commercial Paper\nOur total contractual borrowing capacity for general corporate purposes was $2.7 billion as of the end of fiscal 2020 when combining the unused commercial paper program and credit facilities discussed below, less outstanding borrowing.\nRevolving Lines of Credit\nOur $2.0 billion unsecured 5-year revolving credit facility (“the 2018 credit facility”), of which $150 million may be used for issuances of letters of credit, is currently set to mature on October 25, 2022. We have the option, subject to negotiation and agreement with the related banks, to increase the maximum commitment amount by an additional $500 million. Borrowings under the credit facility are subject to terms defined within the 2018 credit facility and will bear interest at a variable rate based on LIBOR, and, for U.S. dollar-denominated loans under certain circumstances, a Base Rate, in each case plus an applicable margin. The applicable margin is based on the better of (i) the Company's long-term credit ratings assigned by Moody's and Standard & Poor's rating agencies and (ii) the Company's fixed charge coverage ratio, pursuant to a pricing grid set forth in the five-year credit agreement. The current applicable margin is 1.100% for Eurocurrency Rate Loans and 0.000% (nil) for Base Rate Loans. The 2018 credit facility is available for general corporate purposes. As of September 27, 2020, we had no borrowings under the 2018 credit facility.\nOur $1.0 billion unsecured 364-day credit facility (the “364-day credit facility”), of which no amount may be used for issuances of letters of credit, is currently set to mature on September 22, 2021. We have the option, subject to negotiation and agreement with the related banks, to increase the maximum commitment amount by an additional $500 million. Borrowings under the credit facility are subject to terms defined within the 364-day credit facility and will bear interest at a variable rate based on\nLIBOR, and, for U.S. dollar-denominated loans under certain circumstances, a Base Rate, in each case plus an applicable margin. The applicable margin is based on the better of (i) the Company's long-term credit ratings assigned by Moody's and Standard & Poor's rating agencies and (ii) the Company's fixed charge coverage ratio, pursuant to a pricing grid set forth in the 364-day credit agreement. The applicable margin is 1.150% for Eurocurrency Rate Loans and 0.150% for Base Rate Loans. The 364-day credit facility is available for general corporate purposes. As of September 27, 2020, we had no borrowings under the 364-day credit facility.\nDue to the financial impacts from COVID-19, we reached an agreement with our lenders to amend the fixed charge coverage ratio covenant for our combined $3.0 billion revolving lines of credit, through the fourth quarter of fiscal 2021.\nCommercial Paper\nUnder our commercial paper program, we may issue unsecured commercial paper notes up to a maximum aggregate amount outstanding at any time of $3.0 billion, with individual maturities that may vary but not exceed 397 days from the date of issue. Amounts outstanding under the commercial paper program are required to be backstopped by available commitments under the 2018 and 364-day credit facilities discussed above. The proceeds from borrowings under our commercial paper program may be used for working capital needs, capital expenditures and other corporate purposes, including, but not limited to, business expansion, payment of cash dividends on our common stock and share repurchases. As of September 27, 2020, we had borrowings of $296.5 million outstanding, net of unamortized discount, under our commercial paper program, of which a majority will mature during the second quarter of fiscal 2021.\nCredit Facilities in Japan\nAdditionally, we hold Japanese yen-denominated credit facilities which are available for working capital needs and capital expenditures within our Japanese market.\nDuring the third quarter of fiscal 2020, we expanded our ¥1 billion unsecured credit facility to ¥5 billion, or $47.4 million, as of September 27, 2020. This facility is currently set to mature on December 31, 2020. Borrowings under the credit facility are subject to terms defined within the facility and will bear interest at a variable rate based on TIBOR plus an applicable margin of 0.400%. Additionally during the third quarter, we expanded our ¥2 billion unsecured credit facility to ¥10 billion, or $94.9 million, as of September 27, 2020. This facility is currently set to mature on March 26, 2021. Borrowings under the credit facility are subject to terms defined within the facility and will bear interest at a variable rate based on TIBOR plus 0.300%. As of September 27, 2020, we had $142.3 million of borrowings outstanding under these credit facilities.\nIn October 2020, we entered into a new ¥10 billion unsecured facility, or approximately $95 million as of October 29, 2020. This facility is set to mature on October 29, 2021. Borrowings under the credit facility are subject to terms defined within the facility and will bear interest at a variable rate based on TIBOR plus an applicable margin of 0.350%.\nLong-Term Debt\nOn May 7, 2020, we issued long-term debt in an underwritten registered public offering, which consisted of $500 million of 1.300% Senior Notes (the“2022 notes”) due May 2022, $1.25 billion of 2.550% Senior Notes (the “2030 notes”) due November 2030 and $1.25 billion of 3.500% Senior Notes (the “2050 notes”) due November 2050. We are using the net proceeds from the offering for general corporate purposes and for future repayments of outstanding indebtedness. Interest on the 2022 notes is payable semi-annually on May 7 and November 7, commencing on November 7, 2020. Interest on the 2030 notes and the 2050 notes is payable semi-annually on May 15 and November 15, commencing on November 15, 2020.\nOn March 12, 2020, we issued long-term debt in an underwritten registered public offering, which consisted of $500 million of 2.000% Senior Notes (the “2027 notes”) due March 2027, $750 million of 2.250% Senior Notes (the “2030 notes”) due March 2030 and $500 million of 3.350% Senior Notes (the “2050 notes”) due March 2050. We are using the net proceeds from the offering for general corporate purposes, including the repayment of outstanding borrowings under our commercial paper program. We may temporarily invest funds that are not immediately needed for these purposes in short-term investments, including marketable securities. Interest on the 2027 notes, the 2030 notes and the 2050 notes is payable semi-annually on March 12 and September 12, commencing on September 12, 2020.\nSee Note 9, Debt, to the consolidated financial statements included in Item 8 of Part II of this 10-K for details of the components of our long-term debt.\nOur ability to incur new liens and conduct sale and leaseback transactions on certain material properties is subject to compliance with terms of the indentures under which the Senior Notes were issued. As of September 27, 2020, we were in compliance with all applicable covenants.\nUse of Cash\nWe expect to use our available cash and investments, including, but not limited to, additional potential future borrowings under the credit facilities, commercial paper program and the issuance of debt to support and invest in our core businesses, including\ninvesting in new ways to serve our customers and supporting our store partners, repaying maturing debts, as well as returning cash to shareholders through common stock cash dividend payments and discretionary share repurchases and investing in new business opportunities related to our core and developing businesses. Further, we may use our available cash resources to make proportionate capital contributions to our investees. We may also seek strategic acquisitions to leverage existing capabilities and further build our business in support of our “Growth at Scale” agenda. Acquisitions may include increasing our ownership interests in our investees. Any decisions to increase such ownership interests will be driven by valuation and fit with our ownership strategy.\nWe believe that net future cash flows generated from operations and existing cash and investments both domestically and internationally combined with our ability to leverage our balance sheet through the issuance of debt will be sufficient to finance capital requirements for our core businesses as well as shareholder distributions for the foreseeable future. Significant new joint ventures, acquisitions and/or other new business opportunities may require additional outside funding. We have borrowed funds and continue to believe we have the ability to do so at reasonable interest rates; however, additional borrowings would result in increased interest expense in the future. In this regard, we may incur additional debt, within targeted levels, as part of our plans to fund our capital programs, including cash returns to shareholders through future dividends and discretionary share repurchases. To further strengthen our liquidity in the near term, we currently expect the suspension of share repurchases to continue through the end of fiscal 2021. If necessary, we may pursue additional sources of financing, including both short-term and long-term borrowings and debt issuances.\nWe regularly review our cash positions and our determination of indefinite reinvestment of foreign earnings. In the event we determine that all or a portion of such foreign earnings are no longer indefinitely reinvested, we may be subject to additional foreign withholding taxes and U.S. state income taxes, which could be material. We do not anticipate the need for repatriated funds to the U.S. to satisfy domestic liquidity needs. See Note 14, Income Taxes, for further discussion.\nDuring fiscal 2020, we entered into a new $500 million unsecured 364-day term-loan facility (“the 2020 term-loan facility”) which we drew on and subsequently repaid within the fiscal year. The 2020 term-loan facility was originally set to mature on March 19, 2021.\nDuring each of the first three quarters of fiscal 2019, we declared a cash dividend to shareholders of $0.36 per share. In the fourth quarter of fiscal 2019 and each of the first three quarters of fiscal 2020, we declared a cash dividend of $0.41 per share. Dividends are paid in the quarter following the declaration date. Cash returned to shareholders through dividends in fiscal 2020 and 2019 totaled $1.9 billion and $1.8 billion, respectively. Subsequent to the fourth quarter of fiscal 2020, we declared a cash dividend of $0.45 per share to be paid on November 27, 2020 with an expected payout of approximately $527.9 million. As of the date of this report, we do not expect to reduce our quarterly dividend as a result of the COVID-19 pandemic.\nIn September 2018, we entered into accelerated share repurchase agreements (“ASR agreements”) with third-party financial institutions totaling $5.0 billion, effective October 1, 2018. We made a $5.0 billion up-front payment to the financial institutions and received an initial delivery of 72.0 million shares of our common stock. In March 2019, we received an additional 4.9 million shares upon the completion of the program based on a volume-weighted average share price (less discount) of $65.03.\nAdditionally, in March 2019, we entered into ASR agreements with third-party financial institutions totaling $2.0 billion, effective March 22, 2019. We made a $2.0 billion up-front payment to the financial institutions and received an initial delivery of 22.2 million shares of our common stock. In June 2019, we received an additional 3.9 million shares upon the completion of the program based on a volume-weighted average share price (less discount) of $76.50.\nOutside of the ASR agreements noted above, we repurchased 36.6 million shares of common stock for $3.1 billion on the open market during the fiscal year ended September 29, 2019. In total, we repurchased 139.6 million shares at a total cost of $10.1 billion for the fiscal year ended September 29, 2019.\nOur Board of Directors approved an increase of 120 million and 40 million shares to our ongoing share repurchase program during the fiscal first quarter of 2019 and fiscal second quarter of 2020, respectively. We temporarily suspended our share repurchase program in March 2020. Prior to the suspension, we repurchased 20.3 million shares of common stock for $1.7 billion on the open market during the year ended September 27, 2020. As of September 27, 2020, 48.9 million shares remained available for repurchase under current authorizations. The existing share repurchase program remains authorized by the Board of Directors. The suspension of the share repurchases is currently expected to continue through fiscal 2021, and we may resume share repurchases in the future at any time, depending upon operating results, our capital needs and other factors.\nOther than normal operating expenses, cash requirements for fiscal 2021 are expected to consist primarily of capital expenditures for investments in our new and existing stores and our supply chain and corporate facilities. Total capital expenditures for fiscal 2021 are expected to be approximately $1.9 billion.\nCash Flows\nCash provided by operating activities was $1.6 billion for fiscal 2020, compared to $5.0 billion for fiscal 2019. The change was primarily due to temporary retail store closures resulting from the COVID-19 pandemic, the U.S. federal tax payment related to the Nestlé transaction and the timing of other tax payments and refunds.\nCash used in investing activities totaled $1.7 billion for fiscal 2020, compared to $1.0 billion for fiscal 2019. The change was primarily driven by lapping proceeds from the divestiture of certain operations related to the conversions of our retail businesses in Thailand, France and the Netherlands to fully licensed markets during 2019 and an increase in purchase of investments in fiscal 2020. This was partially offset by lower capital expenditures for new and existing stores.\nCash provided by financing activities for fiscal 2020 totaled $1.7 billion, compared to cash used in financing activities of $10.1 billion for fiscal 2019. The change was primarily due to higher repurchases of our common stock under accelerated share repurchase agreements in fiscal 2019 and higher proceeds from issuance of long-term debt in fiscal 2020.\nContractual Obligations\nThe following table summarizes our contractual obligations and borrowings as of September 27, 2020, and the timing and effect that such commitments are expected to have on our liquidity and capital requirements in future periods (in millions):\n(1)We have excluded long-term gross unrecognized tax benefits for uncertain tax positions, including interest and penalties of $137.5 million from the amounts presented as the timing of these obligations is uncertain.\n(2)Amounts include direct lease obligations, excluding any taxes, insurance and other related expenses.\n(3)Purchase obligations include agreements to purchase goods or services that are enforceable and legally binding on Starbucks and that specify all significant terms. Green coffee purchase commitments comprise 93% of total purchase obligations.\n(4)Other obligations include other long-term liabilities primarily consisting of the Tax Act transition tax, asset retirement obligations, Valor Siren Ventures I L.P. (VSV) investment and hedging instruments.\nStarbucks currently expects to fund these commitments primarily with operating cash flows generated in the normal course of business.\nOff-Balance Sheet Arrangements\nOff-balance sheet arrangements relate to purchase commitments detailed in the footnotes to the consolidated financial statements included in Item 8 of Part II of this 10-K.\nCOMMODITY PRICES, AVAILABILITY AND GENERAL RISK CONDITIONS\nCommodity price risk represents Starbucks primary market risk, generated by our purchases of green coffee and dairy products, among other items. We purchase, roast and sell high-quality arabica coffee and related products and risk arises from the price volatility of green coffee. In addition to coffee, we also purchase significant amounts of dairy products to support the needs of our company-operated stores. The price and availability of these commodities directly impacts our results of operations, and we expect commodity prices, particularly coffee, to impact future results of operations. For additional details see Product Supply in Item 1, as well as Risk Factors in Item 1A of this 10-K.\nFINANCIAL RISK MANAGEMENT\nMarket risk is defined as the risk of losses due to changes in commodity prices, foreign currency exchange rates, equity security prices and interest rates. We manage our exposure to various market-based risks according to a market price risk management policy. Under this policy, market-based risks are quantified and evaluated for potential mitigation strategies, such as entering into hedging transactions. The market price risk management policy governs how hedging instruments may be used to mitigate\nrisk. Risk limits are set annually and prohibit speculative trading activity. We also monitor and limit the amount of associated counterparty credit risk, which we consider to be low. We use interest rate swap agreements and treasury locks to primarily hedge against changes in benchmark interest rates related to anticipated debt issuances and cross-currency swaps and foreign exchange debt instruments to hedge against changes in the fair value of our fixed-rate debt and foreign exchange exposure of net investments in Japan. Excluding interest rate hedging instruments, cross currency swaps and foreign currency debt, hedging instruments generally do not have maturities in excess of three years. Refer to Note 1, Summary of Significant Accounting Policies, and Note 3, Derivative Financial Instruments, to the consolidated financial statements included in Item 8 of Part II of this 10-K for further discussion of our hedging instruments.\nThe sensitivity analyses disclosed below provide only a limited, point-in-time view of the market risk of the financial instruments discussed. The actual impact of the respective underlying rates and price changes on the financial instruments may differ significantly from those shown in the sensitivity analyses.\nCommodity Price Risk\nWe purchase commodity inputs, primarily coffee, dairy products, diesel, cocoa, sugar and other commodities, that are used in our operations and are subject to price fluctuations that impact our financial results. We use a combination of pricing features embedded within supply contracts, such as fixed-price and price-to-be-fixed contracts for coffee purchases, and financial derivatives to manage our commodity price risk exposure.\nThe following table summarizes the potential impact as of September 27, 2020 to Starbucks future net earnings and other comprehensive income (“OCI”) from changes in commodity prices. The information provided below relates only to the hedging instruments and does not represent the corresponding changes in the underlying hedged items (in millions):\nForeign Currency Exchange Risk\nThe majority of our revenue, expense and capital purchasing activities are transacted in U.S. dollars. However, because a portion of our operations consists of activities outside of the U.S., we have transactions in other currencies, primarily the Chinese renminbi, Japanese yen, Canadian dollar, British pound, South Korean won and euro. To reduce cash flow volatility from foreign currency fluctuations, we enter into derivative instruments to hedge portions of cash flows of anticipated intercompany royalty payments, inventory purchases, intercompany borrowing and lending activities and certain other transactions in currencies other than the functional currency of the entity that enters into the arrangements, as well as the translation risk of certain balance sheet items. The volatility in the foreign exchange market may lead to significant fluctuation in foreign currency exchange rates and adversely impact our financial results in the case of weakening foreign currencies relative to the U.S. dollar. See Note 3, Derivative Financial Instruments, to the consolidated financial statements included in Item 8 of Part II of this 10-K for further discussion.\nThe following table summarizes the potential impact as of September 27, 2020 to Starbucks future net earnings and other comprehensive income from changes in the fair value of these derivative financial instruments due to a change in the value of the U.S. dollar as compared to foreign exchange rates. The information provided below relates only to the hedging instruments and does not represent the corresponding changes in the underlying hedged items (in millions):\nEquity Security Price Risk\nWe have minimal exposure to price fluctuations on equity mutual funds and equity exchange-traded funds within our marketable equity securities portfolio. Marketable equity securities are recorded at fair value and approximates a portion of our liability under our Management Deferred Compensation Plan (“MDCP”). Gains and losses from the portfolio and the change in our MDCP liability are recorded in our consolidated statements of earnings.\nWe performed a sensitivity analysis based on a 10% change in the underlying equity prices of our investments as of September 27, 2020 and determined that such a change would not have a significant impact on the fair value of these instruments.\nInterest Rate Risk\nLong-term Debt\nWe utilize short-term and long-term financing and may use interest rate hedges to manage our overall interest expense related to our existing fixed-rate debt, as well as to hedge the variability in cash flows due to changes in benchmark interest rates related to anticipated debt issuances. See Note 3, Derivative Financial Instruments and Note 9, Debt, to the consolidated financial statements included in Item 8 of Part II of this 10-K for further discussion of our interest rate hedge agreements and details of the components of our long-term debt, respectively, as of September 27, 2020.\nThe following table summarizes the impact of a change in interest rates as of September 27, 2020 on the fair value of Starbucks debt (in millions):\n(1)Amount disclosed is net of $23 million change in the fair value of our designated interest rate swap. Refer to Note 3, Derivative Financial Instruments, for additional information on our interest rate swap designated as a fair value hedge.\nAvailable-for-Sale Debt Securities\nOur available-for-sale securities comprise a diversified portfolio consisting mainly of investment-grade debt securities. The primary objective of these investments is to preserve capital and liquidity. Available-for-sale securities are recorded on the consolidated balance sheets at fair value with unrealized gains and losses reported as a component of accumulated other comprehensive income. We do not hedge the interest rate exposure on our investments. We performed a sensitivity analysis based on a 100 basis point change in the underlying interest rate of our available-for-sale securities as of September 27, 2020 and determined that such a change would not have a significant impact on the fair value of these instruments.\nAPPLICATION OF CRITICAL ACCOUNTING POLICIES\nCritical accounting policies are those that management believes are both most important to the portrayal of our financial condition and results and require the most difficult, subjective or complex judgments, often as a result of the need to make estimates about the effect of matters that are inherently uncertain, especially in light of the current economic environment due to the COVID-19 pandemic. Judgments and uncertainties affecting the application of those policies may result in materially different amounts being reported under different conditions or using different assumptions.\nOur significant accounting policies are discussed in Note 1, Summary of Significant Accounting Policies, to the consolidated financial statements included in Item 8 of Part II of this 10-K. We believe that of our significant accounting policies, the following policies involve a higher degree of judgment and/or complexity.\nWe consider financial reporting and disclosure practices and accounting policies quarterly to ensure that they provide accurate and transparent information relative to the current economic and business environment. During the past five fiscal years, we have not made any material changes to the accounting methodologies used to assess the areas discussed below, unless noted otherwise.\nProperty, Plant and Equipment and Other Finite-Lived Assets\nWe evaluate property, plant and equipment, operating lease right-of-use (“ROU”) assets and other finite-lived assets for impairment when facts and circumstances indicate that the carrying values of such assets may not be recoverable. When evaluating for impairment, we first compare the carrying value of the asset to the asset’s estimated future undiscounted cash flows. If the estimated undiscounted future cash flows are less than the carrying value of the asset, we determine if we have an impairment loss by comparing the carrying value of the asset to the asset's estimated fair value and recognize an impairment charge when the asset’s carrying value exceeds its estimated fair value. The adjusted carrying amount of the asset becomes its new cost basis and is depreciated over the asset's remaining useful life.\nLong-lived assets are grouped with other assets and liabilities at the lowest level for which identifiable cash flows are largely independent of the cash flows of other assets and liabilities. For company-operated store assets, the impairment test is performed at the individual store asset group level, which is inclusive of property, plant and equipment and lease ROU assets. The fair value of a store’s assets is estimated using a discounted cash flow model. For other long-lived assets, fair value is determined using an approach that is appropriate based on the relevant facts and circumstances, which may include discounted cash flows, comparable transactions, or comparable company analyses.\nOur impairment calculations contain uncertainties because they require management to make assumptions and to apply judgment to estimate future cash flows and asset fair values. Key assumptions used in estimating future cash flows and asset fair values include projected revenue growth and operating expenses, as well as forecasting asset useful lives and selecting an appropriate discount rate. For company-operated stores, estimates of revenue growth and operating expenses are based on internal projections and consider the store’s historical performance, the local market economics and the business environment impacting the store’s performance. The discount rate is selected based on what we believe a buyer would assume when determining a purchase price for the store. These estimates are subjective and our ability to realize future cash flows and asset fair values is affected by factors such as ongoing maintenance and improvement of the assets, changes in economic conditions and changes in operating performance.\nIn each of the three fiscal years prior to fiscal 2020, our business has operated at levels of growth and profitability that have not required material numbers of our store assets to be reviewed for potential impairment. Given the substantial reduction in our revenues and cash flows as a result of the COVID-19 pandemic, primarily in the third quarter of fiscal 2020, along with our announced restructuring plans to close up to 800 of our company-operated stores in the U.S. and Canada in the next 18 months, we identified triggering events that required us to assess the need for potential impairment charges for a larger number of company-operated stores in fiscal 2020 than in prior years. As a result of these activities, we recorded store impairment charges of $298.9 million in fiscal 2020, of which $239.3 million was included in restructuring and impairment expenses on our consolidated statement of earnings. The magnitude of these charges was not particularly sensitive to variations in fair value inputs, as the majority of charges recorded were the result of full impairments of stores identified for closure, based on factors such as the format and location of the store or its current operating performance. Excluding stores in areas impacted by our restructuring plans, our company-operated store portfolio is projecting a return to pre-COVID-19 levels of operations and cash flow recoverability within the next 12 months. However, irrespective of the above, our expectations of business recovery trends may vary materially in future periods based on the pace of global and market-specific recovery from the COVID-19 pandemic.\nAs of September 27, 2020, we had identified 405 stores in the U.S. and Canada for closure under our restructuring plans. We expect to potentially identify up to another 395 stores for closure. We expect total future restructuring costs, which are attributable to our Americas segment, to range from approximately $260 million to $400 million. These restructuring costs include accelerated amortization or impairments of ROU assets due to planned store closures prior to the end of contractual lease terms ($150 million to $190 million), store asset impairment and disposal costs not previously recorded as part of our ongoing store impairment process ($100 million to $190 million) and the remaining amount relates to employee termination costs. Our estimates of future restructuring costs are based on actual costs incurred for recently closed stores of similar profile under the restructuring plans. As we have previously recorded impairment charges in fiscal 2020 for stores that may be identified for closure under our plans, and because store closure decisions are still subject to change, the final costs associated with these store closures may be different from the initial estimates. These costs will depend on the asset carrying value and remaining lease term for each store identified. Future restructuring costs are expected to be incurred over the next 18 months as stores are specifically identified for closure or, in the case of lease exit costs, when the stores cease operations.\nAsset impairment charges are discussed in Note 1, Summary of Significant Accounting Policies, to the consolidated financial statements included in Item 8 of Part II of this 10-K.\nGoodwill and Indefinite-Lived Intangible Assets\nWe evaluate goodwill and indefinite-lived intangible assets for impairment annually during our third fiscal quarter, or more frequently if an event occurs or circumstances change that would indicate impairment may exist. When evaluating these assets for impairment, we may first perform a qualitative assessment to determine whether it is more likely than not that a reporting unit is impaired. If we do not perform a qualitative assessment, or if we determine that it is not more likely than not that the fair\nvalue of the reporting unit exceeds its carrying amount, we calculate the estimated fair value of the reporting unit using discounted cash flows or a combination of discounted cash flow and market approaches.\nWhen assessing goodwill for impairment, our decision to perform a qualitative impairment assessment for an individual reporting unit in a given year is influenced by a number of factors, inclusive of the carrying value of the reporting unit's goodwill, the significance of the excess of the reporting unit's estimated fair value over carrying value at the last quantitative assessment date, the amount of time in between quantitative fair value assessments and the date of acquisition. If we perform a quantitative assessment of an individual reporting unit’s goodwill, our impairment calculations contain uncertainties because they require management to make assumptions and to apply judgment when estimating future cash flows and asset fair values, including projected revenue growth and operating expenses related to existing businesses, product innovation and new store concepts, as well as utilizing valuation multiples of similar publicly traded companies and selecting an appropriate discount rate. Estimates of revenue growth and operating expenses are based on internal projections considering the reporting unit’s past performance and forecasted growth, including assumptions regarding business recovery post COVID-19, strategic initiatives, local market economics and the local business environment impacting the reporting unit’s performance. The discount rate is selected based on the estimated cost of capital for a market participant to operate the reporting unit in the region. These estimates, as well as the selection of comparable companies and valuation multiples used in the market approaches are highly subjective, and our ability to realize the future cash flows used in our fair value calculations is affected by factors such as the success of strategic initiatives, changes in economic conditions, changes in our operating performance and changes in our business strategies, including retail initiatives and international expansion. Our goodwill impairment assessments were not significantly altered as a result of the COVID-19 pandemic. We continue to believe the fair value of each of our reporting units is significantly in excess of its carrying value, and absent a sustained multi-year global decline in our business in key markets such as the U.S. and China, we do not anticipate incurring significant goodwill impairment in the next 12 months.\nWhen assessing indefinite-lived intangible assets for impairment, where we perform a qualitative assessment, we evaluate if changes in events or circumstances have occurred that indicate that impairment may exist. If we do not perform a qualitative impairment assessment or if changes in events and circumstances indicate that a quantitative assessment should be performed, management is required to calculate the fair value of the intangible asset group. The fair value calculation includes estimates of revenue growth, which are based on past performance and internal projections for the intangible asset group's forecasted growth, including assumptions regarding business recovery post COVID-19, and royalty rates, which are adjusted for our particular facts and circumstances. The discount rate is selected based on the estimated cost of capital that reflects the risk profile of the related business. These estimates are highly subjective, and our ability to achieve the forecasted cash flows used in our fair value calculations is affected by factors such as the success of strategic initiatives, changes in economic conditions, changes in our operating performance and changes in our business strategies, including retail initiatives and international expansion. During fiscal 2020, we recorded a charge of $22.1 million relating to the impairment of an indefinite-lived intangible asset due to changes in branding and marketing strategy. The amount of charge taken was not materially impacted by our choice of fair value assumptions, and we do not anticipate recording significant impairment charges in the next 12 months.\nDefinite-lived intangible asset impairment charges are discussed in Note 8, Other Intangible Assets and Goodwill, to the consolidated financial statements included in Item 8 of Part II of this 10-K.\nIncome Taxes\nWe recognize deferred tax assets and liabilities based on the differences between the financial statement carrying amounts and the respective tax bases of our assets and liabilities. Deferred tax assets and liabilities are measured using current enacted tax rates expected to apply to taxable income in the years in which we expect the temporary differences to reverse. We routinely evaluate the likelihood of realizing the benefit of our deferred tax assets and may record a valuation allowance if, based on all available evidence, we determine that some portion of the tax benefit will not be realized.\nIn evaluating our ability to recover our deferred tax assets within the jurisdiction from which they arise, we consider all available positive and negative evidence, including scheduled reversals of deferred tax liabilities, projected future taxable income, tax-planning strategies and results of operations. In projecting future taxable income, we consider historical results and incorporate assumptions about the amount of future state, federal and foreign pretax operating income adjusted for items that do not have tax consequences. Our assumptions regarding future taxable income are consistent with the plans and estimates we use to manage our underlying businesses. In evaluating the objective evidence that historical results provide, we consider three years of cumulative operating income/(loss). During fiscal 2020, we recorded valuation allowances of $56.5 million to reduce our deferred tax asset balance as of the beginning of the fiscal year relating to certain foreign jurisdictions not expected to generate enough future income to offset accumulated losses. Absent a sustained multi-year global decline in our business in key markets such as the U.S., China and Japan, we do not anticipate incurring significant additional valuation allowances against our remaining deferred tax assets as of September 27, 2020 in the next 12 months.\nIn addition, our income tax returns are periodically audited by domestic and foreign tax authorities. These audits include review of our tax filing positions, including the timing and amount of deductions taken and the allocation of income between tax jurisdictions. We evaluate our exposures associated with our various tax filing positions and recognize a tax benefit only if it is\nmore likely than not that the tax position will be sustained upon examination by the relevant taxing authorities, including resolutions of any related appeals or litigation processes, based on the technical merits of our position. For uncertain tax positions that do not meet this threshold, we record a related liability. We adjust our unrecognized tax benefit liability and income tax expense in the period in which the uncertain tax position is effectively settled, the statute of limitations expires for the relevant taxing authority to examine the tax position or when new information becomes available. As discussed in Note 14, Income Taxes, to the consolidated financial statements included in Item 8 of Part II of this 10-K, there is a reasonable possibility that our unrecognized tax benefit liability will be adjusted within 12 months due to the expiration of a statute of limitations and/or resolution of examinations with taxing authorities.\nWe have generated income in certain foreign jurisdictions that may be subject to additional foreign withholding taxes and U.S. state income taxes. We regularly review our plans for reinvestment or repatriation of unremitted foreign earnings. These plans have been unaltered as a result of the COVID-19 pandemic. While we do not expect to repatriate cash to the U.S. to satisfy domestic liquidity needs, if these amounts were distributed to the U.S., in the form of dividends or otherwise, we may be subject to additional foreign withholding taxes and U.S. state income taxes, which could be material.\nOur income tax expense, deferred tax assets and liabilities and liabilities for unrecognized tax benefits reflect management’s best assessment of estimated current and future taxes to be paid. Deferred tax asset valuation allowances and our liabilities for unrecognized tax benefits require significant management judgment regarding applicable statutes and their related interpretation, the status of various income tax audits and our particular facts and circumstances. Although we believe that the judgments and estimates discussed herein are reasonable, actual results, including forecasted COVID-19 business recovery, could differ, and we may be exposed to losses or gains that could be material. To the extent we prevail in matters for which a liability has been established or are required to pay amounts in excess of our established liability, our effective income tax rate in a given financial statement period could be materially affected.\nRECENT ACCOUNTING PRONOUNCEMENTS\nSee Note 1, Summary of Significant Accounting Policies, to the consolidated financial statements included in Item 8 of Part II of this 10-K for a detailed description of recent accounting pronouncements.",
    "item_7A": "Item 7A. Quantitative and Qualitative Disclosures About Market Risk\nThe information required by this item is incorporated by reference to the section entitled “Management’s Discussion and Analysis of Financial Condition and Results of Operations - Commodity Prices, Availability and General Risk Conditions” and “Management’s Discussion and Analysis of Financial Condition and Results of Operations - Financial Risk Management” in Item 7 of this Report.",
    "item_8": "Item 8. Financial Statements and Supplementary Data\nSTARBUCKS CORPORATION\nCONSOLIDATED STATEMENTS OF EARNINGS\n(in millions, except per share data)\nSee Notes to Consolidated Financial Statements.\nSTARBUCKS CORPORATION\nCONSOLIDATED STATEMENTS OF COMPREHENSIVE INCOME\n(in millions)\nSee Notes to Consolidated Financial Statements.\nSTARBUCKS CORPORATION\nCONSOLIDATED BALANCE SHEETS\n(in millions, except per share data)\nSee Notes to Consolidated Financial Statements.\nSTARBUCKS CORPORATION\nCONSOLIDATED STATEMENTS OF CASH FLOWS\n(in millions)\nSee Notes to Consolidated Financial Statements.\nSTARBUCKS CORPORATION\nCONSOLIDATED STATEMENTS OF EQUITY\n(in millions, except per share data)\nSee Notes to Consolidated Financial Statements.\nSTARBUCKS CORPORATION\nINDEX FOR NOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nNote 1 Summary of Significant Accounting Policies\nNote 2 Acquisitions, Divestitures and Strategic Alliance\nNote 3 Derivative Financial Instruments\nNote 4 Fair Value Measurements\nNote 5 Inventories\nNote 6 Equity Investments\nNote 7 Supplemental Balance Sheet and Statement of Earnings Information\nNote 8 Other Intangible Assets and Goodwill\nNote 9 Debt\nNote 10 Leases\nNote 11 Deferred Revenue\nNote 12 Equity\nNote 13 Employee Stock and Benefit Plans\nNote 14 Income Taxes\nNote 15 Earnings per Share\nNote 16 Commitments and Contingencies\nNote 17 Segment Reporting\nNote 18 Selected Quarterly Financial Information (unaudited)\nSTARBUCKS CORPORATION\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nFiscal Years ended September 27, 2020, September 29, 2019 and September 30, 2018\nNote 1: Summary of Significant Accounting Policies\nDescription of Business\nWe purchase and roast high-quality coffees that we sell, along with handcrafted coffee and tea beverages and a variety of fresh and prepared food items, through our company-operated stores. We also sell a variety of coffee and tea products and license our trademarks through other channels such as licensed stores, grocery and foodservice. The grocery and foodservice business is primarily through our Global Coffee Alliance with Nestlé established in August 2018.\nIn this 10-K, Starbucks Corporation (together with its subsidiaries) is referred to as “Starbucks,” the “Company,” “we,” “us” or “our.”\nCertain prior period information on the consolidated statements of cash flows has been reclassified to conform to the current year presentation.\nIn the third quarter of fiscal 2020, we renamed the “cost of sales” caption on our consolidated statement of earnings to “product and distribution costs,” which more accurately reflects the substance of costs classified within this line item. There were no classification or other changes made in conjunction with the new caption.\nWe have three reportable operating segments: 1) Americas, which is inclusive of the U.S., Canada and Latin America; 2) International, which is inclusive of China/Asia Pacific, Europe, the Middle East and Africa; and 3) Channel Development. Non-reportable operating segments such as Evolution Fresh and unallocated corporate expenses are reported within Corporate and Other.\nPrinciples of Consolidation\nOur consolidated financial statements reflect the financial position and operating results of Starbucks, including wholly-owned subsidiaries and investees that we control. Intercompany transactions and balances have been eliminated.\nFiscal Year End\nOur fiscal year ends on the Sunday closest to September 30. Fiscal 2020, 2019 and 2018 included 52 weeks.\nEstimates and Assumptions\nPreparing financial statements in conformity with accounting principles generally accepted in the United States of America (“GAAP”) requires management to make estimates and assumptions that affect the reported amounts of assets, liabilities, revenues and expenses. Examples include, but are not limited to, estimates for inventory reserves, asset and goodwill impairments, assumptions underlying self-insurance reserves, income from unredeemed stored value cards, stock-based compensation forfeiture rates, future asset retirement obligations and the potential outcome of future tax consequences of events that have been recognized in the financial statements. Actual results and outcomes may differ from these estimates and assumptions due to risks and uncertainties, including uncertainty in the current economic environment due to the outbreak of the novel coronavirus (“COVID-19”).\nRestructuring\nIn the third quarter of fiscal 2020, we announced a plan to optimize our North America store portfolio, primarily in dense metropolitan markets by blending store formats to better cater to changing customer tastes and preferences. As of September 27, 2020, we expect the total number of closures to be approximately 800 stores in the U.S. and Canada, reflecting an additional 200 store closures than the initial estimate of 600 stores. As of September 27, 2020, we identified 405 stores for closure under our restructuring plans, and as a result we recorded approximately $254.7 million to restructuring and impairments on our consolidated statement of earnings. Of this total, $151.6 million related to the impairment of store assets for which either a triggering event occurred and the assets were determined not to be recoverable or the store was permanently closed. An additional $87.7 million was primarily associated with accelerated amortization or impairments of right-of-use (“ROU”) lease assets due to planned store closures prior to the end of contractual lease terms. For impaired store asset groups, we estimated the fair values using an income approach incorporating internal projections of revenue growth and operating expenses that are considered Level 3 fair value measurements, as well as applicable discount rates and market lease rates. The application of these projections and fair value measurements did not have a significant impact on our final impairment decisions given that we plan to fully exit the majority of these identified stores in the next 3 to 6 months. The remaining $15.4 million related to employee termination costs.\nWe expect total future restructuring costs, which are attributable to our Americas segment, to range from approximately $260 million to $400 million. These restructuring costs include accelerated amortization or impairments of ROU assets due to\nplanned store closures prior to the end of contractual lease terms ($150 million to $190 million), store impairment and disposal costs not previously recorded as part of our ongoing store impairment process ($100 million to $190 million) and the remaining amount relates to employee termination costs. As we have previously recorded impairment charges in fiscal 2020 for stores that may be identified for closure under our plans, and because store closure decisions are still subject to change, the final costs associated with these store closures may be different from the initial estimates. These costs will depend on the asset carrying value and remaining lease term of the specific stores identified. Future restructuring costs are expected to be incurred over the next 18 months as stores are specifically identified for closure or, in the case of lease exit costs, when the stores either cease operations or when a reduced lease term due to early termination is reasonably certain.\nAs of September 27, 2020, restructuring liabilities totaling $80.0 million were included in current and non-current operating lease liability for the remaining outstanding rent liabilities due to landlords. The associated expense was recognized in fiscal 2020 for these stores that were either closed or reasonably certain to close in fiscal 2021. Additionally, $15.2 million was included in accrued payroll and benefits for employee termination costs on the consolidated balance sheets. Cash payments were immaterial for fiscal 2020.\nCash and Cash Equivalents\nWe consider all highly liquid instruments with maturities of three months or less at the time of purchase, as well as credit card receivables for sales to customers in our company-operated stores that generally settle within two to five business days, to be cash equivalents. We maintain cash and cash equivalent balances with financial institutions that exceed federally-insured limits. We have not experienced any losses related to these balances, and we believe credit risk to be minimal.\nOur cash management system provides for the funding of all major bank disbursement accounts on a daily basis as checks are presented for payment. Under this system, outstanding checks are in excess of the cash balances at certain banks, which creates book overdrafts. Book overdrafts are presented as a current liability in accrued liabilities on our consolidated balance sheets.\nInvestments\nAvailable-for-sale Debt Securities\nOur short-term and long-term investments consist primarily of investment-grade debt securities, all of which are classified as available-for-sale. Available-for-sale debt securities are recorded at fair value, and unrealized holding gains and losses are recorded, net of tax, as a component of accumulated other comprehensive income. Available-for-sale securities with remaining maturities of less than one year and those identified by management at the time of purchase to be used to fund operations within one year are classified as short-term. All other available-for-sale securities are classified as long-term. We evaluate our available-for-sale securities for other-than-temporary impairment on a quarterly basis. Unrealized losses are charged against net earnings when a decline in fair value is determined to be other than temporary. We review several factors to determine whether a loss is other than temporary, such as the length and extent of the fair value decline, the financial condition and near-term prospects of the issuer and whether we have the intent to sell or will more likely than not be required to sell before the securities' anticipated recovery, which may be at maturity. Realized gains and losses are accounted for using the specific identification method. Purchases and sales are recorded on a trade date basis.\nMarketable Equity Securities\nWe also have a marketable equity securities portfolio, which is comprised of marketable equity mutual funds and equity exchange-traded funds. Marketable equity securities are recorded at fair value and approximates a portion of our liability under our Management Deferred Compensation Plan (“MDCP”). Gains or losses from the portfolio and the change in our MDCP liability are recorded in our consolidated statements of earnings.\nEquity Investments\nEquity investments are accounted under the equity method if we are able to exercise significant influence, but not control, over an investee. Our share of the earnings or losses as reported by the investees is classified as income from equity investees on our consolidated statements of earnings. The investments are evaluated for impairment annually and when facts and circumstances indicate that the carrying value may not be recoverable. If a decline in fair value is determined to be other-than-temporary, an impairment charge is recorded in interest income and other, net on our consolidated statements of earnings.\nWe account for equity investments for which we do not have significant influence and without readily determinable fair values at cost with adjustments for observable changes in price or impairments as permitted by the measurement alternative. Investments for which the measurement alternative has been elected are assessed for impairment quarterly, or if a triggering event indicates impairment may be present. Any adjustments as a result of price changes or impairments are recorded in interest income and other, net on our consolidated statements of earnings.\nFair Value\nFair value is the price we would receive to sell an asset or pay to transfer a liability (exit price) in an orderly transaction between market participants. For assets and liabilities recorded or disclosed at fair value on a recurring basis, we determine fair value based on the following:\nLevel 1: The carrying value of cash and cash equivalents approximates fair value because of the short-term nature of these instruments. For equity and U.S. government treasury securities and commodity futures contracts, we use quoted prices in active markets for identical assets to determine fair value.\nLevel 2: When quoted prices in active markets for identical assets are not available, we determine the fair value of our available-for-sale securities and our over-the-counter forward contracts, collars and swaps based upon factors such as the quoted market price of similar assets or a discounted cash flow model using readily observable market data, which may include interest rate curves and forward and spot prices for currencies and commodities, depending on the nature of the investment. The fair value of our long-term debt is estimated based on the quoted market prices for the same or similar issues or on the current rates offered to us for debt of the same remaining maturities.\nLevel 3: We determine the fair value of our auction rate securities using an internally-developed valuation model, using inputs that include interest rate curves, credit and liquidity spreads and effective maturity.\nAssets and liabilities recognized or disclosed at fair value on a nonrecurring basis may include items such as property, plant and equipment, goodwill and other intangible assets, equity and other investments and other assets. We determine the fair value of these items using Level 3 inputs, as described in the related sections below.\nDerivative Instruments\nWe manage our exposure to various risks within our consolidated financial statements according to a market price risk management policy. Under this policy, we may engage in transactions involving various derivative instruments to hedge interest rates, commodity prices and foreign currency-denominated revenue streams, inventory purchases, assets and liabilities and investments in certain foreign operations. In order to manage our exposure to these risks, we use various types of derivative instruments including forward contracts, commodity futures contracts, collars and swaps. Forward contracts and commodity futures contracts are agreements to buy or sell a quantity of a currency or commodity at a predetermined future date and at a predetermined rate or price. A collar is a strategy that uses a combination of a purchased call option and a sold put option with equal premiums to hedge a portion of anticipated cash flows, or to limit possible gains or losses on an underlying asset or liability to a specific range. A swap agreement is a contract between two parties to exchange cash flows based on specified underlying notional amounts, assets and/or indices. We do not enter into derivative instruments for speculative purposes.\nWe record all derivatives on our consolidated balance sheets at fair value and typically do not offset derivative assets and liabilities. Excluding interest rate hedging instruments, cross-currency swaps and foreign currency debt hedging instruments, we generally do not enter into derivative instruments with maturities longer than three years. However, we are allowed to net settle transactions with respective counterparties for certain derivative contracts, inclusive of interest rate swaps and foreign currency forwards, with a single, net amount payable by one party to the other. We also enter into collateral security arrangements that provide for collateral to be received or posted when the net fair value of certain financial instruments fluctuates from contractually established thresholds. As of September 27, 2020, cash collateral held under collateral security arrangements was $34.9 million and is included in other long-term liabilities on our consolidated balance sheet. Cash collateral was immaterial as of September 29, 2019. The potential effects of netting arrangements with our derivative contracts, excluding the effects of collateral, would not have had a material impact on our consolidated balance sheets.\nBy using these derivative instruments, we expose ourselves to potential credit risk. Credit risk is the failure of the counterparty to perform under the terms of the derivative contract. We minimize this credit risk by entering into transactions with carefully selected, credit-worthy counterparties and distribute contracts among several financial institutions to reduce the concentration of credit risk.\nCash Flow Hedges\nFor derivative instruments that are designated and qualify as a cash flow hedge, the derivative's gain or loss is reported as a component of other comprehensive income (“OCI”) and recorded in accumulated other comprehensive income (“AOCI”) on our consolidated balance sheets. The gain or loss is subsequently reclassified into net earnings when the hedged exposure affects net earnings, in the same line item as the underlying hedged item on our consolidated statements of earnings.\nCash flow hedges related to anticipated transactions are designated and documented at the inception of each hedge. Cash flows from hedging transactions are classified in the same categories as the cash flows from the respective hedged items. For de-designated cash flow hedges in which the transactions are no longer likely to occur, the related accumulated derivative gains or losses are recognized in interest income and other, net on our consolidated statements of earnings based on the nature of the underlying transaction.\nNet Investment Hedges\nFor derivative instruments that are designated and qualify as a net investment hedge, the derivative's, or qualifying non-derivative instrument’s gain or loss is reported as a component of OCI and recorded in AOCI. The gain or loss will be subsequently reclassified into net earnings when the hedged net investment is either sold or substantially liquidated.\nFair Value Hedges\nFor derivative instruments that are designated and qualify as a fair value hedge, the changes in fair value of the derivative instrument and the offsetting changes in fair value of the underlying hedged item due to changes in the hedged risk are recorded in interest income and other, net or interest expense on our consolidated statements of earnings.\nDerivatives Not Designated As Hedging Instruments\nWe also enter into certain foreign currency forward contracts, commodity futures contracts, collars and swaps that are not designated as hedging instruments for accounting purposes. The changes in the fair values of these contracts are immediately recognized in interest income and other, net on our consolidated statements of earnings.\nNormal Purchase Normal Sale\nWe enter into fixed-price and price-to-be-fixed green coffee purchase commitments, which are described further in Note 5, Inventories. For both fixed-price and price-to-be-fixed purchase commitments, we expect to take delivery of green coffee and to utilize the coffee in a reasonable period of time in the ordinary course of business. Since these types of purchase commitments qualify for the normal purchase normal sale exemption, they are not recorded as derivative instruments on our consolidated balance sheets.\nRefer to Note 3, Derivative Financial Instruments, and Note 5, Inventories, for further discussion of our derivative instruments and green coffee purchase commitments.\nReceivables, net of Allowance for Doubtful Accounts\nOur receivables are mainly comprised of receivables for product and equipment sales to and royalties from our licensees, as well as receivables from our Global Coffee Alliance and other Channel Development customers. Our allowance for doubtful accounts is calculated based on historical experience, customer credit risk and application of the specific identification method. During fiscal 2020, we also assessed incremental risks due to COVID-19 on our licensees' financial viability. For the year ended September 27, 2020, we did not observe a significant deterioration of our receivable portfolio that required a significant increase in bad debt expense. To assist our international licensed partners with their efforts to recover from the impact of COVID-19, we provided a short-term payment extension for their outstanding receivables as of the end of the second quarter of fiscal 2020 and offered longer-term payment extensions to help certain licensees dedicate their capital to further develop stores and build the brand as the business recovers. During the third quarter of fiscal 2020, we waived royalty payments from our international licensees and did not recognize royalty revenues associated with these accounts. We do not believe the terms and forms of these financial relief actions changed our revenue recognition policy or had a significant impact on future collectability. During the fourth quarter of fiscal 2020, we resumed normal royalty billings and collections. As of September 27, 2020 and September 29, 2019, our allowance for doubtful accounts was $27.1 million and $6.7 million, respectively.\nInventories\nInventories are stated at the lower of cost (primarily moving average cost) or net realizable value. We record inventory reserves for obsolete and slow-moving inventory and for estimated shrinkage between physical inventory counts. Inventory reserves are based on inventory obsolescence trends, historical experience and application of the specific identification method. As of September 27, 2020 and September 29, 2019, inventory reserves were $48.4 million and $33.7 million, respectively.\nProperty, Plant and Equipment\nProperty, plant and equipment is carried at cost less accumulated depreciation. Cost includes all direct costs necessary to acquire and prepare assets for use, including internal labor and overhead in some cases. Depreciation is computed using the straight-line method over estimated useful lives of the assets, generally ranging from 2 to 15 years for equipment and 30 to 40 years for buildings. Leasehold improvements are amortized over the shorter of their estimated useful lives or the related lease life, generally 10 years. For leases with renewal periods at our option, we generally use the original lease term, excluding renewal option periods, to determine estimated useful lives. If failure to exercise a renewal option imposes an economic penalty to us, we may determine at the inception of the lease that renewal is reasonably assured and include the renewal option period in the determination of the appropriate estimated useful lives.\nThe portion of depreciation expense related to production and distribution facilities is included in product and distribution costs on our consolidated statements of earnings. The costs of repairs and maintenance are expensed when incurred, while expenditures for refurbishments and improvements that significantly add to the productive capacity or extend the useful life of\nan asset are capitalized. When assets are disposed of, whether through retirement or sale, the net gain or loss is recognized in net earnings. Long-lived assets to be disposed of are reported at the lower of their carrying amount or fair value less estimated costs to sell.\nWe evaluate property, plant and equipment for impairment when facts and circumstances indicate that the carrying values of such assets may not be recoverable. When evaluating for impairment, we first compare the carrying value of the asset to the asset’s estimated future undiscounted cash flows. If the estimated undiscounted future cash flows are less than the carrying value of the asset, we determine if we have an impairment loss by comparing the carrying value of the asset to the asset's estimated fair value and recognize an impairment charge when the asset’s carrying value exceeds its estimated fair value. The fair value of the asset is estimated using a discounted cash flow model based on forecasted future revenues and operating costs, using internal projections. Property, plant and equipment assets and ROU assets related to the store lease are grouped at the lowest level for which identifiable cash flows are largely independent of the cash flows of other assets and liabilities. For company-operated store assets, the impairment test is performed at the individual store asset group level.\nWe recognized net disposition charges of $84.9 million, $64.6 million and $32.8 million in fiscal 2020, 2019 and 2018, respectively. Additionally, we recognized net impairment charges of $210.0 million, $43.4 million and $42.8 million in fiscal 2020, 2019 and 2018, respectively. Of the total net impairment charges, $134.6 million, $7.1 million and $37.0 million in fiscal 2020, 2019 and 2018, respectively, were restructuring related and recorded in restructuring and impairment expenses. For fiscal 2020, we evaluated initial COVID-19 business recovery trends and their estimated impacts on future revenue growth and profitability for assessing impairment of our company-operated retail store and related operating lease right-of-use assets. As a result, we recorded $59.6 million of impairment losses within store operating expenses on our consolidated statement of earnings during the year ended September 27, 2020. Unless it is restructuring related, the nature of the underlying asset that is impaired or disposed of will determine the operating expense line on which the related impact is recorded on our consolidated statements of earnings.\nLeases\nThe majority of our leases are operating leases for our company-operated retail store locations. We also lease, among other things, roasting, distribution and warehouse facilities and office space for corporate administrative purposes.\nWe categorize leases as either operating or finance leases at the commencement date of the lease. Operating lease agreements may contain tenant improvement allowances, rent holidays, rent escalation clauses and/or contingent rent provisions. We have lease agreements with lease and non-lease components, which are accounted for together as a single lease component for all underlying classes of assets.\nWe recognize a ROU asset and lease liability for each operating and finance lease with a contractual term greater than 12 months at the time of lease inception. We do not record leases with an initial term of 12 months or less on our consolidated balance sheet but continue to record rent expense on a straight-line basis over the lease term. Our leases often include options to extend or terminate at our sole discretion, which are included in the determination of lease term when they are reasonably certain to be exercised.\nOur lease liability represents the present value of future lease payments over the lease term. Given our policy election to combine lease and non-lease components, we also consider fixed common area maintenance (“CAM”) part of our fixed future lease payments; therefore, fixed CAM is also included in our lease liability.\nWe cannot determine the interest rate implicit in each of our leases. Therefore, we use market and term-specific incremental borrowing rates. Our incremental borrowing rate for a lease is the rate of interest we expect to pay on a collateralized basis to borrow an amount equal to the lease payments under similar terms. Because we do not borrow on a collateralized basis, we consider a combination of factors, including our credit-adjusted risk-free interest rate, the risk profile and funding cost of the specific geographic market of the lease, the lease term and the effect of adjusting the rate to reflect consideration of collateral. Our credit-adjusted risk-free rate takes into consideration interest rates we pay on our unsecured long-term bonds as well as quoted interest rates obtained from financial institutions.\nTotal lease costs recorded as rent and other occupancy costs include fixed operating lease costs, variable lease costs and short-term lease costs. Most of our real estate leases require we pay certain expenses, such as CAM costs, real estate taxes and other executory costs, of which the fixed portion is included in operating lease costs. We recognize operating lease costs on a straight-line basis over the lease term. In addition to the above costs, variable lease costs also include amounts based on a percentage of gross sales in excess of specified levels and are recognized when probable and are not included in determining the present value of our lease liability. Our lease agreements do not contain any material residual value guarantees or material restrictive covenants. A significant majority of our leases are related to our company-operated stores, and their related costs are recorded within store operating expenses.\nThe ROU asset is measured at the initial amount of the lease liability adjusted for lease payments made at or before the lease commencement date, initial direct costs and any tenant improvement allowances received. For operating leases, ROU assets are\nreduced over the lease term by the recognized straight-line lease expense less the amount of accretion of the lease liability determined using the effective interest method. For finance leases, ROU assets are amortized on a straight-line basis over the shorter of the useful life of the leased asset or the lease term. Interest expense on each finance lease liability is recognized utilizing the effective interest method. ROU assets are tested for impairment in the same manner as long-lived assets.\nAdditionally, we monitor for events or changes in circumstances that may require a reassessment of one of our leases and determine if a remeasurement is required. During fiscal 2020, we received $27.6 million of COVID-19-related rent concessions for stores in our International segment generally correlating with the temporary period our stores were closed. Consistent with updated guidance from the Financial Accounting Standards Board (“FASB”) in April 2020, we elected to treat COVID-19-related rent concessions as variable rent. Rent concessions were recognized as an offset to our rent expense within store operating expenses on our consolidated statement of earnings. See Note 10, Leases, for additional details. Additionally, for the year ended September 27, 2020, we recorded $87.7 million in accelerated amortization and impairment of ROU assets for stores identified for closure under the restructuring of our Americas store portfolio, which were recorded in restructuring and impairments on the consolidated statement of earnings.\nGoodwill\nWe evaluate goodwill for impairment annually during our third fiscal quarter, or more frequently if an event occurs or circumstances change, such as material deterioration in performance or a significant number of store closures, that would indicate that impairment may exist. When evaluating goodwill for impairment, we may first perform a qualitative assessment to determine whether it is more likely than not that a reporting unit is impaired. If we do not perform a qualitative assessment, or if we determine that it is not more likely than not that the fair value of the reporting unit exceeds its carrying amount, we calculate the estimated fair value of the reporting unit. Fair value is typically calculated using a discounted cash flow model. For certain reporting units, where deemed appropriate, we may also utilize a market approach for estimating fair value. If the carrying amount of the reporting unit exceeds the estimated fair value, an impairment charge is recorded to reduce the carrying value to the estimated fair value.\nAs part of our ongoing operations, we may close certain stores within a reporting unit containing goodwill due to underperformance of the store or inability to renew our lease, among other reasons. We may abandon certain assets associated with a closed store, including leasehold improvements and other non-transferable assets. When a portion of a reporting unit that constitutes a business is to be disposed of, goodwill associated with the business is included in the carrying amount of the business in determining any loss on disposal. Our evaluation of whether the portion of a reporting unit being disposed of constitutes a business occurs on the date of abandonment. Although an operating store meets the accounting definition of a business prior to abandonment, it does not constitute a business on the closure date because the remaining assets on that date do not constitute an integrated set of activities (substantive processes) and assets that are capable of being managed for the purpose of providing a return to investors. As a result, when closing individual stores, we do not include goodwill in the calculation of any loss on disposal of the related assets.\nWe recorded no goodwill impairment during fiscal 2020. In fiscal 2019 and 2018, we recorded goodwill impairment of $10.5 million and $37.6 million, respectively. See Note 8, Other Intangible Assets and Goodwill, for further information.\nOther Intangible Assets\nOther intangible assets include finite-lived intangible assets, which mainly consist of acquired and reacquired rights, trade secrets, licensing agreements, contract-based patents and copyrights. These assets are amortized over their estimated useful lives and are tested for impairment using a similar methodology to our property, plant and equipment, as described above.\nIndefinite-lived intangibles, which consist primarily of trade names and trademarks, are tested for impairment annually during the third fiscal quarter, or more frequently if an event occurs or circumstances change that would indicate that impairment may exist. When evaluating other intangible assets for impairment, we may first perform a qualitative assessment to determine whether it is more likely than not that an intangible asset group is impaired. If we do not perform the qualitative assessment, or if we determine that it is not more likely than not that the fair value of the intangible asset group exceeds its carrying amount, we calculate the estimated fair value of the intangible asset group. Fair value is the price a willing buyer would pay for the intangible asset group and is typically calculated using an income approach, such as a relief-from-royalty model. If the carrying amount of the intangible asset group exceeds the estimated fair value, an impairment charge is recorded to reduce the carrying value to the estimated fair value. In addition, we continuously monitor and may revise our intangible asset useful lives if and when facts and circumstances change.\nWe recorded other intangible asset impairment charges of $22.1 million during fiscal 2020. There were no significant other intangible asset impairment charges recorded during fiscal 2019 and 2018. See Note 8, Other Intangible Assets and Goodwill, for further information.\nInsurance Reserves\nWe use a combination of insurance and self-insurance mechanisms, including a wholly-owned captive insurance entity and participation in a reinsurance treaty, to provide for the potential liabilities for certain risks, including workers’ compensation, healthcare benefits, general liability, property insurance and director and officers’ liability insurance. Liabilities associated with the risks that are retained by us are not discounted and are estimated, in part, by considering historical claims experience, demographics, exposure and severity factors and other actuarial assumptions.\nRevenue Recognition\nConsolidated revenues are presented net of intercompany eliminations for wholly-owned subsidiaries and investees controlled by us and for product sales to and royalty and other fees from licensees accounted for under the equity method. Additionally, consolidated revenues are recognized net of any discounts, returns, allowances and sales incentives, including coupon redemptions and rebates.\nCompany-operated Store Revenues\nCompany-operated store revenues are recognized when payment is tendered at the point of sale as the performance obligation has been satisfied. Company-operated store revenues are reported excluding sales, use or other transaction taxes that are collected from customers and remitted to taxing authorities.\nLicensed Store Revenues\nLicensed store revenues consist of product and equipment sales, royalties and other fees paid by licensees using the Starbucks brand. Sales of coffee, tea, food and related products are generally recognized upon shipment to licensees, depending on contract terms. Shipping charges billed to licensees are also recognized as revenue, and the related shipping costs are included in product and distribution costs on our consolidated statements of earnings.\nWe consider pre-opening services, including site evaluation and selection, store architectural/design and development and operational training, to be performance obligations that are separate from the license to operate under the Starbucks brand. These services provide distinct value to our licensees, including business and industry insight and knowledge that transfers value apart from the license. Revenues associated with pre-opening services are recognized upon completion of the related performance obligations, generally when a store is opened. Royalty revenues are recognized based upon a percentage of reported sales, and other continuing fees, such as marketing and service fees, are recognized as the performance obligations are met.\nStored Value Cards\nStored value cards can be activated through various channels, including at our company-operated and most licensed store locations, online at Starbucks.com or via mobile devices held by our customers and at certain other third-party websites and locations, such as grocery stores, although they cannot be reloaded at these third-party websites or locations. Amounts loaded onto stored value cards are initially recorded as deferred revenue and recognized as revenue upon redemption. Historically, the majority of stored value cards are redeemed within one year.\nIn many of our company-owned markets, including the U.S., our stored value cards do not have an expiration date nor do we charge service fees that cause a decrement to customer balances. Based on historical redemption rates, a portion of stored value cards is not expected to be redeemed and will be recognized as breakage over time in proportion to stored value card redemptions. The redemption rates are based on historical redemption patterns for each market, including the timing and business channel in which the card was activated or reloaded, and remittance to government agencies under unclaimed property laws, if applicable.\nBreakage is recognized as company-operated stores and licensed stores revenue within the consolidated statement of earnings beginning in fiscal 2019 in accordance with the revenue recognition guidance that we adopted prospectively during fiscal 2019. For the fiscal years ended September 27, 2020 and September 29, 2019, we recognized breakage revenue of $130.3 million and $125.1 million in company-operated store revenues and $14.3 million and $15.7 million in licensed store revenues, respectively. Prior to the adoption of the new revenue recognition guidance, breakage was recorded using the remote method and recorded in interest income and other, net. In fiscal 2018, we recognized breakage income of $155.9 million.\nLoyalty Program\nCustomers in the U.S., Canada and certain other countries who register their Starbucks Card are automatically enrolled in the Starbucks® Rewards program, which is primarily a spend-based loyalty program. They earn loyalty points (“Stars”) with each purchase at participating Starbucks® stores and when making purchases with the Starbucks-branded credit and debit cards. Beginning in the fourth quarter of fiscal 2020, in addition to using their Starbucks Cards, Starbucks® Rewards members can earn Stars by paying with cash, credit or debit cards, or selected mobile wallets at company-operated stores in the U.S. and Canada. After accumulating a certain number of Stars, the customer earns a reward that can be redeemed for free product that, regardless of where the related Stars were earned within that country, will be honored at company-operated stores and certain participating licensed store locations in that same country.\nWe defer revenue associated with the estimated selling price of Stars earned by Starbucks® Rewards members towards free product as each Star is earned and a corresponding liability is established in deferred revenue. This deferral is based on the estimated value of the product for which the reward is expected to be redeemed, net of estimated unredeemed Stars. Stars generally expire after six months.\nWhen a customer redeems an earned reward, we recognize revenue for the redeemed product and reduce the related deferred revenue. The revenue recognition guidance that we adopted prospectively during fiscal 2019, did not impact the timing or total revenue recognized related to the loyalty program.\nOther Revenues\nOther revenues primarily include royalty revenues, sales of packaged coffee, tea and a variety of ready-to-drink beverages and single-serve coffee and tea products to customers outside of our company-operated and licensed stores. Sales of these products are generally recognized upon shipment to customers, depending on contract terms.\nBeginning in late fiscal 2018, other revenues also include product sales to and licensing revenue from Nestlé related to our Global Coffee Alliance. Product sales to Nestlé are generally recognized when the product is shipped whereas royalty revenues are recognized based on a percentage of reported sales.\nThe adoption of the revenue recognition guidance discussed above did not impact the timing and amount of revenue recognized related to other revenues.\nDeferred Revenues\nOur deferred revenue primarily consists of the up-front prepaid royalty from Nestlé, for which we have continuing performance obligations to support the Global Coffee Alliance, and our unredeemed stored value card liability and unredeemed Stars associated with our loyalty program. See Note 11, Deferred Revenue, for further information.\nDisaggregation of Revenues\nRevenues disaggregated by segment, product type and geographic area are disclosed in Note 17, Segment Reporting.\nProduct and Distribution Costs\nProduct and distribution costs primarily consist of raw materials, purchased goods and packaging costs as well as operational costs of our supply chain organization, such as wages and benefits, occupancy costs and depreciation expenses, in support of sourcing, procuring, manufacturing, warehousing and transportation activities of products sold at our company-operated and licensed stores as well as through Channel Development and our other businesses. Also included are inventory and supply chain asset impairment costs.\nStore Operating Expenses\nStore operating expenses consist of costs incurred in our company-operated stores, primarily wages and benefits related to store partners (employees), occupancy costs and other costs that directly support the operation and sales-related activities of those stores.\nGeneral and Administrative Expenses\nGeneral and administrative expenses primarily consist of wages and benefits, professional service fees and occupancy costs for corporate headquarter and regional offices that support our corporate functions, including technology, finance, legal and partner (employee) resources.\nAdvertising\nWe expense most advertising costs as they are incurred, except for certain production costs that are expensed the first time the advertising takes place. Advertising expenses totaled $258.8 million, $245.7 million and $260.3 million in fiscal 2020, 2019 and 2018, respectively.\nGovernment Subsidies\nOn March 27, 2020, the U.S. government enacted the Coronavirus Aid, Relief and Economic Security Act (“CARES Act”), which among other things, provides employer payroll tax credits for wages paid to employees who are unable to work during the COVID-19 outbreak and options to defer payroll tax payments for a limited period. Based on our evaluation of the CARES Act, we qualify for certain employer payroll tax credits as well as the deferral of payroll tax payments in the future. Additionally, the Canadian government enacted the Canada Emergency Wage Subsidy (“CEWS”) to help employers offset a portion of their employee wages for a limited period. We elected to treat qualified government subsidies from the U.S., Canada and other governments as offsets to the related operating expenses. During fiscal 2020, the qualified payroll credits reduced our store operating expenses by $349.6 million on our consolidated statement of earnings. After netting the qualified U.S. payroll tax credits against our payroll tax payable, we recorded $155.1 million within prepaid expenses and other current assets as of September 27, 2020. As of September 27, 2020, deferred payroll tax payments of $151.0 million were included in other long-term liabilities on our consolidated balance sheets.\nStore Preopening Expenses\nCosts incurred in connection with the start-up and promotion of new company-operated store openings are expensed as incurred.\nAsset Retirement Obligations\nWe recognize a liability for the fair value of required asset retirement obligations (“ARO”) when such obligations are incurred. Our AROs are primarily associated with leasehold improvements, which, at the end of a lease, we are contractually obligated to remove in order to comply with the lease agreement. At the inception of a lease with such conditions, we record an ARO liability and a corresponding capital asset in an amount equal to the estimated fair value of the obligation. We estimate the liability using a number of assumptions, including store closing costs, cost inflation rates and discount rates, and accrete the liability to its projected future value over time. The capitalized asset is depreciated using the same depreciation convention as leasehold improvement assets. Upon satisfaction of the ARO conditions, any difference between the recorded ARO liability and the actual retirement costs incurred is recognized as a gain or loss in store operating expense on our consolidated statements of earnings. As of September 27, 2020 and September 29, 2019, our net ARO assets included in property, plant and equipment were $30.7 million and $23.5 million, respectively, and our net ARO liabilities included in other long-term liabilities were $111.0 million and $95.5 million, respectively.\nStock-based Compensation\nWe maintain several equity incentive plans under which we may grant non-qualified stock options, incentive stock options, restricted stock, restricted stock units (“RSUs”) or stock appreciation rights to employees, non-employee directors and consultants. We also have an employee stock purchase plan (“ESPP”). RSUs issued by us are equivalent to nonvested shares under the applicable accounting guidance. We record stock-based compensation expense based on the fair value of stock awards at the grant date and recognize the expense over the related service period following a graded vesting expense schedule. Expense for performance-based RSUs is recognized when it is probable the performance goal will be achieved. Performance goals are determined by the Board of Directors and may include measures such as earnings per share, operating income and return on invested capital. The fair value of each stock option granted is estimated on the grant date using the Black-Scholes-Merton option valuation model. The assumptions used to calculate the fair value of options granted are evaluated and revised, as necessary, to reflect market conditions and our historical experience. The fair value of RSUs is based on the closing price of Starbucks common stock on the award date, less the present value of expected dividends not received during the vesting period. If applicable, our total shareholder return relative to our peer group is incorporated into the underlying assumptions used to calculate grant date fair value. Compensation expense is recognized over the requisite service period for each separately vesting portion of the award, and only for those awards expected to vest, with forfeitures estimated at the date of grant based on our historical experience and future expectations.\nForeign Currency Translation\nOur international operations generally use their local currency as their functional currency. Assets and liabilities are translated at exchange rates in effect at the balance sheet date. Income and expense accounts are translated at the average monthly exchange rates during the year. Resulting translation adjustments are reported as a component of OCI and recorded in AOCI on our consolidated balance sheets.\nIncome Taxes\nWe compute income taxes using the asset and liability method, under which deferred income taxes are recognized based on the differences between the financial statement carrying amounts and the respective tax bases of our assets and liabilities. Deferred tax assets and liabilities are measured using current enacted tax rates expected to apply to taxable income in the years in which\nwe expect the temporary differences to reverse. The effect of a change in tax rates on deferred taxes is recognized in income in the period that includes the enactment date.\nWe routinely evaluate the likelihood of realizing the benefit of our deferred tax assets and may record a valuation allowance if, based on all available evidence, we determine that some portion of the tax benefit will not be realized. In evaluating our ability to recover our deferred tax assets within the jurisdictions from which they arise, we consider all available positive and negative evidence, including scheduled reversals of deferred tax liabilities, projected future taxable income, tax-planning strategies and results of recent operations. If we determine that we would be able to realize our deferred tax assets in the future in excess of their net recorded amount, we would make an adjustment to the deferred tax asset valuation allowance, which would reduce the provision for income taxes.\nIn addition, our income tax returns are periodically audited by domestic and foreign tax authorities. These audits include review of our tax filing positions, including the timing and amount of deductions taken and the allocation of income between tax jurisdictions. We evaluate our exposures associated with our various tax filing positions and recognize a tax benefit from an uncertain tax position only if it is more likely than not that the tax position will be sustained upon examination by the relevant taxing authorities, including resolutions of any related appeals or litigation processes, based on the technical merits of our position. The tax benefits recognized in the financial statements from such a position are measured based on the largest benefit that has a greater than 50% likelihood of being realized upon ultimate settlement. For uncertain tax positions that do not meet this threshold, we record a related liability. We adjust our unrecognized tax benefit liability and income tax expense in the period in which the uncertain tax position is effectively settled, the statute of limitations expires for the relevant taxing authority to examine the tax position or when new information becomes available.\nStarbucks recognizes interest and penalties related to income tax matters in income tax expense on our consolidated statements of earnings. Accrued interest and penalties are included within the related tax balances on our consolidated balance sheets.\nGlobal intangible low-taxed income (“GILTI”) provisions are applied, providing an incremental tax on foreign income. We have made a policy election to classify taxes due under the GILTI provision as a current period expense.\nEarnings per Share\nBasic earnings per share is computed based on the weighted average number of shares of common stock outstanding during the period. Diluted earnings per share is computed based on the weighted average number of shares of common stock and the effect of dilutive potential common shares outstanding during the period, calculated using the treasury stock method. Dilutive potential common shares include outstanding stock options and RSUs. Performance-based RSUs are considered dilutive when the related performance criterion has been met.\nCommon Stock Share Repurchases\nWe may repurchase shares of Starbucks common stock under a program authorized by our Board of Directors, including pursuant to a contract, instruction or written plan meeting the requirements of Rule 10b5-1(c)(1) of the Securities Exchange Act of 1934. Under applicable Washington State law, shares repurchased are retired and not displayed separately as treasury stock on the financial statements. Instead, the par value of repurchased shares is deducted from common stock and the excess repurchase price over par value is deducted from additional paid-in capital and from retained earnings.\nRecent Accounting Pronouncements\nRecently Adopted Accounting Pronouncements\nIn the second quarter of fiscal 2020, we adopted the new guidance from the FASB on simplifying the accounting for income taxes by removing certain exceptions to the general principles. The guidance was adopted on a prospective basis and had no material impact on the consolidated financial statements.\nOn September 30, 2019, we adopted the new guidance from the FASB on the recognition and measurement of leases utilizing the modified retrospective approach. As a result, the prior period information reported under the previous lease guidance has not been restated.\nAs permitted under the new FASB lease guidance, we elected the package of practical expedients, which allowed us to retain our prior conclusions regarding lease identification, classification and initial direct costs. For our lease agreements with lease and non-lease components, we elected the practical expedient to account for these as a single lease component for all underlying classes of assets. For our adoption, we did not elect to use hindsight for our existing leases. Additionally, for short-term leases with an initial lease term of 12 months or less and with purchase options we are reasonably certain will not be exercised, we elected to not record right-of-use assets or corresponding lease obligations on our consolidated balance sheet. We will continue to record rent expense for each short-term lease on a straight-line basis over the lease term.\nThe new FASB lease guidance had a material impact on our consolidated balance sheet; however, it did not have a material impact on our consolidated statement of earnings. The most material impact was the recognition of right-of-use assets of\n$8.4 billion upon adoption, with corresponding lease liabilities of $9.0 billion relating to our operating leases. Existing deferred rent and tenant improvement allowances of approximately $568.0 million, previously recorded within other long-term liabilities, were recorded as an offset to our gross operating lease right-of-use assets. Additionally, pursuant to the transition guidance, we derecognized build-to-suit lease assets, previously recorded in property, plant and equipment, net, along with the corresponding liabilities on the consolidated balance sheet as of September 30, 2019. Accordingly, these leases have been recorded as operating leases as of the adoption date and are now included in operating lease, right-of-use assets and operating lease liabilities on the consolidated balance sheet. As of the adoption date, accumulated deficit within shareholder's equity on our consolidated balance sheet decreased by $17.3 million, primarily related to the derecognition of build-to-suit leasing arrangements.\nIn the first quarter of fiscal 2020, we adopted the new guidance from the FASB on the reclassification of certain tax effects from accumulated other comprehensive income (loss) (“AOCI”) which permits entities to reclassify the stranded tax effects resulting from the Tax Cuts and Jobs Act (the “Tax Act”) from AOCI to retained earnings. The guidance was adopted prospectively with no material impact on the consolidated financial statements as of September 27, 2020.\nRecent Accounting Pronouncements Not Yet Adopted\nIn March 2020, the FASB issued guidance related to reference rate reform. The pronouncement provides temporary optional expedients and exceptions to the current guidance on contract modifications and hedge accounting to ease the financial reporting burden related to the expected market transition from the London Interbank Offered Rate (“LIBOR”) and other interbank offered rates to alternative reference rates. The guidance was effective upon issuance and generally can be applied to applicable contract modifications through December 31, 2022. We are currently evaluating the impact of the transition from LIBOR to alternative reference rates but do not expect a significant impact to our consolidated financial statements.\nIn June 2016, the FASB issued guidance replacing the incurred loss impairment methodology with a new methodology that reflects Current Expected Credit Losses on financial assets, including receivables and available-for-sale securities. The new methodology requires entities to estimate and recognize expected credit losses each reporting period. The guidance will be applied under the modified retrospective approach and will be effective at the beginning of our first quarter of fiscal 2021. We do not expect a material impact to our consolidated financial statements upon adoption.\nNote 2: Acquisitions, Divestitures and Strategic Alliance\nFiscal 2019\nIn the third quarter of fiscal 2019, we sold our company-operated retail business in Thailand to Coffee Concepts Thailand, a joint-venture between Maxim's Caterers Limited and F&N Retail Connection Co. Ltd, converting this operation to a fully licensed market. This transaction resulted in a pre-tax gain of $601.9 million, which was included in net gains resulting from divestiture of certain operations on our consolidated statements of earnings.\nIn the second quarter of fiscal 2019, we sold our company-operated retail businesses in France and the Netherlands to Alsea, S.A.B. de C.V. converting these operations to fully licensed markets. These transactions did not have a material impact on our consolidated financial statements.\nFiscal 2018\nWe entered into an agreement on May 6, 2018 to establish the Global Coffee Alliance with Nestlé. On August 26, 2018, Nestlé licensed the rights to market, sell and distribute Starbucks consumer packaged goods and foodservice products in authorized channels. We received an up-front payment of approximately $7 billion consisting primarily of prepaid royalties which was recorded to current and long-term deferred revenue. See Note 1, Summary of Significant Accounting Policies, for the accounting treatment. Also see Note 11, Deferred Revenue.\nOn March 23, 2018, we sold our company-operated retail store assets and operations in Brazil to SouthRock, converting these operations to a fully licensed market. This transaction did not have a material impact on our consolidated financial statements.\nOn December 31, 2017, we acquired the remaining 50% interest of our East China joint venture (“East China”) from President Chain Store (Hong Kong) Holding Ltd. and Kai Yu (BVI) collectively, “Uni-President Group” or “UPG”, for approximately $1.4 billion. Approximately $90.5 million of pre-existing liabilities owed by East China to Starbucks were effectively settled upon the acquisition. Acquiring the remaining interest of East China, which at the time operated over 1,400 stores in the Shanghai, Jiangsu and Zhejiang Provinces, built on the Company's ongoing investment in China. The estimated fair values of the assets acquired and liabilities assumed are based on valuation and analysis performed by management.\nConcurrently with the purchase of our East China joint venture, we sold our 50% interest in President Starbucks Coffee Taiwan Limited, our joint venture operations in Taiwan, to UPG for approximately $181.2 million. The transaction resulted in a pre-tax gain of $156.6 million which was included in net gain resulting from divestiture of certain operations on our consolidated statements of earnings.\nThe following table summarizes the preliminary allocation of the total consideration to the fair values of the assets acquired and liabilities assumed as of December 31, 2017, which are reported within our International segment (in millions):\nAs a result of this acquisition, we remeasured the carrying value of our preexisting 50% equity method investment to fair value, which resulted in a total gain of $1.4 billion that is not subject to income tax, and was presented as gain resulting from acquisition of joint venture on our consolidated statements of earnings. The fair value of $1.4 billion was calculated using an income approach, which was based on significant inputs that are not observable in the market and thus represents a fair value measurement categorized within Level 3 of the fair value hierarchy. Key assumptions used in estimating future cash flows included projected revenue growth and operating expenses, as well as the selection of an appropriate discount rate. Estimates of revenue growth and operating expenses were based on internal projections and considered the historical performance of stores, local market economics and the business environments impacting store performance. The discount rate applied was based on East China's weighted-average cost of capital and included company-specific and size risk premiums.\nThe assets acquired and liabilities assumed are reported within our International segment. Other current and long-term assets acquired primarily include lease deposits and prepaid rent. Accrued liabilities and other long-term liabilities assumed primarily include deferred income tax, dividend payable, accrued payroll, income tax payable and accrued occupancy costs.\nThe definite-lived intangibles primarily relate to reacquired rights to operate stores exclusively in East China. The reacquired rights of $798.0 million represent the fair value calculated over the remaining original contractual period and will be amortized on a straight-line basis through September 2022. Amortization expense for these definite-lived intangible assets was $160.6 million and $163.8 million for fiscal 2020 and 2019, respectively. The estimated future amortization expense is approximately $157.8 million and $154.4 million in fiscal 2021 and 2022, respectively.\nGoodwill represents the intangible assets that do not qualify for separate recognition and primarily includes the acquired customer base, the acquired workforce including store partners in the region that have strong relationships with these customers and the existing geographic retail and online presence. The entire balance was allocated to the International segment and is not deductible for income tax purposes. Due to foreign currency translation, the balance of goodwill related to the acquisition decreased $102.8 million since the date of acquisition to $2.1 billion as of September 27, 2020.\nWe began consolidating East China's results of operations and cash flows into our consolidated financial statements after December 31, 2017. For the year ended September 30, 2018, East China's revenue included in our consolidated statements of earnings was $903.0 million. For the year ended September 30, 2018, East China's net earnings included in our consolidated statements of earnings was $73.1 million.\nThe following table provides the supplemental pro forma revenue and net earnings of the combined entity had the acquisition date of East China been October 3, 2016, the first day of our first quarter of fiscal 2017, rather than the end of our first quarter of fiscal 2018 (in millions):\nThe amounts in the supplemental pro forma earnings for the periods presented above fully eliminate intercompany transactions, apply our accounting policies and reflect adjustments for additional occupancy costs as well as depreciation and amortization that would have been charged assuming the same fair value adjustments to leases, property, plant and equipment and acquired intangibles had been applied on October 3, 2016. These pro forma results are unaudited and are not necessarily indicative of results of operations that would have occurred had the acquisition actually closed in the prior period or indicative of the results of operations for any future period.\nDuring the year ended September 30, 2018, we incurred approximately $3.6 million of acquisition-related costs, such as regulatory, legal and advisory fees, which were recorded in general and administrative expenses.\nIn the first quarter of fiscal 2018, we sold the assets associated with our Tazo brand including Tazo® signature recipes, intellectual property and inventory to Unilever for a total of $383.8 million. The transaction resulted in a pre-tax gain of $347.9 million, which was included in the net gain from divestiture of certain operations on our consolidated statements of earnings. Results from Tazo operations prior to the sale were reported primarily in Channel Development.\nNote 3: Derivative Financial Instruments\nInterest Rates\nFrom time to time, we enter into designated cash flow hedges to manage the variability in cash flows due to changes in benchmark interest rates. We enter into interest rate swap agreements and treasury locks, which are synthetic forward sales of U.S. treasury securities settled in cash based upon the difference between an agreed-upon treasury rate and the prevailing treasury rate at settlement. These agreements are cash settled at the time of the pricing of the related debt. Each derivative agreement's gain or loss is recorded in AOCI and is subsequently reclassified to interest expense over the life of the related debt.\nTo hedge the exposure to changes in the fair value of our fixed-rate debt, we enter into interest rate swap agreements, which are designated as fair value hedges. The changes in fair values of these derivative instruments and the offsetting changes in fair values of the underlying hedged debt due to changes in the relevant benchmark interest rates are recorded in interest expense. Refer to Note 9, Debt, for additional information on our long-term debt.\nForeign Currency\nTo reduce cash flow volatility from foreign currency fluctuations, we enter into forward and swap contracts to hedge portions of cash flows of anticipated intercompany royalty payments, inventory purchases and intercompany borrowing and lending activities. The resulting gains and losses from these derivatives are recorded in AOCI and subsequently reclassified to revenue, product and distribution costs, or interest income and other, net, respectively, when the hedged exposures affect net earnings.\nFrom time to time, we may enter into financial instruments, including, but not limited to, forward and swap contracts or foreign currency-denominated debt, to hedge the currency exposure of our net investments in certain international operations. The resulting gains and losses from these derivatives are recorded in AOCI and are subsequently reclassified to net earnings when the hedged net investment is either sold or substantially liquidated.\nForeign currency forward and swap contracts not designated as hedging instruments are used to mitigate the foreign exchange risk of certain other balance sheet items. Gains and losses from these derivatives are largely offset by the financial impact of translating foreign currency-denominated payables and receivables; these gains and losses are recorded in interest income and other, net.\nCommodities\nDepending on market conditions, we may enter into coffee forward contracts, futures contracts and collars to hedge anticipated cash flows under our price-to-be-fixed green coffee contracts, which are described further in Note 5, Inventories, or our longer-dated forecasted coffee demand where underlying fixed price and price-to-be-fixed contracts are not yet available. The resulting gains and losses are recorded in AOCI and are subsequently reclassified to product and distribution costs when the hedged exposure affects net earnings.\nDepending on market conditions, we may also enter into dairy forward contracts and futures contracts to hedge a portion of anticipated cash flows under our dairy purchase contracts and our forecasted dairy demand. The resulting gains or losses are recorded in AOCI and are subsequently reclassified to product and distribution costs when the hedged exposure affects net earnings.\nCash flow hedges related to anticipated transactions are designated and documented at the inception of each hedge. Cash flows from hedging transactions are classified in the same categories as the cash flows from the respective hedged items. For de-designated cash flow hedges in which the underlying transactions are no longer probable of occurring, the related accumulated derivative gains or losses are recognized in interest income and other, net on our consolidated statements of earnings. During the second, third and fourth quarters of fiscal 2020, we de-designated certain cash flow hedges due to the global COVID-19 impacts, resulting in the release of an insignificant net gain from AOCI to our consolidated statement of earnings. We continue to believe forecasted exposures relating to our other designated cash flow hedges are probable of occurring.\nTo mitigate the price uncertainty of a portion of our future purchases, including diesel fuel and other commodities, we enter into swap contracts, futures and collars that are not designated as hedging instruments. The resulting gains and losses are recorded in interest income and other, net to help offset price fluctuations on our beverage, food, packaging and transportation costs, which are included in product and distribution costs on our consolidated statements of earnings.\nGains and losses on derivative contracts and foreign currency-denominated debt designated as hedging instruments included in AOCI and expected to be reclassified into earnings within 12 months, net of tax (in millions):\nPre-tax gains and losses on derivative contracts and foreign currency-denominated long-term debt designated as hedging instruments recognized in OCI and reclassifications from AOCI to earnings (in millions):\n(1)As a result of the global COVID-19 impacts, we discontinued cash flow hedges during the year ended September 27, 2020.\nPre-tax gains and losses on non-designated derivatives and designated fair value hedging instruments and the related fair value hedged item recognized in earnings (in millions):\nNotional amounts of outstanding derivative contracts (in millions):\nFair value of outstanding derivative contracts (in millions) including the location of the asset and/or liability on the consolidated balance sheets:\nThe following amounts were recorded on the consolidated balance sheets related to fixed-to-floating interest rate swaps designated in fair value hedging relationships:\nAdditional disclosures related to cash flow gains and losses included in AOCI, as well as subsequent reclassifications to earnings, are included in Note 12, Equity.\nNote 4: Fair Value Measurements\nAssets and Liabilities Measured at Fair Value on a Recurring Basis (in millions):\nThere were no material transfers between levels and there was no significant activity within Level 3 instruments during the periods presented. The fair values of any financial instruments presented above exclude the impact of netting assets and liabilities when a legally enforceable master netting agreement exists.\nAvailable-for-sale Debt Securities\nLong-term investments generally mature within 4 years. Proceeds from sales of securities were $177.4 million, $291.1 million and $459.0 million for fiscal 2020, 2019 and 2018, respectively. Realized gains and losses were not material for fiscal 2020, 2019 and 2018. Gross unrealized holding gains and losses were not material as of September 27, 2020 and September 29, 2019.\nMarketable Equity Securities\nMarketable equity securities include equity mutual funds and exchange-traded funds. Our marketable equity securities portfolio approximates a portion of our liability under our MDCP, a defined contribution plan. Our MDCP liability was $91.4 million and $92.1 million as of September 27, 2020 and September 29, 2019, respectively. The changes in net unrealized holding gains and losses in the marketable equity securities portfolio included in earnings for fiscal 2020, 2019 and 2018 were not material. Gross unrealized holding gains and losses on marketable equity securities were not material as of September 27, 2020 and September 29, 2019.\nDerivative Assets and Liabilities\nDerivative assets and liabilities include foreign currency forward contracts, commodity futures contracts, collars and swaps, which are described further in Note 3, Derivative Financial Instruments.\nAssets and Liabilities Measured at Fair Value on a Nonrecurring Basis\nAssets and liabilities recognized or disclosed at fair value on a nonrecurring basis include items such as property, plant and equipment, goodwill and other intangible assets, equity and other investments and other assets. These assets are measured at fair value if determined to be impaired. Impairment of property, plant and equipment and ROU assets is included in Note 1, Summary of Significant Accounting Policies.\nOther than the impairments discussed in Note 8, Other Intangible Assets and Goodwill, and the aforementioned fair value adjustments, there were no other material fair value adjustments during fiscal 2020 and 2019.\nFair Value of Other Financial Instruments\nThe estimated fair value of our long-term debt based on the quoted market price (Level 2) is included at Note 9, Debt.\nNote 5: Inventories (in millions)\nOther merchandise held for sale includes, among other items, serveware, food and tea. Inventory levels vary due to seasonality, commodity market supply and price fluctuations.\nAs of September 27, 2020, we had committed to purchasing green coffee totaling $687 million under fixed-price contracts and an estimated $458 million under price-to-be-fixed contracts. A portion of our price-to-be-fixed contacts are effectively fixed through the use of futures. See Note 3, Derivative Financial Instruments for further discussion. Price-to-be-fixed contracts are purchase commitments whereby the quality, quantity, delivery period and other negotiated terms are agreed upon, but the date, and therefore the price, at which the base “C” coffee commodity price component will be fixed has not yet been established. For most contracts, either Starbucks or the seller has the option to “fix” the base “C” coffee commodity price prior to the delivery date. For other contracts, Starbucks and the seller may agree upon pricing parameters determined by the base “C” coffee commodity price. Until prices are fixed, we estimate the total cost of these purchase commitments. We believe, based on relationships established with our suppliers in the past and continuous monitoring of the business environment, the risk of non-delivery on these purchase commitments is remote.\nDuring fiscal 2020, we wrote off approximately $50 million of inventory in the second quarter that was expiring or expected to expire due to COVID-19 related store closures, primarily perishable food and beverage ingredients located at our stores, distribution centers and suppliers. This was included in product and distribution costs on our consolidated statement of earnings. We did not record significant write-offs related to COVID-19 during the second half of the fiscal year.\nNote 6: Equity Investments (in millions)\nEquity Method Investments\nAs of September 27, 2020, we had 50% ownership interests in Starbucks Coffee Korea Co., Ltd. and Tata Starbucks Limited (India). These international entities operate licensed Starbucks® retail stores.\nWe also license the rights to produce and distribute Starbucks-branded p roducts to our 50% owned joint venture, The North American Coffee Partnership with the Pepsi-Cola Company, which develops and distributes bottled Starbucks® beverages, including Frappuccino® coffee drinks, Starbucks Doubleshot® espresso drinks, Starbucks Refreshers® beverages, Starbucks® Iced Espresso Classics and Starbucks® Iced Coffee.\nOur share of income and losses from our equity method investments is included in income from equity investees on our consolidated statements of earnings. Also included in this line item is our proportionate share of gross profit resulting from coffee and other product sales to, and royalty and license fee revenues generated from, equity investees. Revenues generated from these entities were $123.9 million, $130.7 million and $112.8 million in fiscal 2020, 2019 and 2018, respectively. Related\nproduct and distribution costs were $79.8 million, $73.2 million and $71.5 million in fiscal 2020, 2019 and 2018, respectively. As of September 27, 2020 and September 29, 2019, there were $28.7 million and $35.5 million of accounts receivable from equity investees, respectively, on our consolidated balance sheets, primarily related to product sales and royalty revenues.\nOther Investments\nWe have equity interests in entities that develop and operate Starbucks licensed stores in several global markets, as well as in companies that support our strategic initiatives. We do not have significant influence over these entities and their fair values are not readily determinable. Therefore, we elected to measure these investments at cost with adjustments for observable changes in price or impairment.\nNote 7: Supplemental Balance Sheet and Statement of Earnings Information (in millions)\nPrepaid Expenses and Other Current Assets\nProperty, Plant and Equipment, net\nAccrued Liabilities\nStore Operating Expenses\nNote 8: Other Intangible Assets and Goodwill\nDuring the third quarter of fiscal 2020, we completed our annual goodwill impairment analysis. The results of our analysis indicated significant excess fair values over carrying values across the different reporting units, and therefore no goodwill impairment was recorded. Due to changes in branding and marketing strategy, certain indefinite-lived intangible assets became definite-lived. As a result, approximately $105.5 million was reclassified primarily into Trade names, trademarks and patents within the Finite-Lived Intangible Assets table below. We estimated the fair values of these assets under an income approach with an average remaining useful life of approximately five years. The analysis indicated that the fair value of one of the assets exceeded its carrying value. As a result, we recorded a charge of $22.1 million to restructuring and impairments on our consolidated statement of earnings during the third quarter of fiscal 2020. For our remaining intangible assets, our analysis did not indicate further impairment.\nIndefinite-Lived Intangible Assets\nAdditional disclosure regarding changes in our intangible assets due to acquisitions is included at Note 2, Acquisitions, Divestitures and Strategic Alliance.\nFinite-Lived Intangible Assets\nAmortization expense for finite-lived intangible assets was $223.7 million, $232.8 million and $186.5 million during fiscal 2020, 2019 and 2018, respectively.\nEstimated future amortization expense as of September 27, 2020 (in millions):\nGoodwill\nChanges in the carrying amount of goodwill by reportable operating segment (in millions):\n(1)For fiscal 2020 and 2019, “Other” primarily consists of foreign currency translation.\nNote 9: Debt\nRevolving Credit Facility\nOur $2.0 billion unsecured 5-year revolving credit facility (the “2018 credit facility”) and our $1.0 billion unsecured 364-Day credit facility (the “364-day credit facility”) are available for working capital, capital expenditures and other corporate purposes, including acquisitions and share repurchases.\nThe 2018 credit facility, of which $150 million may be used for issuances of letters of credit, is currently set to mature on October 25, 2022. We have the option, subject to negotiation and agreement with the related banks, to increase the maximum commitment amount by an additional $500 million. Borrowings under the credit facility will bear interest at a variable rate based on LIBOR, and, for U.S. dollar-denominated loans under certain circumstances, a Base Rate (as defined in the credit facility), in each case plus an applicable margin. The applicable margin is based on the better of (i) the Company's long-term credit ratings assigned by Moody's and Standard & Poor's rating agencies and (ii) the Company's fixed charge coverage ratio, pursuant to a pricing grid set forth in the five-year credit agreement. The current applicable margin is 1.100% for Eurocurrency Rate Loans and 0.000% (nil) for Base Rate Loans.\nThe 364-day credit facility, of which no amount may be used for issuances of letters of credit, has been extended to mature on September 22, 2021. We have the option, subject to negotiation and agreement with the related banks, to increase the maximum commitment amount by an additional $500 million. Borrowings under the credit facility bear interest at a variable rate based on LIBOR, and, for U.S. dollar-denominated loans under certain circumstances, a Base Rate (as defined in the credit facility), in each case plus an applicable margin. The applicable margin is based on the better of (i) the Company's long-term credit ratings assigned by Moody's and Standard & Poor's rating agencies and (ii) the Company's fixed charge coverage ratio, pursuant to a pricing grid set forth in the 364-day credit agreement. The applicable margin is 1.150% for Eurocurrency Rate Loans and 0.150% for Base Rate Loans.\nBoth credit facilities contain provisions requiring us to maintain compliance with certain covenants, including a minimum fixed charge coverage ratio, which measures our ability to cover financing expenses. As of September 27, 2020, we were in compliance with all applicable covenants. No amounts were outstanding under our 2018 credit facility or our 364-day credit facility as of September 27, 2020.\nShort-term Debt\nUnder our commercial paper program, we may issue unsecured commercial paper notes up to a maximum aggregate amount outstanding at any time of $3.0 billion, with individual maturities that may vary but not exceed 397 days from the date of issue. Amounts outstanding under the commercial paper program are required to be backstopped by available commitments under our credit facility discussed above. The proceeds from borrowings under our commercial paper program may be used for working capital needs, capital expenditures and other corporate purposes, including, but not limited to, business expansion, payment of cash dividends on our common stock and share repurchases. As of September 27, 2020, we had $296.5 million borrowings outstanding under the program, net of unamortized discount, of which a majority matures in the second quarter of fiscal 2021.\nDuring the third quarter of fiscal 2020, we expanded our ¥1 billion unsecured credit facility to ¥5 billion, or $47.4 million. This facility is currently set to mature on December 31, 2020. Borrowings under the credit facility are subject to terms defined within the facility and will bear interest at a variable rate based on TIBOR plus an applicable margin of 0.400%. Additionally during the third quarter, we expanded our ¥2 billion unsecured credit facility to ¥10 billion, or $94.9 million. This facility is currently\nset to mature on March 26, 2021. Borrowings under the credit facility are subject to terms defined within the facility and will bear interest at a variable rate based on TIBOR plus 0.300%. As of September 27, 2020, we had ¥15 billion, or $142.3 million, of borrowings outstanding under these Japanese Yen-denominated credit facilities.\nLong-term Debt\nComponents of long-term debt including the associated interest rates and related fair values by calendar maturity (in millions, except interest rates):\n(1)Includes the effects of the amortization of any premium or discount and any gain or loss upon settlement of related treasury locks or forward-starting interest rate swaps utilized to hedge the interest rate risk prior to the debt issuance.\n(2)Amount includes the change in fair value due to changes in benchmark interest rates related to our October 2023 notes. Refer to Note 3, Derivative Financial Instruments, for additional information on our interest rate swap designated as a fair value hedge.\n(3)Japanese yen-denominated long-term debt.\n(4)Issued in March 2020.\n(5)Issued in May 2020.\nThe following table summarizes our long-term debt maturities as of September 27, 2020 by fiscal year (in millions):\nNote 10: Leases\nThe components of lease costs (in millions):\n(1)Operating lease costs includes an immaterial amount of sublease income.\nThe following table includes supplemental information (in millions):\n(1)Excludes the initial impact of adoption. See Note 1, Summary of Significant Accounting Policies for additional information.\nFinance lease assets are recorded in property, plant and equipment, net with the corresponding lease liabilities included in accrued liabilities on the consolidated balance sheet. Finance leases were immaterial as of September 27, 2020.\nMinimum future maturities of operating lease liabilities (in millions):\nAs of September 27, 2020, we have entered into operating leases that have not yet commenced of $653.8 million, primarily related to real estate leases. These leases will commence between fiscal year 2021 and fiscal year 2026 with lease terms of 3\nyears to 20 years. A charge of $87.7 million in accelerated amortization and impairment of ROU assets was recorded in restructuring and impairments on the consolidated statement of earnings in fiscal 2020.\nPrevious Lease Guidance Disclosures\nRent expense under operating lease agreements under the previous lease guidance, which excludes certain amounts required under the new guidance (in millions):\nAs previously disclosed, the minimum future rental payments under non-cancelable operating leases and lease financing arrangements under the previous lease guidance as of September 29, 2019 (in millions):\nWe have subleases related to certain of our operating leases. During fiscal 2019 and 2018, we recognized sublease income of $10.9 million and $12.3 million, respectively. Additionally, as of September 29, 2019 and September 30, 2018, the gross carrying values of assets related to build-to-suit lease arrangements accounted for as financing leases were $122.3 million and $103.2 million, respectively, with associated accumulated depreciation of $17.2 million and $12.7 million, respectively. Lease exit costs associated with our restructuring efforts primarily relate to the closure of Teavana retail stores and certain Starbucks company-operated stores, and are recognized concurrently with actual store closures. Total lease exit costs of $55.3 million and $119.3 million were recorded in restructuring and impairments on the consolidated statement of earnings in fiscal 2019 and 2018.\nNote 11: Deferred Revenue\nIn the fourth quarter of fiscal 2018, we licensed the rights to sell and market our products in authorized channels through the Global Coffee Alliance, and received an up-front prepaid royalty from Nestlé. The up-front payment of approximately $7 billion was recorded as deferred revenue as we have continuing performance obligations to support the Global Coffee Alliance, including providing Nestlé access to certain intellectual properties and products for future resale. The up-front payment will be recognized as other revenue on a straight-line basis over the estimated economic life of the arrangement of 40 years for the ongoing access to the licenses within the contractual territories. Our obligations to maintain the Starbucks brand and other intellectual properties are generally constant throughout the term of the arrangement. Therefore, a ratable recognition pattern is reflective of how we satisfy our performance obligations.\nAt September 27, 2020, the current and long-term deferred revenue related to the Nestlé up-front payment was $179.3 million and $6.5 billion, respectively. At September 29, 2019, the current and long-term deferred revenue related to the Nestlé up-front payment was $175.9 million and $6.7 billion, respectively. During the fiscal years ended September 27, 2020 and September 29, 2019, we recognized $176.8 million and $175.2 million of current deferred revenue, respectively, related to amortization of the up-front payment.\nChanges in our deferred revenue balance related to our stored value cards and loyalty program (in millions):\n(1)“Other” primarily consists of changes in the stored value cards and loyalty program balances resulting from foreign currency translation.\n(2)As of September 27, 2020, approximately $1.2 billion of this amount was current. As of September 29, 2019, approximately $1.0 billion of this amount was current.\nNote 12: Equity\nIn addition to 2.4 billion shares of authorized common stock with $0.001 par value per share, we have authorized 7.5 million shares of preferred stock, none of which was outstanding at September 27, 2020.\nThrough open market transactions under our share repurchase program, we repurchased 131.5 million shares of common stock at a total cost of $7.2 billion for the year ended September 30, 2018.\nIn September 2018, we entered into accelerated share repurchase agreements (“ASR agreements”) with third-party financial institutions totaling $5.0 billion, effective October 1, 2018. We made a $5.0 billion up-front payment to the financial institutions and received an initial delivery of 72.0 million shares. In March 2019, we received an additional 4.9 million shares upon the completion of the program based on a volume-weighted average share price (less discount) of $65.03.\nIn March 2019, we entered into ASR agreements with third-party financial institutions totaling $2.0 billion, effective March 22, 2019. We made a $2.0 billion up-front payment to the financial institutions and received an initial delivery of 22.2 million shares. In June 2019, we received an additional 3.9 million shares upon the completion of the program based on a volume-weighted average share price (less discount) of $76.50.\nOutside of the ASR agreements noted above, we repurchased 36.6 million shares of common stock for $3.1 billion on the open market during the year ended September 29, 2019. In total, we repurchased 139.6 million shares at a total cost of $10.1 billion for the year ended September 29, 2019.\nOur Board of Directors authorized the repurchase of up to an additional 120 million and 40 million shares under our ongoing share repurchase program during the fiscal first quarter of 2019 and fiscal second quarter of 2020, respectively. We temporarily suspended share repurchases in March 2020. We repurchased 20.3 million shares of common stock for $1.7 billion on the open market during the year ended September 27, 2020. As of September 27, 2020, 48.9 million shares remained available for repurchase under current authorizations.\nSubsequent to the fourth quarter of fiscal 2020, our Board of Directors declared a quarterly cash dividend to shareholders of $0.45 per share to be paid on November 27, 2020 to shareholders of record as of the close of business on November 12, 2020.\nComprehensive Income\nComprehensive income includes all changes in equity during the period, except those resulting from transactions with our shareholders. Comprehensive income is comprised of net earnings and other comprehensive income. Accumulated other comprehensive income reported on our consolidated balance sheets consists of foreign currency translation adjustments and other items and the unrealized gains and losses, net of applicable taxes, on available-for-sale debt securities and on derivative instruments designated and qualifying as cash flow and net investment hedges.\nChanges in AOCI by component for the years ended September 27, 2020, September 29, 2019 and September 30, 2018, net of tax, are as follows:\nImpact of reclassifications from AOCI on the consolidated statements of earnings (in millions):\n(1) Release of cumulative translation adjustments to earnings upon sale or liquidation of foreign businesses.\nNote 13: Employee Stock and Benefit Plans\nWe maintain several equity incentive plans under which we may grant non-qualified stock options, incentive stock options, restricted stock, restricted stock units (“RSUs”) or stock appreciation rights to employees, non-employee directors and consultants. We issue new shares of common stock upon exercise of stock options and the vesting of RSUs. We also have an employee stock purchase plan (“ESPP”).\nAs of September 27, 2020, there were 46.5 million shares of common stock available for issuance pursuant to future equity-based compensation awards and 11.9 million shares available for issuance under our ESPP.\nStock-based compensation expense recognized in the consolidated financial statements (in millions):\nStock Option Plans\nWe provide stock options as a form of employee compensation, which are primarily time-vested. The majority of time-vested options become exercisable in four equal installments beginning a year from the grant date and generally expire 10 years from the grant date. Options granted to non-employee directors generally vest immediately or one year from grant. All outstanding stock options are non-qualified stock options.\nThe fair value of stock option awards was estimated at the grant date with the following weighted average assumptions for fiscal 2020, 2019 and 2018:\nThe expected term of the options represents the estimated period of time until exercise and is based on historical experience of similar awards, giving consideration to the contractual terms, vesting schedules and expectations of future employee behavior. Expected stock price volatility is based on a combination of historical volatility of our stock and the one-year implied volatility of Starbucks traded options, for the related vesting periods. The risk-free interest rate is based on the implied yield available on U.S. Treasury zero-coupon issues with an equivalent remaining term. The dividend yield assumption is based on our anticipated cash dividend payouts. The amounts shown above for the estimated fair value per option granted are before the estimated effect of forfeitures, which reduce the amount of expense recorded in the consolidated statements of earnings.\nStock option transactions for the year ended September 27, 2020 (in millions, except per share and contractual life amounts):\nThe aggregate intrinsic value in the table above, which is the amount by which the market value of the underlying stock exceeded the exercise price of outstanding options, is before applicable income taxes and represents the amount optionees would have realized if all in-the-money options had been exercised on the last business day of the period indicated.\nAs of September 27, 2020, total unrecognized stock-based compensation expense, net of estimated forfeitures, related to nonvested options was approximately $1 million, before income taxes, and is expected to be recognized over a weighted average period of approximately 1.0 year. The total intrinsic value of options exercised was $236 million, $466 million and\n$236 million during fiscal 2020, 2019 and 2018, respectively. The total fair value of options vested was $25 million, $31 million and $53 million during fiscal 2020, 2019 and 2018, respectively.\nRSUs\nWe have both time-vested and performance-based RSUs. Time-vested RSUs are awarded to eligible employees and entitle the grantee to receive shares of common stock at the end of a vesting period, subject solely to the employee’s continuing employment. The time-vested RSUs either vest in two or four equal annual installments beginning a year from the grant date. Our performance-based RSUs are awarded to eligible employees and entitle the grantee to receive shares of common stock if we achieve specified performance goals during the performance period and the grantee remains employed through the vesting period.\nRSU transactions for the year ended September 27, 2020 (in millions, except per share and contractual life amounts):\nFor fiscal 2019 and 2018, the weighted average fair value per RSU granted was $68.14 and $56.48, respectively. As of September 27, 2020, total unrecognized stock-based compensation expense related to nonvested RSUs, net of estimated forfeitures, was approximately $134 million, before income taxes, and is expected to be recognized over a weighted average period of approximately 1.9 years. The total fair value of RSUs vested was $211 million, $255 million and $166 million during fiscal 2020, 2019 and 2018, respectively.\nESPP\nOur ESPP allows eligible employees to contribute up to 10% of their base earnings toward the quarterly purchase of our common stock, subject to an annual maximum dollar amount. The purchase price is 95% of the fair market value of the stock on the last business day of the quarterly offering period. The number of shares issued under our ESPP was 0.5 million in fiscal 2020.\nDeferred Compensation Plan\nWe have a Deferred Compensation Plan for Non-Employee Directors under which non-employee directors may, for any fiscal year, irrevocably elect to defer receipt of shares of common stock the director would have received upon vesting of restricted stock units. The number of deferred shares outstanding related to deferrals made under this plan is not material.\nDefined Contribution Plans\nWe maintain voluntary defined contribution plans, both qualified and non-qualified, covering eligible employees as defined in the plan documents. Participating employees may elect to defer and contribute a portion of their eligible compensation to the plans up to limits stated in the plan documents, not to exceed the dollar amounts set by applicable laws.\nOur matching contributions to all U.S. and non-U.S. plans were $132.7 million, $122.1 million and $111.7 million in fiscal 2020, 2019 and 2018, respectively.\nNote 14: Income Taxes\nComponents of earnings before income taxes (in millions):\nProvision/(benefit) for income taxes (in millions):\nReconciliation of the statutory U.S. federal income tax rate with our effective income tax rate:\nAs of September 27, 2020, in foreign subsidiaries in which we are partially indefinitely reinvested, the gross taxable temporary difference between the accounting basis and tax basis was approximately $1.4 billion for which there could be up to approximately $280 million of unrecognized tax liability.\nTax effect of temporary differences and carryforwards that comprise significant portions of deferred tax assets and liabilities (in millions):\nThe valuation allowances as of September 27, 2020 and September 29, 2019 were primarily related to net operating losses and other deferred tax assets of consolidated foreign subsidiaries.\nAs of September 27, 2020, we had federal net operating loss carryforwards of $75.2 million which have an indefinite carryforward period, state net operating loss carryforwards of $112.8 million which will begin to expire in fiscal 2024, federal tax credit carryforwards of $11.9 million which will begin to expire in fiscal 2029, state tax credit carryforwards of $2.7 million which will begin to expire in fiscal 2024 and foreign net operating loss carryforwards of $317.8 million, of which $150.5 million have an indefinite carryforward period and the remainder expire at various dates starting from fiscal 2021.\nUncertain Tax Positions\nAs of September 27, 2020, we had $123.7 million of gross unrecognized tax benefits of which $103.0 million, if recognized, would affect our effective tax rate. We recognized an expense of $3.0 million, a benefit of $2.8 million and a benefit of $0.5 million of interest and penalties in income tax expense, prior to the benefit of the federal tax deduction, for fiscal 2020, 2019 and 2018, respectively. As of September 27, 2020 and September 29, 2019, we had accrued interest and penalties of $13.0 million and $10.0 million, respectively, within our consolidated balance sheets.\nThe following table summarizes the activity related to our unrecognized tax benefits (in millions):\nWe are currently under examination, or may be subject to examination, by various U.S. federal, state, local and foreign tax jurisdictions for fiscal 2011 through 2019. We are no longer subject to U.S. federal examination for years prior to fiscal 2017.\nWe are no longer subject to U.S. state and local examinations for years prior to fiscal 2011. We are no longer subject to examination in any material international markets prior to 2015.\nIt is reasonably possible that up to $39 million of the Company's gross unrecognized tax benefits may be recognized by the end of fiscal 2021 for reasons such as a lapse of the statute of limitations or resolution of examinations with tax authorities.\nNote 15: Earnings per Share\nCalculation of net earnings per common share (“EPS”) - basic and diluted (in millions, except EPS):\nPotential dilutive shares consist of the incremental common shares issuable upon the exercise of outstanding stock options (both vested and non-vested) and unvested RSUs, calculated using the treasury stock method. The calculation of dilutive shares outstanding excludes out-of-the-money stock options (i.e., such options’ exercise prices were greater than the average market price of our common shares for the period) because their inclusion would have been antidilutive. As of September 27, 2020 and September 29, 2019, we had no out-of-the-money stock options compared to 14.1 million as of September 30, 2018.\nNote 16: Commitments and Contingencies\nLegal Proceedings\nOn April 13, 2010, an organization named Council for Education and Research on Toxics (“Plaintiff”) filed a lawsuit in the Superior Court of the State of California, County of Los Angeles, against the Company and certain other defendants who manufacture, package, distribute or sell brewed coffee. The lawsuit is Council for Education and Research on Toxics v. Starbucks Corporation, et al. On May 9, 2011, the Plaintiff filed an additional lawsuit in the Superior Court of the State of California, County of Los Angeles, against the Company and additional defendants who manufacture, package, distribute or sell packaged coffee. The lawsuit is Council for Education and Research on Toxics v. Brad Barry LLC, et al.. Both cases have since been consolidated and now include nearly eighty defendants, which constitute the great majority of the coffee industry in California. Plaintiff alleges that the Company and the other defendants failed to provide warnings for their coffee products of exposure to the chemical acrylamide as required under California Health and Safety Code section 25249.5, the California Safe Drinking Water and Toxic Enforcement Act of 1986, better known as Proposition 65. Plaintiff seeks equitable relief, including providing warnings to consumers of coffee products, as well as civil penalties in the amount of the statutory maximum of two thousand five hundred dollars per day per violation of Proposition 65. The Plaintiff asserts that every consumed cup of coffee, absent a compliant warning, is equivalent to a violation under Proposition 65.\nThe Company, as part of a joint defense group organized to defend against the lawsuit, disputes the claims of the Plaintiff. Acrylamide is not added to coffee but is present in all coffee in small amounts (parts per billion) as a byproduct of the coffee bean roasting process. The Company has asserted multiple affirmative defenses. Trial of the first phase of the case commenced on September 8, 2014, and was limited to three affirmative defenses shared by all defendants. On September 1, 2015, the trial court issued a final ruling adverse to defendants on all Phase 1 defenses. Trial of the second phase of the case commenced in the fall of 2017. On May 7, 2018, the trial court issued a ruling adverse to defendants on the Phase 2 defense, the Company's last remaining defense to liability. On June 22, 2018, the California Office of Environmental Health Hazard Assessment (OEHHA) proposed a new regulation clarifying that cancer warnings are not required for coffee under Proposition 65. The case was set to proceed to a third phase trial on damages, remedies and attorneys' fees on October 15, 2018. However, on October 12, 2018, the California Court of Appeal granted the defendants request for a stay of the Phase 3 trial.\nOn June 3, 2019, the Office of Administrative Law (OAL) approved the coffee exemption regulation. The regulation will be effective on October 1, 2019. On June 24, 2019, the Court of Appeal lifted the stay of the litigation. At the status conference on August 25, 2020, the trial judge granted the defendants’ motion for summary judgment, ruling that the coffee exemption regulation is a complete defense to the Plaintiff’s complaint. The Notice of Entry of Judgment from the court was served on October 6, 2020. The plaintiff has not yet filed a Notice of Appeal. Starbucks believes that the likelihood that the Company will ultimately incur a loss in connection with this litigation is less than reasonably possible. Accordingly, no loss contingency was recorded for this matter.\nStarbucks is party to various other legal proceedings arising in the ordinary course of business, including certain employment litigation cases that have been certified as class or collective actions, but, except as noted above, is not currently a party to any legal proceeding that management believes could have a material adverse effect on our consolidated financial position, results of operations or cash flows.\nNote 17: Segment Reporting\nSegment information is prepared on the same basis that our ceo, who is our Chief Operating Decision Maker, manages the segments, evaluates financial results and makes key operating decisions.\nWe have three reportable operating segments: 1) Americas, which is inclusive of the U.S., Canada and Latin America; 2) International, which is inclusive of China, Japan, Asia Pacific, Europe, the Middle East and Africa; and 3) Channel Development.\nAmericas and International operations sell coffee and other beverages, complementary food, packaged coffees, single-serve coffee products and a focused selection of merchandise through company-operated stores and licensed stores. Our Americas segment is our most mature business and has achieved significant scale.\nChannel Development revenues include packaged coffee sales, tea and ready-to-drink beverages to customers outside of our company-operated and licensed stores. Historically revenues have included domestic and international sales of our packaged coffee, tea and ready-to-drink products to grocery, warehouse club and specialty retail stores and through institutional foodservice companies which serviced businesses. Since the fourth quarter of fiscal 2018, most of our Channel Development revenues are from product sales to and royalty revenues from Nestlé. The collaborative business relationships for ready-to-drink products and the associated revenues remain unchanged due to the Global Coffee Alliance.\nConsolidated revenue mix by product type(1) (in millions):\n(1) Certain prior period amounts have been reclassified to conform to current year presentation.\n(2) Beverage represents sales within our company-operated stores.\n(3) Food includes sales within our company-operated stores.\n(4) “Other” primarily consists of packaged and single-serve coffees and teas, royalty and licensing revenues, beverage-related ingredients, serveware and ready-to-drink beverages, among other items.\nInformation by geographic area (in millions):\nNo customer accounts for 10% or more of our revenues. Revenues are shown based on the geographic location of our customers. Revenues from countries other than the U.S. and China consist primarily of revenues from Japan, Canada and the U.K., which together account for approximately 78% of net revenues from other countries for fiscal 2020.\nManagement evaluates the performance of its operating segments based on net revenues and operating income. The accounting policies of the operating segments are the same as those described in Note 1, Summary of Significant Accounting Policies.\nOperating income represents earnings before other income and expenses and income taxes. The identifiable assets by segment disclosed in this note are those assets specifically identifiable within each segment and include cash and cash equivalents, ROU assets, net property, plant and equipment, equity and cost investments, goodwill and other intangible assets. Assets not attributed to reportable operating segments are corporate assets and are primarily comprised of cash and cash equivalents available for general corporate purposes, investments, assets of the corporate headquarters and roasting facilities and inventory.\nThe table below presents financial information for our reportable operating segments and Corporate and Other segment for the years ended September 27, 2020, September 29, 2019 and September 30, 2018.\nNote 18: Selected Quarterly Financial Information (unaudited; in millions, except EPS)\nREPORT OF INDEPENDENT REGISTERED PUBLIC ACCOUNTING FIRM\nTo the shareholders and the Board of Directors of Starbucks Corporation\nOpinion on the Financial Statements\nWe have audited the accompanying consolidated balance sheets of Starbucks Corporation and subsidiaries (the “Company”) as of September 27, 2020 and September 29, 2019, the related consolidated statements of earnings, comprehensive income, equity, and cash flows, for each of the three years in the period ended September 27, 2020, and the related notes (collectively referred to as the “financial statements”). In our opinion, the financial statements present fairly, in all material respects, the financial position of the Company as of September 27, 2020 and September 29, 2019, and the results of its operations and its cash flows for each of the three years in the period ended September 27, 2020, in conformity with accounting principles generally accepted in the United States of America.\nWe have also audited, in accordance with the standards of the Public Company Accounting Oversight Board (United States) (PCAOB), the Company's internal control over financial reporting as of September 27, 2020, based on criteria established in Internal Control - Integrated Framework (2013) issued by the Committee of Sponsoring Organizations of the Treadway Commission and our report dated November 12, 2020, expressed an unqualified opinion on the Company's internal control over financial reporting.\nChanges in Accounting Principle\nAs discussed in Notes 1 and 10 to the financial statements, the Company changed its method of accounting for leases effective September 30, 2019, due to adoption of Financial Accounting Standards Board (FASB) Accounting Standards Codification (ASC) No. 842, Leases. The Company adopted the new lease standard using the transition method provided in Accounting Standards Updated (ASU) No. 2018-11 such that prior period amounts are not adjusted and continue to be reported in accordance with ASC 840, Leases. The adoption of the new leasing standard is also communicated as a critical audit matter below.\nBasis for Opinion\nThese financial statements are the responsibility of the Company's management. Our responsibility is to express an opinion on the Company's financial statements based on our audits. We are a public accounting firm registered with the PCAOB and are required to be independent with respect to the Company in accordance with the U.S. federal securities laws and the applicable rules and regulations of the Securities and Exchange Commission and the PCAOB.\nWe conducted our audits in accordance with the standards of the PCAOB. Those standards require that we plan and perform the audit to obtain reasonable assurance about whether the financial statements are free of material misstatement, whether due to error or fraud. Our audits included performing procedures to assess the risks of material misstatement of the financial statements, whether due to error or fraud, and performing procedures that respond to those risks. Such procedures included examining, on a test basis, evidence regarding the amounts and disclosures in the financial statements. Our audits also included evaluating the accounting principles used and significant estimates made by management, as well as evaluating the overall presentation of the financial statements. We believe that our audits provide a reasonable basis for our opinion.\nCritical Audit Matter\nThe critical audit matter communicated below is a matter arising from the current-period audit of the financial statements that was communicated or required to be communicated to the audit committee and that (1) relates to accounts or disclosures that are material to the financial statements and (2) involved our especially challenging, subjective, or complex judgments. The communication of critical audit matters does not alter in any way our opinion on the financial statements, taken as a whole, and we are not, by communicating the critical audit matter below, providing a separate opinion on the critical audit matter or on the accounts or disclosures to which it relates.\nLeases - Incremental Borrowing Rate Used in Adoption of ASC 842 - Refer to Notes 1 and 10 to the financial statements\nCritical Audit Matter Description\nThe Company adopted the provisions of ASC 842, Leases, as of September 30, 2019. In doing so, the Company recorded lease liabilities for the present value of its leases of $9.0 billion and corresponding right-of-use (ROU) assets of $8.4 billion. The Company has disclosed the impact of adoption in Note 1 to its 2020 financial statements. In determining the lease liabilities and ROU assets, the Company derived market and term-specific incremental borrowing rates (IBRs) to calculate the present value of its lease payments. The determination of an IBR for each lease, requires management to consider a combination of factors, including its credit-adjusted risk-free interest rate, the risk profile and funding cost of the specific geographic market of the lease, the lease term and the effect of adjusting the rate to reflect consideration of collateral.\nGiven the company-specific factors and judgments in the model used by management to develop the IBRs for its leases at adoption, the auditing of the IBRs involved a high degree of auditor judgment, including the need to involve our fair value specialists.\nHow the Critical Audit Matter Was Addressed in the Audit\nOur audit procedures related to the IBRs used in the adoption of ASC 842, which thereby determined the adoption disclosed in the September 27, 2020 financial statements, included the following, among others:\n•We tested the effectiveness of controls over the determination and calculation of the IBRs.\n•With the assistance of our fair value specialists, we evaluated the methods and assumptions used by management to estimate the IBRs and tested the inputs used by management to develop the IBRs.\n/s/ Deloitte & Touche LLP\nSeattle, Washington\nNovember 12, 2020\nWe have served as the Company's auditor since 1987.",
    "item_9": "Item 9.Changes in and Disagreements with Accountants on Accounting and Financial Disclosure\nNot applicable.",
    "item_9A": "Item 9A.Controls and Procedures\nDisclosure Controls and Procedures\nWe maintain disclosure controls and procedures that are designed to ensure that material information required to be disclosed in our periodic reports filed or submitted under the Securities Exchange Act of 1934, as amended (the “Exchange Act”), is recorded, processed, summarized and reported within the time periods specified in the SEC’s rules and forms. Our disclosure controls and procedures are also designed to ensure that information required to be disclosed in the reports we file or submit under the Exchange Act is accumulated and communicated to our management, including our principal executive officer and principal financial officer, as appropriate to allow timely decisions regarding required disclosure.\nDuring the fourth quarter of fiscal 2020, we carried out an evaluation, under the supervision and with the participation of our management, including our chief executive officer and our chief financial officer, of the effectiveness of the design and operation of our disclosure controls and procedures, as defined in Rules 13a-15(e) and 15d-15(e) under the Exchange Act. Based upon that evaluation, our chief executive officer and chief financial officer concluded that our disclosure controls and procedures were effective, as of the end of the period covered by this report (September 27, 2020).\nThere were no changes in our internal control over financial reporting (as defined in Rules 13a-15(f) and 15d-15(f) of the Exchange Act) during our most recently completed fiscal quarter that materially affected or are reasonably likely to materially affect internal control over financial reporting.\nThe certifications required by Section 302 of the Sarbanes-Oxley Act of 2002 are filed as exhibits 31.1 and 31.2, respectively, to this 10-K.\nReport of Management on Internal Control over Financial Reporting\nOur management is responsible for establishing and maintaining adequate internal control over financial reporting. Internal control over financial reporting is a process to provide reasonable assurance regarding the reliability of our financial reporting for external purposes in accordance with accounting principles generally accepted in the United States of America. Internal control over financial reporting includes maintaining records that in reasonable detail accurately and fairly reflect our transactions; providing reasonable assurance that transactions are recorded as necessary for preparation of our financial statements; providing reasonable assurance that receipts and expenditures are made in accordance with management authorization; and providing reasonable assurance that unauthorized acquisition, use or disposition of company assets that could have a material effect on our financial statements would be prevented or detected on a timely basis. Because of its inherent limitations, internal control over financial reporting is not intended to provide absolute assurance that a misstatement of our financial statements would be prevented or detected.\nManagement conducted an evaluation of the effectiveness of our internal control over financial reporting based on the framework and criteria established in Internal Control - Integrated Framework, issued by the Committee of Sponsoring Organizations of the Treadway Commission. This evaluation included review of the documentation of controls, evaluation of the design effectiveness of controls, testing of the operating effectiveness of controls and a conclusion on this evaluation. Based on this evaluation, management concluded that our internal control over financial reporting was effective as of September 27, 2020.\nOur internal control over financial reporting as of September 27, 2020 has been audited by Deloitte & Touche LLP, an independent registered public accounting firm, as stated in their report which is included herein.\nREPORT OF INDEPENDENT REGISTERED PUBLIC ACCOUNTING FIRM\nTo the shareholders and the Board of Directors of Starbucks Corporation\nOpinion on Internal Control over Financial Reporting\nWe have audited the internal control over financial reporting of Starbucks Corporation and subsidiaries (the “Company”) as of September 27, 2020, based on criteria established in Internal Control - Integrated Framework (2013) issued by the Committee of Sponsoring Organizations of the Treadway Commission (COSO). In our opinion, the Company maintained, in all material respects, effective internal control over financial reporting as of September 27, 2020, based on criteria established in Internal Control - Integrated Framework (2013) issued by COSO.\nWe have also audited, in accordance with the standards of the Public Company Accounting Oversight Board (United States) (PCAOB), the consolidated financial statements as of and for the year ended September 27, 2020, of the Company and our report dated November 12, 2020, expressed an unqualified opinion on those financial statements and included an explanatory paragraph relating to the Company’s adoption of Financial Accounting Standards Board (FASB) Accounting Standards Codification (ASC) No. 842, Leases.\nBasis for Opinion\nThe Company’s management is responsible for maintaining effective internal control over financial reporting and for its assessment of the effectiveness of internal control over financial reporting, included in the accompanying Report of Management on Internal Control over Financial Reporting. Our responsibility is to express an opinion on the Company’s internal control over financial reporting based on our audit. We are a public accounting firm registered with the PCAOB and are required to be independent with respect to the Company in accordance with the U.S. federal securities laws and the applicable rules and regulations of the Securities and Exchange Commission and the PCAOB.\nWe conducted our audit in accordance with the standards of the PCAOB. Those standards require that we plan and perform the audit to obtain reasonable assurance about whether effective internal control over financial reporting was maintained in all material respects. Our audit included obtaining an understanding of internal control over financial reporting, assessing the risk that a material weakness exists, testing and evaluating the design and operating effectiveness of internal control based on the assessed risk, and performing such other procedures as we considered necessary in the circumstances. We believe that our audit provides a reasonable basis for our opinion.\nDefinition and Limitations of Internal Control over Financial Reporting\nA company’s internal control over financial reporting is a process designed to provide reasonable assurance regarding the reliability of financial reporting and the preparation of financial statements for external purposes in accordance with generally accepted accounting principles. A company’s internal control over financial reporting includes those policies and procedures that (1) pertain to the maintenance of records that, in reasonable detail, accurately and fairly reflect the transactions and dispositions of the assets of the company; (2) provide reasonable assurance that transactions are recorded as necessary to permit preparation of financial statements in accordance with generally accepted accounting principles, and that receipts and expenditures of the company are being made only in accordance with authorizations of management and directors of the company; and (3) provide reasonable assurance regarding prevention or timely detection of unauthorized acquisition, use, or disposition of the company’s assets that could have a material effect on the financial statements.\nBecause of its inherent limitations, internal control over financial reporting may not prevent or detect misstatements. Also, projections of any evaluation of effectiveness to future periods are subject to the risk that controls may become inadequate because of changes in conditions, or that the degree of compliance with the policies or procedures may deteriorate.\n/s/ Deloitte & Touche LLP\nSeattle, Washington\nNovember 12, 2020",
    "item_9B": "Item 9B.Other Information\nNone.\nPART III",
    "item_9C": "",
    "item_10": "Item 10.Directors, Executive Officers and Corporate Governance\nInformation regarding our executive officers is set forth in Item 1 of Part 1 of this Report under the caption “Information about our Executive Officers.”\nWe adopted a code of ethics that applies to our chief executive officer, chief financial officer, controller and other finance leaders, which is a “code of ethics” as defined by applicable rules of the SEC. This code is publicly available on our website at www.starbucks.com/about-us/company-information/corporate-governance. If we make any amendments to this code other than technical, administrative or other non-substantive amendments, or grant any waivers, including implicit waivers, from a provision of this code to our chief executive officer, chief operating officer, chief financial officer, chief accounting officer or controller, we will disclose the nature of the amendment or waiver, its effective date and to whom it applies on our website at www.starbucks.com/about-us/company-information/corporate-governance or in a report on Form 8-K filed with the SEC.\nThe remaining information required by this item is incorporated herein by reference to the sections entitled “Proposal 1 - Election of Directors,” “Beneficial Ownership of Common Stock,” “Corporate Governance” and “Corporate Governance - Audit and Compliance Committee” in our definitive Proxy Statement for the Annual Meeting of Shareholders to be held on March 17, 2021 (the “Proxy Statement”).",
    "item_11": "Item 11.Executive Compensation\nThe information required by this item is incorporated by reference to the section entitled “Executive Compensation,” in the Proxy Statement.",
    "item_12": "Item 12.Security Ownership of Certain Beneficial Owners and Management and Related Shareholder Matters\nThe information required by this item is incorporated by reference to the sections entitled “Equity Compensation Plan Information” and “Beneficial Ownership of Common Stock” in the Proxy Statement.",
    "item_13": "Item 13.Certain Relationships, Related Transactions and Director Independence\nThe information required by this item is incorporated by reference to the section entitled “Certain Relationships and Related Person Transactions” and “Corporate Governance - Affirmative Determinations Regarding Director Independence and Other Matters” in the Proxy Statement.",
    "item_14": "Item 14.Principal Accounting Fees and Services\nThe information required by this item is incorporated by reference to the sections entitled “Proposal 3 - Ratification of Selection of Deloitte & Touche LLP as our Independent Registered Public Accounting Firm - Independent Registered Public Accounting Firm Fees” and “Proposal 3 - Ratification of Selection of Deloitte & Touche LLP as our Independent Registered Public Accounting Firm - Policy on Audit Committee Pre-Approval of Audit and Permissible Non-Audit Services of the Independent Registered Public Accounting Firm” in the Proxy Statement.\nPART IV",
    "item_15": "Item 15.Exhibits, Financial Statement Schedules\n(a) The following documents are filed as a part of this 10-K:\n1. Financial Statements\nThe following financial statements are included in Part II, Item 8 of this 10-K:\n•Consolidated Statements of Earnings for the fiscal years ended September 27, 2020, September 29, 2019, and September 30, 2018;\n•Consolidated Statements of Comprehensive Income for the fiscal years ended September 27, 2020, September 29, 2019, and September 30, 2018;\n•Consolidated Balance Sheets as of September 27, 2020 and September 29, 2019;\n•Consolidated Statements of Cash Flows for the fiscal years ended September 27, 2020, September 29, 2019, and September 30, 2018;\n•Consolidated Statements of Equity for the fiscal years ended September 27, 2020, September 29, 2019, and September 30, 2018;\n•Notes to Consolidated Financial Statements; and\n•Reports of Independent Registered Public Accounting Firm\n2. Financial Statement Schedules\nFinancial statement schedules are omitted because they are not required or are not applicable, or the required information is provided in the consolidated financial statements or notes described in Item 15(a)(1) above.\n3. Exhibits\n* Denotes a management contract or compensatory plan or arrangement.\n** Furnished herewith.",
    "item_16": "",
    "stock_ticker": "SBUX"
}