{
    "cik": "878927",
    "company": "OLD DOMINION FREIGHT LINE, INC.",
    "filing_type": "10-K",
    "filing_date": "2021-02-24",
    "period_of_report": "2020-12-31",
    "sic": "4213",
    "state_of_inc": "VA",
    "state_location": "NC",
    "fiscal_year_end": "1231",
    "filing_html_index": "https://www.sec.gov/Archives/edgar/data/878927/0001564590-21-008056-index.html",
    "htm_filing_link": "https://www.sec.gov/Archives/edgar/data/878927/000156459021008056/odfl-10k_20201231.htm",
    "complete_text_filing_link": "https://www.sec.gov/Archives/edgar/data/878927/0001564590-21-008056.txt",
    "filename": "878927_10K_2020_0001564590-21-008056.htm",
    "item_1": "ITEM 1. BUSINESS\nUnless the context requires otherwise, references in this report to “Old Dominion,” the “Company,” “we,” “us” and “our” refer to Old Dominion Freight Line, Inc.\nOverview\nWe are one of the largest North American less-than-truckload (“LTL”) motor carriers. We provide regional, inter-regional and national LTL services through a single integrated, union-free organization. Our service offerings, which include expedited transportation, are provided through an expansive network of service centers located throughout the continental United States. Through strategic alliances, we also provide LTL services throughout North America. In addition to our core LTL services, we offer a range of value-added services including container drayage, truckload brokerage and supply chain consulting. More than 98% of our revenue has historically been derived from transporting LTL shipments for our customers, whose demand for our services is generally tied to industrial production and the overall health of the U.S. domestic economy.\nWe have increased our revenue and customer base over the past ten years primarily through organic market share growth. Our infrastructure allows us to provide next-day and second-day service through each of our regions covering the continental United States. In addition to numerous service center renovations, expansions, and relocations of existing service centers, we opened 8, 19 and 31 new service centers over the past one, five and ten years, respectively, for a total of 244 service centers at December 31, 2020. We believe this expansion produced increased capacity within our service center network and provides us with opportunities for future growth.\nWe believe the growth in demand for our services can be attributed to our ability to consistently provide a superior level of customer service at a fair price, which allows our customers to meet their supply chain needs. Our integrated structure allows us to offer our customers consistent high-quality service from origin to destination, and we believe our operating structure and proprietary information systems enable us to efficiently manage our operating costs. Our services are complemented by our technological capabilities, which we believe provide the tools to improve the efficiency of our operations while also empowering our customers to manage their individual shipping needs.\nWe were founded in 1934 and incorporated in Virginia in 1950. Our principal executive offices are located at 500 Old Dominion Way, Thomasville, North Carolina 27360.\nOur Industry\nTrucking companies provide transportation services to virtually every industry operating in the United States and generally offer higher levels of reliability and faster transit times than other surface transportation options. The trucking industry is comprised principally of two types of motor carriers: LTL and truckload. LTL freight carriers typically pick up multiple shipments from multiple customers on a single truck. The LTL freight is then routed through a network of service centers where the freight may be transferred to other trucks with similar destinations. LTL motor carriers generally require a more expansive network of local pickup and delivery\n(“P&D”) service centers, as well as larger breakbulk, or hub, facilities. In contrast, truckload carriers generally dedicate an entire truck to one customer from origin to destination.\nSignificant capital is required to create and maintain a network of service centers and a fleet of tractors and trailers. The high fixed costs and capital spending requirements for LTL motor carriers make it difficult for new start-up or small operators to effectively compete with established carriers. In addition, successful LTL motor carriers generally employ, and regularly update, a high level of technology-based systems and processes that provide information to customers and help reduce operating costs.\nThe American Trucking Associations reported total transportation revenue in the United States of $984.9 billion in 2019, which included approximately $43.3 billion for the LTL industry based on information reported in Transport Topics. The LTL industry is highly competitive on the basis of service and price and has consolidated significantly since the industry was deregulated in 1980. The largest 5 and 10 LTL motor carriers accounted for approximately 56% and 80%, respectively, of the LTL market in 2019. We believe consolidation in our industry will continue due to increased customer demand for transportation providers offering both regional and national service as well as other complementary value-added services.\nCompetition\nThe transportation and logistics industry is intensely competitive and highly fragmented. We compete with regional, inter-regional and national LTL carriers and, to a lesser extent, with truckload carriers, small package carriers, airfreight carriers and railroads. We also compete with, and provide transportation services to, third-party logistics providers that determine both the mode of transportation and the carrier. Some of our competitors may have a broader global network and a wider range of services than we do. Competition in our industry is based primarily on service, price, available capacity and business relationships. We believe we are able to gain market share by expanding our capacity in the United States and providing high-quality service at a fair price.\nThroughout our organization, we continuously seek to improve customer service by, among other things, maximizing on-time performance and minimizing cargo claims. We believe our transit times are generally faster and more reliable than those of our principal national competitors, in part because of our more efficient service center network, use of team drivers and proprietary technology. In addition, we provide greater geographic coverage than most of our regional competitors. Our diversified mix and scope of regional, inter-regional and national LTL service, combined with our value-added service offerings, enables us to provide our customers with a single source to meet their shipping and logistics needs. We believe the combination of these factors provides us with a distinct advantage over most of our competitors.\nWe utilize flexible scheduling and train our employees to perform multiple tasks, which we believe allows us to achieve greater productivity and higher levels of customer service than our competitors. We believe our focus on employee communication, continued education, development and motivation strengthens the relationships and trust among our employees.\nService Center Operations\nAt December 31, 2020, we operated 244 service center locations, of which we owned 217 and leased 27. Our network includes nine major breakbulk facilities located in Atlanta, Georgia; Columbus, Ohio; Indianapolis, Indiana; Greensboro, North Carolina; Harrisburg, Pennsylvania; Memphis and Morristown, Tennessee; Dallas, Texas; and Salt Lake City, Utah, while using various other service centers for additional limited breakbulk activity in order to serve our next-day markets. Our service centers are strategically located throughout the country so that we can provide the highest quality service and minimize freight rehandling costs.\nOur service centers are responsible for the pickup and delivery of freight within their local service area. Each night, our service centers load outbound freight for transport to our other service centers for delivery. All inbound freight received by the service center in the evening or during the night is generally scheduled for local delivery the next business day, unless a customer requests a different delivery schedule. Our management reviews the productivity and service performance of each service center on a daily basis to ensure quality service and efficient operations.\nAlthough we have established primary responsibility for customer service at the local service center level, our customers may access information and initiate transactions through our centralized customer service department located at our corporate office or through other electronic gateways. Our systems allow us to offer our customers access to information such as freight tracking, shipping documents, rate quotes, rate databases and account activity. These centralized systems and our customer service department provide our customers with a single point of contact to access information across all areas of our operations and for each of our service offerings.\nLinehaul Transportation\nLinehaul dispatchers control the movement of freight between service centers through integrated freight movement systems. We also utilize load-planning software to optimize efficiencies in our linehaul operations. Our management team monitors freight\nmovements, transit times, load factors and many other productivity measurements to help ensure that we maintain our high levels of service and efficiency.\nWe utilize scheduled routes, and additional linehaul dispatches as necessary to meet our published transit times. In addition, we gain efficiency through the use of twin 28-foot trailers in our linehaul operations. The use of twin 28-foot trailers permits us to transport freight directly from its point of origin to destination with minimal unloading and reloading, which also reduces our exposure to potential cargo loss and damage expenses. We utilize long-combination vehicles, such as triple 28-foot trailers and combinations of 48-foot and 28-foot trailers, in states where permitted. Twin trailers and long-combination vehicles permit more freight to be transported behind a tractor than could otherwise be transported by one trailer.\nTractors, Trailers and Maintenance\nAt December 31, 2020, we owned 9,288 tractors. We generally use new tractors in linehaul operations for approximately three to five years and then transfer those tractors to P&D operations for the remainder of their useful lives. In many of our service centers, tractors perform P&D functions during the day and linehaul functions at night to maximize tractor utilization.\nThe table below reflects, as of December 31, 2020, the average age of our tractors and trailers:\nWe develop certain specifications for tractors and trailers and then negotiate the production and purchase of this equipment with several manufacturers. These purchases are planned well in advance of anticipated delivery dates in order to accommodate manufacturers’ production schedules. We believe there is sufficient capacity among suppliers to help ensure an uninterrupted supply of equipment to support our operations.\nThe table below sets forth our capital expenditures for tractors and trailers for the years ended December 31, 2020 and 2019. For more information concerning our capital expenditures, see Item 7, “Management’s Discussion and Analysis of Financial Condition and Results of Operations - Liquidity and Capital Resources” in this report.\nAt December 31, 2020, we operated 42 fleet maintenance centers at strategic service center locations throughout our network. These fleet maintenance centers are equipped to perform routine and preventive maintenance and repairs on our equipment.\nWe adhere to established maintenance policies and procedures to help ensure our fleet is properly maintained. Tractors are routed to appropriate maintenance facilities or authorized repair vendors at designated mileage intervals or every 90 days, whichever occurs first. Trailers are also scheduled for preventative maintenance every 90 days.\nCustomers\nRevenue is generated primarily from customers throughout the United States and North America. In 2020, our largest customer accounted for approximately 4.7% of our revenue and our largest 5, 10 and 20 customers accounted for 15.1%, 21.8% and 29.7% of our revenue, respectively. For each of our last two fiscal years, more than 95% of our revenue was derived from services performed in the United States and less than 5% of our revenue was generated from services performed internationally. We believe the diversity of our customer base helps protect our business from adverse developments in a single geographic region and from the reduction or loss of business from a single customer.\nWe utilize an integrated freight-costing system to determine the price level at which a particular freight shipment will be profitable. We can modify elements of this freight-costing model to simulate the actual conditions under which the freight will be moved. Many of our customers engage our services through the terms and provisions of our tariffs and through negotiated service contracts. We also compete for business by participating in bid solicitations. Customers generally solicit bids for relatively large\nnumbers of shipments for a period of one to two years and typically choose to enter into contractual arrangements with a limited number of motor carriers based upon price and service.\nSeasonality\nOur tonnage levels and revenue mix are subject to seasonal trends common in our industry, although other factors, such as macroeconomic changes, could cause variation in these trends. Our revenue and operating margins in the first and fourth quarters are typically lower than those during the second and third quarters due to reduced shipments during the winter months; however, the effects of the COVID-19 pandemic on the domestic economy has impacted, and may continue to impact, our normal seasonal trends. More specifically, we experienced a decrease in LTL shipments driven by the impact of a slowdown in the domestic economy associated with the COVID-19 pandemic, primarily during the second quarter of 2020. Harsh winter weather, hurricanes, tornadoes, floods and other natural disasters can also adversely impact our performance by reducing demand and increasing operating expenses. We believe seasonal trends will continue to impact our business.\nTechnology\nOur technology is critical to the success and delivery of the premium service provided by our operations. We continually seek to upgrade and enhance our technological capabilities. We also provide access to our systems through multiple secure gateways that offer our customers and employees maximum flexibility and access to information. We employ vehicle safety systems, on-board computer systems and smart phones, freight handling systems and logistics technology to reduce costs and transit times, as well as to meet regulatory requirements. Our data systems are integrated at every level within our organization, which we believe is critical to our success. Our systems are protected through physical and software safeguards, as well as redundant systems, network security measures and backup systems. We continue to focus on the development and enhancement of the technology used in our operations in order to improve the efficiency and effectiveness of our services.\nInsurance\nWe carry a significant amount of insurance with third-party insurance carriers that provides various levels of protection for our risk exposure, including protection in the areas of property, casualty, cyber, management, and group health, with coverage limits and retention/deductible levels that we believe are reasonable given historical claim activity and severity. We believe that our policy of maintaining self-insured retentions or deductibles under these various insurance programs for a portion of our risks, supported by our safety, claims management and loss prevention programs, is an effective means of managing insurance costs. We periodically review our risk exposure and insurance coverage applicable to those risks and believe that we maintain sufficient insurance coverage.\nDiesel Fuel Availability and Cost\nWe depend heavily upon the availability and quality of diesel fuel to provide our transportation services. We maintain fuel storage and pumping facilities at certain service center locations as the primary source for fueling our fleet, and we utilize over-the-road fueling options at retail locations as necessary. We could be susceptible to regional and/or national fuel shortages, which could cause us to incur additional expense in order to obtain an adequate supply within our own fueling network or cause us to rely more heavily on higher-priced retail fuel.\nWe believe our operations and financial condition are susceptible to the same diesel fuel price increases or shortages as those of our competitors. Our fuel surcharge programs are one of many components that we use to determine the overall price for our transportation services. Our fuel surcharges are generally indexed to fuel prices published by the U.S. Department of Energy (the “DOE”) that reset each week.\nHuman Capital\nEmployee Profile\nAs of December 31, 2020, we employed 19,779 active full-time employees, none of which were represented under a collective bargaining agreement. Our full-time employees work in the following roles:\nEmployee Engagement and Benefits\nOur Old Dominion Family of employees are a key factor in the success of our business. The unique OD Family culture encourages development and employee engagement, and motivates our employees to provide the superior customer service for which we are known. We believe this culture is part of what attracts employees and helps keep our turnover rates low. We also provide our employees with a comprehensive benefits package, including a plan that covers our eligible employees’ premium for health insurance, a flexible paid time off policy, a 401(k) plan with a guaranteed employer match as well as a discretionary match opportunity, and various wellness programs designed to assist employees with establishing and living a healthy and balanced lifestyle.\nEmployee Development and Safety\nAs of December 31, 2020, we employed 5,310 linehaul drivers and 4,804 P&D drivers on a full-time basis. We select our drivers based upon many factors, including driving records and experience. Among other requirements, our drivers must pass a drug test, have a current U.S. Department of Transportation (“DOT”) physical and have a valid commercial driver’s license prior to employment. Once employed, drivers are required to obtain and maintain hazardous materials endorsements to their commercial driver’s licenses. Drivers, like all of our employees, are required to take pre-employment drug and alcohol tests and are randomly selected for periodic additional testing.\nSince 1988, we have provided a no-cost opportunity for qualified employees to become drivers through the “Old Dominion Driver Training Program.” There are currently 3,069 active drivers who have successfully completed this training, which was approximately 30.3% of our driver workforce as of December 31, 2020. We believe our driver training and qualification programs have been important factors in improving our safety record and retaining qualified drivers. In addition, we have experienced an annual turnover rate for our driver graduates of approximately 6.3%, which is below our Company-wide turnover rate for all drivers of approximately 8.0%.\nWe also maintain a “Management Trainee Program” and a “Supervisor Development Program” that offers opportunities for our employees to be considered and prepared for sales and management opportunities. These programs support our philosophy of promoting from within our high-quality workforce.\nBased on driving records, our drivers are eligible to be rewarded with annual safety bonuses of up to $3,000 per driver. Our safety bonuses paid to drivers totaled $4.7 million, $4.6 million and $4.1 million in 2020, 2019 and 2018, respectively.\nDuring 2020, the outbreak of COVID-19 was declared a pandemic by the World Health Organization. Throughout the COVID-19 pandemic, we have remained focused on protecting the health and safety of our employees while meeting the needs of our customers. We implemented various measures to help ensure the safety and well-being of our OD Family of employees, following guidelines issued by the U.S. Centers for Disease Control and Prevention and the World Health Organization. We provided personal protective equipment and also implemented increased physical distancing in workspaces and enhanced cleaning protocols. Across our businesses, we continue to take measures to prevent workplace hazards, encourage safe behaviors and promote a culture of continuous improvement to ensure our processes help reduce incidents and illnesses and comply with governing health and safety laws.\nGovernmental Regulation\nWe are regulated by the DOT and by various state and federal agencies. These regulatory authorities have broad powers over matters relating to authorized motor carrier operations, as well as motor carrier registration, driver hours of service, safety and fitness of transportation equipment and drivers, transportation of hazardous materials, certain mergers and acquisitions and periodic financial reporting. The trucking industry is also subject to regulatory and legislative changes from a variety of other governmental authorities, which address matters such as increasingly stringent environmental regulations, occupational safety and health regulations, limits on vehicle weight and size, ergonomics, port security, and driver hours of service.\nIn addition, we are subject to compliance with cargo-security and transportation regulations issued by the Transportation Security Administration (“TSA”) and Customs and Border Protection (“CBP”) within the U.S. Department of Homeland Security. Regulatory requirements, and changes in regulatory requirements or guidance, may affect our business or the economics of the industry by requiring changes in operating practices that could influence the demand for and increase the costs of providing transportation services.\nDriver Hours of Service\nThe Federal Motor Carrier Safety Administration (the “FMCSA”) rules provide that a truck driver may work no more than a maximum number of 60 hours within seven consecutive days and 70 hours within eight consecutive days. FMCSA rules further impose a maximum work period of 14 hours (no more than 11 hours of which may be driving time) after first coming on-duty\nfollowing 10 consecutive hours of off-duty time. FMCSA rules also require that drivers take a 30-minute break prior to driving beyond eight hours. Our drivers utilize electronic logging devices (“ELDs”) for the purpose of recording their hours of service.\nCommercial Driver’s License Drug and Alcohol Clearinghouse\nWe are registered as a motor carrier with the Commercial Driver’s License Drug and Alcohol Clearinghouse (“DAC”) which requires us to check for drug and alcohol violations of current drivers at least annually and prospective employees prior to hiring. We have completed our annual limited query and pre-hire driver authorization queries.\nWe are subject to future rulemaking by the FMCSA and other regulatory agencies, which could be more stringent, require additional changes to our operations, increase our operating costs or otherwise adversely impact our results of operations.\nEnvironmental Regulation\nWe are subject to various federal, state and local environmental laws and regulations that focus on, among other things: the disposal, emission and discharge of hazardous waste, hazardous materials, or other materials into the environment or their presence at our properties or in our vehicles; fuel storage tanks; transportation of certain materials; and the discharge or retention of storm water. Under specific environmental laws, we could also be held responsible for any costs relating to contamination at our past or present facilities and at third-party waste disposal sites, as well as costs associated with clean-up of accidents involving our vehicles. We do not believe that the cost of future compliance with current environmental laws or regulations will have a material adverse effect on our operations, financial condition, competitive position or capital expenditures for the remainder of 2021 or fiscal year 2022. However, future changes to laws or regulations may adversely affect our operations and could result in unforeseen costs to our business.\nAvailable Information\nThrough our website, http://www.odfl.com, we make available, free of charge, our Annual Report on Form 10-K, Quarterly Reports on Form 10-Q, Current Reports on Form 8-K and any amendments to those reports filed or furnished pursuant to Section 13(a) or 15(d) of the Securities Exchange Act of 1934 (the “Exchange Act”), as soon as practicable after we electronically file the material with or furnish it to the U.S. Securities and Exchange Commission (the “SEC”). The public may read or copy any document we file with the SEC at the SEC’s website, http://www.sec.gov (File No. 0-19582). Information contained on our website is neither part of nor incorporated by reference into this Form 10-K or any other report we file with or furnish to the SEC.",
    "item_1A": "ITEM 1A. RISK FACTORS\nAn investment in our common stock involves a variety of risks and uncertainties. The following describes some of the material risks that could adversely affect our business, financial condition, operating results or cash flows. We may also be adversely impacted by other risks not presently known to us or that we currently consider immaterial.\nRisks Related to our Business and Operations\nIf we are unable to successfully execute our growth strategy, and develop, market and consistently deliver high-quality services that meet customer expectations, our business and future results of operations may suffer.\nOur growth strategy includes increasing the volume of freight moving through our existing service center network and selectively expanding our capacity in the United States through market share gains. In connection with our growth strategy, at various times, we have consistently expanded and upgraded service centers, purchased additional equipment and increased our sales and marketing efforts, and we expect to continue to do so. Our growth strategy exposes us to a number of risks, including the following:\n•\nshortages of suitable real estate may limit our growth and could cause congestion in our service center network, which could result in increased operating expenses;\n•\nour projected freight volume growth may differ from actual results, and prior capital investments based on our projections may contribute to excess capacity that could negatively impact our profitability;\n•\ngrowth may strain our management, capital resources, information systems and customer service;\n•\nhiring new employees may increase training costs and may result in temporary inefficiencies until those employees become proficient in their jobs;\n•\nwe may find it more difficult to maintain our corporate culture, which we believe has been a key contributor to our success; and\n•\nexpanding our service offerings may require us to enter into new markets and encounter new competitive challenges.\nWe cannot ensure that we will overcome the risks associated with our growth strategy. If we fail to overcome those risks, we may not realize projected growth and related revenue or profits from our efforts, we may incur additional expenses and, as a result, our financial position and results of operations could be materially and adversely affected.\nWe face various risks related to health epidemics, pandemics and similar outbreaks that have had, and may continue to have, adverse effects on our business, results of operations and financial condition.\nThe novel coronavirus (COVID-19) pandemic and the related changes in the economic and political conditions in markets in which we operate have had adverse impacts on our business, results of operations and financial condition, and on those of our customers and suppliers, and these adverse impacts may continue. These impacts and potential impacts include, among other things, significant reductions or volatility in demand for our services, inability of our customers to pay for our services, and failure of our suppliers or third-party service providers to meet their obligations to us. We may also experience capacity constraints in one or more geographic areas if a significant number of our employees in any such region are affected by COVID-19. Furthermore, COVID-19 has impacted and may further impact the global economy, including negatively impacting the proper functioning of financial and capital markets and interest rates, which has impacted the cost of capital and has limited access to capital. As the COVID-19 pandemic continues to adversely affect our business, results of operations and financial condition, it has heightened, and will likely continue to heighten, other risks to which we are subject, including those related to economic downturns, customer/supplier/vendor operations, changes in political and regulatory conditions, liquidity, and industry pricing environment stability, as described in further detail in other risk factors. Despite our efforts to manage our exposure to these risks, the ultimate impact of COVID-19 and similar outbreaks depends on factors beyond our knowledge or control, including the duration and severity of any outbreak and governmental/social actions taken to contain its spread and mitigate its public health impact.\nChanges in our relationships with significant customers, including the loss or reduction in business from one or more of them, could have an adverse impact on our business.\nWe do not believe the loss of any one customer would materially impact our business and revenue growth due to the diversity of our customer base and no individual customer accounting for more than 5% of our revenue. We do, however, have a number of customers whose demand for our services is tied to U.S. industrial production, or the broader domestic economy, that could, collectively, drive business and revenue growth. These customers could experience a decrease in production due to a decrease in the demand for their products, as a result of a decline in the U.S economy or other global economic factors, such as the slowdown in the domestic economy associated with the COVID-19 pandemic. They could also use other LTL providers and other modes of transportation, such as truckload and intermodal, in response to capacity, service and pricing issues. Finally, unfavorable publicity about us or our employees, particularly given the current environment of instantaneous communication and social media outlets, could damage our reputation and result in these customers reducing their demand for our services. If these factors resulted in a reduction or loss of business from these customers, there could be a material impact on our business and revenue growth.\nInsurance and claims expenses could significantly reduce our profitability.\nWe are exposed to a variety of claims, including but not limited to those related to cargo loss and damage, property damage, personal injury, workers’ compensation and healthcare. We have insurance coverage with third-party insurance carriers, but we assume a significant portion of the risk associated with these claims due to our self-insured retentions and deductibles. Our operating results could be adversely affected if any of the following were to occur: (i) the number or the severity of claims increases; (ii) we are required to accrue or pay additional amounts because claims prove to be more severe than our original assessment; or (iii) claims exceed our coverage amounts. If claims exceed our self-insured retention or deductible levels, insurance companies exit the transportation insurance marketplace, or insurance market conditions change, insurers could raise premiums for excess coverage to cover their expenses and anticipated future losses. Coverage also may not be procured or be unavailable for certain claims. In addition, insurance companies generally require us to collateralize our self-insured retention or deductible levels. If these collateralization requirements increase, our borrowing capacity could be adversely affected.\nLimited supply and increased costs of new equipment may adversely affect our earnings and cash flow.\nWe may face difficulty in purchasing new equipment due to decreased supply and increased costs. Investment in new equipment is a significant part of our annual capital expenditures and we require an available supply of tractors and trailers from equipment manufacturers to operate and grow our business. We may also be subject to shortages in raw materials that are required for the production of critical operating equipment and supplies, such as shortages in rubber or steel.\nThe price of our equipment may also be adversely affected in the future by regulations on newly manufactured tractors and diesel engines. We are subject to regulations issued by the U.S. Environmental Protection Agency (the “EPA”) and various state agencies, particularly the California Air Resources Board (“CARB”), that have required progressive reductions in exhaust emissions from diesel engines. We may become subject to new or more restrictive regulations, or differing interpretations of existing regulations, which may increase the cost of providing transportation services or adversely affect our results of operations. We are also unable to\npredict how any future changes in U.S. government policy will affect EPA and CARB regulation and enforcement. These regulations have resulted in higher prices for tractors and diesel engines and increased operating and maintenance costs, and there can be no assurance that continued increases in pricing or costs will not have an adverse effect on our business and results of operations.\nWe may be adversely impacted by fluctuations in the availability and price of diesel fuel.\nDiesel fuel is a critical component of our operations and a significant operating expense for our business. Future fluctuations in prices and diesel fuel availability could have a material adverse effect on our operating results. Diesel fuel prices and fuel availability can be impacted by factors beyond our control, such as natural or man-made disasters, adverse weather conditions, political events, disruption or failure of technology or information systems, price and supply decisions by oil producing countries and cartels, terrorist activities, armed conflict, world supply and demand imbalances, tariffs, sanctions, and quotas or other changes to trade agreements. We maintain fuel storage and pumping facilities at many of our service center locations; however, we may be susceptible to fuel shortages at certain locations that could cause us to incur additional expense to ensure adequate supply on a timely basis and to prevent a disruption to our service schedules. An interruption in the supply of diesel fuel could have a material adverse effect on our operating results.\nWe do not hedge against the risk of diesel fuel price increases. An increase in diesel fuel prices or diesel fuel taxes, or any change in federal or state regulations that results in such an increase, could have a material adverse effect on our operating results. We have fuel surcharge programs in place with a majority of our customers, which help offset the negative impact of the increased cost of diesel fuel and other petroleum-based products. However, we also incur fuel costs that cannot be recovered even with respect to customers with which we maintain fuel surcharge programs, such as those costs associated with empty miles. Because our fuel surcharge recovery lags behind changes in fuel prices, our fuel surcharge recovery may not capture the increased costs we pay for fuel, especially when prices are rising, leading to fluctuations in our levels of reimbursement. We regularly monitor the components of our pricing, including fuel surcharges, and address individual account profitability issues with our customers when necessary; however, there can be no assurance that fuel surcharges can be maintained indefinitely or will be sufficiently effective in offsetting increases in diesel fuel prices.\nOur results of operations may be affected by seasonal factors, harsh weather conditions and disasters.\nOur operations are subject to seasonal trends common in our industry. Our revenue and operating margins in the first and fourth quarters are typically lower than those during the second and third quarters due to reduced shipments, decreased fuel efficiency, increased cold-weather related maintenance costs of revenue equipment, and increased insurance and claims costs during the winter months; however, the effects of the COVID-19 pandemic on the domestic economy has impacted, and may continue to impact, our normal seasonal trends. Harsh winter weather or natural disasters, including but not limited to hurricanes, tornadoes, floods, fires, earthquakes and storms can also adversely impact our performance by disrupting freight shipments or routes, destroying our assets, disrupting fuel supplies, increasing fuel costs, increasing maintenance costs, reducing demand and negatively impacting the business or financial condition of our customers, any of which could harm our results of operations or make our results of operations more volatile.\nWe have significant ongoing cash requirements that could limit our growth and affect our profitability if we are unable to obtain sufficient capital.\nOur business is highly capital intensive. As further described in Part II, Item 7 of this Annual Report on Form 10-K, we generally finance our capital expenditures and planned growth with existing cash, cash flow from operations, issuance of debt (including pursuant to our note purchase and private shelf agreement) and through available borrowings under our existing senior unsecured credit agreement. We may require additional capital to finance long-term real estate purchase opportunities and acquisitions, which we may fund through additional debt or through equity offerings. If we are unable to generate sufficient cash from our operations or raise capital by accessing the debt and equity markets, we may be forced to limit our growth and operate our equipment for longer periods of time, which could have a material adverse effect on our operating results.\nOur business also has significant ongoing operating cash requirements. If our cash requirements are high or our cash flow from operations is low during particular periods, we may need to seek additional financing, which could be costly or difficult to obtain.\nA decrease in the demand and value of used equipment may impact our results of operations.\nAs we purchase new tractors and trailers as part of our normal replacement cycle each year, we rely on the used equipment market to dispose of our older equipment. Oversupply in the transportation industry as well as adverse domestic and foreign economic conditions can negatively impact the demand for used equipment and, therefore, reduce the value we can obtain on our used equipment. If we are unable to sell our older equipment at or above our salvage value, the resulting losses could have a significant impact on our results of operations.\nWe may be unable to successfully consummate and integrate acquisitions as part of our growth strategy.\nGrowth through acquisitions historically has been one of several key components of our LTL growth strategy. In the future, we may seek to acquire other LTL carriers as well as other complementary businesses. Exploration of potential acquisitions requires significant attention from our management team. In addition, we expect to compete for acquisition opportunities with other companies, some of which may have greater financial and other resources than we do. We cannot ensure that we will have sufficient cash to consummate an acquisition or otherwise be able to obtain financing for an acquisition. If we are unable to access sufficient funding for potential acquisitions, we may not be able to complete transactions that we otherwise find advantageous.\nAny subsequent acquisition will entail numerous risks, including:\n•\nwe may not achieve anticipated levels of revenue, efficiency, cash flows and profitability;\n•\nwe may experience difficulties managing businesses that are outside our historical core competency and markets;\n•\nwe may underestimate the resources required to support acquisitions, which could disrupt our ongoing business and distract our management;\n•\nwe may incur unanticipated costs to our infrastructure to support new business lines or separate legal entities;\n•\nwe may be required to temporarily match existing customer pricing in the acquiree’s markets, which may be lower than the rates that we would typically charge for our services;\n•\nliabilities we assume could be greater than our original estimates or may not be disclosed to us at the time of acquisition;\n•\nwe may incur additional indebtedness or we may issue additional equity to finance future acquisitions, which could be dilutive to our shareholders;\n•\npotential loss of key employees and customers of the acquired company; and\n•\nan inability to recognize projected cost savings and economies of scale.\nIn addition, we may have difficulty integrating any acquired business and its operations, services and personnel into our existing operations, and such integration may require a significant amount of time and effort by our management team. To the extent we do not successfully avoid or overcome the risks or problems resulting from any acquisitions we undertake, there could be a material adverse effect on our business, financial condition and results of operations.\nWe are subject to various risks arising from our international business operations and relationships, which could adversely affect our business.\nWe arrange for transportation and logistics services to and from various international locations and are subject to both the risks of conducting international business and the requirements of the Foreign Corrupt Practices Act of 1977 (the “FCPA”). Failure to comply with the FCPA may result in legal claims against us. In addition, we face other risks associated with international operations and relationships, which may include restrictive trade policies, the renegotiation of international trade agreements, imposition of duties, taxes or government royalties imposed by foreign governments, which could adversely affect our business.\nAnti-terrorism measures and terrorist events may disrupt our business.\nFederal, state and municipal authorities have implemented and are continuing to implement various anti-terrorism measures, including checkpoints and travel restrictions on large trucks. If additional security measures disrupt or impede the timing of our deliveries, we may fail to meet the requirements of our customers or incur increased expenses to do so. There can be no assurance that new anti-terrorism measures will not be implemented and that such measures will not have a material adverse effect on our operations.\nRisks Related to our Industry\nWe operate in a rapidly evolving and highly competitive industry, and our business will suffer if we are unable to adequately address potential downward pricing pressures and other factors that may adversely affect our operations and profitability.\nOur industry, faced with requirements for faster deliveries and increased visibility into shipments, is rapidly evolving and increasingly competitive. Numerous competitive factors could impair our ability to maintain our current profitability. These factors include, but are not limited to, the following:\n•\nwe compete with other transportation service providers of varying sizes, some of which may have more equipment, a broader global network and brand recognition, a wider range of services, more fully developed information technology systems, greater capital resources or other competitive advantages;\n•\nsome of our competitors may reduce their prices to gain business, especially during times of reduced growth rates in the economy, which may limit our ability to maintain or increase prices or maintain revenue;\n•\nwe may be unable to continue to collect fuel surcharges or our fuel surcharge program may become ineffective in mitigating the impact of the fluctuating costs of fuel and other petroleum-based products;\n•\nmany customers reduce the number of carriers they use by selecting “core carriers” as approved transportation service providers and we may not be selected;\n•\nmany customers periodically accept bids from multiple carriers for their shipping needs, and this process may depress prices or result in the loss of some business to competitors;\n•\nsome shippers may choose to acquire their own trucking fleet or may choose to increase the volume of freight they transport if they have an existing trucking fleet;\n•\nsome customers may choose to consolidate certain LTL shipments through a different mode of transportation, such as truckload, intermodal or rail;\n•\nsome customers may perceive our environmental, social and governance (“ESG”) profile to be less robust than that of our competitors, which could influence the selection of their carrier;\n•\nour customers may manage their inventory levels more closely to a “just-in-time” basis, which may increase our costs and adversely affect our ability to meet our customers’ needs;\n•\nconsolidation in the ground transportation industry may create other large carriers with greater financial resources and other competitive advantages relating to their size;\n•\nadvances in technology require increased investments to remain competitive, and our customers may not be willing to accept higher prices to cover the cost of these investments;\n•\nlarge transportation and e-commerce companies are making significant investments in their capabilities to compete with us;\n•\ncompetition from non-asset-based logistics and freight brokerage companies may adversely affect our customer relationships and ability to maintain sufficient pricing; and\n•\nour existing or future competitors may adopt emerging or additional technologies that improve their operating effectiveness, which could negatively affect our ability to remain competitive.\nIf we are unable to effectively compete with other LTL carriers, whether on the basis of price, service, brand recognition or otherwise, we may be unable to retain existing customers or attract new customers, either of which could have a material adverse effect on our business, financial condition and results of operations. Furthermore, continued merger and acquisition activity in transportation and logistics could result in stronger or new competitors, which could have a material adverse effect on our business, financial condition and results of operations. We may not be able to compete successfully in an increasingly consolidated LTL industry and cannot predict with certainty how industry consolidation will affect our competitors or us.\nOur customers’ and suppliers’ businesses may be impacted by various economic factors such as recessions, downturns in the economy, global uncertainty and instability, changes in U.S. social, political, and regulatory conditions and/or a disruption of financial markets, which may decrease demand for our services or increase our costs.\nAdverse economic conditions, both in the U.S. and internationally, can negatively affect our customers’ business levels, the amount of transportation services they need, their ability to pay for our services and overall freight levels, any of which might impair our asset utilization. Additionally, uncertainty and instability in the global economy and any other action that the U.S. government may take to withdraw from or materially modify international trade arrangements, including related to the United States-Mexico-Canada Agreement, may lead to fewer goods being transported and could have a material adverse effect on our business, financial conditions and results of operations. The U.S. government has made significant changes in U.S. trade policy and has taken certain other actions that may impact U.S. trade, including imposing tariffs on certain goods imported into the United States. To date, several governments, including the European Union, China, and India, have imposed tariffs on certain goods imported from the United States. Any further changes in U.S. or international trade policy could trigger additional retaliatory actions by affected countries, resulting in “trade wars” and increased costs for goods transported globally, which may reduce customer demand for these products if the parties having to pay those tariffs increase their prices, or in trading partners limiting their trade with countries that impose anti-trade measures. If these consequences are realized, the volume of global economic activity may be significantly reduced. Such a reduction could have a material adverse effect on our business, results of operations and financial condition.\nCustomers adversely impacted by changes in U.S. trade policies or otherwise encountering adverse economic conditions, including as a result of the COVID-19 pandemic, may be unable to obtain additional financing or financing under acceptable terms. These customers represent a greater potential for bad debt losses, which may require us to increase our reserve for bad debt. Economic conditions resulting in bankruptcies of a concentration of our customers could have a significant impact on our financial position, results of operations or liquidity in a particular year or quarter. Further, when adverse economic times arise, customers may select competitors that offer lower rates in an attempt to lower their costs, and we might be forced to lower our rates or lose freight volumes.\nOur suppliers’ business levels also may be negatively affected by adverse economic conditions and changes in the political and regulatory environment, both in the U.S. and internationally, or financial constraints, including as a result of the COVID-19 pandemic, which could lead to disruptions in the supply and availability of equipment, parts and services critical to our operations. A significant interruption in our normal supply chain could disrupt our operations, increase our costs and negatively impact our ability to serve our customers.\nWe are also subject to cost increases outside of our control that could materially reduce our profitability if we are unable to increase our rates sufficiently. Such cost increases include, but are not limited to, increases in wage rates, fuel prices, interest rates, taxes, tolls, license and registration fees, insurance, revenue equipment and healthcare for our employees.\nRisks Related to Labor Matters\nIf our employees were to unionize, our operating costs would increase and our ability to compete would be impaired.\nNone of our employees are currently represented under a collective bargaining agreement. However, from time to time there have been efforts to organize our employees at various service centers. Further, Congress or one or more states could approve legislation and/or the National Labor Relations Board could render decisions or implement rule changes that could significantly affect our business and our relationship with our employees, including actions that could substantially liberalize the procedures for union organization. In addition, we can offer no assurance that the Department of Labor will not adopt new regulations or interpret existing regulations in a manner that would favor the agenda of unions, or that our employees will not unionize in the future, particularly if regulatory changes occur that facilitate unionization.\nThe unionization of our employees could have a material adverse effect on our business, financial condition and results of operations because:\n•\nrestrictive work rules could hamper our efforts to improve and sustain operating efficiency;\n•\nrestrictive work rules could impair our service reputation and limit our ability to provide next-day services;\n•\na strike or work stoppage could negatively impact our profitability and could damage customer and employee relationships;\n•\nshippers may limit their use of unionized trucking companies because of the threat of strikes and other work stoppages; and\n•\nan election and bargaining process could divert management’s time and attention from our overall objectives and impose significant expenses.\nDifficulties attracting and retaining qualified drivers and maintenance technicians could result in increases in driver and technician compensation and could adversely affect our profitability, our ability to maintain or grow our fleet and our ability to maintain our customer relationships.\nRecently, there has been intense competition for qualified drivers in the transportation industry resulting from a shortage of drivers. Due in part to the time commitment, physical requirements, our stringent hiring standards, changing workforce demographics and current industry conditions and regulations, the available pool of qualified employee drivers has been declining. As a result, we have faced, and may continue to face, difficulty maintaining or increasing our number of drivers. Similarly, in recent years, there has been a decrease in the overall supply of skilled maintenance technicians, particularly new technicians with qualifications from technical programs and schools, which has made it more difficult, and may continue to make it more difficult, to attract and retain skilled technicians. The compensation we offer our drivers and technicians is subject to market conditions that may require increases in driver or technician compensation. If we are unable to attract and retain a sufficient number of qualified drivers and technicians, we could be required to adjust our compensation packages, amend our hiring standards, or operate with fewer trucks and face difficulty meeting customer demands, any of which could adversely affect our growth and profitability.\nIf we are unable to retain our key employees, or if we do not continue to effectively execute our succession plan, our financial condition, results of operations and liquidity could be adversely affected.\nOur success will continue to depend upon the experience and leadership of our key employees and executive officers. In that regard, the loss of the services of any of our key personnel could have a material adverse effect on our financial condition, results of operations and liquidity if we are unable to secure replacement personnel who have sufficient experience in our industry and in the management of our business. If we are unable to continue to develop and retain a core group of management personnel and execute succession planning strategies, or we encounter any unforeseen difficulties associated with the transition of members of our management team, our business could be negatively impacted in the future.\nRisks Related to Cybersecurity and Technology Matters\nOur information technology systems are subject to cyber and other risks, some of which are beyond our control, which could have a material adverse effect on our business, results of operations and financial position.\nWe rely heavily on the proper functioning and availability of our information systems for our operations as well as for providing value-added services to our customers. Our information systems, including our accounting, communications and data processing systems, are integral to the efficient operation of our business. It is critical that the data processed by these systems remains confidential, as it often includes competitive customer information, confidential customer payment and transaction information, employee records and key financial and operational results and statistics. The sophistication of efforts by hackers, foreign governments, cyber-terrorists, and cyber-criminals, acting individually or in coordinated groups, to launch distributed denial of service attacks or other coordinated attacks that may cause service outages, gain inappropriate or block legitimate access to systems or information, or result in other business interruptions has continued to increase in recent years. We utilize third-party service providers who have access to our systems and certain sensitive data, which exposes us to additional security risks, particularly given the complex and evolving laws and regulations regarding privacy and data protection. While we and our third-party service providers have experienced cyber-attacks and attempted breaches of our and their information technology systems and networks or similar events from time to time, no such incidents have been, individually or in the aggregate, material to us. Cyber incidents that impact the security, availability, reliability, speed, accuracy or other proper functioning of our systems, information and measures, including outages, computer viruses, break-ins and similar disruptions, could have a significant impact on our operations.\nWe have security processes, protocols and standards in place to protect our information systems, including through physical and software safeguards, as well as redundant systems, network security measures and backup systems. Nevertheless, it is difficult to fully protect against the possibility of power loss, telecommunications failures, cyber-attacks, and other cyber incidents in every potential circumstance that may arise. A significant cyber incident, including system failure, security breach, disruption by malware or ransomware, or other damage, could interrupt or delay our operations, damage our reputation and brand, cause a loss of customers, expose us to a risk of loss or litigation, result in regulatory scrutiny, investigations, actions, fines or penalties and/or cause us to incur significant time and expense to remedy such an event, any of which could have a material adverse impact on our results of operations and financial position. Furthermore, any failure to comply with data privacy, security or other laws and regulations, such as the California Consumer Privacy Act and similar laws in the United States, at both the federal and state level, could result in claims, legal or regulatory proceedings, inquiries or investigations. As cyber threats are continually evolving, our controls and procedures may become inadequate and we may be required to devote additional resources to modifying or enhancing our systems in the future. Furthermore, while we maintain insurance intended to address costs associated with aspects of cyber incidents, network failures and data privacy-related concerns, our coverage may not sufficiently cover all types of losses or claims that may arise.\nIf we do not adapt to new technologies implemented by our competitors in the LTL and transportation industry, our business could suffer.\nThe LTL and transportation industry may be impacted by rapid changes in technologies. Our competitors may implement new technology that could improve their service, price, available capacity or business relationships and increase their market share. If we do not appropriately adapt our operations to these new technologies, our business, financial condition, and results of operations may suffer.\nFailure to keep pace with developments in technology, any disruption to our technology infrastructure, or failures of essential services upon which our technology platforms rely could cause us to incur costs or result in a loss of business, which may have a material adverse effect on our results of operations and financial condition.\nWe rely heavily on information technology systems. Our information technology systems are complex and require ongoing investments and enhancements to meet both internal requirements and the requirements of our customers. If we are unable to invest in and enhance or modernize our technology systems in a timely manner or at a reasonable cost, or if we are unable to train our employees to operate the new, enhanced or modernized systems, our results of operations and financial condition could be adversely\naffected. We also may not achieve the benefits that we anticipate from any new technology or new or modernized system, and a failure to do so could result in higher than anticipated costs or adversely affect our results of operations.\nOur information technology systems also depend upon the Internet, third-party service providers, global communications providers, satellite-based communications systems, the electric utilities grid, electric utility providers and telecommunications providers. We have minimal control over the operation, quality, or maintenance of these services or whether vendors will improve their services or continue to provide services that are essential to our business. Disruptions due to transitional challenges in upgrading or enhancing our technology systems; failures in the services upon which our information technology platforms rely, including those that may arise from adverse weather conditions or natural calamities, including but not limited to floods, hurricanes, earthquakes or tornadoes; illegal acts, including terrorist attacks; human error or systems modernization initiatives; and/or other disruptions, may adversely affect our business, which could increase our costs or result in a loss of customers that could have a material adverse effect on our results of operations and financial condition.\nRisks Related to Legal and Regulatory Matters\nThe FMCSA’s CSA initiative could adversely impact our ability to hire qualified drivers, meet our growth projections and maintain our customer relationships, each of which could adversely impact our results of operations.\nThe FMCSA’s Compliance, Safety, Accountability initiative (“CSA”) is an enforcement and compliance program designed to monitor and improve commercial motor vehicle safety by measuring the safety record of both the motor carrier and the driver. These measurements are scored and used by the FMCSA to identify potential safety risks and to direct enforcement action.\nOur CSA scores are dependent upon our safety and compliance experience, which could change at any time. In addition, the safety standards prescribed in CSA could change and our ability to maintain an acceptable score could be adversely impacted. Public disclosure of certain CSA scores was restricted through the enactment of the Fixing America’s Surface Transportation Act of 2015 (the “FAST Act”) on December 4, 2015; however, the FAST Act does not restrict public disclosure of all data collected by the FMCSA. If we receive unacceptable CSA scores, and this data is made available to the public, our relationships with our customers could be damaged, which could result in a loss of business.\nThe requirements of the CSA could also shrink the industry’s pool of drivers, as those with unfavorable scores could leave the industry. As a result, the costs to attract, train and retain qualified drivers could increase. In addition, a shortage of qualified drivers could increase driver turnover, decrease asset utilization, limit growth and adversely impact our results of operations.\nWe operate in a highly regulated industry, and increased costs of compliance with, or liability for violation of, existing or future regulations could have a material adverse effect on our business.\nWe are regulated by the DOT and by various state and federal agencies. These regulatory authorities have broad powers over matters relating to authorized motor carrier operations, as well as motor carrier registration, driver hours of service, safety and fitness of transportation equipment and drivers, transportation of hazardous materials, certain mergers and acquisitions and periodic financial reporting. The trucking industry is also subject to regulatory and legislative changes from a variety of other governmental authorities, which address matters such as increasingly stringent environmental regulations, occupational safety and health regulations, limits on vehicle weight and size, ergonomics, port security, and driver hours of service. We are also subject to the costs and potential adverse impact of compliance associated with FMCSA’s ELD regulations and guidance, including the operation of our fleet and safety management systems on the ELD hardware and software platform. In addition, we are subject to compliance with cargo-security and transportation regulations issued by the TSA and CBP within the U.S. Department of Homeland Security. Regulatory requirements and changes in regulatory requirements or guidance, together with the growing compliance risks presented by increased differences between applicable federal and state regulations, may affect our business or the economics of the industry by requiring changes in operating practices that could influence the demand for and increase the costs of providing transportation services.\nWe are subject to various governmental laws and regulations, and costs of compliance with, liabilities under, or violations of, existing or future governmental laws or regulations could adversely affect our business.\nWe are subject to various federal, state and local environmental laws and regulations that govern, among other things, the disposal, emission and discharge of hazardous waste, hazardous materials, or other materials into the environment, their presence at our properties or in our vehicles, fuel storage tanks, the transportation of certain materials and the discharge or retention of storm water. Under specific environmental laws, we could also be held responsible for any costs relating to contamination at our past or present facilities and at third-party waste disposal sites, as well as costs associated with the clean-up of accidents involving our vehicles. Environmental laws have become and may continue to be increasingly more stringent over time, and there can be no assurance that our costs of complying with current or future environmental laws or liabilities arising under such laws will not have a material adverse effect on our business, operations or financial condition.\nWe may be adversely affected by legal, regulatory, or market responses to climate change concerns.\nIncreased concern over climate change and the potential impact of global warming has led to an increase in the consideration of greenhouse gas emissions regulation. Due to increased consideration, there could be an increase in regulation from federal, state and local governments related to our carbon footprint, including with respect to vehicle engine emissions. This increase in regulation could result in increased direct costs, such as taxes, fees, fuel, or capital costs, or changes to our operations in order to comply. There is also a focus from regulators and our customers on sustainability issues. This focus may result in new legislation or customer requirements, such as limits on vehicle weight and size or energy source. Finally, given the increasing focus on ESG matters by the investor community, if shareholders were to express dissatisfaction with our policies or efforts with respect to climate change, sustainability or similar matters, there could be a negative impact on our stock price, and we could also suffer reputational harm. Costs associated with future climate change concerns or environmental laws and regulations, sustainability requirements and related investor expectations could have a material adverse effect on our financial condition, results of operations, liquidity and cash flows.\nHealthcare legislation may increase our costs for employee healthcare and benefits and reduce our future profitability.\nTo attract and retain employees, we maintain a competitive health insurance plan for our employees and their dependents. We cannot predict the impact that any state or federal healthcare legislation or regulation will have on our operations, but we expect costs associated with providing benefits under employee medical plans and healthcare-related costs associated with workers’ compensation to continue to increase. Rising healthcare costs in the U.S. could result in significant long-term costs to us, which could have a material adverse effect on our operating results. In addition, rising healthcare costs could force us to make further changes to our benefits program, which could negatively impact our ability to attract and retain employees.\nWe are subject to the risks of litigation and governmental proceedings, inquiries, notices or investigations which could adversely affect our business.\nThe nature of our business exposes us to the potential for various claims and litigation related to labor and employment, personal injury, property damage, cargo claims, safety and contract compliance, environmental liability and other matters. Accordingly, we are, and in the future may be, subject to legal proceedings and claims that have arisen in the ordinary course of our business, and may include collective and/or class action allegations. We are also subject to potential governmental proceedings, inquiries, notices or investigations, which also exposes us to the potential for various claims and litigation. The parties in such actions may seek amounts from us that may not be covered in whole or in part by insurance. Defending ourselves against such actions could result in significant costs and could require a substantial amount of time and effort by our management team. We cannot predict the outcome of litigation or governmental proceedings, inquiries, notices or investigations to which we are a party or whether we will be subject to future legal actions. As a result, the potential costs associated with any such legal actions against us could adversely affect our business, financial condition or results of operations.\nWe are subject to legislative, regulatory, and legal developments involving taxes.\nTaxes are a significant part of our expenses. We are subject to U.S. federal and state income, payroll, property, sales and use, fuel, and other types of taxes. Changes to tax laws and regulations or changes to the interpretation thereof, or the ambiguity of tax laws and regulations, the subjectivity of factual interpretations, higher tax rates, claims, audits, investigations or legal proceedings involving taxing authorities, could have a material adverse effect on our results of operations, financial condition, and cash flows.\nRisks Related to Owning our Common Stock\nOur principal shareholders control a large portion of our outstanding common stock.\nEarl E. Congdon, David S. Congdon, John R. Congdon, Jr. and their affiliate family members beneficially own an aggregate of approximately 18% of the outstanding shares of our common stock. As long as the Congdon family controls a large portion of our voting stock, they may be able to significantly influence the election of the entire Board of Directors and the outcome of all matters involving a shareholder vote. The Congdon family’s interests may differ from the interests of other shareholders and the status of their ownership could change at their discretion.\nThere can be no assurance of our ability to declare and pay cash dividends in future periods.\nWe intend to pay a quarterly cash dividend to holders of our common stock for the foreseeable future; however, dividend payments are subject to approval by our Board of Directors, and are restricted by applicable state law limitations on distributions to shareholders as well as certain covenants under our revolving credit facility and our note purchase and private shelf agreement. As a result, future dividend payments are not guaranteed and will depend upon various factors such as our overall financial condition, available liquidity, anticipated cash needs, future prospects for earnings and cash flows, as well as other factors considered relevant by\nour Board of Directors. In addition, any reduction or suspension in our dividend payments could adversely affect the price of our common stock.\nThe amount and frequency of our stock repurchases may fluctuate.\nThe amount, timing and execution of our stock repurchase program may fluctuate based on our strategic approach and our priorities for the use of cash. Other factors that may impact share repurchases include changes in stock price, profitability, capital structure, or cash flows. Our revolving credit facility and our note purchase and private shelf agreement also include provisions that may limit our ability to make payments for share repurchases. We may also use cash for investing in strategic assets or dividend payments, instead of share repurchases.\nThe market value of our common stock has been and may in the future be volatile, and could be substantially affected by various factors.\nThe price of our common stock on the Nasdaq Global Select Market changes constantly. We expect that the market price of our common stock will continue to fluctuate due to a variety of factors, many of which are beyond our control. These factors include, among others:\n•\nactual or anticipated variations in earnings, financial or operating performance or liquidity;\n•\nthe extent of the impact and the duration of the COVID-19 pandemic;\n•\nchanges in analysts’ recommendations or projections;\n•\nfailure to meet analysts’ projections;\n•\ngeneral political, social, economic and capital market conditions;\n•\nannouncements of developments related to our business;\n•\noperating and stock performance of other companies deemed to be peers;\n•\nactions by government regulators;\n•\nchanges in key personnel;\n•\ninvestor sentiment with respect to our policies or efforts on ESG matters;\n•\nfluctuations in trading volume, including substantial increases or decreases in reported holdings by significant shareholders;\n•\nexpectations regarding our capital deployment program, including any existing or potential future share repurchase programs and any future dividend payments that may be declared by our Board of Directors, or any determination to cease repurchasing stock or paying dividends; and\n•\nnews reports of trends, concerns and other issues related to us or our industry, including changes in regulations.\nOur common stock price may continue to fluctuate significantly in the future, and these fluctuations may be unrelated to our performance. General market price declines or market volatility in the future could adversely affect the price of our common stock, and the current market price of our common stock may not be indicative of future market prices.\nOur articles of incorporation, our bylaws and Virginia law contain provisions that could discourage, delay or prevent a change in our control or our management.\nProvisions of our articles of incorporation, bylaws and the laws of Virginia, the state in which we are incorporated, may discourage, delay or prevent a change in control of us or a change in management that shareholders may consider favorable. These provisions:\n•\nlimit who may call a special meeting of shareholders;\n•\nrequire shareholder action by written consent to be unanimous;\n•\nestablish advance notice requirements for nominations for election to our Board of Directors or for proposing matters that can be acted upon at shareholder meetings;\n•\nmay make it difficult to merge with or otherwise absorb a Virginia corporation acquired in a tender offer for the three years after the acquisition; and\n•\nmay make an unsolicited attempt to gain control of us more difficult by restricting the right of specified shareholders to vote newly acquired large blocks of stock.",
    "item_1B": "ITEM 1B. UNRESOLVED STAFF COMMENTS\nNone.",
    "item_1C": "",
    "item_2": "ITEM 2. PROPERTIES\nWe own our principal executive office located in Thomasville, North Carolina, consisting of a two-story office building of approximately 168,000 square feet on 31.8 acres of land. At December 31, 2020, we operated 244 service centers, of which 217 were owned and 27 were leased. Our owned service centers include most of our larger facilities and account for approximately 94% of the total door capacity in our network. We own each of our major breakbulk facilities listed below and have provided the number of doors as of December 31, 2020.\nOur 244 facilities are strategically dispersed over the states in which we operate. At December 31, 2020, the terms of our leased properties ranged from month-to-month to a lease that expires in 2039. We believe that as current leases expire, we will be able to renew them or find comparable facilities without causing any material negative impact on service to our customers or our operating results.\nWe believe that all of our properties are in good repair and are capable of providing the level of service required by current business levels and customer demands. In addition, we believe we have sufficient capacity in our service center network to accommodate increased demand for our services.",
    "item_3": "ITEM 3. LEGAL PROCEEDINGS\nWe are involved in or addressing various legal proceedings and claims, governmental inquiries, notices and investigations that have arisen in the ordinary course of our business and have not been fully adjudicated, some of which may be covered in whole or in part by insurance. Certain of these matters include collective and/or class-action allegations. We do not believe that the resolution of any of these matters will have a material adverse effect upon our financial position, results of operations or cash flows.\nConsistent with SEC Regulation S-K Item 103, we have elected to disclose those environmental legal proceedings with a governmental authority if management reasonably believes that the proceedings may involve potential monetary sanctions of $1,000,000 or more. The following matter is disclosed in accordance with that requirement. We do not believe that any possible loss that may be incurred in connection with the matter will be material to our financial position, results of operations or cash flows.\nOn May 12, 2017, we received a letter from the Orange County California District Attorney’s Office concerning suspected violations of California laws with respect to waste handling practices. As part of the civil investigation conducted in coordination with other California counties, we have shared information about our waste handling practices at our facilities throughout the state. We are in discussions concerning resolution of this matter.",
    "item_4": "ITEM 4. MINE SAFETY DISCLOSURES\nNot applicable.\nPART II",
    "item_5": "ITEM 5. MARKET FOR REGISTRANT’S COMMON EQUITY, RELATED STOCKHOLDER MATTERS AND ISSUER PURCHASES OF EQUITY SECURITIES\nCommon Stock Information\nOur common stock is traded on the Nasdaq Global Select Market (“Nasdaq”) under the symbol ODFL. At February 18, 2021, there were 123,513 holders of our common stock, including 103 shareholders of record.\nThe following table provides information regarding our repurchases of our common stock during the fourth quarter of 2020:\n(1) The total number of shares purchased includes the final settlement of 172,007 shares of our common stock under our Accelerated Share Repurchase Agreement (the “ASR Agreement”) entered into with a third-party financial institution on May 29, 2020 as part of our 2020 Repurchase Program (as defined below). This delivery of shares and their market price at time of delivery are included in the table above. The final number of shares received was based on the daily volume-weighted average share price during the term of the ASR Agreement, less a negotiated discount.\nOn May 1, 2020, we announced that our Board of Directors had approved a new two-year stock repurchase program authorizing us to repurchase up to an aggregate of $700.0 million of our outstanding common stock (the “2020 Repurchase Program”). The 2020 Repurchase Program became effective upon the termination of our $350.0 million repurchase program on May 29, 2020, as of which date $21.5 million remained authorized under the prior program. Under the 2020 Repurchase Program, we may repurchase shares from time to time in open market purchases or through privately negotiated transactions. Shares of our common stock repurchased under our repurchase programs are canceled at the time of repurchase and are classified as authorized but unissued shares of our common stock.\nPerformance Graph\nThe following graph compares the total shareholder cumulative returns, assuming the reinvestment of all dividends, of $100 invested on December 31, 2015, in (i) our common stock, (ii) the S&P 500 Total Return Index, and (iii) the Nasdaq Industrial Transportation Index, for the five-year period ended December 31, 2020.\nCumulative Total Return",
    "item_6": "ITEM 6. SELECTED FINANCIAL DATA\nNot applicable.",
    "item_7": "ITEM 7. MANAGEMENT’S DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION AND RESULTS OF OPERATIONS\nThis Management’s Discussion and Analysis of Financial Condition and Results of Operations generally discusses our 2020 and 2019 results and year-to-year comparisons between 2020 and 2019. Discussions of our 2018 results and year-to-year comparisons between 2019 and 2018 that are not included in this Annual Report on Form 10-K can be found in “Management’s Discussion and Analysis of Financial Condition and Results of Operations” in Part II, Item 7 of our Annual Report on Form 10-K for the fiscal year ended December 31, 2019, which was filed with the Securities and Exchange Commission on February 26, 2020.\nOverview\nWe are one of the largest North American less-than-truckload (“LTL”) motor carriers. We provide regional, inter-regional and national LTL services through a single integrated, union-free organization. Our service offerings, which include expedited transportation, are provided through an expansive network of service centers located throughout the continental United States. Through strategic alliances, we also provide LTL services throughout North America. In addition to our core LTL services, we offer a range of value-added services including container drayage, truckload brokerage and supply chain consulting. More than 98% of our revenue has historically been derived from transporting LTL shipments for our customers, whose demand for our services is generally tied to industrial production and the overall health of the U.S. domestic economy.\nIn analyzing the components of our revenue, we monitor changes and trends in our LTL volumes and LTL revenue per hundredweight. While LTL revenue per hundredweight is a yield measurement, it is also a commonly-used indicator for general pricing trends in the LTL industry. This yield metric is not a true measure of price, however, as it can be influenced by many other factors, such as changes in fuel surcharges, weight per shipment and length of haul. As a result, changes in revenue per hundredweight do not necessarily indicate actual changes in underlying base rates. LTL revenue per hundredweight and the key factors that can impact this metric are described in more detail below:\n•\nLTL Revenue Per Hundredweight - Our LTL transportation services are generally priced based on weight, commodity, and distance. This measurement reflects the application of our pricing policies to the services we provide, which are influenced by competitive market conditions and our growth objectives. Generally, freight is rated by a class system, which is established by the National Motor Freight Traffic Association, Inc. Light, bulky freight typically has a higher class and is priced at higher revenue per hundredweight than dense, heavy freight. Fuel surcharges, accessorial charges, revenue adjustments and revenue for undelivered freight are included in this measurement. Revenue for undelivered freight is deferred for financial statement purposes in accordance with our revenue recognition policy; however, we believe including it in our revenue per hundredweight metrics results in a more accurate representation of the underlying changes in our yields by matching total billed revenue with the corresponding weight of those shipments.\n•\nLTL Weight Per Shipment - Fluctuations in weight per shipment can indicate changes in the mix of freight we receive from our customers, as well as changes in the number of units included in a shipment. Generally, increases in weight per shipment indicate higher demand for our customers’ products and overall increased economic activity. Changes in weight per shipment can also be influenced by shifts between LTL and other modes of transportation, such as truckload and intermodal, in response to capacity, service and pricing issues. Fluctuations in weight per shipment generally have an inverse effect on our revenue per hundredweight, as a decrease in weight per shipment will typically cause an increase in revenue per hundredweight.\n•\nAverage Length of Haul - We consider lengths of haul less than 500 miles to be regional traffic, lengths of haul between 500 miles and 1,000 miles to be inter-regional traffic, and lengths of haul in excess of 1,000 miles to be national traffic. This metric is used to analyze our tonnage and pricing trends for shipments with similar characteristics, and also allows for comparison with other transportation providers serving specific markets. By analyzing this metric, we can determine the success and growth potential of our service products in these markets. Changes in length of haul generally have a direct effect on our revenue per hundredweight, as an increase in length of haul will typically cause an increase in revenue per hundredweight.\n•\nLTL Revenue Per Shipment - This measurement is primarily determined by the three metrics listed above and is used in conjunction with the number of LTL shipments we receive to evaluate LTL revenue.\nOur primary revenue focus is to increase density, which is shipment and tonnage growth within our existing infrastructure. Increases in density allow us to maximize our asset utilization and labor productivity, which we measure over many different functional areas of our operations including linehaul load factor, P&D stops per hour, P&D shipments per hour, platform pounds handled per hour and platform shipments per hour. In addition to our focus on density and operating efficiencies, it is critical for us to obtain an appropriate yield, which is measured as revenue per hundredweight, on the shipments we handle to offset our cost inflation and support our ongoing investments in capacity and technology. We regularly monitor the components of our pricing, including base freight rates, accessorial charges and fuel surcharges. The fuel surcharge is generally designed to offset fluctuations in the cost of our\npetroleum-based products and is indexed to diesel fuel prices published by the DOE, which reset each week. We believe our yield management process focused on individual account profitability, and ongoing improvements in operating efficiencies, are both key components of our ability to produce profitable growth.\nOur primary cost elements are direct wages and benefits associated with the movement of freight, operating supplies and expenses, which include diesel fuel, and depreciation of our equipment fleet and service center facilities. We gauge our overall success in managing costs by monitoring our operating ratio, a measure of profitability calculated by dividing total operating expenses by revenue, which also allows for industry-wide comparisons with our competition.\nWe regularly upgrade our technological capabilities to improve our customer service and lower our operating costs. Our technology provides our customers with visibility of their shipments throughout our network, increases the productivity of our workforce, and provides key metrics that we use to monitor and enhance our processes.\nResults of Operations\nThe following table sets forth, for the years indicated, expenses and other items as a percentage of revenue from operations:\nKey financial and operating metrics for 2020 and 2019 are presented below:\nDespite the difficult operating conditions created by the COVID-19 pandemic, our financial results for 2020 include Company records for profitability and diluted earnings per share. While our annual revenue decreased slightly as a result of a decrease in our volumes, our LTL revenue per hundredweight increased as we maintained our price discipline throughout the year. The increase in\nour yields along with the increase in productivity allowed us to improve our variable operating costs as a percent of revenue. We also improved our overhead costs as a percent of revenue due to our control over discretionary spending during the year. These factors contributed to the 270 basis point improvement in our operating ratio resulting in a new Company record of 77.4% for the year. As a result, our net income and diluted earnings per share increased 9.3% and 11.4%, respectively, in 2020 as compared to 2019.\nRevenue\nRevenue decreased $94.0 million, or 2.3%, in 2020 compared to 2019. This decline reflects a decrease in LTL tons and a slight decline in our LTL revenue per hundredweight when compared with 2019. The decrease in LTL tons in 2020 was primarily attributable to a decline in shipments that was partially offset by an increase in our LTL weight per shipment. The decrease in LTL shipments was driven by the impact of a slowdown in the domestic economy associated with the COVID-19 pandemic, primarily during the second quarter of 2020.\nLTL revenue per hundredweight decreased 0.1% in 2020 compared to 2019. Our LTL revenue and yield were negatively impacted by a decrease in fuel surcharges that resulted from a significant decline in the average price of diesel fuel for the comparable periods. The slight decrease in LTL revenue per hundredweight also includes the adverse impact of the increase in our LTL weight per shipment on this metric. Excluding fuel surcharges, LTL revenue per hundredweight increased 2.5% in 2020 compared to 2019 as a result of the ongoing commitment to our yield management strategy, which is supported by our best-in-class service to customers. As a percent of revenue, fuel surcharges decreased to 10.5% in 2020 as compared to 12.7% in 2019.\nJanuary 2021 Update\nRevenue per day increased 14.6% in January 2021 compared to the same month last year. LTL tons per day increased 11.9%, due primarily to a 7.0% increase in LTL shipments per day and a 4.6% increase in LTL weight per shipment. LTL revenue per hundredweight increased 2.2% as compared to the same month last year. LTL revenue per hundredweight, excluding fuel surcharges, increased 4.1% as compared to the same month last year.\nOperating Costs and Other Expenses\nSalaries, wages and benefits decreased $68.6 million, or 3.2%, in 2020 as compared to 2019, due to a $21.2 million decrease in the costs attributable to salaries and wages and a $47.4 million decrease in benefits costs. The decrease in salaries and wages was due to a decrease in the average number of active full-time employees and improvements in productivity. These decreases were partially offset by the impact of annual wage increases provided to our employees at the beginning of both September of 2019 and 2020 and two special bonuses provided to eligible employees during 2020 in recognition of their outstanding service to our customers during the COVID-19 pandemic. Our average number of active full-time employees decreased 1,530, or 7.4%, as compared to 2019 as we aligned our headcount with shipment volume trends.\nOur productive labor costs, which include wages for drivers, platform employees, and fleet technicians, increased slightly as a percent of revenue to 27.8% in 2020 as compared to 27.6% in 2019. While our productive labor costs as a percentage of revenue were negatively impacted by the deleveraging effect of lower fuel surcharges, we increased the efficiency of our operations with improvements in our linehaul laden load average, P&D shipments and stops per hour and platform pounds and shipments per hour as compared to 2019. Our other salaries and wages as a percent of revenue also increased slightly to 10.4% in 2020 as compared to 10.2% in 2019.\nEmployee benefit costs decreased $47.4 million in 2020 as compared to 2019, due primarily to a reduction in expense related to our phantom stock plans, which were amended in the fourth quarter of 2019 to allow the awards to be settled in stock and limit our ongoing benefits expense in future periods. Our employee benefit costs were also lower due to a reduction in group health and dental and workers’ compensation resulting from a decrease in employee headcount and fewer claims per employee during 2020. As a result of these expense reductions, our employee benefit costs as a percent of salaries and wages decreased to 33.8% in 2020 from 36.4% in 2019.\nWe believe our active full-time employee count will increase as we continue to hire employees to balance our workforce with growing demand and shipment trends. Although we intend to hire additional employees in 2021 to further increase the capacity of our workforce, we expect to continue to purchase supplemental transportation until the capacity of our team can fully support our anticipated growth.\nOperating supplies and expenses decreased $99.7 million, or 21.1%, in 2020 as compared to 2019, due primarily to a decrease in our costs for diesel fuel used in our vehicles. Our diesel fuel costs, excluding fuel taxes, represents the largest component of operating supplies and expenses, and can vary based on both the average price per gallon and consumption. Our average cost per gallon of diesel fuel decreased 31.8% in 2020 as compared to 2019. In addition, our gallons consumed decreased 4.5% in 2020 as compared to 2019 due to a decrease in miles driven. We do not use diesel fuel hedging instruments; therefore, our costs are subject to\nmarket price fluctuations. Other operating supplies and expenses improved as a percent of revenue between the periods compared as we efficiently maintained our fleet and managed our other variable operating expenses.\nGeneral supplies and expenses decreased $13.7 million, or 11.0%, in 2020 as compared to 2019, due primarily to lower advertising and marketing costs as we controlled our discretionary spending. We also benefited from lower travel-related expenses, due to travel restrictions imposed during the COVID-19 pandemic. While we will continue our discipline in controlling discretionary spending in 2021, we anticipate that certain costs that were reduced in 2020 will be restored in future periods.\nDepreciation and amortization increased $7.6 million, or 3.0%, in 2020 as compared to 2019. While our 2020 capital expenditure plan was lower than in 2019, particularly with respect to revenue equipment and real estate, we believe depreciation expense will continue to increase in future periods as we maintain our focus on expanding capacity to support our anticipated growth and long-term strategic initiatives.\nOur effective tax rate in 2020 was 25.4% as compared to 25.3% in 2019. Our effective tax rate generally exceeds the federal statutory rate due to the impact of state taxes and, to a lesser extent, certain other non-deductible items.\nLiquidity and Capital Resources\nA summary of our cash flows is presented below:\nThe change in our cash flows provided by operating activities during 2020 as compared to 2019 was impacted by an increase in our income taxes paid of $109.2 million and fluctuations in certain working capital accounts, which were partially offset by an increase in net income.\nThe changes in cash flows used in investing activities during 2020 as compared to 2019 was primarily due to purchases of short-term investments in 2020, partially offset by a reduction in capital expenditures as compared to 2019. Changes in our capital expenditures are more fully described below in “Capital Expenditures.”\nThe changes in cash flows used in financing activities for all periods were due primarily to fluctuations in capital returned to shareholders and fluctuations in our long-term debt. Our financing arrangements are more fully described below under “Financing Agreements.” Our return of capital to shareholders is more fully described below under “Stock Repurchase Program” and “Dividends to Shareholders.”\nWe have five primary sources of available liquidity: cash flows from operations, our existing cash and cash equivalents, short-term investments, available borrowings under our second amended and restated credit agreement (the “Credit Agreement”), and our Note Purchase and Private Shelf Agreement (the “Note Agreement”). Our Credit Agreement and the Note Agreement are described in more detail below under “Financing Arrangements.” We believe we also have sufficient access to debt and equity markets to provide other sources of liquidity, if needed. While the ongoing COVID-19 pandemic creates some uncertainty for the domestic economy, we believe our current sources of liquidity will be sufficient to satisfy our planned capital expenditures and working capital needs.\nCapital Expenditures\nThe table below sets forth our net capital expenditures for property and equipment for the years ended December 31, 2020 and 2019:\nOur capital expenditures vary based upon the projected increase in the number and size of our service center facilities to support our plan for long-term growth, our planned tractor and trailer replacement cycle and forecasted tonnage and shipment growth. Expenditures for land and structures can be dependent upon the availability of land in the geographic areas where we are looking to expand. We expect to continue to maintain a high level of capital expenditures in order to support our long-term plan for market share growth.\nWe currently estimate capital expenditures will be approximately $605 million for the year ending December 31, 2021. Approximately $275 million is allocated for the purchase of service center facilities, construction of new service center facilities or expansion of existing service center facilities, subject to the availability of suitable real estate and the timing of construction projects; approximately $290 million is allocated for the purchase of tractors and trailers; and approximately $40 million is allocated for investments in technology and other assets. We expect to fund these capital expenditures primarily through cash flows from operations, our existing cash and cash equivalents, short-term investments and, if needed, borrowings available under our Credit Agreement, or Note Agreement. We believe our current sources of liquidity will be sufficient to satisfy our expected capital expenditures.\nStock Repurchase Program\nOn May 1, 2020, we announced that our Board of Directors had approved a new two-year stock repurchase program authorizing us to repurchase up to an aggregate of $700.0 million of our outstanding common stock (the “2020 Repurchase Program”). The 2020 Repurchase Program became effective upon the termination of our $350.0 million repurchase program on May 29, 2020, as of which date $21.5 million remained authorized under the prior program. Under the 2020 Repurchase Program, we may repurchase shares from time to time in open market purchases or through privately negotiated transactions. Shares of our common stock repurchased under our repurchase programs are canceled at the time of repurchase and are classified as authorized but unissued shares of our common stock.\nDuring the years ended December 31, 2020 and 2019, we repurchased 2,507,885 and 2,403,336 shares of our common stock under our repurchase programs for an aggregate of $364.1 million and $241.0 million, respectively. As of December 31, 2020, we had $555.2 million remaining authorized under the 2020 Repurchase Program.\nDividends to Shareholders\nOn February 21, 2020, we announced that our Board of Directors approved a three-for-two split of our common stock for shareholders of record as of the close of business on the record date of March 10, 2020. On March 24, 2020, those shareholders received one additional share of common stock for every two shares owned. In lieu of fractional shares, shareholders received a cash payment based on the average of the high and low sales prices of our common stock on the record date.\nAll references in this report to dividend amounts have been restated retroactively to reflect this stock split. Split-adjusted quarterly per-share metrics may not recalculate precisely due to rounding.\nOur Board of Directors also declared quarterly cash dividends that totaled $0.60 per share for the year ended December 31, 2020 and quarterly cash dividends that totaled $0.45 per share for the year ended December 31, 2019.\nFinancing Agreements\nSenior Note Agreements\nWe had an unsecured senior note agreement with a principal amount outstanding of $45.0 million at December 31, 2019 (the “Senior Note”). The agreement for the Senior Note called for a scheduled principal payment of $45.0 million, with an interest rate of 4.79%, on January 3, 2021, which was paid in the fourth quarter of 2020.\nOn May 4, 2020, we entered into the Note Agreement with PGIM, Inc. (“Prudential”) and certain affiliates and managed accounts of Prudential. The Note Agreement, which is uncommitted and subject to Prudential’s sole discretion, provides for the issuance of senior promissory notes with an aggregate principal amount of up to $350.0 million through May 4, 2023. Pursuant to the Note Agreement, we issued $100.0 million aggregate principal amount of senior promissory notes (the “Series B Notes”), the proceeds of which are available for capital expenditures, share repurchases, dividends, acquisitions, or general corporate purposes. Borrowing availability under the Note Agreement is reduced by the outstanding amount of the existing Series B Notes, and all other senior promissory notes issued pursuant to the Note Agreement.\nThe Series B Notes bear interest at 3.10% per annum and mature on May 4, 2027, unless prepaid. Principal payments are required annually beginning on May 4, 2023 in equal installments of $20.0 million through May 4, 2027. The Series B Notes are senior unsecured obligations and rank pari passu with our other senior unsecured indebtedness.\nCredit Agreement\nOn November 21, 2019, we entered into our Credit Agreement with Wells Fargo Bank, National Association serving as administrative agent for the lenders. The Credit Agreement provides for a five-year, $250.0 million senior unsecured revolving line of credit and a $150.0 million accordion feature, which if fully exercised and approved, would expand the total borrowing capacity up to an aggregate of $400.0 million. Of the $250.0 million line of credit commitments under the Credit Agreement, up to $100.0 million may be used for letters of credit.\nAt our option, borrowings under the Credit Agreement bear interest at either: (i) LIBOR (including applicable successor provisions) plus an applicable margin (based on our ratio of net debt-to-total capitalization) that ranges from 1.000% to 1.375%; or (ii) a Base Rate plus an applicable margin (based on our ratio of net debt-to-total capitalization) that ranges from 0.000% to 0.375%. Letter of credit fees equal to the applicable margin for LIBOR loans are charged quarterly in arrears on the daily average aggregate stated amount of all letters of credit outstanding during the quarter. Commitment fees ranging from 0.100% to 0.175% (based upon the ratio of net debt-to-total capitalization) are charged quarterly in arrears on the aggregate unutilized portion of the Credit Agreement.\nFor periods covered under the Credit Agreement, the applicable margin on LIBOR loans and letter of credit fees were 1.000% and commitment fees were 0.100%.\nThe Credit Agreement replaced our previous five-year, $300.0 million senior unsecured revolving credit agreement dated as of December 15, 2015, as amended on September 9, 2016 (the “Prior Credit Agreement”). For periods in 2019 covered under the Prior Credit Agreement, the applicable margin on LIBOR loans and letter of credit fees were 1.000% and commitment fees were 0.125%.\nThe amounts outstanding and available borrowing capacity under the Credit Agreement are presented below:\nGeneral Debt Provisions\nThe Credit Agreement and Note Agreement contain customary covenants, including financial covenants that require us to observe a maximum ratio of debt to total capital and a minimum fixed charge coverage ratio. The Credit Agreement and Note Agreement also include a provision limiting our ability to make restricted payments, including dividends and payments for share repurchases, unless, among other conditions, no defaults or events of default are ongoing (or would be caused by such restricted payment). We were in compliance with all covenants in our outstanding debt instruments for the period ended December 31, 2020.\nThe interest rate is fixed on the Note Agreement. Therefore, short-term exposure to fluctuations in interest rates is limited to our line of credit facility. We do not currently use interest rate derivative instruments to manage exposure to interest rate changes.\nWe do not anticipate financial performance that would cause us to violate any such covenants in the future, and we believe the combination of our existing Credit Agreement and Note Agreement along with our additional borrowing capacity will be sufficient to meet foreseeable seasonal and long-term capital needs.\nContractual Obligations\nThe following table summarizes our significant contractual obligations as of December 31, 2020:\n(1)\nContractual obligations include principal and interest on our senior notes; operating leases consisting primarily of real estate and automotive leases; and purchase obligations relating to non-cancellable purchase orders for (i) equipment scheduled for delivery in 2021, and (ii) information technology agreements. Please refer to the information regarding interest rates and the balance on our revolving credit facility in this section above and also in Note 2 of the Notes to the Financial Statements included in Item 8 of this report.\n(2)\nLease payments include lease extensions that are reasonably certain to be exercised.\nCritical Accounting Policies\nIn preparing our financial statements, we apply the following critical accounting policies that we believe affect our judgments and estimates of amounts recorded in certain assets, liabilities, revenue and expenses. These critical accounting policies are further described in Note 1 of the Notes to the Financial Statements included in Item 8 of this report.\nRevenue Recognition\nOur revenue is generated from providing transportation and related services to customers in accordance with the bill of lading (“BOL”) contract, our general tariff provisions and contractual agreements. Generally, our performance obligations begin when we receive a BOL from a customer and are satisfied when we complete the delivery of a shipment and related services. We recognize revenue for our performance obligations under our customer contracts over time, as our customers receive the benefits of our services in accordance with Accounting Standards Update (“ASU”) 2014-09. With respect to services not completed at the end of a reporting period, we use a percentage of completion method to allocate the appropriate revenue to each separate reporting period. Under this method, we develop a factor for each uncompleted shipment by dividing the actual number of days in transit at the end of a reporting period by that shipment’s standard delivery time schedule. This factor is applied to the total revenue for that shipment and revenue is allocated between reporting periods accordingly. Payment terms vary by customer and are short-term in nature.\nAllowances for Uncollectible Accounts and Revenue Adjustments\nWe maintain an allowance for uncollectible accounts for estimated losses resulting from the failure of our customers to make required payments. We estimate this allowance by analyzing the aging of our customer receivables, our historical loss experience and other trends and factors affecting the credit risk of our customers, including anticipated changes to future performance. We determine customer receivables to be past due when payment has not been received by the invoice due date. Write-offs occur when we determine an account to be uncollectible and could differ from our allowance estimate as a result of factors such as changes in the overall economic environment or risks surrounding our customers. Additional allowances may be required if the financial condition of our customers were to deteriorate, resulting in an impairment of their ability to make payments. We periodically review the underlying assumptions in our estimate of the allowance for uncollectible accounts to ensure that the allowance reflects the most recent trends and factors.\nWe also maintain an allowance for estimated revenue adjustments resulting from future billing corrections, customer allowances, money-back service guarantees and other miscellaneous revenue adjustments. These revenue adjustments are recorded in our revenue from operations. We use historical experience, trends and current information to update and evaluate these estimates.\nClaims and Insurance Accruals\nClaims and insurance accruals reflect the estimated cost of claims for cargo loss and damage, Bodily Injury/Property Damage (“BIPD”), workers’ compensation, group health and dental. The related costs are charged to insurance and claims expense except for workers’ compensation, group health and dental, which are charged to employee benefits expense.\nInsurers providing excess coverage above a company’s self-insured retention or deductible levels typically adjust their premiums to cover insured losses and for other market factors. As a result, we periodically evaluate our self-insured retention and deductible levels to determine the most cost-efficient balance between our exposure and excess coverage.\nIn establishing accruals for claims and expenses, we evaluate and monitor each claim individually, and we use factors such as historical claims development experience, known trends and third-party estimates to determine the appropriate reserves for potential liability. We believe the assumptions and methods used to estimate these liabilities are reasonable; however, any changes in the severity of previously-reported claims, significant changes in medical costs and regulatory changes affecting the administration of our plans could significantly impact the determination of appropriate reserves in future periods.\nProperty and Equipment\nProperty and equipment are recorded at cost and depreciated on a straight-line basis over their estimated economic lives. We use historical experience, certain assumptions and estimates in determining the economic life of each asset. When indicators of impairment exist, we review property and equipment for impairment due to changes in operational and market conditions, and we adjust the carrying value and economic life of any impaired asset as appropriate.\nEstimated economic lives for structures are 7 to 30 years, revenue equipment is 4 to 15 years, other equipment is 2 to 20 years, and leasehold improvements are the lesser of the economic life of the leasehold improvement or the remaining life of the lease. The use of different assumptions, estimates or significant changes in the resale market for our equipment could result in material changes in the carrying value and related depreciation of our assets.\nInflation\nMost of our expenses are affected by inflation, which typically results in increased operating costs. In response to fluctuations in the cost of petroleum products, particularly diesel fuel, we generally include a fuel surcharge in our tariffs and contractual agreements. The fuel surcharge is designed to offset the cost of diesel fuel above a base price and fluctuates as diesel fuel prices change from the base, which is generally indexed to the DOE’s published fuel prices that reset each week. Volatility in the price of diesel fuel, independent of inflation, has impacted our business, as described in this report. However, we do not believe inflation has had a material effect on our results of operations for any of the past three years.\nRelated Party Transactions\nFamily Relationships\nEach of Earl E. Congdon, David S. Congdon and John R. Congdon, Jr. are related to one another and served in various management positions and/or on our Board of Directors during 2020. Our employment agreement with David S. Congdon is incorporated by reference as an exhibit to this Annual Report on Form 10-K. We regularly disclose the amount of compensation that we pay to these individuals, as well as the compensation paid to any of their family members employed by us that from time to time may require disclosure, in the proxy statement for our Annual Meeting of Shareholders.\nAudit Committee Approval\nThe Audit Committee of our Board of Directors reviews and approves all related person transactions in accordance with our Related Person Transactions Policy.",
    "item_7A": "ITEM 7A. QUANTITATIVE AND QUALITATIVE DISCLOSURES ABOUT MARKET RISK\nMarket risk represents the risk of loss that may impact our financial position, results of operations and cash flows due to adverse changes in financial market prices and rates.\nWe are exposed to interest rate risk directly related to loans, if any, under our Credit Agreement, which have variable interest rates. A 100 basis point increase in the average interest rate on this agreement would have no material effect on our operating results. We have established policies and procedures to manage exposure to market risks and use major institutions that we believe are creditworthy to minimize credit risk.\nWe are also exposed to interest rate risk on our short-term investments. We maintain an investment portfolio principally composed of certificates of deposit, U.S. government securities, and commercial paper. At December 31, 2020, these investments totaled $330.3 million. These fixed rate securities are subject to interest rate risk, as sharp increases in market interest rates could have an adverse impact on their fair value. Although the fair values of these instruments can fluctuate, we believe that the short-term, highly liquid nature of these debt securities, and our ability to hold these instruments to maturity, reduces our risk for potential material losses. A hypothetical 100 basis point change in market interest rates at December 31, 2020 would have had an immaterial impact on the fair value of these investments.\nWe are exposed to market risk for investments relating to certain assets held within the Company-owned life insurance contracts on certain current and former employees. The cash surrender value in life insurance contracts included on our Balance Sheets at December 31, 2020 and 2019 was $65.4 million and $59.0 million, respectively. The portion of underlying investments with exposure to market fluctuations was $51.2 million and $56.7 million at December 31, 2020 and 2019, respectively. To provide a meaningful assessment of the market risk for investments relating to Company-owned life insurance contracts, we performed a sensitivity analysis using a 10% change in market value in those investments on December 31, 2020. A 10% change in market value would have caused a $5.1 million and a $5.7 million impact on our pre-tax income in 2020 and 2019, respectively.\nWe are also exposed to commodity price risk related to diesel fuel prices, and we manage our exposure to that risk primarily through the application of fuel surcharges to our customers.\nFor further discussion related to these risks, see Notes 1, 2 and 9 of the Notes to the Financial Statements included in Item 8, “Financial Statements and Supplementary Data” and Item 7, “Management’s Discussion and Analysis of Financial Condition and Results of Operations.”",
    "item_8": "ITEM 8. FINANCIAL STATEMENTS AND SUPPLEMENTARY DATA\nOLD DOMINION FREIGHT LINE, INC.\nBALANCE SHEETS\nThe accompanying notes are an integral part of these financial statements.\nOLD DOMINION FREIGHT LINE, INC.\nSTATEMENTS OF OPERATIONS\nThe accompanying notes are an integral part of these financial statements.\nOLD DOMINION FREIGHT LINE, INC.\nSTATEMENTS OF CHANGES IN SHAREHOLDERS’ EQUITY\nThe accompanying notes are an integral part of these financial statements.\nOLD DOMINION FREIGHT LINE, INC.\nSTATEMENTS OF CASH FLOWS\nThe accompanying notes are an integral part of these financial statements.\nOLD DOMINION FREIGHT LINE, INC.\nNOTES TO THE FINANCIAL STATEMENTS\nNote 1. Significant Accounting Policies\nBusiness\nWe are one of the largest North American less-than-truckload (“LTL”) motor carriers. We provide regional, inter-regional and national LTL services through a single integrated, union-free organization. Our service offerings, which include expedited transportation, are provided through an expansive network of service centers located throughout the continental United States. Through strategic alliances, we also provide LTL services throughout North America. In addition to our core LTL services, we offer a range of value-added services including container drayage, truckload brokerage and supply chain consulting.\nWe have one operating segment and no single customer exceeds 5% of our revenue. The composition of our revenue is summarized below:\nBasis of Presentation\nThe preparation of financial statements in conformity with U.S. generally accepted accounting principles requires management to make estimates and assumptions that affect the amounts reported in the financial statements and accompanying notes. Actual results could differ from those estimates.\nCertain amounts in prior years have been reclassified to conform prior years’ financial statements to the current presentation.\nUnless the context requires otherwise, references in these Notes to “Old Dominion,” the “Company,” “we,” “us” and “our” refer to Old Dominion Freight Line, Inc.\nRevenue and Expense Recognition\nWe recognize revenue based upon when our transportation and related services have been completed in accordance with the bill of lading (“BOL”) contract, our general tariff provisions and contractual agreements with our customers. Generally, our performance obligations begin when we receive a BOL from a customer and are satisfied when we complete the delivery of a shipment and related services. We recognize revenue for our performance obligations under our customer contracts over time, as our customers receive the benefits of our services in accordance with Accounting Standards Update (“ASU”) 2014-09. With respect to services not completed at the end of a reporting period, we use a percentage of completion method to allocate the appropriate revenue to each separate reporting period. Under this method, we develop a factor for each uncompleted shipment by dividing the actual number of days in transit at the end of a reporting period by that shipment’s standard delivery time schedule. This factor is applied to the total revenue for that shipment and revenue is allocated between reporting periods accordingly. Payment terms vary by customer and are short-term in nature.\nExpenses are recognized when incurred.\nAllowances for Uncollectible Accounts and Revenue Adjustments\nWe maintain an allowance for uncollectible accounts for estimated losses resulting from the inability of our customers to make required payments. We estimate this allowance by analyzing the aging of our customer receivables, our historical loss experience and other trends and factors affecting the credit risk of our customers, including anticipated changes to future performance. Write-offs occur when we determine an account to be uncollectible and could differ from our allowance estimate as a result of factors such as changes in the overall economic environment or risks surrounding our customers. Additional allowances may be required if the financial condition of our customers were to deteriorate, resulting in an impairment of their ability to make payments. We periodically review the underlying assumptions in our estimate of the allowance for uncollectible accounts to ensure that the allowance reflects the most recent trends and factors.\nWe also maintain an allowance for estimated revenue adjustments resulting from future billing corrections, customer allowances, money-back service guarantees and other miscellaneous revenue adjustments. These revenue adjustments are recorded in our revenue from operations. We use historical experience, trends, current information and anticipated changes to future performance to update and evaluate these estimates.\nCredit Risk\nFinancial instruments that potentially subject us to concentrations of credit risk consist principally of customer receivables. We perform initial and ongoing credit evaluations of our customers to minimize credit risk. We generally do not require collateral but may require prepayment of our services under certain circumstances. Credit risk is generally diversified due to the large number of entities comprising our customer base and their dispersion across many different industries and geographic regions.\nCash and Cash Equivalents\nWe consider cash on hand and deposits in banks along with certificates of deposit and short-term marketable securities with original maturities of three months or less as cash and cash equivalents.\nShort-term Investments\nThe Company’s investments in certificates of deposit, U.S. government securities, and commercial paper with an original maturity of greater than three months have been classified and accounted for as trading securities, and are reported in “Short-term investments” on our Balance Sheet. These investments are measured at fair value each reporting period, with gains or losses recorded in “Non-operating expense (income)” on our Statement of Operations.\nProperty and Equipment\nProperty and equipment are stated at cost. Major additions and improvements are capitalized, while maintenance and repairs that do not improve or extend the lives of the respective assets are charged to expense as incurred. We capitalize the cost of tires mounted on purchased revenue equipment as a part of the total equipment cost. Subsequent replacement tires are expensed at the time those tires are placed in service. We assess the realizable value of our long-lived assets and evaluate such assets for impairment whenever events or changes in circumstances indicate the carrying amount of an asset may not be recoverable.\nDepreciation of property and equipment is calculated using the straight-line method over the estimated useful lives of the related assets. The following table provides the estimated useful lives by asset type:\nDepreciation expense was $261.3 million, $253.7 million and $230.4 million for 2020, 2019 and 2018, respectively.\nClaims and Insurance Accruals\nWe carry a significant amount of insurance with third-party insurance carriers that provides various levels of protection for our risk exposure, including protection in the areas of property, casualty, cyber, management, and group health, with coverage limits and retention and deductible levels that we believe are reasonable given historical claim activity and severity. We believe that our policy of maintaining self-insured retentions or deductibles under these various insurance programs for a portion of our risks, supported by our safety, claims management and loss prevention programs, is an effective means of managing insurance costs. We periodically review our risk exposure and insurance coverage applicable to those risks and believe that we maintain sufficient insurance coverage.\nClaims and insurance accruals reflect the estimated cost of claims for cargo loss and damage, BIPD, workers’ compensation, group health and group dental. These accruals include amounts for future claims development and claims incurred but not reported, which are primarily based on historical claims development experience. The related cost for cargo loss and damage and BIPD is charged to “Insurance and claims” on our Statements of Operations, while the related costs for workers’ compensation, group health and group dental are charged to “Salaries, wages and benefits” on our Statements of Operations.\nOur liability for claims and insurance totaled $139.6 million and $141.1 million at December 31, 2020 and 2019, respectively. The long-term portions of those reserves were $86.5 million and $86.7 million for 2020 and 2019, respectively, which were included in “Other non-current liabilities” on our Balance Sheets.\nShare-Based Compensation\nWe have various share-based compensation plans for our employees and non-employee directors. Our share-based compensation includes awards of phantom stock, restricted stock, and performance-based restricted stock units which are accounted for under ASC Topic 718, Compensation - Stock Compensation. All share-based compensation expense is presented in “Salaries, wages and benefits” for employees and “Miscellaneous expenses, net” for non-employee directors in the accompanying Statements of Operations. Total compensation expense recognized for all share-based compensation awards, including cash settled phantom shares, was $14.3 million, $42.9 million and $10.7 million during 2020, 2019, and 2018, respectively. The total tax benefit recognized related to these awards was ($3.8) million, ($10.8) million and ($3.2) million during 2020, 2019, and 2018, respectively.\nCash settled phantom stock awards are accounted for as a liability under ASC Topic 718 and changes in the fair value of our liability are recognized as compensation cost over the remaining requisite service period. Changes in the fair value of the liability that occur after the requisite service period are recognized as compensation cost during the period in which the changes occur. We remeasure the liability for the outstanding awards at the end of each reporting period and the compensation cost is based on the change in fair market value for each reporting period.\nIn December 2019, we modified our employee and director phantom stock plans to permit the settlement of outstanding phantom stock awards in shares of the Company’s common stock in lieu of cash settlement. Awards for plan participants electing to settle their awards in stock were amended and certain vesting provisions were waived. Modified awards are accounted for as equity awards rather than liability awards under ASC Topic 718, as they are settled in common stock rather than cash. The total compensation cost of the amended awards was remeasured on the modification date. Any excess over the previously recognized compensation cost will be recognized on a straight-line basis over the requisite remaining period.\nAwards of restricted stock and performance-based restricted stock units are accounted for as equity under ASC Topic 718. We recognize compensation cost, net of estimated forfeitures, for restricted stock awards on a straight-line basis over the requisite service period of each award. Compensation cost for performance-based restricted stock unit awards is recognized using the accelerated attribution method over the requisite service period of each award. At the end of each reporting period, we reassess the probability of achieving performance targets and changes to our initial assessment are reflected in the reporting period in which the change in estimate occurs.\nAdvertising\nThe costs of advertising our services are expensed as incurred and are included in “General supplies and expenses” on our Statements of Operations. Advertising costs charged to expense totaled $19.0 million, $28.3 million and $28.2 million for 2020, 2019 and 2018, respectively.\nCommon Stock Split\nOn February 21, 2020, we announced that our Board of Directors approved a three-for-two split of our common stock for shareholders of record as of the close of business on the record date of March 10, 2020. On March 24, 2020, those shareholders received one additional share of common stock for every two shares owned. In lieu of fractional shares, shareholders received a cash payment based on the average of the high and low sales prices of our common stock on the record date.\nAll references in this report to shares outstanding, weighted average shares outstanding, earnings per share, and dividends per share amounts have been restated retroactively to reflect this stock split. Split-adjusted per-share metrics may not recalculate precisely due to rounding.\nFair Value of Financial Instruments\nFair value is defined as the price that would be received to sell an asset or paid to transfer a liability in an orderly transaction between market participants at the measurement date. The levels of inputs used to measure fair value are:\n•Level 1 - Quoted prices for identical instruments in active markets;\n•Level 2 - Quoted prices for similar instruments in active markets; quoted prices for identical or similar instruments in markets that are not active; and model-derived valuations in which all significant inputs are observable in active markets; and\n•Level 3 - Valuations based on inputs that are unobservable, generally utilizing pricing models or other valuation techniques that reflect management’s judgment and estimates.\nOur short-term investments and our long-term debt, including current maturities, are measured at fair value on a recurring basis, and are further described in Note 9. Our other financial securities in current assets and current liabilities approximate their fair value due to the short-term maturities of these instruments.\nStock Repurchase Program\nOn May 1, 2020, we announced that our Board of Directors had approved a new two-year stock repurchase program authorizing us to repurchase up to an aggregate of $700.0 million of our outstanding common stock (the “2020 Repurchase Program”). The 2020 Repurchase Program became effective upon the termination of our $350.0 million repurchase program on May 29, 2020, as of which date $21.5 million remained authorized under the prior program. Under the 2020 Repurchase Program, we may repurchase shares from time to time in open market purchases or through privately negotiated transactions. Shares of our common stock repurchased under our repurchase programs are canceled at the time of repurchase and are classified as authorized but unissued shares of our common stock. As of December 31, 2020, we had $555.2 million remaining authorized under the 2020 Repurchase Program.\nComprehensive Income\nThe Company has no components of other comprehensive income. Accordingly, net income equals comprehensive income for all periods presented in this report.\nRecent Accounting Pronouncements\nIn June 2016, the Financial Accounting Standards Board (“FASB”) issued Accounting Standards Update (“ASU”) 2016-13, “Financial Instruments - Credit Losses - Measurement of Credit Losses on Financial Statements” (Topic 326). This ASU modified the methodology for establishing a provision against financial assets, including customer receivables, to include an expected future performance component. We adopted ASU 2016-13 on January 1, 2020. The adoption did not have a material impact to our financial position, results of operations, or cash flow.\nNote 2. Long-term Debt\nLong-term debt, net of unamortized debt issuance costs, consisted of the following:\nSenior Note Agreements\nWe had an unsecured senior note agreement with a principal amount outstanding of $45.0 million at December 31, 2019 (the “Senior Note”). The agreement for the Senior Note called for a scheduled principal payment of $45.0 million, with an interest rate of 4.79%, on January 3, 2021, which was paid in the fourth quarter of 2020.\nOn May 4, 2020, we entered into a Note Purchase and Private Shelf Agreement with PGIM, Inc. (“Prudential”) and certain affiliates and managed accounts of Prudential (the “Note Agreement”). The Note Agreement, which is uncommitted and subject to Prudential’s sole discretion, provides for the issuance of senior promissory notes with an aggregate principal amount of up to $350.0\nmillion through May 4, 2023. Pursuant to the Note Agreement, we issued $100.0 million aggregate principal amount of senior promissory notes (the “Series B Notes”), the proceeds of which are available for capital expenditures, share repurchases, dividends, acquisitions, or general corporate purposes. Borrowing availability under the Note Agreement is reduced by the outstanding amount of the existing Series B Notes, and all other senior promissory notes issued pursuant to the Note Agreement.\nThe Series B Notes bear interest at 3.10% per annum and mature on May 4, 2027, unless prepaid. Principal payments are required annually beginning on May 4, 2023 in equal installments of $20.0 million through May 4, 2027. The Series B Notes are senior unsecured obligations and rank pari passu with our other senior unsecured indebtedness.\nCredit Agreement\nOn November 21, 2019, we entered into a second amended and restated credit agreement with Wells Fargo Bank, National Association serving as administrative agent for the lenders (the “Credit Agreement”). The Credit Agreement provides for a five-year, $250.0 million senior unsecured revolving line of credit and a $150.0 million accordion feature, which if fully exercised and approved, would expand the total borrowing capacity up to an aggregate of $400.0 million. Of the $250.0 million line of credit commitments under the Credit Agreement, up to $100.0 million may be used for letters of credit.\nAt our option, borrowings under the Credit Agreement bear interest at either: (i) LIBOR (including applicable successor provisions) plus an applicable margin (based on our ratio of net debt-to-total capitalization) that ranges from 1.000% to 1.375%; or (ii) a Base Rate plus an applicable margin (based on our ratio of net debt-to-total capitalization) that ranges from 0.000% to 0.375%. Letter of credit fees equal to the applicable margin for LIBOR loans are charged quarterly in arrears on the daily average aggregate stated amount of all letters of credit outstanding during the quarter. Commitment fees ranging from 0.100% to 0.175% (based upon the ratio of net debt-to-total capitalization) are charged quarterly in arrears on the aggregate unutilized portion of the Credit Agreement.\nFor periods covered under the Credit Agreement, the applicable margin on LIBOR loans and letter of credit fees were 1.000% and commitment fees were 0.100%.\nThe Credit Agreement replaced our previous five-year, $300.0 million senior unsecured revolving credit agreement dated as of December 15, 2015, as amended on September 9, 2016 (the “Prior Credit Agreement”).\nThere were $42.1 million and $48.9 million of outstanding letters of credit at December 31, 2020 and 2019, respectively.\nGeneral Debt Provisions\nThe Credit Agreement and Note Agreement contain customary covenants, including financial covenants that require us to observe a maximum ratio of debt to total capital and a minimum fixed charge coverage ratio. The Credit Agreement and Note Agreement also include a provision limiting our ability to make restricted payments, including dividends and payments for share repurchases, unless, among other conditions, no defaults or events of default are ongoing (or would be caused by such restricted payment).\nNote 3. Leases\nWe lease certain assets under operating leases, which at December 31, 2020 primarily consist of real estate leases for 27 of our 244 service center locations and automotive leases for private passenger vehicles. Certain operating leases provide for renewal options, which can vary by lease and are typically offered at their fair rental value. We have not made any residual value guarantees related to our operating leases; therefore, we have no corresponding liability recorded on our Balance Sheets.\nThe right-of-use assets and corresponding lease liabilities on our Balance Sheet represent payments over the lease term, which includes renewal options for certain real estate leases that we are likely to exercise. These renewal options begin in 2021 and continue through 2033, and range from one to ten years in length. Short-term leases, which have an initial term of 12 months or less, are not included in our right-of-use assets, or corresponding lease liabilities.\nOf our total lease liabilities, $13.0 million and $10.4 million are classified as current and are presented within “Other accrued liabilities,” and $93.3 million and $56.1 million are classified as non-current and is presented within “Other non-current liabilities,” on our Balance Sheet as of December 31, 2020 and 2019, respectively. Our right-of-use assets totaled $104.4 million and $65.3 million and are presented within “Other assets,” which is classified as long-term, on our Balance Sheet as of December 31, 2020 and 2019, respectively.\nFuture lease payments for assets under operating leases, as well as a reconciliation to our total lease liabilities as of December 31, 2020, are as follows:\n(a) Lease payments include lease extensions that are reasonably certain to be exercised\nThe weighted average lease term for our operating leases was 9.4 years at each of December 31, 2020 and 2019, respectively. The discount rate used in the calculation of our right-of-use assets and corresponding lease liabilities was determined based on the stated rate within each contract when available, or our collateralized borrowing rate from lending institutions. The weighted average discount rate for our operating leases was 3.1% and 4.0% as of December 31, 2020 and 2019, respectively.\nCash paid for amounts included in the measurement of our operating leases was $14.5 million and $14.3 million for the years ended December 31, 2020 and 2019, respectively. Aggregate expense under operating leases was $16.0 million, $14.7 million and $12.6 million for 2020, 2019 and 2018, respectively. Certain operating leases include rent escalation provisions, which we recognize as expense on a straight-line basis. Lease expense is presented within “Operating supplies and expenses” or “General supplies and expenses,” depending on the nature of the use of the leased asset. During the years ended December 31, 2020 and 2019, we added $51.1 million and $8.3 million of right-of-use assets, respectively, in exchange for new operating lease liabilities.\nNote 4. Income Taxes\nThe components of the provision for income taxes are as follows:\nThe following is a reconciliation of income tax expense calculated using the U.S. statutory federal income tax rate with our income tax expense for 2020, 2019 and 2018:\nDeferred tax assets and liabilities, which are included in “Other assets” and “Deferred income taxes” on our Balance Sheets, consist of the following:\nWe are subject to U.S. federal income tax, as well as income tax of multiple state tax jurisdictions. We remain open to examination by the Internal Revenue Service for tax years 2017 through 2020. We also remain open to examination by various state tax jurisdictions for tax years 2016 through 2020.\nThe Company’s liability for unrecognized tax benefits was immaterial as of December 31, 2020 and 2019. Interest and penalties related to uncertain tax positions, which are immaterial, are recorded in our “Provision for income taxes” on our Statements of Operations. Changes in our liability for unrecognized tax benefits could affect our effective tax rate, if recognized, but we do not expect any material changes within the next twelve months.\nNote 5. Related Party Transactions\nEach of Earl E. Congdon, David S. Congdon and John R. Congdon, Jr. are related to one another and served in various management positions and/or on our Board of Directors during 2020. Our employment agreement with David S. Congdon is incorporated by reference as an exhibit to this Annual Report on Form 10-K. We regularly disclose the amount of compensation that we pay to these individuals, as well as the compensation paid to any of their family members employed by us that from time to time may require disclosure, in the proxy statement for our Annual Meeting of Shareholders.\nNote 6. Employee Benefit Plans\nDefined Contribution Plan\nFull-time employees meeting certain eligibility requirements are automatically enrolled in our 401(k) employee retirement plan. Employee contributions are limited to a percentage of the employee’s compensation, as defined in the plan. We match a percentage of our employees’ contributions up to certain maximum limits. In addition, we may also provide a discretionary matching contribution as specified in the plan. Our employer contributions, net of forfeitures, for 2020, 2019 and 2018 were $65.4 million, $60.4 million and $59.8 million, respectively.\nDeferred Compensation Plan\nWe maintain a nonqualified deferred compensation plan for the benefit of certain eligible employees, including those whose contributions to the 401(k) employee retirement plan are limited due to provisions of the Internal Revenue Code. Participating employees may elect to defer receipt of a percentage of their compensation, as defined in the plan, and the deferred amount is credited to each participant’s deferred compensation account. The plan is not funded, and the Company does not make a matching contribution to this plan. Although the plan is not funded, participants are allowed to select investment options for which their deferrals and future earnings are deemed to be invested. Participant accounts are adjusted to reflect participant deferrals and the performance of their deemed investments. The amounts owed to the participants totaled $84.2 million and $75.4 million at December 31, 2020 and 2019, respectively, of which $79.1 million and $71.4 million were included in “Other non-current liabilities” on our Balance Sheets as of December 31, 2020 and 2019, respectively.\nNote 7. Earnings Per Share\nBasic earnings per share is computed by dividing net income by the daily weighted average number of shares of our common stock outstanding for the period, excluding unvested restricted stock. Unvested restricted stock is included in common shares outstanding on our Balance Sheets.\nDiluted earnings per share is computed using the treasury stock method. The denominator used in calculating diluted earnings per share includes the impact of unvested restricted stock and other dilutive, non-participating securities under our equity award agreements. The denominator excludes contingently-issuable shares under performance-based award agreements when the performance target has not yet been deemed achieved.\nThe following table provides a reconciliation of the number of shares of common stock used in computing basic and diluted earnings per share:\nNote 8. Share-Based Compensation\nStock Incentive Plan\nOn May 19, 2016, our shareholders approved the Old Dominion Freight Line, Inc. 2016 Stock Incentive Plan (the “Stock Incentive Plan”) previously approved by our Board of Directors. The Stock Incentive Plan, under which awards may be granted until May 18, 2026 or the Stock Incentive Plan’s earlier termination, serves as our primary equity incentive plan and provides for the grant of incentive stock options, nonqualified stock options, stock appreciation rights, restricted awards, performance awards, phantom stock awards and other stock-based awards or dividend equivalent awards to selected employees and non-employee directors. The maximum number of shares of common stock that we may issue or deliver pursuant to awards granted under the Stock Incentive Plan is 3,000,000 shares.\nRestricted Stock Awards\nDuring 2020, 2019 and 2018, we granted restricted stock awards to selected employees and non-employee directors under the Stock Incentive Plan. The employee restricted stock awards vest in three equal annual installments on each anniversary of the grant date, and the non-employee director restricted stock awards generally vest in full on the first anniversary of the grant date. In both cases, the restricted stock awards are subject to accelerated vesting due to death, total disability, or change in control of the Company. Subject to the foregoing, unvested restricted stock awards are generally forfeited upon termination of employment. The restricted stock awards accrue dividends while the award is unvested and only carry rights to receive the accrued dividends once vested.\nCompensation cost for restricted stock awards is measured at the grant date based on the fair market value per share of our common stock.\nThe following table summarizes our restricted stock award activity for employees and non-employee directors:\nThe weighted average grant date fair value per restricted stock award granted during fiscal years 2020, 2019 and 2018 was $149.38, $96.59 and $91.85, respectively. The total fair value of vested restricted stock awards for fiscal year 2020, 2019 and 2018 was $11.9 million, $7.3 million and $6.2 million, respectively. At December 31, 2020, the Company had $9.9 million of unrecognized stock-based compensation cost, net of estimated forfeitures, related to unvested restricted stock awards that are expected to be recognized over a weighted average period of 1.7 years.\nPerformance-Based Restricted Stock Units\nDuring 2020 and 2019, we granted performance-based restricted stock units (“PBRSUs”) to selected employees under the Stock Incentive Plan. The PBRSUs are earned based on the achievement of stated Company performance metrics over a one-year performance period. One-third of the earned PBRSUs vest following the end of the one-year performance period if the performance metrics are satisfied, with an additional one-third of the PBRSUs vesting on each of the next two grant date anniversaries. Earned PBRSUs are subject to accelerated vesting due to death, total disability, or change in control of the Company. Subject to the foregoing, unvested PBRSUs are generally forfeited if minimum threshold performance targets are not achieved or upon termination of employment. The PBRSUs do not include dividend participation rights.\nCompensation cost for PBRSUs is measured at the grant date based on the fair market value per share of our common stock, with consideration given to the probability of achieving performance targets. At the end of each reporting period, we reassess the probability of achieving performance targets and changes to our initial assessment are reflected in the reporting period in which the change in estimate occurs. All PBRSUs granted in 2019 were forfeited as the performance metrics were not met.\nThe following table summarizes our activity for PBRSUs for employees during 2020:\n(a) Amount represents PBRSUs granted at target. PBRSUs earned may range from zero to 200% of the target award. Actual PBRSUs earned for the 2020 performance period, as determined by the Compensation Committee, were equal to the target amount.\nAt December 31, 2020, the Company had $1.9 million of unrecognized stock-based compensation cost, net of estimated forfeitures, related to unvested PBRSUs that are expected to be recognized over a weighted average period of 2.1 years.\nPhantom Stock Plan\nEmployee Plans\nOn October 30, 2012, our Board of Directors approved, and we adopted the Old Dominion Freight Line, Inc. 2012 Phantom Stock Plan, as amended on January 29, 2015 and December 16, 2019 (the “2012 Phantom Stock Plan”). Under the 2012 Phantom Stock Plan, 1,500,000 shares of phantom stock may be awarded, each of which represents a contractual right to receive an amount in cash or common stock equal to the fair market value of a share of our common stock on the settlement date, which is the earliest of the date of the participant’s (i) termination of employment for any reason other than for cause, (ii) death or (iii) total disability. Each award vests in 20% increments on the anniversary of the grant date provided that the participant (i) has been continuously employed by us since the grant date, (ii) has been continuously employed by us for ten years, and (iii) has reached the age of 65 (with respect to the cash settlement option). Vesting also occurs on the earliest of (i) a change in control, (ii) death or (iii) total disability. Awards are settled in cash or common stock after the required vesting period has been satisfied and upon termination of employment. Unvested shares are forfeited upon termination of employment, although our Board of Directors has authority to modify and/or accelerate the vesting of awards.\nOn May 16, 2005, our Board of Directors approved, and the Company adopted, the Old Dominion Freight Line, Inc. Phantom Stock Plan, as amended January 1, 2009, May 18, 2009, May 17, 2011, January 29, 2015 and December 16, 2019 (the “2005 Phantom Stock Plan” and, together with the 2012 Phantom Stock Plan, the “Employee Phantom Plans”). The 2005 Phantom Stock Plan expired in May 2012; however, grants under the 2005 Phantom Stock Plan remain outstanding. Each share of phantom stock awarded to eligible employees under the 2005 Phantom Stock Plan represents a contractual right to receive an amount in cash or common stock equal to the fair market value of a share of our common stock on the settlement date, which generally is the earlier of the eligible employee’s (i) termination from the Company after reaching 55 years of age (with respect to the cash settlement option), (ii) death, or (iii) total disability. Awards are settled in cash after the required vesting period has been satisfied and upon termination of employment.\nAwards under the 2005 Phantom Stock Plan vest upon the earlier to occur of the following: (i) the date of a change of control in our ownership; (ii) the fifth anniversary of the grant date of the award, provided the participant is employed by us on that date; (iii) the\ndate of the participant’s death while employed by us; (iv) the date of the participant’s total disability; or (v) with respect to the cash settlement option, the date the participant attains the age of 65 while employed by us. Awards that are not vested upon termination of employment are forfeited. The 2005 Phantom Stock Plan does, however, provide the Board of Directors with discretionary authority to modify and/or accelerate the vesting of awards.\nOn December 16, 2019, our Board of Directors approved, and the Company adopted, amendments to the Employee Phantom Plans. The amendments permit settlement of outstanding phantom stock awards in shares of the Company’s common stock in lieu of cash settlement, among other administrative changes. For employees who elected to amend their phantom stock awards under the Employee Phantom Plans and settle awards in common stock, the amended award agreements also provide for waivers of the age 65 and age 55 vesting provisions required by the 2012 Phantom Stock Plan and the 2005 Phantom Stock Plan, respectively.\nDirector Plan\nOn May 28, 2008, our Board of Directors approved, and the Company adopted, the Old Dominion Freight Line, Inc. Director Phantom Stock Plan, as amended April 1, 2011, February 20, 2014, August 7, 2014, February 25, 2016 and December 16, 2019 (the “Director Phantom Stock Plan” and together with the Employee Phantom Plans, the “Phantom Plans”). Under the Director Phantom Stock Plan, each eligible non-employee director was granted an annual award of phantom shares. Our Board of Directors approved the initial grant under this plan at its May 2008 meeting and authorized the subsequent annual grants to be made thereafter. For each vested phantom share, participants are entitled to an amount in cash or common stock equal to the fair market value of the award on the date that service as a director terminates for any reason. Our shareholders approved the Stock Incentive Plan at our 2016 Annual Meeting of Shareholders; as a result, no phantom shares have been granted under the Phantom Plans since such approval.\nDirector Phantom Stock Plan awards vest upon the earlier to occur of the following: (i) the one-year anniversary of the grant date; (ii) the date of the first annual meeting of shareholders that occurs after the grant date provided the participant is still in service as a director; (iii) the date of a change of control in our ownership provided that the participant is still in service as a director; or (iv) the date of the participant’s death or total disability while still in service as a director. Awards that are not vested upon termination of service as a director are forfeited.\nOn December 16, 2019, our Board of Directors approved, and the Company adopted, an amendment to the Director Phantom Stock Plan. The amendment permits settlement of outstanding phantom stock awards in shares of the Company’s common stock in lieu of cash settlement, among other administrative changes.\nAccounting Impact\nModified awards are accounted for as equity awards rather than liability awards under ASC Topic 718, Compensation - Stock Compensation, as they are settled in common stock rather than cash. In December 2019, awards for 613,996 employee and director phantom shares were modified to settle in shares of the Company’s common stock. These modified awards have a weighted average grant date fair value per share of $120.41.\nA summary of the changes in the number of outstanding phantom stock awards during the year ended December 31, 2020 for the Phantom Plans is provided below:\nAll phantom shares outstanding at December 31, 2020 relate to modified awards. Of these outstanding awards, 600,719 phantom shares were vested at December 31, 2020 with a weighted average grant date fair value per share of $120.56. The remaining phantom shares are unvested and have a weighted average grant date fair value per share of $113.65. There were no unsettled phantom stock awards accounted for as a liability under the Phantom Plans as of December 31, 2020.\nWhile the Stock Incentive Plan currently serves as our primary equity plan, the terms of the Phantom Stock Plans and related award agreements will continue to govern all awards granted under the Phantom Stock Plans until such awards have been settled, forfeited, canceled or have otherwise expired or terminated.\nNote 9. Fair Value Measurements\nShort-term investments\nA summary of the fair value of our short-term investments as of December 31, 2020 is shown in the table below.\nOur certificates of deposit are measured at carrying value including accrued interest, which approximates fair value due to their short-term nature. Our commercial paper is valued using broker quotes that utilize observable market inputs.\nLong-term debt\nThe carrying value of our total long-term debt, including current maturities, was $99.9 million and $45.0 million at December 31, 2020 and 2019, respectively. The estimated fair value of our total long-term debt, including current maturities, was $105.4 million and $46.1 million at December 31, 2020 and 2019, respectively. The fair value measurement of our senior notes was determined using a discounted cash flow analysis that factors in current market yields for comparable borrowing arrangements under our credit profile. Since this methodology is based upon market yields for comparable arrangements, the measurement is categorized as Level 2 under the three-level fair value hierarchy as established by the Financial Accounting Standards Board.\nNote 10. Commitments and Contingencies\nWe are involved in or addressing various legal proceedings and claims, governmental inquiries, notices and investigations that have arisen in the ordinary course of our business and have not been fully adjudicated, some of which may be covered in whole or in part by insurance. Certain of these matters include collective and/or class-action allegations. We do not believe that the resolution of any of these matters will have a material adverse effect upon our financial position, results of operations or cash flows.\nReport of Independent Registered Public Accounting Firm\nTo the Shareholders and the Board of Directors of Old Dominion Freight Line, Inc.\nOpinion on the Financial Statements\nWe have audited the accompanying balance sheets of Old Dominion Freight Line, Inc. (the Company) as of December 31, 2020 and 2019, the related statements of operations, changes in shareholders' equity and cash flows for each of the three years in the period ended December 31, 2020, and the related notes, as well as the financial statement schedule listed in the Index at Item 15(a)(2) (collectively referred to as the “financial statements”). In our opinion, the financial statements present fairly, in all material respects, the financial position of the Company at December 31, 2020 and 2019, and the results of its operations and its cash flows for each of the three years in the period ended December 31, 2020, in conformity with U.S. generally accepted accounting principles.\nWe also have audited, in accordance with the standards of the Public Company Accounting Oversight Board (United States) (PCAOB), the Company's internal control over financial reporting as of December 31, 2020, based on criteria established in Internal Control-Integrated Framework issued by the Committee of Sponsoring Organizations of the Treadway Commission (2013 framework) and our report dated February 24, 2021 expressed an unqualified opinion thereon.\nBasis for Opinion\nThese financial statements are the responsibility of the Company's management. Our responsibility is to express an opinion on the Company’s financial statements based on our audits. We are a public accounting firm registered with the PCAOB and are required to be independent with respect to the Company in accordance with the U.S. federal securities laws and the applicable rules and regulations of the Securities and Exchange Commission and the PCAOB.\nWe conducted our audits in accordance with the standards of the PCAOB. Those standards require that we plan and perform the audit to obtain reasonable assurance about whether the financial statements are free of material misstatement, whether due to error or fraud. Our audits included performing procedures to assess the risks of material misstatement of the financial statements, whether due to error or fraud, and performing procedures that respond to those risks. Such procedures included examining, on a test basis, evidence regarding the amounts and disclosures in the financial statements. Our audits also included evaluating the accounting principles used and significant estimates made by management, as well as evaluating the overall presentation of the financial statements. We believe that our audits provide a reasonable basis for our opinion.\nCritical Audit Matter\nThe critical audit matter communicated below is a matter arising from the current period audit of the financial statements that was communicated or required to be communicated to the audit committee and that: (1) relates to accounts or disclosures that are material to the financial statements and (2) involved our especially challenging, subjective or complex judgments. The communication of the critical audit matter does not alter in any way our opinion on the financial statements, taken as a whole, and we are not, by communicating the critical audit matter below, providing a separate opinion on the critical audit matter or on the accounts or disclosures to which it relates.\nSelf-Insurance Reserves for Bodily Injury/Property Damage (“BIPD”) and Workers’ Compensation\nDescription of the Matter\nThe liability for claims and insurance totaled $139.6 million at December 31, 2020, and the majority of this amount represents the self-insurance reserves for BIPD and workers’ compensation claims. The long-term portion of this liability was $86.5 million, which was included in “Other non-current liabilities”, and the remainder was included in “Claims and insurance accruals” on the Company’s Balance Sheet.\nAs described in Note 1 to the financial statements, claims and insurance accruals include the estimated cost of claims for BIPD and workers' compensation. These accruals include estimates for both future claims development on reported claims as well as claims incurred but not yet reported. The Company uses historical claims experience, known trends and third-party analyses to estimate the liabilities for each of the BIPD and workers’ compensation reserves. These analyses are complex and require significant judgment as the models utilize multiple valuation methods and reflect subjective assumptions, including 1) the weighting of such methods, 2) the loss ratio, 3) the loss trend factor and 4) the loss development factor, among other assumptions.\nHow We Addressed the Matter in Our Audit\nWe identified and tested internal controls over management’s review of the estimate for self-insurance reserves for BIPD and workers’ compensation claims, including controls over the completeness and accuracy of data inputs used in the Company’s third-party calculations, the assumptions and reserve calculations, as well as management’s evaluation of service organization controls and user controls over the Company’s claims data managed by its third-party administrator.\nTo test the self-insurance reserves for BIPD and workers’ compensation claims balances, our audit procedures included, among others, evaluating the methodologies used and the significant assumptions discussed above, as well as performing procedures with respect to underlying data and calculations used in the Company’s third-party analyses. We involved our actuarial specialists to assist in our evaluation of the appropriateness of the methods and assumptions used as well as to independently calculate ranges of reasonable reserve estimates developed based on independently selected assumptions and to compare such ranges to the Company’s recorded reserves. We tested claims data by comparing the data to supporting source documentation and payment information as well as performing trend analyses.\n/s/ Ernst & Young LLP\nWe have served as the Company’s auditor since 1994.\nRaleigh, North Carolina\nFebruary 24, 2021",
    "item_9": "ITEM 9. CHANGES IN AND DISAGREEMENTS WITH ACCOUNTANTS ON ACCOUNTING AND FINANCIAL DISCLOSURE\nNone.",
    "item_9A": "ITEM 9A. CONTROLS AND PROCEDURES\na)\nEvaluation of disclosure controls and procedures\nAs of the end of the period covered by this report, our management has conducted an evaluation, with the participation of our Chief Executive Officer (“CEO”) and Chief Financial Officer (“CFO”), of the effectiveness of our disclosure controls and procedures in accordance with Rule 13a-15 under the Exchange Act. Based on this evaluation as of the end of the period covered by this report, our CEO and CFO concluded that, as of such date, our disclosure controls and procedures were effective to ensure that information required to be disclosed by us in the reports that we file or submit under the Exchange Act is (i) accumulated and communicated to our management, including our CEO and CFO, as appropriate to allow timely decisions regarding required disclosure, and (ii) recorded, processed, summarized and reported within the time periods specified in the SEC’s rules and forms.\nb)\nManagement’s annual report on internal control over financial reporting\nManagement is responsible for establishing and maintaining adequate internal control over financial reporting in accordance with Exchange Act Rule 13a-15(f). Management has conducted an evaluation, with the participation of our CEO and CFO, of the effectiveness of our internal control over financial reporting as of December 31, 2020 based on the framework in Internal Control - Integrated Framework issued by the Committee of Sponsoring Organizations of the Treadway Commission (the “2013 Framework”). Management concluded that our internal control over financial reporting was effective as of December 31, 2020, based on our evaluation under the 2013 Framework.\nA control system, no matter how well conceived and operated, can provide only reasonable, not absolute, assurance that the objectives of the control system are met. Further, in designing a control system, we must take into account the benefits of controls relative to their costs. Because of the inherent limitations in all control systems, no evaluation of controls can provide absolute assurance that all control issues and instances of fraud, if any, within the Company have been detected.\nThe effectiveness of our internal control over financial reporting as of December 31, 2020 has been audited by Ernst & Young LLP, an independent registered public accounting firm, as stated in its report dated February 24, 2021, which is included herein.\nc)\nChanges in internal control over financial reporting\nThere were no changes in our internal control over financial reporting that occurred during the last quarter of the period covered by this report that have materially affected, or are reasonably likely to materially affect, our internal control over financial reporting.\nReport of Independent Registered Public Accounting Firm\nTo the Shareholders and the Board of Directors of Old Dominion Freight Line, Inc.\nOpinion on Internal Control over Financial Reporting\nWe have audited Old Dominion Freight Line, Inc.’s internal control over financial reporting as of December 31, 2020, based on criteria established in Internal Control-Integrated Framework issued by the Committee of Sponsoring Organizations of the Treadway Commission (2013 framework) (the COSO criteria). In our opinion, Old Dominion Freight Line, Inc. (the Company) maintained, in all material respects, effective internal control over financial reporting as of December 31, 2020, based on the COSO criteria.\nWe also have audited, in accordance with the standards of the Public Company Accounting Oversight Board (United States) (PCAOB), the balance sheets of the Company as of December 31, 2020 and 2019, the related statements of operations, changes in shareholders’ equity and cash flows for each of the three years in the period ended December 31, 2020, and the related notes and the financial statement schedule listed in the Index at Item 15(a)(2) and our report dated February 24, 2021 expressed an unqualified opinion thereon.\nBasis for Opinion\nThe Company’s management is responsible for maintaining effective internal control over financial reporting and for its assessment of the effectiveness of internal control over financial reporting included in the accompanying Management’s Annual Report on Internal Control over Financial Reporting. Our responsibility is to express an opinion on the Company’s internal control over financial reporting based on our audit. We are a public accounting firm registered with the PCAOB and are required to be independent with respect to the Company in accordance with the U.S. federal securities laws and the applicable rules and regulations of the Securities and Exchange Commission and the PCAOB.\nWe conducted our audit in accordance with the standards of the PCAOB. Those standards require that we plan and perform the audit to obtain reasonable assurance about whether effective internal control over financial reporting was maintained in all material respects.\nOur audit included obtaining an understanding of internal control over financial reporting, assessing the risk that a material weakness exists, testing and evaluating the design and operating effectiveness of internal control based on the assessed risk, and performing such other procedures as we considered necessary in the circumstances. We believe that our audit provides a reasonable basis for our opinion.\nDefinition and Limitations of Internal Control Over Financial Reporting\nA company’s internal control over financial reporting is a process designed to provide reasonable assurance regarding the reliability of financial reporting and the preparation of financial statements for external purposes in accordance with generally accepted accounting principles. A company’s internal control over financial reporting includes those policies and procedures that (1) pertain to the maintenance of records that, in reasonable detail, accurately and fairly reflect the transactions and dispositions of the assets of the company; (2) provide reasonable assurance that transactions are recorded as necessary to permit preparation of financial statements in accordance with generally accepted accounting principles, and that receipts and expenditures of the company are being made only in accordance with authorizations of management and directors of the company; and (3) provide reasonable assurance regarding prevention or timely detection of unauthorized acquisition, use, or disposition of the company’s assets that could have a material effect on the financial statements.\nBecause of its inherent limitations, internal control over financial reporting may not prevent or detect misstatements. Also, projections of any evaluation of effectiveness to future periods are subject to the risk that controls may become inadequate because of changes in conditions, or that the degree of compliance with the policies or procedures may deteriorate.\n/s/ Ernst & Young LLP\nRaleigh, North Carolina\nFebruary 24, 2021",
    "item_9B": "ITEM 9B. OTHER INFORMATION\nNone.\nPART III",
    "item_9C": "",
    "item_10": "ITEM 10. DIRECTORS, EXECUTIVE OFFICERS AND CORPORATE GOVERNANCE\nThe information required by Item 10 of Form 10-K will appear in the Company’s proxy statement for its 2021 Annual Meeting of Shareholders under the captions “Proposal 1 - Election of Directors,” “Executive Officers,” “Corporate Governance - Attendance and Committees of the Board - Audit Committee,” and “Corporate Governance - Director Nominations,” and the information therein is incorporated herein by reference.\nWe have adopted a “Code of Business Conduct” that applies to all of our directors and officers and other employees, including our principal executive officer, principal financial officer and principal accounting officer. Our Code of Business Conduct is publicly available and is posted on our website at https://ir.odfl.com/governance-docs. To the extent permissible under applicable law, the rules of the SEC and Nasdaq listing standards, we intend to disclose on our website any amendment to our Code of Business Conduct, or any grant of a waiver from a provision of our Code of Business Conduct, that requires disclosure under applicable law, the rules of the SEC or Nasdaq listing standards.",
    "item_11": "ITEM 11. EXECUTIVE COMPENSATION\nThe information required by Item 11 of Form 10-K will appear in the Company’s proxy statement for its 2021 Annual Meeting of Shareholders under the captions “Corporate Governance - Compensation Committee Interlocks and Insider Participation,” “Compensation Discussion and Analysis,” “Compensation Committee Report,” “Executive Compensation,” and “Director Compensation,” and the information therein is incorporated herein by reference.",
    "item_12": "ITEM 12. SECURITY OWNERSHIP OF CERTAIN BENEFICIAL OWNERS AND MANAGEMENT AND RELATED STOCKHOLDER MATTERS\nThe information required by Item 12 of Form 10-K will appear in the Company’s proxy statement for its 2021 Annual Meeting of Shareholders under the captions “Equity Compensation Plan Information” and “Security Ownership of Management and Certain Beneficial Owners,” and the information therein is incorporated herein by reference.",
    "item_13": "ITEM 13. CERTAIN RELATIONSHIPS AND RELATED TRANSACTIONS, AND DIRECTOR INDEPENDENCE\nThe information required by Item 13 of Form 10-K will appear in the Company’s proxy statement for the 2021 Annual Meeting of Shareholders under the captions “Corporate Governance - Independent Directors” and “Related Person Transactions,” and the information therein is incorporated herein by reference.",
    "item_14": "ITEM 14. PRINCIPAL ACCOUNTING FEES AND SERVICES\nThe information required by Item 14 of Form 10-K will appear in the Company’s proxy statement for its 2021 Annual Meeting of Shareholders under the captions “Corporate Governance - Audit Committee Pre-Approval Policies and Procedures” and “Independent Registered Public Accounting Firm Fees and Services,” and the information therein is incorporated herein by reference.\nPART IV",
    "item_15": "ITEM 15. EXHIBITS, FINANCIAL STATEMENT SCHEDULES\n(a)(1) Financial Statements.\nThe following financial statements of Old Dominion Freight Line, Inc. are included in Item 8:\nBalance Sheets - December 31, 2020 and December 31, 2019\nStatements of Operations - Years ended December 31, 2020, December 31, 2019 and December 31, 2018\nStatements of Changes in Shareholders’ Equity - Years ended December 31, 2020, December 31, 2019 and December 31, 2018\nStatements of Cash Flows - Years ended December 31, 2020, December 31, 2019 and December 31, 2018\nNotes to the Financial Statements\n(a)(2) Financial Statement Schedules.\nThe Schedule II - Valuation and Qualifying Accounts schedule of Old Dominion Freight Line, Inc. is included below:\nSchedule II\nOld Dominion Freight Line, Inc.\nValuation and Qualifying Accounts\n(1)\nThis table does not include any allowances for revenue adjustments that result from billing corrections, customer allowances, money-back service guarantees and other miscellaneous revenue adjustments that are recorded in our revenue from operations.\n(2)\nUncollectible accounts written off, net of recoveries.\nAll other schedules for which provision is made in the applicable accounting regulations of the SEC are not required under the instructions thereto or are inapplicable and, therefore, have been omitted.\n(a)(3) Exhibits Filed.\nThe exhibits listed in the accompanying Exhibit Index are filed as a part of this report.\n(b) Exhibits.\nSee the Exhibit Index immediately preceding the signatures to this Annual Report on Form 10-K.\n(c) Separate Financial Statements and Schedules.\nNone.",
    "item_16": "ITEM 16. FORM 10-K SUMMARY\nNone.\nEXHIBIT INDEX\nTO ANNUAL REPORT ON FORM 10-K\nOLD DOMINION FREIGHT LINE, INC.\nFOR YEAR ENDED DECEMBER 31, 2020\nExhibit No.\nDescription\n3.1.1\nAmended and Restated Articles of Incorporation of Old Dominion Freight Line, Inc. (as amended July 30, 2004) (Incorporated by reference to the exhibit of the same number contained in the Company’s Quarterly Report on Form 10-Q for the quarter ended June 30, 2004, filed on August 6, 2004)\n3.1.2\nArticles of Amendment of Old Dominion Freight Line, Inc. (Incorporated by reference to the exhibit of the same number contained in the Company’s Quarterly Report on Form 10-Q for the quarter ended June 30, 2012, filed on August 9, 2012)\n3.1.3\nArticles of Amendment of Old Dominion Freight Line, Inc. (Incorporated by reference to the exhibit of the same number contained in the Company’s Quarterly Report on Form 10-Q for the quarter ended June 30, 2020, filed on August 6, 2020)\n3.2\nAmended and Restated Bylaws of Old Dominion Freight Line, Inc. (Incorporated by reference to the exhibit of the same number contained in the Company’s Annual Report on Form 10-K for the year ended December 31, 2012, filed on February 28, 2013)\n4.1\nSpecimen certificate of Common Stock (Incorporated by reference to the exhibit of the same number contained in the Company's Quarterly Report on Form 10-Q for the quarter ended June 30, 2018, filed on August 7, 2018)\n4.11\nNote Purchase Agreement among Old Dominion Freight Line, Inc. and the Purchasers set forth in Schedule A thereto, dated as of January 3, 2011 (Incorporated by reference to the exhibit of the same number contained in the Company’s Current Report on Form 8-K filed on January 6, 2011)\n4.13\nAmended and Restated Credit Agreement among Wells Fargo Bank, National Association, as Administrative Agent; the Lenders named therein; and Old Dominion Freight Line, Inc., dated December 15, 2015 (Incorporated by reference to the exhibit of the same number contained in the Company’s Current Report on Form 8-K filed on December 21, 2015)\n4.15\nDescription of Common Stock (Incorporated by reference to the exhibit of the same number contained in the Company’s Annual Report on Form 10-K for the year ended December 31, 2019, filed on February 26, 2020)\n4.16\nNote Purchase and Private Shelf Agreement among Old Dominion Freight Line, Inc., PGIM, Inc. and certain affiliates and managed accounts of PGIM, Inc., as purchasers, dated as of May 4, 2020 (Incorporated by reference to the exhibit of the same number contained in the Company’s Quarterly Report on Form 10-Q for the quarter ended March 31, 2020 filed on May 5, 2020)\n10.17.8*\nAmended and Restated Employment Agreement between Old Dominion Freight Line, Inc. and David S. Congdon, effective as of June 1, 2008 (Incorporated by reference to the exhibit of the same number contained in the Company’s Current Report on Form 8-K, filed on June 3, 2008)\n10.17.15*\nOld Dominion Freight Line, Inc. 2012 Phantom Stock Plan (Incorporated by reference to the exhibit of the same number contained in the Company’s Current Report on Form 8-K filed on November 5, 2012)\n10.17.16*\nForm of Old Dominion Freight Line, Inc. 2012 Phantom Stock Plan Phantom Stock Award Agreement (Incorporated by reference to the exhibit of the same number contained in the Company’s Current Report on Form 8-K filed on November 5, 2012)\n10.17.18*\nFirst Amendment to Amended and Restated Employment Agreement, effective as of November 1, 2012, by and between Old Dominion Freight Line, Inc. and David S. Congdon (Incorporated by reference to the exhibit of the same number contained in the Company’s Annual Report on Form 10-K for the year ended December 31, 2012, filed on February 28, 2013)\n10.17.20*\nFirst Amendment to the Old Dominion Freight Line, Inc. 2012 Phantom Stock Plan (Incorporated by reference to the exhibit of the same number contained in the Company’s Quarterly Report on Form 10-Q for the quarter ended March 31, 2015, filed on May 7, 2015)\n10.17.22*\nSecond Amendment to Amended and Restated Employment Agreement, effective October 20, 2016, by and between Old Dominion Freight Line, Inc. and David S. Congdon (Incorporated by reference to the exhibit of the same number contained in the Company’s Current Report on Form 8-K filed on October 26, 2016)\n10.17.23*\nThird Amendment to Amended and Restated Employment Agreement, effective May 16, 2018, by and between Old Dominion Freight Line, Inc. and David S. Congdon (Incorporated by reference to the exhibit of the same number contained in the Company’s Current Report on Form 8-K/A filed on May 17, 2018)\nExhibit No.\nDescription\n10.18.4*\nForm of Old Dominion Freight Line, Inc. Director Phantom Stock Plan Award Agreement (Incorporated by reference to the exhibit of the same number contained in the Company’s Quarterly Report on Form 10-Q for the quarter ended June 30, 2008, filed on August 8, 2008)\n10.18.7*\nOld Dominion Freight Line, Inc. Director Phantom Stock Plan, as amended through April 1, 2011 (Incorporated by reference to the exhibit of the same number contained in the Company’s Quarterly Report on Form 10-Q for the quarter ended March 31, 2011, filed on May 9, 2011)\n10.18.9*\n2014 Declaration of Amendment to Old Dominion Freight Line, Inc. Director Phantom Stock Plan, effective February 20, 2014 (Incorporated by reference to the exhibit of the same number contained in the Company’s Quarterly Report on Form 10-Q for the quarter ended March 31, 2014, filed on May 6, 2014)\n10.18.12*\nOld Dominion Freight Line, Inc. Director Phantom Stock Plan (As Amended and Restated Through December 16, 2019) (Incorporated by reference to the exhibit of the same number contained in the Company’s Annual Report on Form 10-K for the year ended December 31, 2019, filed on February 26, 2020)\n10.18.13*\nAmendment to Old Dominion Freight Line, Inc. Director Phantom Stock Award Agreement (under the Old Dominion Freight Line, Inc. Director Phantom Stock Plan (As Amended and Restated Through December 16, 2019)) (Incorporated by reference to the exhibit of the same number contained in the Company’s Annual Report on Form 10-K for the year ended December 31, 2019, filed on February 26, 2020)\n10.18.14*\nOld Dominion Freight Line, Inc. Non-Employee Director Compensation Structure, effective as of the 2020 Annual Meeting of Shareholders (Incorporated by reference to the exhibit of the same number contained in the Company’s Annual Report on Form 10-K for the year ended December 31, 2019, filed on February 26, 2020)\n10.19.1*\nOld Dominion Freight Line, Inc. Phantom Stock Plan, effective as of May 16, 2005 (Incorporated by reference to the exhibit of the same number contained in the Company’s Current Report on Form 8-K filed on May 20, 2005)\n10.19.3*\nForm of Old Dominion Freight Line, Inc. Phantom Stock Award Agreement (Incorporated by reference to the exhibit of the same number contained in the Company’s Current Report on Form 8-K filed on February 21, 2006)\n10.19.4*\nOld Dominion Freight Line, Inc. Phantom Stock Plan, effective as of January 1, 2009 (Incorporated by reference to the exhibit of the same number contained in the Company’s Annual Report on Form 10-K for the year ended December 31, 2008, filed on March 2, 2009)\n10.19.6*\nAmendment to Old Dominion Freight Line, Inc. Phantom Stock Plan, effective as of May 18, 2009 (Incorporated by reference to Exhibit 10.19.4 contained in the Company’s Quarterly Report on Form 10-Q for the quarter ended June 30, 2009, filed on August 7, 2009)\n10.19.7*\n2011 Declaration of Amendment to Old Dominion Freight Line, Inc. Phantom Stock Plan, effective as of May 17, 2011 (Incorporated by reference to the exhibit of the same number contained in the Company’s Quarterly Report on Form 10-Q for the quarter ended September 30, 2011, filed on November 8, 2011)\n10.19.8*\nOld Dominion Freight Line, Inc. Phantom Stock Award Agreement (Incorporated by reference to the exhibit of the same number contained in the Company’s Current Report on Form 8-K filed on July 5, 2012)\n10.19.9*\n2014 Declaration of Second Amendment to Old Dominion Freight Line, Inc. Director Phantom Stock Plan, effective as of August 7, 2014 (Incorporated by reference to the exhibit of the same number contained in the Company’s Quarterly Report on Form 10-Q for the quarter ended September 30, 2014, filed on November 5, 2014)\n10.19.10*\n2015 Declaration of Amendment to the Old Dominion Freight Line, Inc. Phantom Stock Plan (Incorporated by reference to the exhibit of the same number contained in the Company’s Quarterly Report on Form 10-Q for the quarter ended March 31, 2015, filed on May 7, 2015)\n10.19.11*\n2016 Declaration of Amendment to Old Dominion Freight Line, Inc. Director Phantom Stock Plan, effective as of February 25, 2016 (Incorporated by reference to the exhibit of the same number contained in the Company’s Annual Report on Form 10-K for the year ended December 31, 2015, filed on February 29, 2016)\n10.19.12*\nOld Dominion Freight Line, Inc. Change of Control Severance Plan for Key Executives (As Amended and Restated Effective October 31, 2018) (Incorporated by reference to the exhibit of the same number contained in the Company’s Current Report on Form 8-K filed on November 1, 2018)\n10.19.13*\nOld Dominion Freight Line, Inc. Phantom Stock Plan (As Amended and Restated Through December 16, 2019) (Incorporated by reference to the exhibit of the same number contained in the Company’s Current Report on Form 8-K filed on December 19, 2019)\nExhibit No.\nDescription\n10.19.14*\nAmendment to Old Dominion Freight Line, Inc. Phantom Stock Award Agreement (under the Old Dominion Freight Line, Inc. Phantom Stock Plan (As Amended and Restated Through December 16, 2019)) (Incorporated by reference to the exhibit of the same number contained in the Company’s Current Report on Form 8-K filed on December 19, 2019)\n10.19.15*\nOld Dominion Freight Line, Inc. 2012 Phantom Stock Plan (As Amended and Restated Through December 16, 2019) (Incorporated by reference to the exhibit of the same number contained in the Company’s Current Report on Form 8-K filed on December 19, 2019)\n10.19.16*\nAmendment to Old Dominion Freight Line, Inc. Phantom Stock Award Agreement (under the Old Dominion Freight Line, Inc. 2012 Phantom Stock Plan (As Amended and Restated Through December 16, 2019)) (Incorporated by reference to the exhibit of the same number contained in the Company’s Current Report on Form 8-K filed on December 19, 2019)\n10.20.1*\n2006 Nonqualified Deferred Compensation Plan of Old Dominion Freight Line, Inc., effective January 1, 2006 (as restated and effective January 1, 2009) (Incorporated by reference to the exhibit of the same number contained in the Company’s Annual Report on Form 10-K for the year ended December 31, 2009, filed on March 1, 2010)\n10.20.2*\nForm of Annual Salary and Bonus Deduction Agreement (Incorporated by reference to the exhibit of the same number contained in the Company’s Current Report on Form 8-K filed on February 21, 2006)\n10.20.3*\nSecond Amendment to 2006 Nonqualified Deferred Compensation Plan of Old Dominion Freight Line, Inc., as amended, effective November 10, 2011 (Incorporated by reference to the exhibit of the same number contained in the Company’s Annual Report on Form 10-K for the year ended December 31, 2011, filed on February 29, 2012)\n10.20.4*\nThird Amendment to the 2006 Nonqualified Deferred Compensation Plan of Old Dominion Freight Line, Inc.(Incorporated by reference to the exhibit of the same number contained in the Company’s Quarterly Report on Form 10-Q for the quarter ended March 31, 2015, filed on May 7, 2015)\n10.21*\nOld Dominion Freight Line, Inc. Performance Incentive Plan (Incorporated by reference to the exhibit of the same number contained in the Company’s Current Report on Form 8-K, filed on June 3, 2008)\n10.21.1*\nOld Dominion Freight Line, Inc. Performance Incentive Plan (As Amended and Restated Through January 30, 2019) (Incorporated by reference to the exhibit of the same number contained in the Company’s Annual Report on Form 10-K for the year ended December 31, 2018, filed on February 27, 2019)\n10.23*\nOld Dominion Freight Line, Inc. 2016 Stock Incentive Plan (Incorporated by reference to Exhibit 99 contained in the Company’s Registration Statement on Form S-8 (File No. 333-211464), filed on May 19, 2016)\n10.23.1*\nForm of Old Dominion Freight Line, Inc. 2016 Stock Incentive Plan Restricted Stock Award Agreement (Employees) (Incorporated by reference to the exhibit of the same number contained in the Company’s Quarterly Report on Form 10-Q for the quarter ended June 30, 2016, filed on August 8, 2016)\n10.23.2*\nForm of Old Dominion Freight Line, Inc. 2016 Stock Incentive Plan Restricted Stock Award Agreement (Non-Employee Directors) (Incorporated by reference to the exhibit of the same number contained in the Company’s Quarterly Report on Form 10-Q for the quarter ended June 30, 2016, filed on August 8, 2016)\n10.23.3*\nForm of Old Dominion Freight Line, Inc. 2016 Stock Incentive Plan Restricted Stock Unit Agreement (Performance-Based) (Employees) (Incorporated by reference to the exhibit of the same number contained in the Company’s Annual Report on Form 10-K for the year ended December 31, 2018, filed on February 27, 2019)\n23.1\nConsent of Ernst & Young LLP\n31.1\nCertification Pursuant to Rule 13a-14(a) or 15d-14(a) of the Exchange Act, as Adopted Pursuant to Section 302 of the Sarbanes-Oxley Act of 2002\n31.2\nCertification Pursuant to Rule 13a-14(a) or 15d-14(a) of the Exchange Act, as Adopted Pursuant to Section 302 of the Sarbanes-Oxley Act of 2002\n32.1\nCertification Pursuant to 18 U.S.C Section 1350, as Adopted Pursuant to Section 906 of the Sarbanes-Oxley Act of 2002\n32.2\nCertification Pursuant to 18 U.S.C Section 1350, as Adopted Pursuant to Section 906 of the Sarbanes-Oxley Act of 2002\nThe following financial information from our Annual Report on Form 10-K for the year ended December 31, 2020, filed on February 24, 2021, formatted in iXBRL (Inline eXtensible Business Reporting Language) includes: (i) the Balance Sheets at December 31, 2020 and 2019, (ii) the Statements of Operations for the years ended December 31, 2020, 2019 and 2018, (iii) the Statements of Changes in Shareholders’ Equity for the years ended December 31, 2020, 2019 and 2018, (iv) the Statements of Cash Flows for the years ended December 31, 2020, 2019 and 2018, and (v) the Notes to the Financial Statements\nExhibit No.\nDescription\nThe cover page from our Annual Report on Form 10-K for the year ended December 31, 2020, formatted in iXBRL\n*\nDenotes an executive compensation plan or agreement\nOur SEC file number reference for documents filed with the SEC pursuant to the Securities Exchange Act of 1934, as amended, is 0-19582.",
    "stock_ticker": "ODFL"
}