{
    "cik": "898173",
    "company": "O REILLY AUTOMOTIVE INC",
    "filing_type": "10-K",
    "filing_date": "2020-02-28",
    "period_of_report": "2019-12-31",
    "sic": "5531",
    "state_of_inc": null,
    "state_location": "MO",
    "fiscal_year_end": "1231",
    "filing_html_index": "https://www.sec.gov/Archives/edgar/data/898173/0000898173-20-000007-index.html",
    "htm_filing_link": "https://www.sec.gov/Archives/edgar/data/898173/000089817320000007/orly-20191231x10k.htm",
    "complete_text_filing_link": "https://www.sec.gov/Archives/edgar/data/898173/0000898173-20-000007.txt",
    "filename": "898173_10K_2019_0000898173-20-000007.htm",
    "item_1": "Item 1. Business\nGENERAL INFORMATION\nUnless otherwise indicated, “we,” “us,” “our” and similar terms, as well as references to the “Company,” refer to O’Reilly Automotive, Inc. and its Subsidiaries. O’Reilly is one of the largest specialty retailers of automotive aftermarket parts, tools, supplies, equipment and accessories in the United States (“U.S.”), selling our products to both do-it-yourself (“DIY”) and professional service provider customers, our “dual market strategy.” The business was founded in 1957 by Charles F. O’Reilly and his son, Charles H. “Chub’’ O’Reilly, Sr., and initially operated from a single store in Springfield, Missouri. Our common stock has traded on The NASDAQ Global Select Market under the symbol “ORLY” since April 22, 1993.\nAfter the close of business on November 29, 2019, we completed the acquisition of Mayoreo de Autopartes y Aceites, S.A. de C.V. (“Mayasa”), a specialty retailer of automotive aftermarket parts headquartered in Guadalajara, Jalisco, Mexico pursuant to a stock purchase agreement. At the time of the acquisition, Mayasa operated six distribution centers, 21 Orma Autopartes stores and served over 2,000 independent jobber locations in 28 Mexican states.\nAt December 31, 2019, we operated 5,439 stores in 47 states in the United States and 21 stores in Mexico. Our stores carry an extensive product line, including\n● new and remanufactured automotive hard parts and maintenance items, such as alternators, batteries, brake system components, belts, chassis parts, driveline parts, engine parts, fuel pumps, hoses, starters, temperature control, water pumps, antifreeze, appearance products, engine additives, filters, fluids, lighting, oil and wiper blades; and\n● accessories, such as floor mats, seat covers and truck accessories.\nOur stores offer many enhanced services and programs to our customers, such as\n● battery diagnostic testing;\n● battery, wiper and bulb replacement;\n● check engine light code extraction, where allowed by law;\n● custom hydraulic hoses;\n● drum and rotor resurfacing;\n● electrical and module testing;\n● loaner tool program;\n● machine shops;\n● professional paint shop mixing and related materials; and\n● used oil, oil filter and battery recycling.\nSee the “Risk Factors” section of this annual report on Form 10-K for a description of certain risks relevant to our business. These risk factors include, among others, deteriorating economic conditions, competition in the automotive aftermarket business, our sensitivity to regional economic and weather conditions, future growth assurance, our dependence upon key and other personnel, our relationships with key suppliers and availability of key products, our acquisition strategies, complications in our distribution centers (“DCs”), failure to achieve high levels of service and product quality, unanticipated fluctuations in our quarterly results, the volatility of the market price of our common stock, our increased debt levels, a downgrade in our credit ratings, data security, environmental legislation and other regulations and risks associated with international operations.\nOUR BUSINESS\nOur goal is to continue to achieve growth in sales and profitability by capitalizing on our competitive advantages and executing our growth strategy. We remain confident in our ability to continue to gain market share in our existing markets and grow our business in new markets by focusing on our dual market strategy and the core O’Reilly values, including superior customer service and expense control. Our intent is to be the dominant auto parts provider in all the markets we serve, by providing a higher level of customer service and a better value position than our competitors to both DIY and professional service provider customers.\nCompetitive Advantages\nWe believe our effective dual market strategy, superior customer service, technically proficient store personnel, strategic distribution network and experienced management team make up our key competitive advantages, which cannot be easily duplicated.\nProven Ability to Execute Our Dual Market Strategy:\nFor more than 40 years, we have established a track record of effectively serving, at a high level, both DIY and professional service provider customers. We believe our proven ability to effectively execute a dual market strategy is a unique competitive advantage. The execution of this strategy enables us to better compete by targeting a larger base of automotive aftermarket parts consumers, capitalizing on our existing retail and distribution infrastructure, operating profitably in both large markets and less densely populated geographic areas that typically attract fewer competitors, and enhancing service levels offered to DIY customers through the offering of a broad inventory and the extensive product knowledge required by professional service provider customers.\nIn 2019, we derived approximately 56% of our sales from our DIY customers and approximately 44% of our sales from our professional service provider customers. Historically, we have increased our sales to professional service provider customers at a faster pace than the increase in our sales to DIY customers due to the more fragmented nature of the professional service provider business, which offers a greater opportunity for consolidation. We believe we will continue to have a competitive advantage on the professional service provider portion of our business, due to our systems, knowledge and experience serving the professional service provider side of the automotive aftermarket, supported by our approximately 825 full-time sales staff dedicated solely to calling upon and servicing the professional service provider customer. We will also continue to expand and enhance the level of offerings focused on growing our DIY business and will continue to execute our proven dual market strategy in both existing and new markets.\nSuperior Customer Service:\nWe seek to provide our customers with an efficient and pleasant in-store experience by maintaining attractive stores in convenient locations with a wide selection of automotive products. We believe the satisfaction of DIY and professional service provider customers is substantially dependent upon our ability to provide, in a timely fashion, the specific automotive products needed to complete their repairs. Accordingly, each O’Reilly store carries, or has same or next day availability to, a broad selection of automotive products designed to cover a wide range of vehicle applications. We continuously refine the inventory levels and assortments carried in each of our stores and within our network, based in large part on the sales movement tracked by our inventory control system, market vehicle registration data, failure rates and management’s assessment of the changes and trends in the marketplace. We have no material backorders for the products we sell.\nWe seek to attract new DIY and professional service provider customers and retain existing customers by offering superior customer service, the key elements of which are identified below:\n● superior in-store service through highly-motivated, technically-proficient store personnel (“Professional Parts People”);\n● an extensive selection and availability of products;\n● many enhanced service programs, including battery and electrical testing, battery, wiper and bulb replacement and check engine light code extractions;\n● attractive stores in convenient locations;\n● competitive pricing, supported by a good, better, best product assortment designed to meet all of our customers’ quality and value preferences; and\n● a robust point-of-sale system integrated with our proprietary electronic catalog, which contains a wide variety of product images, schematics and technical specifications and equips our Team Members with highly effective tools to source products in our extensive supply network.\nTechnically Proficient Professional Parts People:\nOur highly-motivated, technically-proficient Professional Parts People provide us with a significant competitive advantage, particularly over less specialized retail operators. We require our Professional Parts People to undergo extensive and ongoing training and to be knowledgeable, particularly with respect to hard part repairs, in order to better serve the technically-oriented professional service provider customers with whom they interact on a daily basis. Such technical proficiency also enhances the customer service we provide to our DIY customers who value the expert assistance provided by our Professional Parts People.\nStrategic Regional Tiered Distribution Network:\nWe believe our commitment to a robust, regional, tiered distribution network provides superior replenishment and access to hard-to-find parts and enables us to optimize product availability and inventory levels throughout our store network. Our strategic, regional,\ntiered distribution network includes DCs and Hub stores. Our inventory management and distribution systems electronically link each of our stores to one or more DCs, which provides for efficient inventory control and management. We currently operate 28 regional DCs, which provide our stores with same-day or overnight access to an average of 159,000 stock keeping units (“SKUs”), many of which are hard-to-find items not typically stocked by other auto parts retailers. To augment our robust distribution network, we operate a total of 356 Hub stores that also provide delivery service and same-day access to an average of 68,000 SKUs from a Super Hub or 42,000 SKUs from a Hub to other stores within the surrounding area. We believe this timely access to a broad range of products is a key competitive advantage in satisfying customer demand and generating repeat business.\nExperienced Management Team:\nOur Company philosophy is to “promote from within” and the vast majority of our senior management, district managers and store managers have been promoted from within the Company. We augment this promote from within philosophy by pursuing strategic hires with a strong emphasis on automotive aftermarket experience. We have a strong management team comprised of 216 senior managers who average 21 years of service; 270 corporate managers who average 16 years of service; and 540 district managers who average 14 years of service. Our management team has demonstrated the consistent ability to successfully execute our business plan and growth strategy by generating 27 consecutive years of record revenues and earnings and positive comparable store sales results since becoming a public company in April of 1993.\nGrowth Strategy\nAggressively Open New Stores:\nWe intend to continue to consolidate the fragmented automotive aftermarket. During 2019, we opened 200 net, new domestic stores, as well as 20 net, additional stores from the Bennett Auto Supply (“Bennett”), Inc. acquisition and 21 additional stores from the Mayasa acquisition. In 2020, we plan to open approximately 180 net, new stores, which will increase our penetration in existing markets and allow for expansion into new, contiguous markets. The sites for these new stores have been identified, and to date, we have not experienced significant difficulties in locating suitable sites for construction of new stores or identifying suitable acquisition targets for conversion to O’Reilly stores. We typically open new stores by\n(i) constructing a new facility or renovating an existing one on property we purchase or lease and stocking the new store with fixtures and inventory;\n(ii) acquiring an independently owned auto parts store (“jobber store”), typically by the purchase of substantially all of the inventory and other assets (other than realty) of such store; or\n(iii) purchasing multi-store chains.\nNew store sites are strategically located in clusters within geographic areas that complement our distribution network in order to achieve economies of scale in management, advertising and distribution. Other key factors we consider in the site selection process include population density and growth patterns, demographic lifestyle segmentation, age and per capita income, vehicle traffic counts, vehicles in operation, number and type of existing automotive repair facilities and competing auto parts stores within a predetermined radius.\nWe target both small and large markets for expansion of our store network. While we have, and continue to face, aggressive competition in the more densely populated markets, we believe we have competed effectively, and are well positioned to continue to compete effectively, in such markets and to achieve our goal of continued profitable sales growth within these markets. We also believe that with our dual market strategy, we are better able to operate stores in less densely populated areas, which would not otherwise support a national chain store selling primarily to the retail automotive aftermarket. Therefore, we continue to pursue opening new stores in less densely populated market areas as part of our growth strategy.\nGrow Sales in Existing Stores:\nProfitable comparable store sales growth is also an important part of our growth strategy. To achieve improved sales and profitability at existing O’Reilly stores, we continually strive to improve the service provided to our customers. We believe that while competitive pricing is an essential component of successful growth in the automotive aftermarket business, it is customer satisfaction, whether of the DIY consumer or professional service provider, resulting from superior customer service, that generates increased sales and profitability.\nSelectively Pursue Strategic Acquisitions:\nThe automotive aftermarket industry is still highly fragmented, and we believe the ability of national auto parts chains, like O’Reilly, to operate more efficiently and effectively than smaller independent operators, will result in continued industry consolidation. Our intention is to continue to selectively pursue strategic acquisitions that will strengthen our position as a leading automotive aftermarket parts supplier in existing markets and provide a springboard for expansion into new markets.\nContinually Enhance Store Design and Location:\nOur current prototype store design features optimized square footage, high ceilings, convenient interior store layouts, in-store signage, bright lighting, convenient ingress, egress and parking, and dedicated counters to serve professional service provider customers, each designed to increase sales and operating efficiencies to enhance overall customer service. We continually update the location and condition of our store network through systematic renovation and relocation of our existing stores to enhance store performance. During 2019, we relocated 12 stores and performed minor to major updates or renovations to approximately 1,500 additional stores. We believe that our ability to consistently achieve growth in comparable store sales is due in part to our commitment to maintaining an attractive store network, which is strategically located to best serve our customers.\nOmnichannel Growth Strategy:\nOur Omnichannel growth strategies reflect the continued evolution of customer preferences in researching and completing purchases. More than ever before, our customers’ purchase decisions are informed by a range of interactions, whether in-person, over the phone, or through a variety of digital channels, as they seek to find the professional parts knowledge and the product availability they need to meet their automotive repair and maintenance needs. Our Omnichannel growth strategies are focused on offering our customers an enhanced and seamless research and buying experience through any of these channels. We have long been known for excellent customer service and continue to grow the functionality and user-friendliness of our websites, including www.OReillyAuto.com and www.FirstCallOnline.com, to enhance our customer’s shopping experience. Many of our customers interact over multiple channels to research and complete a purchase, and the functionality and features of our digital sites complements the outstanding customer service provided in our over 5,400 brick and mortar locations.\nTeam Members\nAs of January 31, 2020, we employed 82,167 Team Members (53,159 full-time Team Members and 29,008 part-time Team Members), of whom 68,679 were employed at our U.S. stores, 8,607 were employed at our U.S. DCs, 3,620 were employed at our U.S. corporate and regional offices, and 1,261 were employed in Mexico. A union represents 50 stores (489 Team Members) in the Greater Bay Area in California and has for many years, and approximately 34 Team Members who drive over-the-road trucks in two of our domestic DCs are represented by labor unions as well. In addition, the Company assumed collective bargaining agreements with various unions in Mexico in connection with its acquisition of Mayasa; however, none of the Company’s Team Members are specifically affiliated with, or members of, those unions. With the exception of the previously described Team Members, our Team Members are not represented by labor unions. Our tradition for 63 years has been to treat all of our Team Members with honesty and respect and to commit significant resources to instill in them our “Live Green” culture, which emphasizes the importance of each Team Member’s contribution to the success of O’Reilly. This focus on professionalism and respect has created an industry-leading team, and we consider our relations with our Team Members to be excellent.\nStore Network\nNew Store Site Selection:\nIn selecting sites for new stores, we seek to strategically locate store sites in clusters within geographic areas in order to achieve economies of scale in management, advertising and distribution. Other key factors we consider in the site selection process are\n● population density;\n● demographics, including age, ethnicity, life style and per capita income;\n● market economic strength, retail draw and growth patterns;\n● number, age and percent of makes and models of registered vehicles;\n● the number, type and sales potential of existing automotive repair facilities;\n● the number of auto parts stores and other competitors within a predetermined radius;\n● physical location, traffic count, size, economics and presentation of the site;\n● financial review of adjacent existing locations; and\n● the type and size of store that should be developed.\nWhen entering new, more densely populated markets, we generally seek to initially open several stores within a short span of time in order to maximize the effect of initial promotional programs and achieve economies of scale. After opening this initial cluster of new stores, we begin penetrating the less densely populated surrounding areas. As these store clusters mature, we evaluate the need to open additional locations in the more densely populated markets where we believe opportunities exist to expand our market share or to\nimprove the level of service provided in high volume areas. This strategy enables us to achieve additional distribution and advertising efficiencies in each market.\nStore Locations and Size:\nAs a result of our dual market strategy, we are able to profitably operate in both large, densely populated markets and small, less densely populated areas that would not otherwise support a national chain selling primarily to the retail automotive aftermarket. Our U.S. stores, on average, carry approximately 22,000 SKUs and average approximately 7,400 total square feet in size. At December 31, 2019, we had a total of approximately 40 million square feet in our 5,439 domestic stores. Our domestic stores are served primarily by the nearest DC, which averages 159,000 SKUs, but also have same-day access to the broad selection of inventory available at one of our 356 Hub stores, which are comprised of 85 Super Hubs that average approximately 15,700 square feet and carry an average of 68,000 SKUs and 271 Hubs that average approximately 10,000 square feet and carry an average of 42,000 SKUs.\nWe believe that our stores are “destination stores” generating their own traffic rather than relying on traffic created by the presence of other stores in the immediate vicinity. Consequently, most of our stores are freestanding buildings or prominent end caps situated on or near major traffic thoroughfares and offer ample parking, easy customer access and are generally located in close proximity to our professional service provider customers.\nThe following table sets forth the geographic distribution and activity of our stores as of December 31, 2019 and 2018:\nManagement Structure\nEach of our stores is staffed with a store manager and one or more assistant managers, in addition to parts specialists, retail and/or installer service specialists and other positions required to meet the specific needs of each store. Each of our 540 district managers has general supervisory responsibility for an average of 10 stores, which provides our stores with strong operational support.\nStore and district managers complete a comprehensive training program to ensure each has a thorough understanding of customer service, leadership, inventory management and store profitability, as well as all other sales and operational aspects of our business model. Store and district managers are also required to complete a structured training program that is specific to their position, including attending a week-long manager development program at the corporate headquarters in Springfield, Missouri. Store and district managers also receive continuous training through online training, field workshops, regional meetings and our annual leadership conference.\nWe provide financial incentives to all store Team Members through incentive compensation programs. Under our incentive compensation programs, base salary is augmented by incentive compensation based on individual and store sales and profitability. In addition, each of our district managers participates in our stock option and bonus programs, and store managers participate in bonus programs based on their store’s performance. We believe our incentive compensation programs significantly increase the motivation and overall performance of our store Team Members and enhance our ability to attract and retain qualified management and other personnel.\nProfessional Parts People\nWe believe our highly trained team of Professional Parts People is essential in providing superior customer service to both DIY and professional service provider customers. A significant portion of our business is from professional service provider customers; therefore, our Professional Parts People are required to be highly technically proficient in automotive products. In addition, we have found that the typical DIY customer often seeks assistance from Professional Parts People, particularly when purchasing hard parts. The ability of our Professional Parts People to provide such assistance to the DIY customer creates a favorable impression and is a significant factor in generating repeat DIY business.\nWe screen prospective Team Members to identify highly motivated individuals who either have experience with automotive parts or repairs, or automotive aptitude. New store Team Members go through a comprehensive orientation focused on the culture of our Company, as well as the requirements for their specific position. Additionally, during their first year of employment, our parts specialists go through extensive automotive systems and product knowledge training to ensure they are able to provide high levels of service to our customers. Once all of the required training has been satisfied, our parts specialists become eligible to take the O’Reilly Certified Parts Professional test. Passing the O’Reilly test helps prepare them to become certified by the National Institute for Automotive Service Excellence (“ASE”).\nAll of our stores have the ability to service professional service provider customers. For this reason, select Team Members in each store complete extensive sales call training with a regional field sales manager. These Team Members then spend at least one day per week calling on existing and potential professional service provider customers. Additionally, each Team Member engaged in such sales activities participates in quarterly advanced training programs for sales and business development.\nDistribution Systems\nWe believe that our tiered distribution model provides industry-leading parts availability and store in-stock positions, while lowering our inventory carrying costs by controlling the depth of our inventory. Moreover, we believe our ongoing, significant capital investments made in our DC network allow us to efficiently service new stores that are planned to open in contiguous market areas as well as servicing our existing store network. Our distribution expansion strategy complements our new store opening strategy by supporting newly established clusters of stores, and additional penetration into existing markets, in the regions surrounding each DC. As of December 31, 2019, we had a total growth capacity of more than 695 stores in our distribution center network. Further enhancing our distribution capabilities in 2020, we plan to relocate and merge our existing Nashville, Tennessee, and Knoxville, Tennessee, DCs into a larger facility located in Lebanon, Tennessee, providing a larger, more efficient facility to serve both markets, while also allowing us to convert the existing Knoxville, Tennessee, DC into a large Hub that will continue to provide same day parts availability in the attractive Knoxville market. Additionally, we plan to open a new DC in Horn Lake, Mississippi, in 2020.\nDistribution Centers:\nAs of December 31, 2019, we operated 28 domestic DCs comprised of approximately 11.4 million operating square feet (see the “Properties” table in Item 2 of this annual report on Form 10-K for more information about DC operating square footages). Our DCs stock an average of 159,000 SKUs and most DCs are linked to and have the ability to access multiple other regional DCs’ inventory.\nOur DCs provide five-night-a-week delivery, primarily via a Company-owned fleet, to all of our stores in the continental United States. In addition, stores within an individual DC’s metropolitan area receive multiple daily deliveries from the DC’s “city counter,” many of which receive this service seven days per week. Our DCs provide weekend service to not only the stores they service via their city counters but also to strategic Hub locations, which redistribute products to surrounding stores. Our national Hub store network provides additional service throughout the week, and on weekends, to surrounding stores.\nAs part of our continuing efforts to enhance our distribution network in 2020, we plan to\n● continue to enhance our distribution network through the engineering, design, expansion or relocation of new or current DCs;\n● continue to utilize routing software to continue to enhance logistics efficiencies;\n● continue to implement labor management software to improve DC productivity and overall operating efficiency;\n● continue to define and implement best practices in all DCs; and\n● make proven, return-on-investment based capital enhancements to material handling equipment in DCs, including conveyor systems, picking modules, lift equipment and computer hardware.\nHub Stores:\nWe currently operate a total of 356 strategically located Hub stores. In addition to serving DIY and professional service provider customers in their markets, Hub stores also provide delivery service to our other stores within the surrounding area and access to an expanded selection of SKUs on a same-day basis. Our Hub store network consists of 85 Super Hubs that average approximately 15,700 square feet and carry an average of 68,000 SKUs and 271 Hubs that average approximately 10,000 square feet and carry an average of 42,000 SKUs.\nProducts and Purchasing\nOur stores offer DIY and professional service provider customers a wide selection of products for domestic and imported automobiles, vans and trucks. Our merchandise generally consists of nationally recognized, well-advertised, premium name brand products, such as AC Delco, Armor All, Bosch, Castrol, Dorman, Fel-Pro, Gates Rubber, Lucas Oil, Mobil1, Monroe, Moog, Pennzoil, Prestone, Standard, STP, Turtle Wax, Valvoline, Wagner, and Wix, and a wide selection of quality proprietary private label products, which span the entire good, better and best value spectrum, under our BestTest®, BrakeBest®, Cartek®, Import Direct®, MasterPro®, MicroGard®, Murray®, Omnispark®, O’Reilly Auto Parts®, Precision®, Power Torque®, Super Start®, and Ultima® brands. Our proprietary private label products are produced by respected automotive manufacturers, meet or exceed original equipment manufacturer specifications and consist of house brands and nationally recognized proprietary bands, which we have acquired or developed over time. Our “good” proprietary brands provide a great combination of quality and value, a characteristic important to our DIY customers, while our “better” and “best” proprietary brands offer options for our more heavy-duty DIY customers, as well as our professional service provider customers, who often prefer higher quality products that can be relied upon to support and grow their businesses.\nWe have no long-term contracts with material purchase commitments with any of our suppliers, nor have we experienced difficulty in obtaining satisfactory alternative supply sources for automotive parts. We believe that alternative supply sources exist at competitive costs for substantially all of the automotive products that we sell. It is our policy to take advantage of payment and seasonal purchasing discounts offered by our suppliers and to utilize extended dating terms available from suppliers. We have entered into various programs and arrangements with certain suppliers that provided for extended dating and payment terms for inventory purchases. As a whole, we consider our relationships with our suppliers to be very good.\nWe purchase automotive products in substantial quantities from over 735 suppliers, the five largest of which accounted for approximately 24% of our total purchases in 2019. Our largest supplier in 2019 accounted for approximately 7% of our total purchases and the next four largest suppliers each accounted for approximately 3% to 6% of our total purchases.\nMarketing\nRetail and Online Marketing:\nOur integrated marketing strategy and Omnichannel efforts include national media channels, in-store, digital, and social media activation, as well as marketing the O’Reilly brand through automotive event sponsorships and on-site appearances throughout the country. Our O’Rewards loyalty program encourages repeat customers, as they accumulate points from their O’Reilly purchases that are redeemable for rewards at various purchase levels. Our marketing efforts also target the Spanish-speaking market through radio, print, and sports marketing, as well as sponsorships of local and regional events.\nProfessional Marketing:\nTo develop our continued relationships with professional service providers and installers, we employ Territory Sales Managers in nearly every market to ensure complete sales territory coverage and personalized service for these customers. Flyers, quick reference guides, and catalogs are distributed on a regular basis to all professional service providers, including paint and body shops and fleet maintenance customers to encourage brand and program awareness. In addition, our professional customer program, First Call, also offers an ordering website, www.FirstCallOnline.com, dedicated to Professional Service Specialists in stores, multiple daily deliveries and access to training opportunities, shop management, maintenance supplies and the Certified Auto Repair program, which offers professional service providers with the business tools they need to profitably grow and market their business.\nINDUSTRY ENVIRONMENT\nThe automotive aftermarket industry includes all products and services purchased for light and heavy-duty vehicles after the original sale. The total size of the automotive aftermarket is estimated to be approximately $297 billion, according to The Auto Care Association. This market is made up of four segments: labor share of professional service provider sales, auto parts share of professional service provider sales, DIY sales and tire sales. We estimate that O’Reilly’s addressable market within this industry is approximately $90 billion to $100 billion, which includes the auto parts share of professional service provider sales at wholesale and DIY sales at retail. We do not sell tires or perform for-fee automotive repairs or installations.\nCompetition\nThe sale of automotive aftermarket items is highly competitive in many areas, including customer service, product availability, store location, brand recognition and price. We compete in both the DIY and professional service provider portions of the automotive aftermarket and are one of the largest specialty retailers within that market. We compete primarily with\n● national retail and wholesale automotive parts chains (such as AutoZone, Inc., Advance Auto Parts, CARQUEST, NAPA and the Pep Boys - Manny, Moe and Jack, Inc.);\n● regional retail and wholesale automotive parts chains;\n● wholesalers or jobber stores (some of which are associated with national automotive parts distributors or associations such as NAPA, CARQUEST, Bumper to Bumper and Auto Value);\n● automobile dealers; and\n● mass merchandisers and online retailers that carry automotive replacement parts, maintenance items and accessories (such as Wal-Mart Stores, Inc. and Amazon.com, Inc.).\nWe compete on the basis of customer service, which includes merchandise selection and availability, technical proficiency and helpfulness of store personnel, price, store layout, continually enhancing the Omnichannel experience and convenient and accessible store locations. Our dual market strategy requires significant capital, such as the capital expenditures required for our distribution and store networks and working capital needed to maintain inventory levels necessary for providing products to both the DIY and professional service provider portions of the automotive aftermarket.\nInflation and Seasonality\nWe have been successful, in many cases, in reducing the effects of merchandise cost increases principally by taking advantage of supplier incentive programs, economies of scale resulting from increased volume of purchases and selective forward buying. To the extent our acquisition costs increase due to price increases industry wide, we have typically been able to pass along these increased costs through higher retail prices for the affected products. As a result, we do not believe our operations have been materially, adversely affected by inflation.\nTo some extent our business is seasonal, primarily as a result of the impact of weather conditions on customer buying patterns. Store sales, profits and inventory levels have historically been higher in the second and third quarters (April through September) than in the first and fourth quarters (October through March) of the year.\nRegulations\nWe are subject to federal, state and local laws and governmental regulations relating to our business, including, but not limited to, those related to the handling, storage and disposal of hazardous substances, the recycling of batteries and used lubricants, and the ownership and operation of real property.\nAs part of our operations, we handle hazardous materials in the ordinary course of business and our customers may bring hazardous materials onto our property in connection with, for example, our oil and battery recycling programs. We currently provide a recycling program for batteries and the collection of used lubricants at certain stores as a service to our customers pursuant to agreements with third-party suppliers. The batteries and used lubricants are collected by our Team Members, deposited into supplier-provided containers and pallets, and then recycled by the third-party suppliers. In general, our agreements with such suppliers contain provisions that are designed to limit our potential liability under applicable environmental regulations for any damage or contamination, which may be caused by the batteries and lubricants to off-site properties (including as a result of waste disposal) and to our properties, when caused by the supplier.\nCompliance with any such laws and regulations has not had a material adverse effect on our operations to date. However, we cannot give any assurance that we will not incur significant expenses in the future in order to comply with any such laws or regulations.\nINFORMATION ABOUT OUR EXECUTIVE OFFICERS\nGregory D. Johnson, age 54, Chief Executive Officer and Co-President, has been an O’Reilly Team Member for 37 years, which includes continuous years of service with a company acquired by O’Reilly. Mr. Johnson’s O’Reilly career began as a part-time Distribution Center Team Member and progressed through the roles of Retail Systems Manager, Warehouse Management Systems (WMS) Development Manager, Director of Distribution, Vice President of Distribution Operations, Senior Vice President of Distribution Operations, and Executive Vice President of Supply Chain. Mr. Johnson has held the position of Co-President since 2017. Mr. Johnson was promoted to Chief Executive Officer and Co-President in 2018.\nJeff M. Shaw, age 57, Chief Operating Officer and Co-President, has been an O’Reilly Team Member for 31 years. Mr. Shaw’s primary areas of responsibility are Store Operations, Sales, Distribution Operations, Real Estate, Jobber Sales and Acquisitions. Mr. Shaw’s O’Reilly career began as a Parts Specialist and progressed through the roles of Store Manager, District Manager, Regional Manager, Vice President of the Southern Division, Vice President of Sales and Operations, Senior Vice President of Sales and Operations, and Executive Vice President of Store Operations and Sales. Mr. Shaw has held the position of Co-President since 2017. Mr. Shaw was promoted to Chief Operating Officer and Co-President in 2018.\nBrad Beckham, age 41, Executive Vice President of Store Operations and Sales, has been an O’Reilly Team Member for 23 years. Mr. Beckham’s primary areas of responsibility are Store Operations and Sales for O’Reilly’s Store Operations. Mr. Beckham’s O’Reilly career began as a Parts Specialist and progressed through the roles of Store Manager, District Manager, Regional Manager, Divisional Vice President, Vice President of Eastern Store Operations and Sales, Senior Vice President of Eastern Store Operations and Sales, and Senior Vice President of Central Store Operations. Mr. Beckham has held the position of Executive Vice President of Store Operations and Sales since 2018.\nTom McFall, age 49, Executive Vice President and Chief Financial Officer, has been an O’Reilly Team Member for 13 years. Mr. McFall’s primary areas of responsibility are Finance, Accounting, Information Technology, Legal, and Risk Management. Mr. McFall’s career began with Ernst & Young LLP in Detroit, Michigan, where he achieved the position of Audit Manager, before accepting a position with Murray’s Discount Auto Stores (“Murray’s”). Mr. McFall served Murray’s for eight years through the roles of Controller, Vice President of Finance, and Chief Financial Officer, with direct responsibility for finance, accounting, and distribution and logistics operations. After Murray’s was acquired by CSK Auto Corporation (“CSK”) in 2005, Mr. McFall held the position of Chief Financial Officer of Midwest Operation for CSK. In 2006, Mr. McFall joined O’Reilly as Senior Vice President of Finance and Chief Financial Officer. Mr. McFall has held the position of Executive Vice President and Chief Financial Officer since 2007.\nJonathan Andrews, age 52, Senior Vice President of Human Resources and Training, has been an O’Reilly Team Member for seven years. Mr. Andrews’s primary areas of responsibility are Human Resources and Training. Mr. Andrews has over 25 years of human resources experience. Mr. Andrews’s career includes human resource positions with Cargill, Inc., Tyson Foods, Inc. and AutoNation, Inc. Mr. Andrews served AutoNation for 10 years as Director of Human Resources and Senior Director of Human Resources. In 2012, Mr. Andrews joined O’Reilly as Vice President of Human Resources and progressed through the role of Vice President of Human Resources and Training. Mr. Andrews has held the position of Senior Vice President of Human Resources and Training since January of 2019.\nDoug Bragg, age 50, Senior Vice President of Central Store Operations and Sales, has been an O’Reilly Team Member for 29 years. Mr. Bragg’s primary areas of responsibility are Store Operations and Sales for O’Reilly Central Store Operations. Mr. Bragg’s O’Reilly career began as a Distribution Center Team Member and progressed through the roles of Assistant Store Manager, Store Manager, District Manager, Regional Manager, and Divisional Vice President. Mr. Bragg has held the position of Senior Vice President of Central Store Operations since 2018.\nRobert Dumas, age 46, Senior Vice President of Eastern Store Operations and Sales, has been an O’Reilly Team Member for 28 years, which includes continuous years of service with a company acquired by O’Reilly. Mr. Dumas’s primary areas of responsibility are Store Operations and Sales for O’Reilly’s Eastern Store Operations. Mr. Dumas’s O’Reilly career began as a Parts Specialist and progressed through the roles of Installer Service Specialist, Night Manager, Associate Manager, Store Manager, District Manager, Regional Manager, and Divisional Vice President. Mr. Dumas has held the position of Senior Vice President of Eastern Store Operations and Sales since 2016.\nLarry L. Ellis, age 64, Senior Vice President of Distribution Operations, has been an O’Reilly Team Member for 44 years, which includes continuous years of service with a company acquired by O’Reilly. Mr. Ellis’s primary areas of responsibility are Distribution Operations and Logistics. Mr. Ellis’s O’Reilly career began as a Distribution Center Team Member and progressed through the roles of Distribution Center Supervisor, Distribution Center Manager, Director of Distribution Operations, Vice President of Logistics, Vice President of Western Division Distribution Operations, and Vice President of Distribution Operations. Mr. Ellis has held the position of Senior Vice President of Distribution Operations since 2014.\nJeremy Fletcher, age 42, Senior Vice President of Finance and Controller, has been an O’Reilly Team Member for 14 years. Mr. Fletcher’s primary area of responsibility is Finance. Mr. Fletcher’s O’Reilly career began as the Financial Reporting and Budgeting Manager and progressed through the roles of Director of Finance, and Vice President of Finance and Controller. Prior to joining O’Reilly, Mr. Fletcher worked as a Certified Public Accountant with a public accounting firm and in a financial reporting and planning role for a Fortune 1000 corporation. Mr. Fletcher has held the position of Senior Vice President of Finance and Controller since 2017.\nJeffrey L. Groves, age 54, Senior Vice President of Legal and General Counsel, has been an O’Reilly Team Member for 15 years. Mr. Groves’s primary areas of responsibility are Corporate Governance, Regulatory Matters, and Internal Audit. Mr. Groves’s O’Reilly career began as Director of Legal and Claim Services and progressed through the roles of Director of Legal and Claim Services and General Counsel and Vice President of Legal and Claim Services and General Counsel. Prior to joining O’Reilly, Mr. Groves worked in a private civil defense trial practice. Mr. Groves has held the position of Senior Vice President of Legal and General Counsel since 2016.\nBrent Kirby, age 51, Senior Vice President of Omnichannel, has been an O’Reilly Team Member since 2018. Mr. Kirby’s primary areas of responsibility are Marketing, Advertising, Electronic Catalog, Customer Satisfaction and Digital business areas while working cross functionally to deliver our Omnichannel strategy. Mr. Kirby has over 30 years of experience in the retail industry. Prior to joining O’Reilly, Mr. Kirby held the position of Chief Supply Chain Officer for Lowe’s Companies, Inc. (“Lowe’s”), with direct responsibility for leading the global supply chain supporting Lowe’s U.S.-based home improvement business. In this role, Mr. Kirby was responsible for team members across a diverse network of distribution centers, manufacturing facilities, direct-to-consumer parcel operations and last mile delivery operations. Mr. Kirby began his retail career as a hardware associate with Lowe’s and progressed through various positions at the store, district and regional levels before being promoted to Senior Vice President of Store Operations and later Chief Omnichannel Officer. In 2018, Mr. Kirby joined O’Reilly as Senior Vice President of Omnichannel and has held this position since that time.\nScott Kraus, age 43, Senior Vice President of Real Estate and Expansion, has been an O’Reilly Team Member for 21 years. Mr. Kraus’s primary areas of responsibility are Real Estate Expansion and Acquisitions. Mr. Kraus’s O’Reilly career began as a Parts Specialist and progressed through the roles of Store Manager, District Manager, Regional Field Sales Manager, Regional Manager, Divisional Vice President, and Vice President of Real Estate. Mr. Kraus has held the position of Senior Vice President of Real Estate and Expansion since 2016.\nJeffrey A. Lauro, age 53, Senior Vice President of Information Technology, has been an O’Reilly Team Member since 2015. Mr. Lauro’s primary area of responsibility is Information Technology. Mr. Lauro has over 30 years of information technology experience primarily in the retail industry. Prior to joining O’Reilly, Mr. Lauro held the position of Chief Information Officer for Payless ShoeSource (“Payless”), with direct responsibility for solution delivery, infrastructure and operations, and enterprise architecture. Prior to joining Payless, Mr. Lauro was the Vice President, Global Information Technology Service Delivery Director for The TJX Companies, Inc., with direct responsibility for global information technology service management, operations, implementation and disaster recovery. In 2015, Mr. Lauro joined O’Reilly as Senior Vice President of Information Technology and has held this position since that time.\nJason Tarrant, age 39, Senior Vice President of Western Store Operations and Sales, has been an O’Reilly Team Member for 18 years, which includes continuous years of service with a company acquired by O’Reilly. Mr. Tarrant’s primary areas of responsibility are Store Operations and Sales for O’Reilly Western Store Operations. Mr. Tarrant’s O’Reilly career began as a Parts Specialist and progressed through the roles of Assistant Store Manager, Store Manager, District Manager, Regional Field Sales Manager, Regional Manager, and Divisional Vice President. Mr. Tarrant has held the position of Senior Vice President of Western Store Operations and Sales since 2018.\nDarin Venosdel, age 49, Senior Vice President of Inventory Management, has been an O’Reilly Team Member for 22 years. Mr. Venosdel’s primary areas of responsibility are Inventory Management, Purchasing and Store Design. Mr. Venosdel’s O’Reilly career began as a Programmer/Analyst and progressed through the roles of Application Development Manager, Director of Application Development, Director of Inventory Management, and Vice President of Inventory Management. Mr. Venosdel has held the position of Senior Vice President of Inventory Management since 2018.\nDavid Wilbanks, age 48, Senior Vice President of Merchandise, has been an O’Reilly Team Member for seven years. Mr. Wilbanks’s primary areas of responsibility are Merchandise and Pricing. Mr. Wilbanks has over 30 years of experience in the automotive aftermarket industry. Mr. Wilbanks’s career began as a counter technician for an independent jobber and progressed to becoming an ASE Certified Master Technician for an automotive dealership, before accepting a position with AutoZone, Inc. (“AutoZone”). Mr. Wilbanks served AutoZone for twelve years as a financial analyst, Category Manager, and Director of Merchandise. In 2012, Mr. Wilbanks joined O’Reilly as Vice President of Merchandise and has held the position of Senior Vice President of Merchandise since 2016.\nSERVICE MARKS AND TRADEMARKS\nWe have registered, acquired and/or been assigned the following service marks and trademarks in the United States: BENNETT AUTO SUPPLY®; BESTEST®; BETTER PARTS. BETTER PRICES.®; BETTER PARTS, BETTER PRICES....EVERYDAY!®; BOND AUTO PARTS®; BRAKEBEST®; BRAKEBEST HD®; CARTEK®; CARTEK PRO®; CERTIFIED AUTO REPAIR®; CHECKER AUTO PARTS®; CSK PROSHOP®; CUSTOMIZE YOUR RIDE®; DO IT RIGHT DEALS®; DO IT RIGHT REBATE®; DRIVE WITH THE LEADER!®; FIRST CALL®; FLEET & HEAVY DUTY PROFESSIONAL PARTS PEOPLE®; FRIENDLIEST PARTS STORE IN TOWN®; FROM OUR STORE TO YOUR DOOR®; IMPORT DIRECT®; KRAGEN AUTO PARTS®; MASTER PRO®; MASTER PRO REFINISHING®; MASTERPRO SELECT®; MASTERPRO UNDERCAR®; MICROGARD®; MURRAY®; MURRAY CLIMATE CONTROL®; MURRAY TEMPERATURE CONTROL®; MURRAY’S MASCOT® (Design only); MURRAY PLUS®; MURRAY ULTRA®; MURRAY’S AUTO PARTS®; O LOW PRICE GUARANTEE! ®; O® (Shamrock inside of “O”); OMNISPARK®; O’REILLY®; O’REILLY AUTO COLOR PROFESSIONAL PAINT PEOPLE®; O’REILLY AUTO PARTS®; O’REILLY AUTO PARTS PROFESSIONAL PARTS PEOPLE®; O’REILLY AUTOMOTIVE®; O’REILLY O’REWARDS®; O’REILLY RACING®; O’REILLY SELECT®; O’REWARDS®; PARTNERSHIP NETWORK®; PARTS CITY®; PARTS CITY AUTO COLOR PROFESSIONAL PAINT PEOPLE®; PARTS CITY AUTO PARTS®; PARTS CITY TOOL BOX®; PARTS FOR YOUR CAR WHEREVER YOU ARE®; PARTS PAYOFF®; POWER TORQUE®; PRECISION®; PRECISION HUB ASSEMBLIES®; PRIORITY PARTS®; QUIETECH®; REAL WORLD TRAINING®; ¡SIGUE ADELANTE CON O’REILLY!®; SCHUCK’S AUTO SUPPLY®; SUPER START®; TOOLBOX®; ULTIMA®; and ULTIMA SELECT®. Some of the service marks and trademarks listed above may also have a design associated therewith. Each of the service marks and trademarks are in duration for as long as we continue to use and seek renewal of such marks. The above list includes only the trademarks and service marks that are currently and validly registered with the United States Patent and Trademark Office. It does not include trademarks or service marks which may also be in use, but are not yet registered. We believe that our business is not otherwise dependent upon any patent, trademark, service mark or copyright.\nSolely for convenience, our service marks and trademarks may appear in this report without the ® or ™ symbol, which is not intended to indicate that we will not assert, to the fullest extent under applicable law, our rights or the right to these service marks and trademarks.\nAVAILABLE INFORMATION\nOur Internet address is www.OReillyAuto.com. Interested readers can access, free of charge, our annual reports on Form 10-K, quarterly reports on Form 10-Q, current reports on Form 8-K and any amendments to those reports filed or furnished pursuant to Section 13(a) or 15(d) of the Securities Exchange Act of 1934, as amended, through the Securities and Exchange Commission website at www.sec.gov and searching with our ticker symbol “ORLY.” Such reports are generally available the day they are filed. Upon request, we will furnish interested readers a paper copy of such reports free of charge by contacting Mark Merz, Vice President of Investor Relations, Financial Reporting and Planning, at 233 South Patterson Avenue, Springfield, Missouri, 65802.",
    "item_1A": "Item 1A. Risk Factors\nOur future performance is subject to a variety of risks and uncertainties. Although the risks described below are the risks that we believe are material, there may also be risks of which we are currently unaware, or that we currently regard as immaterial based upon the information available to us that later may prove to be material. Interested parties should be aware that the occurrence of the events described in these risk factors, elsewhere in this Form 10-K and in our other filings with the Securities and Exchange Commission could\nhave a material adverse effect on our business, operating results and financial condition. Actual results, therefore, may materially differ from anticipated results described in our forward-looking statements.\nDeteriorating economic conditions may adversely impact demand for our products, reduce access to credit and cause our customers and others, with which we do business, to suffer financial hardship, all of which could adversely impact our business, results of operations, financial condition and cash flows.\nAlthough demand for many of our products is primarily non-discretionary in nature and tend to be purchased by consumers out of necessity, rather than on an impulse basis, our sales are impacted by constraints on the economic health of our customers. The economic health of our customers is affected by many factors, including, among others, general business conditions, interest rates, inflation, consumer debt levels, the availability of consumer credit, currency exchange rates, taxation, fuel prices, unemployment levels and other matters that influence consumer confidence and spending, such as a prolong public health crisis or epidemic (such as the coronavirus). Many of these factors are outside of our control. Our customers’ purchases, including purchases of our products, could decline during periods when income is lower, when prices increase in response to rising costs, or in periods of actual or perceived unfavorable economic conditions or political uncertainty. In addition, restrictions on access to telematics, diagnostic tools and repair information imposed by the original vehicle manufacturers or by governmental regulations may force vehicle owners to rely on dealers to perform maintenance and repairs. If any of these events occur, or if unfavorable economic conditions challenge the consumer environment, our business, results of operations, financial condition and cash flows could be adversely affected.\nOverall demand for products sold in the automotive aftermarket is dependent upon many factors including the total number of vehicle miles driven in the U.S., the total number of registered vehicles in the U.S., the age and quality of these registered vehicles and the level of unemployment in the U.S. Adverse changes in these factors could lead to a decreased level of demand for our products, which could negatively impact our business, results of operations, financial condition and cash flows.\nIn addition, economic conditions, including decreased access to credit, may result in financial difficulties leading to restructurings, bankruptcies, liquidations and other unfavorable events for our customers, suppliers, logistics and other service providers and financial institutions that are counterparties to our credit facilities. Furthermore, the ability of these third parties to overcome these difficulties may increase. If third parties, on whom we rely for merchandise, are unable to overcome difficulties resulting from the deterioration in economic conditions, the cause of which could include a prolonged public health crisis or epidemic (such as the coronavirus), and provide us with the merchandise we need, or if counterparties to our credit facilities do not perform their obligations, our business, results of operations, financial condition and cash flows could be adversely affected.\nThe automotive aftermarket business is highly competitive, and we may have to risk our capital to remain competitive, all of which could adversely impact our business, results of operations, financial condition and cash flows.\nBoth the DIY and professional service provider portions of our business are highly competitive, particularly in the more densely populated areas that we serve. Some of our competitors are larger than we are and have greater financial resources. In addition, some of our competitors are smaller than we are, but have a greater presence than we do in a particular market. Online and mobile platforms may allow customers to quickly compare prices and product assortments between us and a range of competitors, which could result in pricing pressure. Some online competitors may have a lower cost structure than we do, as a result of our strategy of providing an exceptional in-store experience and superior parts availability supported by our extensive store network and robust, regional distribution footprint, which could also create pricing pressure. We may have to expend more resources and risk additional capital to remain competitive, and our results of operations, financial condition and cash flows could be adversely affected. For a list of our principal competitors, see the “Competition” section of Item 1 of this annual report on Form 10-K.\nWe are sensitive to regional economic and weather conditions that could impact our costs and sales.\nOur business is sensitive to national and regional economic and weather conditions, and natural disasters. Unusually inclement weather, such as significant rain, snow, sleet, freezing rain, flooding, seismic activity and hurricanes, has historically discouraged our customers from visiting our stores during the affected period and reduced our sales, particularly to DIY customers. Extreme weather conditions, such as extreme heat and extreme cold temperatures, may enhance demand for our products due to increased failure rates of our customers’ automotive parts, while temperate weather conditions may have a lesser impact on failure rates of automotive parts. In addition, our stores and DCs located in coastal regions may be subject to increased insurance claims resulting from regional weather conditions and our results of operations, financial condition and cash flows could be adversely affected.\nWe cannot assure future growth will be achieved.\nWe believe that our ability to open additional, profitable stores at a high growth rate will be a significant factor in achieving our growth objectives for the future. Our ability to accomplish our growth objectives is dependent, in part, on matters beyond our control, such as weather conditions, zoning, and other issues related to new store site development, the availability of qualified management personnel and general business and economic conditions. We cannot be sure that our growth plans for 2020 and beyond will be achieved. Failure\nto achieve our growth objectives may negatively impact the trading price of our common stock. For a discussion of our growth strategies, see the “Growth Strategy” section of Item 1 of this annual report on Form 10-K.\nIn order to be successful, we will need to retain and motivate key employees.\nOur success has been largely dependent on the efforts of certain key personnel. In order to be successful, we will need to retain and motivate executives and other key employees. Experienced management and technical personnel are in high demand and competition for their talents is intense. We must also continue to motivate employees and keep them focused on our strategies and goals. Our business, results of operations and cash flows could be materially adversely affected by the unexpected loss of the services of one or more of our key employees. We cannot be sure that we will be able to continue to attract qualified personnel, which could cause us to be less efficient and, as a result, may adversely impact our sales and profitability. For a discussion of our management, see the “Business” section of Item 1 of this annual report on Form 10-K.\nA change in the relationship with any of our key suppliers, the unavailability of our key products at competitive prices or changes in trade policies could affect our financial health.\nOur business depends on developing and maintaining close relationships with our suppliers and on our suppliers’ ability or willingness to sell quality products to us at favorable prices and terms. Many factors outside of our control may harm these relationships and the ability or willingness of these suppliers to sell us products on favorable terms. For example, financial or operational difficulties that our suppliers may face could increase the cost of the products we purchase from them or our ability to source products from them. In addition, the trend toward consolidation among automotive parts suppliers, as well as the off-shoring of manufacturing capacity to foreign countries, may disrupt or end our relationship with some suppliers and could lead to less competition and result in higher prices. We could also be negatively impacted by suppliers who might experience work stoppages, labor strikes, a prolonged public health crisis or epidemic (such as the coronavirus) or other interruptions to, or difficulties in the, manufacture or supply of the products we purchase from them. Changes in U.S. trade policies, practices, tariffs or taxes could affect our ability and our suppliers’ ability to source product at current volumes and/or prices.\nRisks associated with future acquisitions may not lead to expected growth and could result in increased costs and inefficiencies.\nWe expect to continue to make acquisitions as an element of our growth strategy. Acquisitions involve certain risks that could cause our actual growth and profitability to differ from our expectations. Examples of such risks include the following:\n● We may not be able to continue to identify suitable acquisition targets or to acquire additional companies at favorable prices or on other favorable terms.\n● Our management’s attention may be distracted.\n● We may fail to retain key personnel from acquired businesses.\n● We may assume unanticipated legal liabilities and other problems.\n● We may not be able to successfully integrate the operations (accounting and billing functions, for example) of businesses we acquire to realize economic, operational and other benefits.\n● We may fail, or be unable to, discover liabilities of businesses that we acquire for which we or the subsequent owner or operator may be liable.\nBusiness interruptions in our distribution centers or other facilities may affect our store hours, operability of our computer systems, and/or availability and distribution of merchandise, which may affect our business.\nWeather, terrorist activities, war or other disasters, or the threat of them, may result in the closure of one or more of our DCs or other facilities, or may adversely affect our ability to deliver inventory to our stores on a nightly basis. This may affect our ability to timely provide products to our customers, resulting in lost sales or a potential loss of customer loyalty. Some of our merchandise is imported from other countries and these goods could become difficult or impossible to bring into the United States, and we may not be able to obtain such merchandise from other sources at similar prices. Such a disruption in revenue could potentially have a negative impact on our results of operations, financial condition and cash flows.\nWe rely extensively on our computer systems to manage inventory, process transactions and timely provide products to our customers. Our systems are subject to damage or interruption from power outages, telecommunications failures, computer viruses, security breaches or other catastrophic events. If our systems are damaged or fail to function properly, we may experience loss of critical data and interruptions or delays in our ability to manage inventories or process customer transactions. Such a disruption of our systems could negatively impact revenue and potentially have a negative impact on our results of operations, financial condition and cash flows.\nFailure to achieve and maintain a high level of product and service quality may reduce our brand value and negatively impact our business.\nWe believe our Company has built an excellent reputation as a leading retailer in the automotive aftermarket industry. We believe our continued success depends, in part, on our ability to preserve, grow and leverage the value of our brand. Brand value is based, in large part, on perceptions of subjective qualities and even isolated incidents can erode trust and confidence, particularly if they result in adverse publicity, governmental investigations or litigation, which can negatively impact these perceptions and lead to adverse effects on our business or Team Members.\nRisks related to us and unanticipated fluctuations in our quarterly operating results could affect our stock price.\nWe believe that quarter-to-quarter comparisons of our financial results are not necessarily meaningful indicators of our future operating results and should not be relied on as an indication of future performance. If our quarterly operating results fail to meet the expectations of analysts, the trading price of our common stock could be negatively affected. We cannot be certain that our growth plans and business strategies will be successful or that they will successfully meet the expectations of these analysts. If we fail to adequately address any of these risks or difficulties, our stock price would likely suffer.\nThe market price of our common stock may be volatile and could expose us to securities class action litigation.\nThe stock market and the price of our common stock may be subject to wide fluctuations based upon general economic and market conditions. The market price of our common stock may also be affected by our ability to meet analysts’ expectations and failure to meet such expectations, even slightly, could have an adverse effect on the market price of our common stock.\nIn addition, stock market volatility has had a significant effect on the market prices of securities issued by many companies for reasons unrelated to the operating performance of these companies. Downturns in the stock market may cause the price of our common stock to decline. In the past, following periods of volatility in the market price of a company’s securities, securities class action litigation has often been initiated against such companies. If similar litigation were initiated against us, it could result in substantial costs and a diversion of our management’s attention and resources, which could have an adverse effect on our business.\nOur debt levels could adversely affect our cash flow and prevent us from fulfilling our obligations.\nWe have an unsecured revolving credit facility and unsecured senior notes, which could have important consequences to our financial health. For example, our level of indebtedness could, among other things,\n● make it more difficult to satisfy our financial obligations, including those relating to the senior unsecured notes and our credit facility;\n● increase our vulnerability to adverse economic and industry conditions;\n● limit our flexibility in planning for, or reacting to, changes and opportunities in our industry, which may place us at a competitive disadvantage;\n● require us to dedicate a substantial portion of our cash flows to service the principal and interest on the debt, reducing the funds available for other business purposes, such as working capital, capital expenditures or other cash requirements;\n● limit our ability to incur additional debt with acceptable terms, if at all; and\n● expose us to fluctuations in interest rates, including changes that may result from the implementation of new benchmark rates that replace LIBOR.\nIn addition, the terms of our financing obligations include restrictions, such as affirmative, negative and financial covenants, conditions on borrowing and subsidiary guarantees. A failure to comply with these restrictions could result in a default under our financing obligations or could require us to obtain waivers from our lenders for failure to comply with these restrictions. The occurrence of a default that remains uncured or the inability to secure a necessary consent or waiver could have a material adverse effect on our business, financial condition, results of operations and cash flows.\nA downgrade in our credit rating would impact our cost of capital and could impact the market value of our unsecured senior notes, as well as limit our access to attractive supplier financing programs.\nCredit ratings are an important component of our cost of capital. These ratings are based upon, among other factors, our financial strength. Our current credit ratings provide us with the ability to borrow funds at favorable rates. A downgrade in our current credit rating from either rating agency could adversely affect our cost of capital by causing us to pay a higher interest rate on borrowed funds under our unsecured revolving credit facility and a higher facility fee on commitments under our unsecured revolving credit facility. A downgrade in our current credit rating could also adversely affect the market price and/or liquidity of our unsecured senior notes, preventing a holder from selling the unsecured senior notes at a favorable price, as well as adversely affect our ability to issue new notes in the future. In addition, a downgrade in our current credit rating could limit the financial institutions willing to commit funds to our\nsupplier financing programs at attractive rates. Decreased participation in our supplier financing programs would lead to an increase in working capital needed to operate the business, adversely affecting our cash flows.\nA breach of customer, supplier, Team Member or Company information could damage our reputation or result in substantial additional costs or possible litigation.\nOur business involves the storage of information about our customers, suppliers, Team Members and the Company, some of which is entrusted to third-party service providers and vendors. We and our third-party service providers and vendors have taken reasonable and appropriate steps to protect this information; however, these security measures may be breached due to cyber-attacks, Team Member error, system compromises, fraud, hacking or other intentional or unintentional acts, which could result in unauthorized parties gaining access to such information. The methods used to obtain unauthorized access are constantly evolving and may be difficult to anticipate or detect for long periods of time. If we experience a significant data security breach, we could be exposed to damage to our reputation, additional costs, lost sales, litigation or possible regulatory action. In addition, the regulatory environment related to information security and privacy is constantly evolving, and compliance with those requirements could result in additional costs. There is no guarantee that the procedures that we and our third-party service providers and vendors have implemented to protect against unauthorized access to secured data are adequate to safeguard against all data security breaches, and such a breach could potentially have a negative impact on our results of operations, financial condition and cash flows.\nLitigation, governmental proceedings, environmental legislation and regulations and employment legislation and regulations may affect our business, financial condition, results of operations and cash flows.\nWe are, and in the future may become, involved in lawsuits, regulatory inquiries, and governmental and other legal proceedings, arising out of the ordinary course of our business. The damages sought against us in some of these litigation proceedings may be material and may adversely affect our business, results of operations, financial condition and cash flows.\nEnvironmental legislation and regulations, like the initiatives to limit greenhouse gas emissions and bills related to climate change, could adversely impact all industries. While it is uncertain whether these initiatives will become law, additional climate change related mandates could potentially be forthcoming and these matters, if enacted, could adversely impact our costs, by, among other things, increasing fuel prices.\nOur business is subject to employment legislation and regulations, including requirements related to minimum wage. Our success depends, in part, on our ability to manage operating costs and identify opportunities to reduce costs. Our ability to meet labor needs, while controlling costs is subject to external factors, such as minimum wage legislation. A violation of, or change in, employment legislation and/or regulations could hinder our ability to control costs, which could have a material adverse effect on our business, results of operations, financial condition and cash flows.\nRisks associated with international operations could result in additional costs and inefficiencies.\nIn addition to many of the risks we face in our U.S. operations, international operations present a unique set of risks and challenges, including local laws and customs, U.S. laws applicable to foreign operations, and political and socio-economic conditions. Our ability to operate effectively and grow in international markets could be impacted by these risks resulting in legal liabilities, additional costs, and the distraction of management’s attention. Compliance with the Foreign Corrupt Practices Act and protection of intellectual property rights surrounding items such as tradenames and trademarks in foreign jurisdictions can pose significant challenges.\nIn addition, our operations in international markets are conducted primarily in the local currency of those countries. Given that our Consolidated Financial Statements are denominated in U.S. dollars, amounts of assets, liabilities, net sales, and other revenues and expenses denominated in local currencies must be translated into U.S. dollars using exchange rates for the current period. As a result, foreign currency exchange rates and fluctuations in those rates may adversely impact our financial performance.",
    "item_1B": "Item 1B. Unresolved Staff Comments\nNone.",
    "item_1C": "",
    "item_2": "Item 2. Properties\nStores, distribution centers and other properties:\nOf the 5,460 stores that we operated at December 31, 2019, 2,235 stores were owned, 3,151 stores were leased from unaffiliated parties, 21 of which were located in Mexico, and 74 stores were leased from entities that include one or more of our affiliated directors or members of their immediate family. Leases with unaffiliated parties generally provide for payment of a fixed base rent, payment of certain tax, insurance and maintenance expenses and an original term of, at a minimum, 10 years, subject to one or more renewals at our\noption. We have entered into separate master lease agreements with each of the affiliated entities for the occupancy of the stores covered thereby. Such master lease agreements with two of the seven affiliated entities have been modified to extend the term of the lease agreement for specific stores. The master lease agreements or modifications thereto expire on dates ranging from July 31, 2020, to September 30, 2031. We believe that the lease agreements with the affiliated entities are on terms comparable to those obtainable from third parties.\nThe following table provides information regarding our U.S. domestic regional DCs in operation as of December 31, 2019:\n(1) DC operating square footage includes floor and mezzanine operating square footage and excludes subleased square footage.\n(2) Terms expiring on dates ranging from March 31, 2022, to June 30, 2035.\nIn addition, we acquired six small distribution centers in Mexico from the Mayasa acquisition; these distribution centers do not serve U.S. stores and are immaterial in the aggregate. We have two distribution system expansion projects under construction in the Nashville and Memphis, Tennessee, markets, both of which are expected to be completed in 2020. With the completion of our new Nashville area DC, two of our smaller, existing Tennessee DCs will cease being used as distribution facilities.\nWe believe that our present facilities are in good condition, are adequately insured and are adequate for the conduct of our current operations. The store servicing capability of our 28 existing U.S. DCs is approximately 6,135 stores, providing a growth capacity of more than 695 U.S. stores, which will increase by approximately 190 stores with the completion of our two Tennessee market area DCs in 2020. We believe the growth capacity in our DCs, along with the additional capacity of our new Nashville and Memphis, Tennessee, markets DCs, will provide us with the DC infrastructure needed for near-term expansion. However, as we expand our geographic footprint, we will continue to evaluate our existing distribution system infrastructure and will adjust our distribution system capacity as needed to support our future growth.\nOur corporate office operations occur primarily in Springfield, Missouri, and as of December 31, 2019, the total square footage was 0.6 million square feet, substantially all of which was owned.\nWe also own or lease other properties that are not material in the aggregate.",
    "item_3": "Item 3. Legal Proceedings\nThe Company is currently involved in litigation incidental to the ordinary conduct of the Company’s business. The Company accrues for litigation losses in instances where a material adverse outcome is probable and the Company is able to reasonably estimate the probable loss. The Company accrues for an estimate of material legal costs to be incurred in pending litigation matters. Although the Company cannot ascertain the amount of liability that it may incur from any of these matters, it does not currently believe that, in the aggregate, these matters, taking into account applicable insurance and accruals, will have a material adverse effect on its consolidated financial position, results of operations or cash flows in a particular quarter or annual period.",
    "item_4": "Item 4. Mine Safety Disclosures\nNot applicable.\nPART II",
    "item_5": "Item 5. Market for Registrant’s Common Equity, Related Stockholder Matters and Issuer Purchases of Equity Securities\nCommon stock:\nShares of the Company’s common stock are traded on The NASDAQ Global Select Market (“Nasdaq”) under the symbol “ORLY.” The Company’s common stock began trading on April 22, 1993; no cash dividends have been declared since that time, and the Company does not anticipate paying any cash dividends in the foreseeable future.\nAs of February 14, 2020, the Company had approximately 392,000 shareholders of common stock based on the number of holders of record and an estimate of individual participants represented by security position listings.\nSales of unregistered securities:\nThere were no sales of unregistered securities during the year ended December 31, 2019.\nIssuer purchases of equity securities:\nThe following table identifies all repurchases during the fourth quarter ended December 31, 2019, of any of the Company’s securities registered under Section 12 of the Securities Exchange Act of 1934, as amended, by or on behalf of the Company or any affiliated purchaser (in thousands, except per share data):\n(1) Under the Company’s share repurchase program, as approved by its Board of Directors on January 11, 2011, the Company may, from time to time, repurchase shares of its common stock, solely through open market purchases effected through a broker dealer at prevailing market prices, based on a variety of factors such as price, corporate trading policy requirements and overall market conditions not to exceed a dollar limit authorized by the Board of Directors. The Company’s Board of Directors may increase or otherwise modify, renew, suspend or terminate the share repurchase program at any time, without prior notice. As announced on May 31, 2019, and February 5, 2020, the Company’s Board of Directors each time approved a resolution to increase the authorization amount under the share repurchase program by an additional $1.0 billion, resulting in a cumulative authorization amount of $13.8 billion. Each additional authorization is effective for a three-year period, beginning on its respective announcement date. The authorizations under the share repurchase program that currently have capacity are scheduled to expire on May 31, 2022, and February 5, 2023. No other share repurchase programs existed during the twelve months ended December 31, 2019.\nThe Company repurchased a total of 3.9 million shares of its common stock under its publicly announced share repurchase program during the year ended December 31, 2019, at an average price per share of $369.55, for a total investment of $1.4 billion. Subsequent to the end of the year and through February 28, 2020, the Company repurchased an additional 0.9 million shares of its common stock, at an average price per share of $400.78, for a total investment of $363.4 million. The Company has repurchased a total of 77.1 million shares of its common stock under its share repurchase program since the inception of the program in January of 2011 and through February 28, 2020, at an average price of $162.72, for a total aggregate investment of $12.5 billion.\nStock performance graph:\nThe graph below shows the cumulative total shareholder return assuming the investment of $100, on December 31, 2014, and the reinvestment of dividends thereafter, if any, in the Company’s common stock versus the Standard and Poor’s S&P 500 Retail Index (“S&P 500 Retail Index”) and the Standard and Poor’s S&P 500 Index (“S&P 500”).",
    "item_6": "Item 6. Selected Financial Data\nThe table below compares the “Company’s selected financial data over a ten-year period:\n(a) During the year ended December 31, 2017, the Company adopted a new accounting standard that requires excess tax benefits related to share-based compensation payments to be recorded through the income statement. In compliance with the standard, the Company did not restate prior period amounts to conform to current period presentation. The Company recorded a cumulative effect adjustment to opening retained earnings, due to the adoption of the new accounting standard. See Note 1 “Summary of Significant Accounting Policies” to the Consolidated Financial Statements of the annual report on Form 10-K for the year ended December 31, 2017, for more information.\n(b) Following the enactment of the U.S. Tax Cuts and Jobs Act in December of 2017, the Company revalued its deferred income tax liabilities, which resulted in a one-time benefit to the Company’s Consolidated Statement of Income for the year ended December 31, 2018 and 2017. See Note 13 “Income Taxes” to the Consolidated Financial Statements of the annual report on Form 10-K for the year ended December 31, 2018, for more information.\n(c) Represents O’Reilly U.S. operations only.\n(d) In 2008, 2012, 2016, and 2018, the Company acquired CSK Auto Corporation (“CSK”), materially all assets of VIP Parts, Tires & Service (“VIP”), Bond Auto Parts (“Bond”) and Bennett Auto Supply, Inc. (“Bennett”), respectively. The 2008 CSK acquisition added 1,342 stores, the 2012 VIP acquisition added 56 stores and the 2016 Bond acquisition added 48 stores to the O’Reilly store count. After the close of business on December 31, 2018, the Company acquired substantially all of the non-real estate assets of Bennett, including 33 stores that were not included in the 2018 store count and were not operated by the Company in 2018, but beginning January 1, 2019, the operations of the acquired Bennett locations were included in the Company’s store count, and during the year ended December 31, 2019, the Company merged 13 of these acquired Bennett stores into existing O’Reilly locations and rebranded the remaining 20 Bennett stores as O’Reilly stores. Financial results for these acquired companies have been included in the Company’s consolidated financial statements from the dates of the acquisitions forward.\n(e) In 2019, the Company acquired Mayoreo de Autopartes y Aceites, S.A. de C.V. (“Mayasa”), which added 21 stores to the O’Reilly store count. Financial results for this acquired company have been included in the Company’s consolidated financial statements beginning from the date of the acquisition.\n(f) Square footage includes normal selling, office, stockroom and receiving space.\n(g) Sales per weighted-average store are weighted to consider the approximate dates of store openings, acquisitions or closures.\n(h) Sales per weighted-average square foot are weighted to consider the approximate dates of domestic store openings, acquisitions, expansions or closures.\n(i) Comparable store sales are calculated based on the change in sales of U.S. stores open at least one year and excludes sales of specialty machinery, sales to independent parts stores, sales to Team Members, sales from Leap Day during the years ended December 31, 2016 and 2012, and sales during the one to two week period certain CSK branded stores were closed for conversion. Online sales, resulting from ship-to-home orders and pick-up-in-store orders, for U.S. stores open at least one year, are included in the comparable store sales calculation.\n(j) Certain prior period amounts have been reclassified to conform to current period presentation, due to the Company’s adoption of new accounting standards during the fourth quarter ended December 31, 2015. See Note 1 “Summary of Significant Accounting Policies” to the Consolidated Financial Statements of the annual report on Form 10-K for the year ended December 31, 2015, for more information.\n(k) Inventory turnover is calculated as cost of goods sold for the last 12 months divided by average inventory. Average inventory is calculated as the average of inventory for the trailing four quarters used in determining the denominator.\n(l) Accounts payable to inventory is calculated as accounts payable divided by inventory.\n(m) Certain prior period amounts have been reclassified to conform to current period presentation, due to the Company’s adoption of a new accounting standard during the first quarter ended March 31, 2017. See Note 1 “Summary of Significant Accounting Policies” to the Consolidated Financial Statements of the annual report on Form 10-K for the year ended December 31, 2017, for more information.\n(n) Free cash flow is calculated as net cash provided by operating activities less capital expenditures, excess tax benefit from share-based compensation payments, and investment in tax credit equity investments for the period.",
    "item_7": "Item 7. Management’s Discussion and Analysis of Financial Condition and Results of Operations\nIn Management’s Discussion and Analysis, we provide a historical and prospective narrative of our general financial condition, results of operations, liquidity and certain other factors that may affect our future results, including\n● an overview of the key drivers of the automotive aftermarket industry;\n● key events and recent developments within our company;\n● our results of operations for the years ended December 31, 2019, 2018, and 2017;\n● our liquidity and capital resources;\n● any contractual obligations, to which we are committed;\n● any off-balance sheet arrangements we utilize;\n● our critical accounting estimates;\n● the inflation and seasonality of our business;\n● our quarterly results for the years ended December 31, 2019, and 2018; and\n● recent accounting pronouncements that may affect our Company.\nThe review of Management’s Discussion and Analysis should be made in conjunction with our consolidated financial statements, related notes and other financial information, forward-looking statements and other risk factors included elsewhere in this annual report.\nFORWARD-LOOKING STATEMENTS\nWe claim the protection of the safe-harbor for forward-looking statements within the meaning of the Private Securities Litigation Reform Act of 1995. You can identify these statements by forward-looking words such as “estimate,” “may,” “could,” “will,” “believe,” “expect,” “would,” “consider,” “should,” “anticipate,” “project,” “plan,” “intend” or similar words. In addition, statements contained within this annual report that are not historical facts are forward-looking statements, such as statements discussing, among other things, expected growth, store development, integration and expansion strategy, business strategies, future revenues and future performance. These forward-looking statements are based on estimates, projections, beliefs and assumptions and are not guarantees of future events and results. Such statements are subject to risks, uncertainties and assumptions, including, but not limited to, the economy in general, inflation, tariffs, product demand, the market for auto parts, competition, weather, risks associated with the performance of acquired businesses, our ability to hire and retain qualified employees, consumer debt levels, our increased debt levels, credit ratings on public debt, governmental regulations, information security and cyber-attacks, terrorist activities, war and the threat of war. Actual results may materially differ from anticipated results described or implied in these forward-looking statements. Please refer to the “Risk Factors” section in this annual report on Form 10-K for the year ended December 31, 2019, and subsequent Securities and Exchange Commission filings, for additional factors that could materially affect our financial performance. Forward-looking statements speak only as of the date they were made, and we undertake no obligation to publicly update any forward-looking statements, whether as a result of new information, future events or otherwise, except as required by applicable law.\nOVERVIEW\nWe are a specialty retailer of automotive aftermarket parts, tools, supplies, equipment and accessories in the United States. We are one of the largest U.S. automotive aftermarket specialty retailers, selling our products to both DIY customers and professional service providers - our “dual market strategy.” Our stores carry an extensive product line consisting of new and remanufactured automotive hard parts, maintenance items, accessories, a complete line of auto body paint and related materials, automotive tools and professional service provider service equipment.\nOur extensive product line includes an assortment of products that are differentiated by quality and price for most of the product lines we offer. For many of our product offerings, this quality differentiation reflects “good,” “better,” and “best” alternatives. Our sales and total gross profit dollars are highest for the “best” quality category of products. Consumers’ willingness to select products at a higher point on the value spectrum is a driver of sales and profitability in our industry. We have ongoing initiatives focused on marketing and training to educate customers on the advantages of ongoing vehicle maintenance, as well as “purchasing up” on the value spectrum.\nOur stores also offer enhanced services and programs to our customers, including used oil, oil filter and battery recycling; battery, wiper and bulb replacement; battery diagnostic testing; electrical and module testing; check engine light code extraction; loaner tool program; drum and rotor resurfacing; custom hydraulic hoses; professional paint shop mixing and related materials; and machine shops. As of December 31, 2019, we operated 5,439 stores in 47 U.S. states and 21 stores in Mexico.\nWe are influenced by a number of general macroeconomic factors that influence both our industry and our consumers, including, but not limited to, fuel costs, unemployment trends, interest rates, and other economic factors. Due to the nature of these macroeconomic\nfactors, we are unable to determine how long current conditions will persist and the degree of impact future changes may have on our business.\nThe sustained trends of low U.S. unemployment have been favorable to our industry through the support of miles driven and consumer confidence; however, this has also resulted in pressure on wages, particularly when combined with legislated wage increases in certain market areas.\nWe believe the key drivers of current and future long-term demand for the products sold within the automotive aftermarket include the number of U.S. miles driven, number of U.S. registered vehicles, new light vehicle registrations and average vehicle age.\nNumber of Miles Driven\nThe number of total miles driven in the U.S. influences the demand for repair and maintenance products sold within the automotive aftermarket. In total, vehicles in the U.S. are driven approximately three trillion miles per year, resulting in ongoing wear and tear and a corresponding continued demand for the repair and maintenance products necessary to keep these vehicles in operation. According to the Department of Transportation, the number of total miles driven in the U.S. increased 0.4% and 1.2% in 2018 and 2017, respectively, and through November of 2019, year-to-date miles driven increased 0.9%. We would expect to continue to see modest improvements in total miles driven in the U.S., supported by an increasing number of registered vehicles on the road, resulting in continued demand for automotive aftermarket products.\nSize and Age of the Vehicle Fleet\nThe total number of vehicles on the road and the average age of the vehicle population heavily influence the demand for products sold within the automotive aftermarket industry. As reported by The Auto Care Association, the total number of registered vehicles increased 8.1% from 2008 to 2018, bringing the number of light vehicles on the road to 272 million by the end of 2018. For the year ended December 31, 2019, the seasonally adjusted annual rate of light vehicle sales in the U.S. (“SAAR”) was approximately 16.7 million, contributing to the continued growth in the total number of registered vehicles on the road. In the past decade, vehicle scrappage rates have remained relatively stable, ranging from 4.4% to 5.7% annually. As a result, over the past decade, the average age of the U.S. vehicle population has increased, growing 20.6%, from 9.7 years in 2008 to 11.7 years in 2018.\nWe believe this increase in average age can be attributed to better engineered and manufactured vehicles, which can be reliably driven at higher mileages due to better quality power trains, interiors and exteriors, and the consumer’s willingness to invest in maintaining these higher-mileage, better built vehicles. As the average age of vehicles on the road increases, a larger percentage of miles are being driven by vehicles that are outside of a manufacturer warranty. These out-of-warranty, older vehicles generate strong demand for automotive aftermarket products as they go through more routine maintenance cycles, have more frequent mechanical failures and generally require more maintenance than newer vehicles. We believe consumers will continue to invest in these reliable, higher-quality, higher-mileage vehicles and these investments, along with an increasing total light vehicle fleet, will support continued demand for automotive aftermarket products.\nWe remain confident in our ability to gain market share in our existing markets and grow our business in new markets by focusing on our dual market strategy and the core O’Reilly values of hard work and excellent customer service.\nKEY EVENTS AND RECENT DEVELOPMENTS\nSeveral key events have had or may have a significant impact on our operations and are identified below:\n● After the close of business on December 31, 2018, we completed an asset purchase of Bennett, a privately held automotive parts supplier operating 33 stores and a warehouse in Florida. These stores were not operated by the Company in 2018 and were therefore not included in our 2018 store count. Beginning January 1, 2019, the operations of the acquired Bennett locations were included in the Company’s store count, consolidated financial statements and results of operations. During the year ended December 31, 2019, the Company merged 13 of these acquired Bennett stores into existing O’Reilly locations and rebranded the remaining 20 Bennett stores as O’Reilly stores.\n● Under the Company’s share repurchase program, as approved by our Board of Directors in January of 2011, we may, from time to time, repurchase shares of our common stock, solely through open market purchases effected through a broker dealer at prevailing market prices, based on a variety of factors such as price, corporate trading policy requirements and overall market conditions. Our Board of Directors may increase or otherwise modify, renew, suspend or terminate the share repurchase program at any time, without prior notice. As announced on May 31, 2019, and February 5, 2020, our Board of Directors approved a resolution each time to increase the authorization amount under our share repurchase program by an additional $1.00 billion, resulting in a cumulative authorization amount of $13.75 billion. Each additional authorization is effective for a\nthree-year period, beginning on its respective announcement date. As of February 28, 2020, we had repurchased approximately 77.1 million shares of our common stock at an aggregate cost of $12.54 billion under this program.\n● On May 20, 2019, we issued $500 million aggregate principal amount of unsecured 3.900% Senior Notes due 2029 (“3.900% Senior Notes due 2029”) at a price to the public of 99.991% of their face value with U.S. Bank National Association (“U.S. Bank”) as trustee. Interest on the 3.900% Senior Notes due 2029 is payable on June 1 and December 1 of each year, which began on December 1, 2019, and is computed on the basis of a 360-day year.\n● After the close of business on November 29, 2019, we completed the acquisition of Mayasa, a specialty retailer of automotive aftermarket parts headquartered in Guadalajara, Jalisco, Mexico pursuant to a stock purchase agreement. At the time of the acquisition, Mayasa operated six distribution centers, 21 Orma Autopartes stores and served over 2,000 independent jobber locations in 28 Mexican states. The results of Mayasa’s operations have been included in the Company’s consolidated financial statements and results of operations beginning from the date of acquisition. Pro forma results of operations related to the acquisition of Mayasa are not presented as Mayasa’s results are not material to the Company’s results of operations.\nRESULTS OF OPERATIONS\nThe following table includes income statement data as a percentage of sales for the years ended December 31, 2019, 2018 and 2017\n(1) Each percentage of sales amount is computed independently and may not compute to presented totals.\n2019 Compared to 2018\nSales:\nSales for the year ended December 31, 2019, increased $614 million, or 6%, to $10.15 billion from $9.54 billion for the same period in 2018. Comparable store sales for stores open at least one year increased 4.0% and 3.8% for the years ended December 31, 2019 and 2018, respectively. U.S. domestic comparable store sales are calculated based on the change in sales for stores open at least one year and exclude sales of specialty machinery, sales to independent parts stores and sales to Team Members. Online sales, resulting from ship-to-home orders and pickup in-store orders, for stores open at least one year, are included in the comparable store sales calculation.\nThe following table presents the components of the increase in sales for the year ended December 31, 2019 (in millions):\nWe believe the increased sales achieved by our stores were the result of store growth, the high levels of customer service provided by our well-trained and technically proficient Team Members, superior inventory availability, including same day and over-night access to inventory in our regional distribution centers, enhanced services and programs offered in our stores, a broad selection of product offerings in most of our stores with a dynamic catalog system to identify and source parts, a targeted promotional and advertising effort through a variety of media and localized promotional events, continued improvement in the merchandising and store layouts of our stores, compensation programs for all store Team Members that provide incentives for performance and our continued focus on serving both DIY and professional service provider customers.\nOur comparable store sales increase for the year ended December 31, 2019, was driven by an increase in average ticket values for both DIY and professional service provider customers. Transaction counts were flat for the year ended December 31, 2019, comprised of positive transaction counts for professional service provider customers, offset by negative transaction counts for DIY customers. The improvement in average ticket values was the result of the increasing complexity and cost of replacement parts necessary to maintain the newer population of vehicles and increased selling prices on a same-SKU basis, as compared to one year ago. The increased complexity and replacement costs are a result of the current population of better-engineered and more technically advanced vehicles that require less frequent repairs, as the component parts are more durable and last for longer periods of time, which creates pressure on customer transaction counts. However, when repairs are needed, the cost of replacement parts is, on average, greater, which benefits average ticket values. The increase in selling prices on a same-SKU basis was driven by increases in acquisition costs of inventory, which were passed through in market prices. Transaction counts for the year ended December 31, 2019, as compared to the same period in 2018, were also negatively impacted by wetter, cooler than normal temperatures in many of our markets during the first half of 2019, which is a headwind to DIY business. DIY transaction counts continue to be impacted by the inflationary environment.\nWe opened 200 net, new U.S. stores during the year ended December 31, 2019, compared to opening 200 net, new U.S. stores during the year ended December 31, 2018. In addition, on January 1, 2019, we began operating 33 acquired Bennett stores, and during the year ended December 31, 2019, we merged 13 of these acquired Bennett stores into existing O’Reilly locations and rebranded the remaining 20 Bennett stores as O’Reilly stores. After the close of business on November 29, 2019, we acquired 21 stores from Mayasa. As of December 31, 2019, we operated 5,439 stores in 47 U.S. states and 21 stores in Mexico compared to 5,219 U.S. stores in 47 states at December 31, 2018. We anticipate U.S. new store growth will be approximately 180 net, new store openings in 2020.\nGross profit:\nGross profit for the year ended December 31, 2019, increased 7% to $5.39 billion (or 53.1% of sales) from $5.04 billion (or 52.8% of sales) for the same period in 2018. The increase in gross profit dollars for the year ended December 31, 2019, was primarily the result of sales from new stores and the increase in comparable store sales at existing stores. The increase in gross profit as a percentage of sales for the year ended December 31, 2019, was due to a benefit from selling through inventory purchased prior to recent industry-wide acquisition cost increases and corresponding selling price increases. Beginning in the last six months of 2018, inventory acquisition costs in our industry increased, as a result of tariffs on products imported from China and other increases in supplier input costs, which were passed through in higher retail and wholesale prices in our industry. We determine inventory cost using the last-in, first-out (“LIFO”) method, but have, over time, seen our LIFO reserve balance exhausted, as a result of cumulative historical acquisition cost decreases. Our policy is to not write up inventory in excess of replacement cost, and accordingly, we are effectively valuing our inventory at replacement cost.\nSelling, general and administrative expenses:\nSelling, general and administrative expenses (“SG&A”) for the year ended December 31, 2019, increased 8% to $3.47 billion (or 34.2% of sales) from $3.22 billion (or 33.8% of sales) for the same period in 2018. The increase in total SG&A dollars for the year ended December 31, 2019, was the result of Team Members, facilities and vehicles to support our increased sales and store count. The increase in SG&A as a percentage of sales for the year ended December 31, 2019, was principally due to wage pressure, driven by a low unemployment, inflationary environment, and other variable costs, including health benefit costs and cost of insurance, primarily auto related, and increased spending on Omnichannel and technology initiatives.\nOperating income:\nAs a result of the impacts discussed above, operating income for the year ended December 31, 2019, increased 6% to $1.92 billion (or 18.9% of sales) from $1.82 billion (or 19.0% of sales) for the same period in 2018.\nOther income and expense:\nTotal other expense for the year ended December 31, 2019, increased 8% to $130 million (or 1.3% of sales), from $121 million (or 1.3% of sales) for the same period in 2018. The increase in total other expense for the year ended December 31, 2019, was the result of increased interest expense on higher average outstanding borrowings, partially offset by an increase in the value of our trading securities.\nIncome taxes:\nOur provision for income taxes for the year ended December 31, 2019, increased 8% to $399 million (22.3% effective tax rate) from $370 million (21.8% effective tax rate) for the same period in 2018. The increase in our provision for income taxes for the year ended December 31, 2019, was the result of higher taxable income and lower excess tax benefits from share-based compensation. The increase in our effective tax rate for the year ended December 31, 2019, was the result of lower excess tax benefits from share-based compensation. During the years ended December 31, 2019 and 2018, excess tax benefits from share-based compensation were approximately $26 million and $35 million, respectively.\nNet income:\nAs a result of the impacts discussed above, net income for the year ended December 31, 2019, increased 5% to $1.39 billion (or 13.7% of sales), from $1.32 billion (or 13.9% of sales) for the same period in 2018.\nEarnings per share:\nOur diluted earnings per common share for the year ended December 31, 2019, increased 11% to $17.88 on 78 million shares from $16.10 on 82 million shares for the same period in 2018.\n2018 Compared to 2017\nSales:\nSales for the year ended December 31, 2018, increased $559 million, or 6%, to $9.54 billion from $8.98 billion for the same period in 2017. Comparable store sales for stores open at least one year increased 3.8% and 1.4% for the years ended December 31, 2018 and 2017, respectively. Comparable store sales are calculated based on the change in sales for stores open at least one year and exclude sales of specialty machinery, sales to independent parts stores and sales to Team Members. Online sales, resulting from ship-to-home orders and pickup in-store orders, for stores open at least one year, are included in the comparable store sales calculation.\nThe following table presents the components of the increase in sales for the year ended December 31, 2018 (in millions):\nWe believe the increased sales achieved by our stores were the result of store growth, the high levels of customer service provided by our well-trained and technically proficient Team Members, superior inventory availability, including same day and over-night access to inventory in our regional distribution centers, enhanced services and programs offered in our stores, a broad selection of product offerings with a dynamic catalog system to identify and source parts, a targeted promotional and advertising effort through a variety of media and localized promotional events, continued improvement in the merchandising and store layouts of our stores, compensation programs for all store Team Members that provide incentives for performance and our continued focus on serving both DIY and professional service provider customers.\nOur comparable store sales increase for the year ended December 31, 2018, was driven by an increase in average ticket values for both DIY and professional service provider customers and positive transaction counts for professional service provider customers, offset by negative transaction counts for DIY customers. The improvement in average ticket values was the result of the increasing complexity and cost of replacement parts necessary to maintain the current population of better-engineered and more technically advanced vehicles and same SKU inflation. These better-engineered, more technically advanced vehicles require less frequent repairs, as the component parts are more durable and last for longer periods of time. This decrease in repair frequency creates pressure on customer transaction counts; however, when repairs are needed, the cost of replacement parts is, on average, greater, which is a benefit to average ticket values. During the year ended December 31, 2018, DIY transaction counts also continued to be pressured by increased gas prices and other inflationary impacts, resulting in an increased deferral of vehicle maintenance and repairs over the short term.\nWe opened 200 net, new stores during the year ended December 31, 2018, compared to opening 190 net, new stores during the year ended December 31, 2017. As of December 31, 2018, we operated 5,219 stores in 47 states compared to 5,019 stores in 47 states at December 31, 2017. After the close of business on December 31, 2018, we acquired the 33 Bennett stores that were not included in our 2018 store count and were not operated by the Company in 2018.\nGross profit:\nGross profit for the year ended December 31, 2018, increased 7% to $5.04 billion (or 52.8% of sales) from $4.72 billion (or 52.6% of sales) for the same period in 2017. The increase in gross profit dollars for the year ended December 31, 2018, was primarily the result of sales from new stores and the increase in comparable store sales at existing stores. The increase in gross profit as a percentage of sales for the year ended December 31, 2018, was primarily due to a non-cash LIFO charge in 2017, partially offset by an increase in distribution expenses. The increase in distribution expenses was primarily due to wage pressure and increased transportation costs, as compared to 2017. During the year ended December 31, 2018, we did not realize net acquisition cost decreases, and as a result, we did not record a LIFO charge. During the year ended December 31, 2017, our LIFO costs were written down by approximately $22 million to reflect replacement cost.\nSelling, general and administrative expenses:\nSG&A for the year ended December 31, 2018, increased 8% to $3.22 billion (or 33.8% of sales) from $3.00 billion (or 33.4% of sales) for the same period in 2017. The increase in total SG&A dollars for the year ended December 31, 2018, was primarily the result of additional Team Members, facilities and vehicles to support our increased sales and store count, the planned allocation of a portion of the tax savings realized as a result of the U.S. Tax Cuts and Jobs Act, enacted in December 2017 (the “Tax Act”) and unfavorable comparison to a 2017 benefit of $9.1 million from the reduction in our legal accrual following the expiration of the statute of limitations related to a legacy claim. The increase in SG&A as a percentage of sales for the year ended December 31, 2018, was primarily due to our tax savings allocation initiatives and the 2017 legal accrual benefit.\nOperating income:\nAs a result of the impacts discussed above, operating income for the year ended December 31, 2018, increased 5% to $1.82 billion (or 19.0% of sales) from $1.73 billion (or 19.2% of sales) for the same period in 2017.\nOther income and expense:\nTotal other expense for the year ended December 31, 2018, increased 38% to $121 million (or 1.3% of sales), from $88 million (or 1.0% of sales) for the same period in 2017. The increase in total other expense for the year ended December 31, 2018, was primarily the result of increased interest expense on higher average outstanding borrowings.\nIncome taxes:\nOur provision for income taxes for the year ended December 31, 2018, decreased 27% to $370 million (21.8% effective tax rate) from $504 million (30.8% effective tax rate) for the same period in 2017. The decreases in our provision for income taxes and our effective tax rate for the year ended December 31, 2018, were primarily the result of the lower federal corporate tax rate set forth by the Tax Act, partially offset by a $53 million benefit in 2017 from the required revaluation of our deferred income tax liabilities based on the lower federal corporate tax rate set forth by the Tax Act and lower excess tax benefits from share-based compensation in 2018, as compared 2017. During the year ended December 31, 2018 and 2017, excess tax benefits from share-based compensation were approximately $35 million and $49 million, respectively.\nNet income:\nAs a result of the impacts discussed above, net income for the year ended December 31, 2018, increased 17% to $1.32 billion (or 13.9% of sales), from $1.13 billion (or 12.6% of sales) for the same period in 2017.\nEarnings per share:\nOur diluted earnings per common share for the year ended December 31, 2018, increased 27% to $16.10 on 82 million shares from $12.67 on 90 million shares for the same period in 2017. Due to the revaluation of our deferred income tax liabilities in 2017, our diluted earnings per common share for the year ended December 31, 2017, included a one-time benefit of $0.59.\nLIQUIDITY AND CAPITAL RESOURCES\nOur long-term business strategy requires capital to open new stores, fund strategic acquisitions, expand distribution infrastructure, operate and maintain our existing stores and may include the opportunistic repurchase of shares of our common stock through our Board-approved share repurchase program. The primary sources of our liquidity are funds generated from operations and borrowed under our unsecured revolving credit facility. Decreased demand for our products or changes in customer buying patterns could negatively impact our ability to generate funds from operations. Additionally, decreased demand or changes in buying patterns could impact our ability to meet the debt covenants of our credit agreement and, therefore, negatively impact the funds available under our unsecured revolving credit facility. We believe that cash expected to be provided by operating activities and availability under our unsecured revolving credit facility will be sufficient to fund both our short-term and long-term capital and liquidity needs for the foreseeable future. However, there can be no assurance that we will continue to generate cash flows at or above recent levels.\nLiquidity and related ratios:\nThe following table highlights our liquidity and related ratios as of December 31, 2019 and 2018 (dollars in millions):\n(1) Working capital is calculated as current assets less current liabilities.\n(2) Debt to equity is calculated as total debt divided by total equity.\nCurrent assets increased 8%, current liabilities increased 15%, total debt increased 14% and total equity increased 12% from 2018 to 2019. The increase in current assets was primarily due to the increase in inventory, resulting from our distribution expansion projects and the opening and acquiring of 241 net, new stores in 2019. The increase in current liabilities was primarily due to the adoption of\nASC 842 during 2019, resulting in the recognition of $316 million of current operating lease liabilities at December 31, 2019, and an increase in accounts payable, resulting from inventory growth related to distribution expansion projects and new store openings. Our accounts payable to inventory ratio was 104.4% as of December 31, 2019, as compared to 105.7% for the same period in 2018. The increase in total debt was attributable to the issuance of $500 million of 3.900% Senior Notes due 2029 and borrowings of $261 million on our revolving credit facility at December 31, 2019. The increase in total equity was due to a decrease in retained deficit, resulting from net income for the year ended December 31, 2019, and increased additional paid-in-capital, which was due to employee stock option exercises, partially offset by the impact of share repurchase activity, under our share repurchase program, on retained deficit and additional paid-in capital.\nThe following table identifies cash provided by/(used in) our operating, investing and financing activities for the years ended December 31, 2019, 2018 and 2017 (in thousands):\n(1) Calculated as net cash provided by operating activities, less capital expenditures, excess tax benefit from share-based compensation payments, and investment in tax credit equity investments for the period.\nCash and cash equivalents balances held outside of the U.S. were $5.7 million as of December 31, 2019, which was generally utilized to support the liquidity needs of foreign operations in Mexico, and no cash or cash equivalents were held outside of the U.S. as of December 31, 2018 and 2017.\nOperating activities:\nThe decrease in net cash provided by operating activities in 2019 compared to 2018 was primarily due to a decrease in income taxes payable, a larger increase in net inventory investment and an increase in accounts receivable, primarily offset by increased operating income. The decrease from income taxes payable in 2019, compared to the increase in income taxes payable in 2018, was primarily the result of a prepaid income taxes position at the end of 2019, versus an income taxes payable position at the end of 2018. The increase in net inventory investment was the result of a larger increase in inventory in 2019, compared to 2018, primarily driven by our distribution expansion projects. The increase in accounts receivable during 2019, as compared to the decrease in 2018, was primarily due to the respective year-over-year business day timing of year-end.\nThe increase in net cash provided by operating activities in 2018 compared to 2017 was primarily due to increased operating income, reduced cash taxes paid, due to the Tax Act, and a reduction of accounts receivable, due to the business day timing of year-end 2018, as compared to 2017.\nInvesting activities:\nThe increase in net cash used in investing activities in 2019 compared to 2018 was primarily the result of an increase in capital expenditures, investments in tax credit equity investments and an increase in other investing activities. Total capital expenditures were $628 million in 2019 versus $504 million in 2018, and the increase was primarily related to distribution expansion projects, the timing of property acquisitions and construction costs for new stores and technology investments during 2019, as compared to 2018. Investments in tax credit equity investments were the result of entering into tax credit equity investments for the purpose of receiving renewable energy tax credits. The increase in other investing activities was due to the acquisition of Mayasa in 2019.\nThe increase in net cash used in investing activities in 2018 compared to 2017 was primarily the result of an increase in capital expenditures in 2018 and an increase in other investing activities. Total capital expenditures were $504 million and $466 million in 2018 and 2017, respectively, and the increase was primarily related to the timing of property acquisitions, closings, construction costs for new stores and the mix of owned versus leased stores opened during 2018, as compared to 2017. The increase in other investing activities was primarily due to more acquisition related expenditures in 2018, as compared to 2017.\nWe opened 200, 200, and 190 net, new domestic stores in 2019, 2018 and 2017, respectively. In addition, on January 1, 2019, we began operating 33 acquired Bennett stores, and during the year ended December 31, 2019, we merged 13 of these acquired Bennett stores into existing O’Reilly locations and rebranded the remaining 20 Bennett stores as O’Reilly stores. After the close of business on November 29, 2019, we acquired 21 stores from Mayasa. We plan to open approximately 180 net, new domestic stores in 2020. The current costs associated with the opening of a new store, including the cost of land acquisition, building improvements, fixtures, vehicles, net inventory investment and computer equipment, are estimated to average approximately $1.5 million to $1.8 million; however, such costs may be significantly reduced where we lease, rather than purchase, the store site.\nFinancing activities:\nThe decrease in net cash used in financing activities in 2019 compared to 2018 was primarily attributable to a lower level of repurchases of our common stock in 2019, compared to 2018, and a higher level of net borrowings during 2019, as compared to 2018.\nThe increase in net cash used in financing activities in 2018 compared to 2017 was primarily attributable to a lower level of net borrowings during 2018, as compared to 2017, partially offset by a lower level of repurchases of our common stock in 2018, as compared to 2017.\nUnsecured revolving credit facility:\nOn April 5, 2017, the Company entered into a credit agreement (the “Credit Agreement”). The Credit Agreement provides for a five-year $1.20 billion unsecured revolving credit facility (the “Revolving Credit Facility”) arranged by JPMorgan Chase Bank, N.A., which is scheduled to mature in April 2022. The Credit Agreement includes a $200 million sub-limit for the issuance of letters of credit and a $75 million sub-limit for swing line borrowings. As described in the Credit Agreement governing the Revolving Credit Facility, the Company may, from time to time, subject to certain conditions, increase the aggregate commitments under the Revolving Credit Facility by up to $600 million, provided that the aggregate amount of the commitments does not exceed $1.80 billion at any time.\nAs of December 31, 2019 and 2018, we had outstanding letters of credit, primarily to support obligations related to workers’ compensation, general liability and other insurance policies, in the amounts of $39 million and $35 million, respectively, reducing the aggregate availability under the Credit Agreement by those amounts. As of December 31, 2019 and 2018, we had outstanding borrowings under the Revolving Credit Facility in the amounts of $261 million and $287 million, respectively.\nSenior Notes:\nOn May 20, 2019, we issued $500 million aggregate principal amount of unsecured 3.900% Senior Notes due 2029 (“3.900% Senior Notes due 2029”) at a price to the public of 99.991% of their face value with U.S. Bank National Association (“U.S. Bank”) as trustee. Interest on the 3.900% Senior Notes due 2029 is payable on June 1 and December 1 of each year, which began on December 1, 2019, and is computed on the basis of a 360-day year.\nWe have issued a cumulative $3.65 billion aggregate principal amount of unsecured senior notes, which are due between 2021 and 2029, with UMB Bank, N.A. and U.S. Bank as trustees. Interest on the senior notes, ranging from 3.550% to 4.875%, is payable semi-annually and is computed on the basis of a 360-day year. None of our subsidiaries is a guarantor under our senior notes.\nDebt covenants:\nThe indentures governing our senior notes contain covenants that limit our ability and the ability of certain of our subsidiaries to, among other things, create certain liens on assets to secure certain debt and enter into certain sale and leaseback transactions, and limit our ability to merge or consolidate with another company or transfer all or substantially all of our property, in each case as set forth in the indentures. These covenants are, however, subject to a number of important limitations and exceptions. As of December 31, 2019, we were in compliance with the covenants applicable to our senior notes.\nThe Credit Agreement contains certain covenants, including limitations on indebtedness, a minimum consolidated fixed charge coverage ratio of 2.50:1.00 and a maximum consolidated leverage ratio of 3.50:1.00. The consolidated fixed charge coverage ratio includes a calculation of earnings before interest, taxes, depreciation, amortization, rent and non-cash share-based compensation expense to fixed charges. Fixed charges include interest expense, capitalized interest and rent expense. The consolidated leverage ratio includes a calculation of adjusted debt to earnings before interest, taxes, depreciation, amortization, rent and non-cash share-based compensation expense. Adjusted debt includes outstanding debt, outstanding stand-by letters of credit and similar instruments, five-times rent expense and excludes any premium or discount recorded in conjunction with the issuance of long-term debt. In the event that we should default on any covenant contained within the Credit Agreement, certain actions may be taken, including, but not limited to, possible termination of commitments, immediate payment of outstanding principal amounts plus accrued interest and other amounts payable under the Credit Agreement and litigation from our lenders.\nWe had a consolidated fixed charge coverage ratio of 5.21 times and 5.38 times as of December 31, 2019 and 2018, respectively, and a consolidated leverage ratio of 2.20 times and 2.10 times as of December 31, 2019 and 2018, respectively, remaining in compliance with all covenants related to the borrowing arrangements.\nThe table below outlines the calculations of the consolidated fixed charge coverage ratio and consolidated leverage ratio covenants, as defined in the Credit Agreement governing the Revolving Credit Facility, for the years ended December 31, 2019 and 2018 (dollars in thousands):\n(1)\nThe table below outlines the calculation of Rent expense and reconciles Rent expense to Total lease cost, per Accounting Standard Codification 842 (“ASC 842”), adopted and effective January 1, 2019, the most directly comparable GAAP financial measure, for the twelve months ended December 31, 2019 (in thousands):\nThe table below outlines the calculation of Free cash flow and reconciles Free cash flow to Net cash provided by operating activities, the most directly comparable GAAP financial measure, for the years ended December 31, 2019, 2018 and 2017 (in thousands):\nFree cash flow, the consolidated fixed charge coverage ratio and the consolidated leverage ratio discussed and presented in the tables above are not derived in accordance with United States generally accepted accounting principles (“GAAP”). We do not, nor do we suggest investors should, consider such non-GAAP financial measures in isolation from, or as a substitute for, GAAP financial information. We believe that the presentation of our free cash flow, consolidated fixed charge coverage ratio and consolidated leverage ratio provides meaningful supplemental information to both management and investors and reflects the required covenants under the Credit Agreement. We include these items in judging our performance and believe this non-GAAP information is useful to investors as well. Material limitations of these non-GAAP measures are that such measures do not reflect actual GAAP amounts. We compensate for such limitations by presenting, in the tables above, a reconciliation to the most directly comparable GAAP measures.\nShare repurchase program:\nIn January of 2011, our Board of Directors approved a share repurchase program. Under the program, we may, from time to time, repurchase shares of our common stock, solely through open market purchases effected through a broker dealer at prevailing market prices, based on a variety of factors such as price, corporate trading policy requirements and overall market conditions. Our Board of Directors may increase or otherwise modify, renew, suspend or terminate the share repurchase program at any time, without prior notice. As announced on May 31, 2019, and February 5, 2020, our Board of Directors each time approved a resolution to increase the authorization amount under our share repurchase program by an additional $1.00 billion, resulting in a cumulative authorization amount of $13.75 billion. Each additional authorization is effective for a three-year period, beginning on its respective announcement date.\nThe following table identifies shares of our common stock that have been repurchased as part of our publicly announced share repurchase program for the year ended December 31, 2019 and 2018 (in thousands, except per share data):\nAs of December 31, 2019, we had $569 million remaining under our share repurchase program. Subsequent to the end of the year and through February 28, 2020, we repurchased an additional 0.9 million shares of our common stock under our share repurchase program, at an average price of $400.78, for a total investment of $363 million. We have repurchased a total of 77.1 million shares of our common stock under our share repurchase program since the inception of the program in January of 2011 and through February 28, 2020, at an average price of $162.72 for a total aggregate investment of $12.54 billion. As of February 28, 2020, we had approximately $1.21 billion remaining under our share repurchase program.\nCONTRACTUAL OBLIGATIONS\nOur contractual obligations as of December 31, 2019, included commitments for short and long-term debt arrangements, interest payments related to long-term debt, future payments under non-cancelable lease arrangements, self-insurance reserves, purchase obligations for construction contract commitments and other long-term liabilities, which are identified in the table below and are fully disclosed in Note 5 “Leases,” Note 11 “Share-Based Compensation and Benefit Plans” and Note 13 “Commitments” to the Consolidated Financial Statements. We expect to fund these commitments primarily with operating cash flows expected to be generated in the normal course of business or through borrowings under our Revolving Credit Facility.\nDeferred income taxes, as well as commitments with various suppliers for the purchase of inventory, are not reflected in the table below due to the absence of scheduled maturities, the nature of the account or the commitment’s cancellation terms. Due to the absence of scheduled maturities, the timing of certain of these payments cannot be determined, except for amounts estimated to be payable in 2020, which are included in “Current liabilities” on our Consolidated Balance Sheets.\nWe record a reserve for potential liabilities related to uncertain tax positions, including estimated interest and penalties, which are fully disclosed in Note 15 “Income Taxes” to the Consolidated Financial Statements. These estimates are not included in the table below because the timing related to the ultimate resolution or settlement of these positions cannot be determined. As of December 31, 2019, we recorded a net liability of $36.6 million related to these uncertain tax positions on our Consolidated Balance Sheets, all of which was included in “Other liabilities.”\nWe record a reserve for the projected obligation related to future payments under the Company’s nonqualified deferred compensation plan, which is fully disclosed in Note 11 “Share-Based Compensation and Benefit Plans” to the Consolidated Financial Statements. This estimate is not included in the table below because the timing related to the ultimate payment cannot be determined. As of\nDecember 31, 2019, we recorded a liability of $32 million related to this uncertain liability on our Consolidated Balance Sheets, all of which was included in “Other liabilities.”\nThe following table identifies the estimated payments of the Company’s contractual obligations as of December 31, 2019 (in thousands):\n(1) Our Revolving Credit Facility, which has a maximum aggregate commitment of $1.20 billion and matures in April 2022, bears interest (other than swing line loans), at our option, at either the Alternate Base Rate or Adjusted LIBO Rate (both as defined in the Credit Agreement) plus a margin, that will vary from 0.000% to 0.250% in the case of loans bearing interest at the Alternate Base Rate and 0.680% to 1.250% in the case of loans bearing interest at the Adjusted LIBO Rate, in each case based upon the better of the ratings assigned to our debt by Moody’s Investor Service, Inc. and Standard & Poor’s Rating Services, subject to limited exceptions. Swing line loans made under the Revolving Credit Facility bear interest at the Alternate Base Rate plus the applicable margin described above. In addition, we pay a facility fee on the aggregate amount of the commitments in an amount equal to a percentage of such commitments, varying from 0.070% to 0.250% per annum based upon the better of the ratings assigned to our debt by Moody’s Investor Service, Inc. and Standard & Poor’s Rating Services, subject to limited exceptions. Based on our current credit ratings, our margin for Alternate Base Rate loans was 0.000%, our margin for Eurodollar Revolving Loans was 0.900% and our facility fee was 0.100%. As of December 31, 2019, we had outstanding borrowings in the amount of $261 million under our Revolving Credit Facility.\n(2) The minimum lease payments above do not include potential amounts for percentage rent and other variable operating lease related costs, which are also required contractual obligations under our operating leases but are generally not fixed and can fluctuate from year to year. See Note 5 “Leases” to the Consolidated Financial Statements for further information on our operating leases.\n(3) We use various self-insurance mechanisms to provide for potential liabilities from workers’ compensation, vehicle and general liability, and employee health care benefits. The self-insurance reserves above are at the undiscounted obligation amount. The self-insurance reserves liabilities are recorded on our Consolidated Balance Sheets at our estimate of their net present value and do not have scheduled maturities; however, we can estimate the timing of future payments based upon historical patterns. See Note 13 “Commitments” to the Consolidated Financial Statements for further information on our self-insurance reserves.\n(4) We have entered into an agreement to make capital contributions to certain tax credit equity investments for the purpose of receiving renewable energy tax credits. We are required to make capital contributions upon achievement of project milestones by the solar energy farms, the timing of which is variable and outside of the Company’s control. See Note 13 “Commitments” to the Consolidated Financial Statements for further information on our capital contribution obligations.\nOFF-BALANCE SHEET ARRANGEMENTS\nOff-balance sheet arrangements are transactions, agreements, or other contractual arrangements with an unconsolidated entity, for which we have an obligation to the entity that is not recorded in our consolidated financial statements. We historically utilized various off-balance sheet financial instruments, including sale-leaseback and synthetic lease transactions, but we have not entered into any such transactions for over 10 years and do not plan to utilize off-balance sheet arrangements in the future to fund our working capital requirements, operations or growth plans.\nWe issue stand-by letters of credit provided by a $200 million sub-limit under the Revolving Credit Facility that reduce our available borrowings under the Revolving Credit Facility. Those letters of credit are issued primarily to satisfy the requirements of workers’ compensation, general liability and other insurance policies. Substantially all of the outstanding letters of credit have a one-year term from the date of issuance. Letters of credit totaling $39 million and $35 million were outstanding at December 31, 2019 and 2018, respectively.\nWe have entered into an agreement to make capital contributions to certain tax credit equity investments for the purpose of receiving renewable energy tax credits. We are required to make capital contributions totaling $95 million upon achievement of project milestones by the solar energy farms, the timing of which is variable and outside of the Company’s control.\nWe do not have any off-balance sheet financing that has, or is reasonably likely to have, a material, current or future effect on our financial condition, cash flows, results of operations, liquidity, capital expenditures or capital resources.\nCRITICAL ACCOUNTING POLICIES AND ESTIMATES\nThe preparation of our financial statements in accordance with GAAP requires the application of certain estimates and judgments by management. Management bases its assumptions, estimates, and adjustments on historical experience, current trends and other factors believed to be relevant at the time the consolidated financial statements are prepared. Management believes that the following policies are critical due to the inherent uncertainty of these matters and the complex and subjective judgments required in establishing these estimates. Management continues to review these critical accounting policies and estimates to ensure that the consolidated financial statements are presented fairly in accordance with GAAP. However, actual results could differ from our assumptions and estimates and such differences could be material.\nInventory Obsolescence and Shrink:\nInventory, which consists of automotive hard parts, maintenance items, accessories and tools, is stated at the lower of cost or market. The extended nature of the life cycle of our products is such that the risk of obsolescence of our inventory is minimal. The products that we sell generally have applications in our markets for a long period of time in conjunction with the corresponding vehicle population. We have developed sophisticated systems for monitoring the life cycle of a given product and, accordingly, have historically been very successful in adjusting the volume of our inventory in conjunction with a decrease in demand. We do record a reserve to reduce the carrying value of our inventory through a charge to cost of sales in the isolated instances where we believe that the market value of products is lower than our recorded cost. This reserve is based on our assumptions about the marketability of our existing inventory and is subject to uncertainty to the extent that we must estimate, at a given point in time, the market value of inventory that will be sold in future periods. Ultimately, our projections could differ from actual results and could result in a material impact to our stated inventory balances. We have historically not had to materially adjust our obsolescence reserves due to the factors discussed above and do not anticipate that we will experience material changes in our estimates in the future.\nWe also record a reserve to reduce the carrying value of our perpetual inventory to account for quantities in our perpetual records above the actual existing quantities on hand caused by unrecorded shrink. We estimate this reserve based on the results of our extensive and frequent cycle counting programs and periodic, full physical inventories. To the extent that our estimates do not accurately reflect the actual unrecorded inventory shrinkage, we could potentially experience a material impact to our inventory balances. We have historically been able to provide a timely and accurate measurement of shrink and have not experienced material adjustments to our estimates. If the shrink reserve changed 10% from the estimate that we recorded based on our historical experience at December 31, 2019, the financial impact would have been approximately less than $1 million or less than 0.1% of pretax income for the year ended December 31, 2019.\nValuation of Long-Lived Assets and Goodwill:\nWe evaluate the carrying value of long-lived assets for impairment whenever events or changes in circumstances indicate the carrying value of these assets might exceed their current fair values. As part of the evaluation, we review performance at the store level to identify any stores with current period operating losses that should be considered for impairment. A potential impairment has occurred if the projected future undiscounted cash flows realized from the best possible use of the asset are less than the carrying value of the asset. The estimate of cash flows includes management’s assumptions of cash inflows and outflows directly resulting from the use of that asset in operations. If the carrying amount of an asset exceeds its estimated future cash flows, an impairment charge is recognized for the amount by which the carrying amount of the asset exceeds the fair value of the assets. Our impairment analyses contain estimates due to the inherently judgmental nature of forecasting long-term estimated cash flows and determining the ultimate useful lives and fair values of the assets. Actual results could differ from these estimates, which could materially impact our impairment assessment.\nWe review goodwill for impairment annually during the fourth quarter, or when events or changes in circumstances indicate the carrying value of these assets might exceed their current fair values. We have never recorded an impairment to goodwill. The process of evaluating goodwill for impairment involves a detailed qualitative assessment to be performed first and then, based on the conclusion of the totality of events and circumstances, a quantitative assessment may be performed, which involves the determination of the fair value of our Company using the market approach. When a quantitative assessment is performed, inherent in such fair value determinations are certain judgments and estimates, including estimates that incorporate assumptions marketplace participants would use in making their estimates of fair value. In the future, if events or market conditions affect the estimated fair value to the extent that an asset is impaired, we will adjust the carrying value of these assets in the period in which the impairment occurs. Based on our qualitative assessment, we do not believe there has been any change of events or circumstances that would indicate that a reevaluation of goodwill is required as of December 31, 2019, nor do we believe goodwill would be at risk of failing impairment testing.\nSupplier Concessions:\nWe receive concessions from our suppliers through a variety of programs and arrangements, including co-operative advertising, allowances for warranties, merchandise allowances and volume purchase rebates. Co-operative advertising allowances that are\nincremental to our advertising program, specific to a product or event and identifiable for accounting purposes are reported as a reduction of advertising expense in the period in which the advertising occurred. All other material supplier concessions are recognized as a reduction to the cost of sales. Amounts receivable from suppliers also include amounts due to us relating to supplier purchases and product returns. Management regularly reviews amounts receivable from suppliers and assesses the need for a reserve for uncollectible amounts based on our evaluation of our suppliers’ financial position and corresponding ability to meet their financial obligations. Based on our historical results and current assessment, we have not recorded a reserve for uncollectible amounts in our consolidated financial statements, and we do not believe there is a reasonable likelihood that our ability to collect these amounts will differ from our expectations. The eventual ability of our suppliers to pay us the obliged amounts could differ from our assumptions and estimates, and we may be exposed to losses or gains that could be material.\nWarranty Reserves:\nWe offer warranties on certain merchandise we sell with warranty periods ranging from 30 days to limited lifetime warranties. The risk of loss arising from warranty claims is typically the obligation of our suppliers. Certain suppliers provide upfront allowances to us in lieu of accepting the obligation for warranty claims. For this merchandise, when sold, we bear the risk of loss associated with the cost of warranty claims. Differences between supplier allowances received in lieu of warranty obligations and estimated warranty expense are recorded as an adjustment to the cost of sales. Estimated warranty costs, which are recorded as obligations at the time of sale, are based on the historical failure rate of each individual product line. Our historical experience has been that failure rates are relatively consistent over time and that the ultimate cost of warranty claims has been driven by volume of units sold as opposed to fluctuations in failure rates or the variation of the cost of individual claims. If warranty reserves were changed 10% from our estimated reserves at December 31, 2019, the financial impact would have been approximately $6 million or 0.3% of pretax income for the year ended December 31, 2019.\nSelf-Insurance Reserves:\nWe use a combination of insurance and self-insurance mechanisms to provide for potential liabilities from workers’ compensation, general liability, vehicle liability, property loss, and Team Member health care benefits. With the exception of certain Team Member health care benefit liabilities, employment related claims and litigation, certain commercial litigation and certain regulatory matters, we obtain third-party insurance coverage to limit our exposure for any individual workers’ compensation, general liability, vehicle liability or property loss claim. When estimating our self-insurance liabilities, we consider a number of factors, including historical claims experience and trend-lines, projected medical and legal inflation, growth patterns and exposure forecasts. The assumptions made by management as they relate to each of these factors represent our judgment as to the most probable cumulative impact of each factor to our future obligations. Our calculation of self-insurance liabilities requires management to apply judgment to estimate the ultimate cost to settle reported claims and claims incurred but not yet reported as of the balance sheet date, and the application of alternative assumptions could result in a different estimate of these liabilities. Actual claim activity or development may vary from our assumptions and estimates, which may result in material losses or gains. As we obtain additional information that affects the assumptions and estimates we used to recognize liabilities for claims incurred in prior accounting periods, we adjust our self-insurance liabilities to reflect the revised estimates based on this additional information. These liabilities are recorded at our estimate of their net present value, using a credit-adjusted discount rate. These liabilities do not have scheduled maturities, but we can estimate the timing of future payments based upon historical patterns. We could apply alternative assumptions regarding the timing of payments or the applicable discount rate that could result in materially different estimates of the net present value of the liabilities. If self-insurance reserves were changed 10% from our estimated reserves at December 31, 2019, the financial impact would have been approximately $16 million or 0.9% of pretax income for the year ended December 31, 2019.\nLegal Reserves:\nWe maintain reserves for expenses associated with litigation, for which O’Reilly is currently involved. We are currently involved in litigation incidental to the ordinary conduct of our business. Management, with the assistance of outside legal counsel, must make estimates of potential legal obligations and possible liabilities arising from such litigation and records reserves for these expenditures. If legal reserves were changed 10% from our estimated reserves at December 31, 2019, the financial impact would have been approximately $1 million or less than 0.1% of pretax income for the year ended December 31, 2019.\nTaxes:\nWe operate within multiple taxing jurisdictions and are subject to audit in these jurisdictions. These audits can involve complex issues, which may require an extended period of time to resolve. We regularly review our potential tax liabilities for tax years subject to audit. The amount of such liabilities is based on various factors, such as differing interpretations of tax regulations by the responsible tax authority, experience with previous tax audits and applicable tax law rulings. Changes in our tax liability may occur in the future as our assessments change based on the progress of tax examinations in various jurisdictions and/or changes in tax regulations. In management’s opinion, adequate provisions for income taxes have been made for all years presented. The estimates of our potential tax liabilities contain uncertainties because management must use judgment to estimate the exposures associated with our various tax\npositions and actual results could differ from our estimates. Alternatively, we could have applied assumptions regarding the eventual outcome of the resolution of open tax positions that could differ from our current estimates but would still be reasonable given the nature of a particular position. While our estimates are subject to the uncertainty noted in the preceding discussion, our initial estimates of our potential tax liabilities have historically not been materially different from actual results, except in instances where we have reversed liabilities that were recorded for periods that were subsequently closed with the applicable taxing authority.\nINFLATION AND SEASONALITY\nWe have generally been successful in reducing the effects of merchandise cost increases principally by taking advantage of supplier incentive programs, economies of scale resulting from increased volume of purchases and selective forward buying. To the extent our acquisition cost increased due to price increases industry-wide, we have typically been able to pass along these increased costs through higher retail prices for the affected products. As a result, we do not believe inflation has had a material adverse effect on our operations.\nTo some extent, our business is seasonal primarily as a result of the impact of weather conditions on customer buying patterns. While we have historically realized operating profits in each quarter of the year, our store sales and profits have historically been higher in the second and third quarters (April through September) than in the first and fourth quarters (October through March) of the year.\nQUARTERLY RESULTS\nThe following tables set forth certain quarterly unaudited operating data for fiscal years ended December 31, 2019 and 2018. The unaudited quarterly information includes all adjustments, which management considers necessary for a fair presentation of the information shown (in thousands, except per share and comparable store sales data):\n(1) Earnings per share amounts are computed independently for each quarter and annual period. The quarterly earnings per share amounts may not sum to equal the full-year earnings per share amount.\nThe unaudited operating data presented above should be read in conjunction with our consolidated financial statements and related notes included elsewhere in this annual report, and the other financial information included therein.\nRECENT ACCOUNTING PRONOUNCEMENTS\nSee Note 1 “Summary of Significant Accounting Policies” to the Consolidated Financial Statements for information about recent accounting pronouncements.",
    "item_7A": "Item 7A. Quantitative and Qualitative Disclosures about Market Risk\nInterest rate risk:\nWe are subject to interest rate risk to the extent we borrow against our unsecured revolving credit facility (the “Revolving Credit Facility”) with variable interest rates based on either an Alternative Base Rate or Adjusted LIBO Rate, as defined in the credit agreement governing the Revolving Credit Facility. As of December 31, 2019, we had outstanding borrowings under our Revolving Credit Facility in the amount of $261 million, at the weighted-average variable interest rate of 3.318%. At this borrowing level, a 0.25% increase in interest rates would have had an unfavorable annual impact on our pre-tax earnings and cash flows in the amount of $0.7 million.\nWe had outstanding fixed rate debt of $3.65 billion and $3.15 billion as of December 31, 2019 and 2018, respectively. The fair value of our fixed rate debt was estimated at $3.88 billion and $3.12 billion as of December 31, 2019 and 2018, respectively, which was determined by reference to quoted market prices.\nCash equivalents risk:\nWe invest certain of our excess cash balances in short-term, highly-liquid instruments with maturities of 90 days or less. We do not expect any material losses from our invested cash balances and we believe that our interest rate exposure is minimal. As of December 31, 2019, our cash and cash equivalents totaled $40 million.\nForeign currency risk:\nForeign currency exposures arising from transactions include firm commitments and anticipated transactions denominated in a currency other than our entities’ functional currencies. To minimize our risk, we generally enter into transactions denominated in the respective functional currencies. Our foreign currency exposure arises from Mexican peso-denominated revenues and profits and their translation into U.S. dollars.\nWe view our investments in Mexican subsidiaries as long-term. The net asset exposure in the Mexican subsidiaries translated into U.S. dollars using the year-end exchange rates was $151.9 million at December 31, 2019. The year-end exchange rates of the Mexican peso with respect to the U.S. dollar increased by approximately 3% from the acquisition date of November 29, 2019. The potential loss in value of our net assets in the Mexican subsidiaries resulting from a 10% change in quoted foreign currency exchange rates at December 31, 2019, would be approximately $13.8 million. Any changes in our net assets in the Mexican subsidiaries relating to foreign currency exchange rates would be reflected in the financial statement through the foreign currency translation component of accumulated other comprehensive income, unless the Mexican subsidiaries are sold or otherwise disposed.\nA 10% change in average exchange rates would not have had a material impact on our results of operations.",
    "item_8": "Item 8. Financial Statements and Supplementary Data\nIndex\nMANAGEMENT’S REPORT ON INTERNAL CONTROL OVER FINANCIAL REPORTING\nThe management of O’Reilly Automotive, Inc. and Subsidiaries (the “Company”), under the supervision and with the participation of the Company’s principal executive officer and principal financial officer and effected by the Company’s Board of Directors, is responsible for establishing and maintaining adequate internal control over financial reporting as defined in Rule 13(a)-15(f) or 15(d)-15(f) under the Securities Exchange Act of 1934, as amended. The Company’s internal control system is designed to provide reasonable assurance regarding the reliability of financial reporting and the preparation of financial statements for external purposes in accordance with accounting principles generally accepted in the United States.\nInternal control over financial reporting includes all policies and procedures that\n● pertain to the maintenance of records that, in reasonable detail, accurately and fairly reflect the transactions and dispositions of the assets of the Company;\n● provide reasonable assurance that transactions are recorded as necessary to permit preparation of financial statements in accordance with accounting principles generally accepted in the United States of America, and that receipts and expenditures of the Company are being made only in accordance with authorizations of management and directors of the Company; and\n● provide reasonable assurance regarding prevention or timely detection of unauthorized acquisition, use or disposition of the Company’s assets that could have a material effect on the financial statements.\nManagement recognizes that all internal control systems, no matter how well designed, have inherent limitations. Therefore, even those systems determined to be effective can provide only reasonable assurance with respect to financial statement preparation and presentation. Also, projections of any evaluation of effectiveness to future periods are subject to risk. Over time, controls may become inadequate because of changes in conditions or deterioration in the degree of compliance with policies or procedures.\nUnder the supervision and with the participation of the Company’s principal executive officer and principal financial officer, management assessed the effectiveness of the Company’s internal control over financial reporting as of December 31, 2019. In making this assessment, management used the criteria set forth by the Committee of Sponsoring Organizations of the Treadway Commission (“COSO”) in Internal Control - Integrated Framework (2013 framework). Based on this assessment, management believes that as of December 31, 2019, the Company’s internal control over financial reporting is effective based on those criteria.\nAs permitted by guidance issued by the Securities and Exchange Commission, management excluded from its assessment of its system of internal control over financial reporting the operations associated with the acquisition of Mayoreo de Autopartes y Aceites, S.A. de C.V. (“Mayasa”), pursuant to a stock purchase agreement, which was completed after the close of business on November 29, 2019. The acquired operations were included in the consolidated financial statements of the Company, which constituted 2% of total assets as of December 31, 2019, and less than 1% of revenues and less than 1% of net income for the year ended December 31, 2019.\nErnst & Young LLP, Independent Registered Public Accounting Firm, has audited the Company’s consolidated financial statements and has issued an attestation report on the effectiveness of the Company’s internal control over financial reporting, as stated in their report, which is included herein.\nREPORT OF INDEPENDENT REGISTERED PUBLIC ACCOUNTING FIRM\nTo the Shareholders and the Board of Directors of O’Reilly Automotive, Inc. and Subsidiaries\nOpinion on Internal Control Over Financial Reporting\nWe have audited O’Reilly Automotive, Inc. and Subsidiaries’ internal control over financial reporting as of December 31, 2019, based on criteria established in Internal Control-Integrated Framework issued by the Committee of Sponsoring Organizations of the Treadway Commission (2013 framework) (the COSO criteria). In our opinion, O’Reilly Automotive, Inc. and Subsidiaries (the Company) maintained, in all material respects, effective internal control over financial reporting as of December 31, 2019, based on the COSO criteria.\nAs indicated in the accompanying Management’s Report on Internal Control over Financial Reporting, management’s assessment of and conclusion on the effectiveness of internal control over financial reporting did not include the internal controls of Mayoreo de Autopartes y Aceites, S.A. de C.V. (Mayasa), which is included in the 2019 consolidated financial statements of the Company and constituted 2% of total assets as of December 31, 2019 and less than 1% of revenues and less than 1% of net income for the year ended December 31, 2019. Our audit of internal control over financial reporting of the Company also did not include an evaluation of the internal control over financial reporting of Mayasa.\nWe also have audited, in accordance with the standards of the Public Company Accounting Oversight Board (United States) (PCAOB), the consolidated balance sheets of the Company as of December 31, 2019 and 2018, the related consolidated statements of income, comprehensive income, shareholders’ equity and cash flows for each of the three years in the period ended December 31, 2019, and the related notes and financial statement schedule listed in the Index at Item 15(a) and our report dated February 28, 2020 expressed an unqualified opinion thereon.\nBasis for Opinion\nThe Company’s management is responsible for maintaining effective internal control over financial reporting and for its assessment of the effectiveness of internal control over financial reporting included in the accompanying Management’s Report on Internal Control over Financial Reporting. Our responsibility is to express an opinion on the Company’s internal control over financial reporting based on our audit. We are a public accounting firm registered with the PCAOB and are required to be independent with respect to the Company in accordance with the U.S. federal securities laws and the applicable rules and regulations of the Securities and Exchange Commission and the PCAOB.\nWe conducted our audit in accordance with the standards of the PCAOB. Those standards require that we plan and perform the audit to obtain reasonable assurance about whether effective internal control over financial reporting was maintained in all material respects.\nOur audit included obtaining an understanding of internal control over financial reporting, assessing the risk that a material weakness exists, testing and evaluating the design and operating effectiveness of internal control based on the assessed risk, and performing such other procedures as we considered necessary in the circumstances. We believe that our audit provides a reasonable basis for our opinion.\nDefinition and Limitations of Internal Control Over Financial Reporting\nA company’s internal control over financial reporting is a process designed to provide reasonable assurance regarding the reliability of financial reporting and the preparation of financial statements for external purposes in accordance with generally accepted accounting principles. A company’s internal control over financial reporting includes those policies and procedures that (1) pertain to the maintenance of records that, in reasonable detail, accurately and fairly reflect the transactions and dispositions of the assets of the company; (2) provide reasonable assurance that transactions are recorded as necessary to permit preparation of financial statements in accordance with generally accepted accounting principles, and that receipts and expenditures of the company are being made only in accordance with authorizations of management and directors of the company; and (3) provide reasonable assurance regarding prevention or timely detection of unauthorized acquisition, use, or disposition of the company’s assets that could have a material effect on the financial statements.\nBecause of its inherent limitations, internal control over financial reporting may not prevent or detect misstatements. Also, projections of any evaluation of effectiveness to future periods are subject to the risk that controls may become inadequate because of changes in conditions, or that the degree of compliance with the policies or procedures may deteriorate.\n/s/ Ernst & Young LLP\nKansas City, Missouri\nFebruary 28, 2020\nREPORT OF INDEPENDENT REGISTERED PUBLIC ACCOUNTING FIRM\nTo the Shareholders and the Board of Directors of O’Reilly Automotive, Inc. and Subsidiaries\nOpinion on the Financial Statements\nWe have audited the accompanying consolidated balance sheets of O’Reilly Automotive, Inc. and Subsidiaries (the Company) as of December 31, 2019 and 2018, the related consolidated statements of income, comprehensive income, shareholders’ equity and cash flows for each of the three years in the period ended December 31, 2019, and the related notes and financial statement schedule listed in the Index at Item 15(a) (collectively referred to as the “consolidated financial statements”). In our opinion, the consolidated financial statements present fairly, in all material respects, the financial position of the Company at December 31, 2019 and 2018, and the results of its operations and its cash flows for each of the three years in the period ended December 31, 2019, in conformity with U.S. generally accepted accounting principles.\nWe also have audited, in accordance with the standards of the Public Company Accounting Oversight Board (United States) (PCAOB), the Company’s internal control over financial reporting as of December 31, 2019, based on criteria established in Internal Control-Integrated Framework issued by the Committee of Sponsoring Organizations of the Treadway Commission (2013 framework) and our report dated February 28, 2020 expressed an unqualified opinion thereon.\nAdoption of New Accounting Standard\nAs discussed in Note 1 to the consolidated financial statements, the Company changed its method for accounting for leasing arrangements upon the adoption of Accounting Standard Codification Topic 842, Leases (“ASC 842”), on January 1, 2019. See below for discussion of our related critical audit matter.\nBasis for Opinion\nThese financial statements are the responsibility of the Company’s management. Our responsibility is to express an opinion on the Company’s financial statements based on our audits. We are a public accounting firm registered with the PCAOB and are required to be independent with respect to the Company in accordance with the U.S. federal securities laws and the applicable rules and regulations of the Securities and Exchange Commission and the PCAOB.\nWe conducted our audits in accordance with the standards of the PCAOB. Those standards require that we plan and perform the audit to obtain reasonable assurance about whether the financial statements are free of material misstatement, whether due to error or fraud. Our audits included performing procedures to assess the risks of material misstatement of the financial statements, whether due to error or fraud, and performing procedures that respond to those risks. Such procedures included examining, on a test basis, evidence regarding the amounts and disclosures in the financial statements. Our audits also included evaluating the accounting principles used and significant estimates made by management, as well as evaluating the overall presentation of the financial statements. We believe that our audits provide a reasonable basis for our opinion.\nCritical Audit Matters\nThe critical audit matters communicated below are matters arising from the current period audit of the financial statements that were communicated or required to be communicated to the audit committee and that: (1) relate to accounts or disclosures that are material to the financial statements and (2) involved our especially challenging, subjective or complex judgments. The communication of critical audit matters does not alter in any way our opinion on the consolidated financial statements, taken as a whole, and we are not, by communicating the critical audit matters below, providing separate opinions on the critical audit matters or on the accounts or disclosures to which they relate.\nValuation of Self-insurance Reserves\nDescription of the Matter\nAt December 31, 2019, the Company’s self-insurance reserve was $157 million. As discussed in Note 1 of the financial statements, self-insurance liabilities are estimated based upon historical claim experience and trend-lines. Furthermore, certain of these liabilities were recorded at an estimate of their net present value, using a discount rate.\nAuditing management’s self-insurance reserves was complex and judgmental and required us to use our actuarial specialists due to the estimation required in determining the ultimate claim value and net present value\nof certain liabilities. The estimate is sensitive to assumptions such as the projected cost inflation, claim growth patterns and exposure forecasts.\nHow We Addressed the Matter in Our Audit\nWe obtained an understanding, evaluated the design of controls over the Company’s self-insurance estimation process and tested the operating effectiveness of those controls including management’s controls over reviewing the appropriateness of assumptions and the completeness and accuracy of the data underlying the reserves.\nTo test the Company’s determination of the estimated self-insurance reserves, we performed audit procedures that included, among others, involving a specialist to assist in the development of an independent actuarial estimate for the reserve balance based upon current industry and economic trends, comparing certain selected assumptions used by management to our independent estimates which were developed with the assistance of our specialists, testing the underlying data used by management in the development of the reserves and testing the mathematical accuracy of the calculations.\nAdoption of New Lease Accounting Standard\nDescription of the Matter\nAs discussed above and in Note 1 to the consolidated financial statements, the Company adopted Accounting Standard Codification Topic 842, Leases (“ASC 842”), on January 1, 2019. The adoption of ASC 842 resulted in the recognition of right-of-use operating lease assets and operating lease liabilities of approximately $1.9 billion as of January 1, 2019. Since most of the leases do not provide a determinable implicit rate, the Company estimated its incremental borrowing rate (IBR) used to calculate its right of use assets and lease liabilities.\nAuditing the Company’s adoption of ASC 842 was challenging and involved subjective auditor judgment because the Company is party to a significant number of lease contracts and certain aspects of adopting ASC 842 required management to exercise judgment in applying the new standard to its portfolio of lease contracts. In particular, auditing management’s estimate of the incremental borrowing rate was especially challenging as it involved a high degree of subjective auditor judgment when testing the reasonableness of the inputs and appropriateness of the rates applied to each lease.\nHow We Addressed the Matter in Our Audit\nWe obtained an understanding and evaluated the design of controls over the Company’s accounting for the adoption of the ASC 842. We tested the operating effectiveness of those controls over management’s application of accounting policies, evaluation of the completeness of the lease portfolio, and over management’s review of the IBR.\nTo test the Company’s implementation of the new leasing standard, our audit procedures included, among others, an evaluation of the completeness of the population of contracts that meet the definition of a lease under ASC 842 and testing the accuracy of the Company’s calculations of initial right-of-use assets and lease liabilities. Additionally, we evaluated management’s methodology for developing the IBR, sensitized the impacts of discounting, and compared the management’s IBRs to the Company’s existing market transactions with comparable terms.\n/s/ Ernst & Young LLP\nWe have served as the Company’s auditor since 1992.\nKansas City, Missouri\nFebruary 28, 2020\nO’REILLY AUTOMOTIVE, INC. AND SUBSIDIARIES\nCONSOLIDATED BALANCE SHEETS\n(In thousands, except share data)\nSee accompanying Notes to consolidated financial statements.\nO’REILLY AUTOMOTIVE, INC. AND SUBSIDIARIES\nCONSOLIDATED STATEMENTS OF INCOME\n(In thousands, except per share data)\nSee accompanying Notes to consolidated financial statements.\nO’REILLY AUTOMOTIVE, INC. AND SUBSIDIARIES\nCONSOLIDATED STATEMENTS OF COMPREHENSIVE INCOME\n(In thousands)\nSee accompanying Notes to consolidated financial statements.\nO’REILLY AUTOMOTIVE, INC. AND SUBSIDIARIES\nCONSOLIDATED STATEMENTS OF SHAREHOLDERS’ EQUITY\n(In thousands)\nSee accompanying Notes to consolidated financial statements.\nO’REILLY AUTOMOTIVE, INC. AND SUBSIDIARIES\nCONSOLIDATED STATEMENTS OF CASH FLOWS\n(In thousands)\nSee accompanying Notes to consolidated financial statements.\nO’REILLY AUTOMOTIVE, INC. AND SUBSIDIARIES\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nDecember 31, 2019\nNOTE 1 - SUMMARY OF SIGNIFICANT ACCOUNTING POLICIES\nNature of business:\nO’Reilly Automotive, Inc. and its Subsidiaries, collectively, “O’Reilly” or the “Company,” is a specialty retailer and supplier of automotive aftermarket parts. The Company’s stores carry an extensive product line, including new and remanufactured automotive hard parts, maintenance items and various automotive accessories. As of December 31, 2019, the Company owned and operated 5,439 stores in 47 U.S. states and 21 stores in Mexico, servicing both do-it-yourself (“DIY”) and the professional service provider customers. The Company’s robust distribution system provides stores with same-day or overnight access to an extensive inventory of hard-to-find items not typically stocked in the stores of other auto parts retailers.\nSegment reporting:\nThe Company is managed and operated by a single management team reporting to the chief operating decision maker. O’Reilly stores have similar characteristics, including the nature of the products and services, the type and class of customers and the methods used to distribute products and provide service to its customers and, as a whole, make up a single operating segment. The Company does not prepare discrete financial information with respect to product lines, types of customers or geographic locations and as such has one reportable segment.\nPrinciples of consolidation:\nThe consolidated financial statements include the accounts of the Company and its wholly-owned subsidiaries. All inter-company balances and transactions have been eliminated in consolidation.\nUse of estimates:\nThe preparation of the consolidated financial statements, in conformity with United States (“U.S.”) generally accepted accounting principles (“GAAP”), requires management to make estimates and assumptions that affect the amounts reported in the consolidated financial statements and accompanying notes. Actual results could materially differ from those estimates.\nCash equivalents:\nCash equivalents include investments with maturities of 90 days or less on the date of purchase.\nForeign Currency:\nThe Company accounts for its Mexican operations using the local market currency, the Mexican peso, and converts its financial statements compiled for these operations from the Mexican peso to U.S. dollars. The cumulative gain on currency translation is included as a component of “Accumulated other comprehensive income” on the accompanying Consolidated Balance Sheets. See Note 12 for further information concerning the Company’s accumulated other comprehensive income.\nAccounts receivable:\nThe Company maintains allowances for doubtful accounts for estimated losses resulting from the inability of the Company’s customers to make required payments. The Company considers the following factors when determining if collection is reasonably assured: customer creditworthiness, past transaction history with the customer, current economic and industry trends and changes in customer payment terms. Allowances for doubtful accounts are determined based on historical experience and an evaluation of the current composition of accounts receivable. Amounts due to the Company from its Team Members are included in “Accounts receivable” on the accompanying Consolidated Balance Sheets. These amounts consist primarily of purchases of merchandise on Team Member accounts. Accounts receivable due from Team Members was approximately $0.9 million and $1.1 million as of December 31, 2019 and 2018, respectively.\nThe Company grants credit to certain customers who meet the Company’s pre-established credit requirements. Concentrations of credit risk with respect to these receivables are limited because the Company’s customer base consists of a large number of small customers, spreading the credit risk across a broad base. The Company also controls this credit risk through credit approvals, credit limits and accounts receivable and credit monitoring procedures. Generally, the Company does not require security when credit is granted to customers. Credit losses are provided for in the Company’s consolidated financial statements and have consistently been within management’s expectations.\nAmounts receivable from suppliers:\nThe Company receives concessions from its suppliers through a variety of programs and arrangements, including allowances for new stores and warranties, volume purchase rebates and co-operative advertising. Co-operative advertising allowances that are incremental to the Company’s advertising program, specific to a product or event and identifiable for accounting purposes are reported as a reduction of advertising expense in the period in which the advertising occurred. All other supplier concessions are recognized as a reduction to the cost of sales. Amounts receivable from suppliers also include amounts due to the Company for changeover merchandise and product returns. The Company regularly reviews supplier receivables for collectability and assesses the need for a reserve for uncollectable amounts based on an evaluation of the Company’s suppliers’ financial positions and corresponding abilities to meet financial obligations. Management does not believe there is a reasonable likelihood that the Company will be unable to collect the amounts receivable from suppliers and the Company did not record a reserve for uncollectable amounts from suppliers in the consolidated financial statements as of December 31, 2019 or 2018.\nInventory:\nInventory, which consists of automotive hard parts, maintenance items, accessories and tools, is stated at the lower of cost or market. Inventory also includes capitalized costs related to procurement, warehousing and distribution centers (“DC”s). Cost has been determined using the last-in, first-out (“LIFO”) method, which more accurately matches costs with related revenues. Over time, as the Company’s merchandise inventory purchases have increased, the Company negotiated improved acquisition costs from its suppliers and the corresponding price deflation exhausted the Company’s LIFO reserve balance. The Company’s policy is to not write up the value of its inventory in excess of its replacement cost, and accordingly, the Company’s merchandise inventory has been effectively recorded at replacement cost since December 31, 2013. The replacement cost of inventory was $3.47 billion and $3.20 billion as of December 31, 2019 and 2018, respectively. LIFO costs exceeded replacement costs by $31.0 million and $107.3 million at December 31, 2019 and 2018, respectively.\nFair value of financial instruments:\nThe Company uses the fair value hierarchy, which prioritizes the inputs used to measure the fair value of certain of its financial instruments. The hierarchy gives the highest priority to unadjusted quoted prices in active markets for identical assets or liabilities (Level 1 measurement) and the lowest priority to unobservable inputs (Level 3 measurement). The Company uses the income and market approaches to determine the fair value of its assets and liabilities. The three levels of the fair value hierarchy are set forth below:\n● Level 1 - Quoted prices (unadjusted) in active markets for identical assets or liabilities that the reporting entity can access at the measurement date.\n● Level 2 - Inputs other than quoted prices in active markets included within Level 1 that are observable for the asset or liability, either directly or indirectly.\n● Level 3 - Unobservable inputs for the asset or liability.\nSee Note 3 for further information concerning the Company’s financial and non-financial assets and liabilities measured at fair value on a recurring and non-recurring basis.\nProperty and equipment:\nProperty and equipment are carried at cost. Depreciation is calculated using the straight-line method, generally over the estimated useful lives of the assets. Leasehold improvements are amortized over the lesser of the lease term or the estimated economic life of the assets. The lease term includes renewal options determined by management at lease inception, for which failure to execute renewal options would result in a substantial economic penalty to the Company. Maintenance and repairs are charged to expense as incurred. Upon retirement or sale, the cost and accumulated depreciation are eliminated and the gain or loss, if any, is recognized in the Company’s Consolidated Statements of Income. The Company reviews long-lived assets for impairment whenever events or changes in circumstances indicate that the carrying amount of an asset may not be fully recoverable. See Note 4 for further information concerning the Company’s property and equipment.\nGoodwill and other intangibles:\nThe accompanying Consolidated Balance Sheets at December 31, 2019 and 2018, include goodwill and other intangible assets recorded as the result of acquisitions. The Company operates a single reporting unit and reviews goodwill for impairment annually during the fourth quarter, or when events or changes in circumstances indicate the carrying value of these assets might exceed their current fair values. During 2019, the goodwill impairment test included a qualitative assessment. During 2018, the goodwill impairment test included a quantitative assessment, which compared the fair value of the reporting unit to its carrying amount, including goodwill. The Company’s qualitative assessment found no evidence to suggest it is more likely than not that its fair value is less than its carrying amount, including goodwill, as of December 31, 2019. The Company’s quantitative assessment determined that its fair value exceeded\nits carrying value, including goodwill, as of December 31, 2018. As such, no goodwill impairment adjustment was required as of December 31, 2019 and 2018. Finite-lived intangibles are carried at amortized cost and amortization is calculated using the straight-line method, generally over the estimated useful lives of the intangibles. See Note 6 for further information concerning the Company’s goodwill and other intangibles.\nImpairment of long-lived assets:\nThe Company reviews its long-lived assets for impairment whenever events or changes in circumstances indicate that the carrying value of an asset may not be recoverable. When such an event occurs, the Company compares the sum of the undiscounted expected future cash flows of the asset (asset group) with the carrying amounts of the asset. If the undiscounted expected future cash flows are less than the carrying value of the assets, the Company measures the amount of impairment loss as the amount by which the carrying amount of the assets exceeds the fair value of the assets. The Company has not historically recorded any material impairment charges to its long-lived assets; however, during the years ended December 31, 2019 and 2018, the Company recorded a charge of $1.9 million and $11.4 million, respectively, related to its long-lived assets, primarily due to the disposal of certain software projects that were no longer expected to provide a long-term benefit.\nValuation of investments:\nThe Company has an unsecured obligation to pay, in the future, the value of deferred compensation and a Company match relating to employee participation in the Company’s nonqualified deferred compensation plan (the “Deferred Compensation Plan”). The future obligation is adjusted to reflect the performance, whether positive or negative, of selected investment measurement options, chosen by each participant. The Company invests in various marketable securities with the intention of selling these securities to fulfill its future obligations under the Deferred Compensation Plan. The investments in this plan were stated at fair value based on quoted market prices, were accounted for as trading securities and were included in “Other assets, net” on the accompanying Consolidated Balance Sheets as of December 31, 2019 and 2018. See Note 3 for further information concerning the fair value measurements of the Company’s marketable securities. See Note 11 for further information concerning the Company’s benefit plans.\nLeases:\nThe Company leases certain office space, retail stores, distribution centers and equipment under long-term, non-cancelable operating leases. Lease components are not accounted for separately from nonlease components. Leases generally include renewal options and some include options to purchase, provisions for percentage rent based on sales and/or incremental step increase provisions. The exercise of renewal options is typically at the Company’s sole discretion and all operating lease expense is recognized on a straight-line basis over the lease term. The Company’s lease agreements do not contain any material residual value guarantees or material restrictive covenants. The Company rents or subleases certain surplus real estate to third parties. Right-of-use assets and corresponding operating lease liabilities are recognized for all leases with an initial term greater than 12 months. See Note 5 for further information concerning the Company’s operating leases.\nSelf-insurance reserves:\nThe Company uses a combination of insurance and self-insurance mechanisms to provide for potential liabilities for Team Member health care benefits, workers’ compensation, vehicle liability, general liability and property loss. With the exception of certain Team Member health care benefit liabilities, employment related claims and litigation, certain commercial litigation and certain regulatory matters, the Company obtains third-party insurance coverage to limit its exposure. The Company estimates its self-insurance liabilities by considering a number of factors, including historical claims experience and trend-lines, projected medical and legal inflation, growth patterns and exposure forecasts. Certain of these liabilities were recorded at an estimate of their net present value, using a credit-adjusted discount rate.\nThe following table identifies the components of the Company’s self-insurance reserves as of December 31, 2019 and 2018 (in thousands):\nThe current portion of the Company’s discounted self-insurance reserves totaled $79.1 million and $77.0 million as of December 31, 2019 and 2018, respectively, which was included in “Self-insurance reserves” on the accompanying Consolidate Balance Sheets as of December 31, 2019 and 2018. The remainder was included in “Other liabilities” on the accompanying Consolidated Balance Sheets as of December 31, 2019 and 2018.\nWarranties:\nThe Company offers warranties on certain merchandise it sells with warranty periods ranging from 30 days to limited lifetime warranties. The risk of loss arising from warranty claims is typically the obligation of the Company’s suppliers. Certain suppliers provide upfront allowances to the Company in lieu of accepting the obligation for warranty claims. For this merchandise, when sold, the Company bears the risk of loss associated with the cost of warranty claims. Differences between supplier allowances received by the Company, in lieu of warranty obligations and estimated warranty expense, are recorded as an adjustment to cost of sales. Estimated warranty costs, which are recorded as obligations at the time of sale, are based on the historical failure rate of each individual product line. The Company’s historical experience has been that failure rates are relatively consistent over time and that the ultimate cost of warranty claims to the Company has been driven by volume of units sold as opposed to fluctuations in failure rates or the variation of the cost of individual claims. See Note 8 for further information concerning the Company’s aggregate product warranty liabilities.\nLitigation accruals:\nO’Reilly is currently involved in litigation incidental to the ordinary conduct of the Company’s business. The Company accrues for litigation losses in instances where a material adverse outcome is probable and the Company is able to reasonably estimate the probable loss. The Company accrues for an estimate of material legal costs to be incurred in pending litigation matters. Although the Company cannot ascertain the amount of liability that it may incur from any of these matters, it does not currently believe that, in the aggregate, these matters, taking into account applicable insurance and accruals, will have a material adverse effect on its consolidated financial position, results of operations or cash flows in a particular quarter or annual period.\nShare repurchases:\nIn January of 2011, the Company’s Board of Directors approved a share repurchase program. Under the program, the Company may, from time to time, repurchase shares of its common stock, solely through open market purchases effected through a broker dealer at prevailing market prices, based on a variety of factors such as price, corporate trading policy requirements and overall market conditions. All shares repurchased under the share repurchase program are retired and recorded under the par value method on the accompanying Consolidated Balance Sheets. See Note 9 for further information concerning the Company’s share repurchase program.\nRevenue recognition:\nThe Company’s primary source of revenue is derived from the sale of automotive aftermarket parts and merchandise to its customers. Revenue is recognized when performance obligations under the terms of a contract with a customer are satisfied, in an amount representing the consideration the Company expects to receive in exchange for transferring goods to the customer. Generally, the Company’s performance obligations are satisfied when the customer takes possession of the merchandise, which normally occurs immediately at the point of sale or through same day delivery of the merchandise. All sales are recorded net of estimated returns allowances, discounts and taxes. The company does not recognize revenue related to product warranties, as these are considered assurance warranty obligations.\nOver-the-counter retail sales to DIY customers are recorded when the customer takes possession of the merchandise. Internet retail sales, included in sales to DIY customers, are recorded when the merchandise is shipped or when the customer picks up the merchandise at a store. Sales to professional service provider customers, also referred to as “commercial sales,” are recorded upon same-day delivery of the merchandise to the customer, generally at the customer’s place of business. Other sales and sales adjustments primarily includes sales to Team Members, wholesale sales to other retailers (“jobber sales”), equipment sales, discounts, rebates, deferred revenue adjustments relating to the Company’s retail loyalty program and adjustments to estimated sales returns allowances. Sales to Team Members are recorded when the Team Member takes possession of the merchandise. Jobber sales are recorded upon shipment of the merchandise from a regional distribution center with same-day delivery to the jobber customer’s location.\nThe Company maintains a retail loyalty program named O’Reilly O’Rewards, which represents a performance obligation. The Company records a deferred revenue liability, based on a breakage adjusted, estimated redemption rate, and a corresponding reduction in revenue in periods when loyalty points are earned by members. The Company recognizes revenue and a corresponding reduction to the deferred revenue liability in periods when loyalty program issued coupons are redeemed by members, generally within a period of three months from issuance, or when unredeemed points expire, generally within 12 months after the date they were earned, which satisfies the Company’s performance obligation. See Note 10 for further information concerning the Company’s revenue.\nCost of goods sold and selling, general and administrative expenses:\nThe following table illustrates the primary costs classified in each major expense category:\nAdvertising expenses:\nAdvertising expense consists primarily of expenses related to the Company’s integrated marketing program, which includes radio, in-store, digital and social media promotions, as well as sports and event sponsorships and direct mail and newspaper promotional distribution. The Company expenses advertising costs as incurred. The Company also participates in cooperative advertising arrangements with certain of its suppliers. Advertising expense, net of cooperative advertising allowances from suppliers that were incremental to the advertising program, specific to the product or event and identifiable for accounting purposes, total $79.3 million, $81.4 million and $83.7 million for the years ended December 31, 2019, 2018 and 2017, respectively, which were included in “Selling, general and administrative expenses” on the accompanying Consolidated Statements of Income.\nShare-based compensation and benefit plans:\nThe Company sponsors share-based compensation plans and benefit plans. The Company recognizes compensation expense over the requisite service period for its share-based plans based on the fair value of the awards on the date of the grant, award or issuance. Share-based plans include stock option awards, restricted stock awards and stock appreciation rights issued under the Company’s incentive plans and stock issued through the Company’s employee stock purchase plan. See Note 11 for further information concerning the Company’s share-based compensation and benefit plans.\nPre-opening expenses:\nCosts associated with the opening of new stores, which consist primarily of payroll and occupancy costs, are charged to “Selling, general and administrative expenses” on the accompanying Consolidated Statements of Income as incurred. Costs associated with the opening of new distribution centers, which consist primarily of payroll and occupancy costs, are included in “Cost of goods sold, including warehouse and distribution expenses” on the accompanying Consolidated Statements of Income as incurred.\nInterest expense:\nThe Company capitalizes interest costs as a component of construction in progress, based on the weighted-average interest rates incurred on its long-term borrowings. Total interest costs capitalized for the years ended December 31, 2019, 2018 and 2017, were $13.0 million, $9.1 million and $8.5 million, respectively, which were included in “Interest expense” on the accompanying Consolidated Statements of Income.\nIn conjunction with the issuance or amendment of long-term debt instruments, the Company incurs various costs, including debt registration fees, accounting and legal fees and underwriter and book runner fees. Debt issuance costs related to the Company’s long-term unsecured senior notes are recorded as a reduction of the principal amount of the corresponding unsecured senior notes. Debt issuance costs related to the Company’s unsecured revolving credit facility are recorded as an asset. These debt issuance costs have been deferred and are being amortized over the term of the corresponding debt instrument and the amortization expense is included in “Interest expense” on the accompanying Consolidated Statements of Income. Deferred debt issuance costs totaled $18.0 million and $17.1 million, net of accumulated amortization, as of December 31, 2019 and 2018, respectively, of which $1.1 million and $1.5 million\nwere included in “Other assets, net” as of December 31, 2019 and 2018, respectively, with the remainder included in “Long-term debt” on the accompanying Consolidated Balance Sheets.\nThe Company issued its long-term unsecured senior notes at a discount. The original issuance discounts on the senior notes are recorded as a reduction of the principal amount of the corresponding senior notes and are accreted over the term of the applicable senior note, with the accretion expense included in “Interest expense” on the accompanying Consolidated Statements of Income. Original issuance discounts, net of accretion, totaled $3.5 million and $4.3 million as of December 31, 2019 and 2018, respectively.\nSee Note 7 for further information concerning debt issuance costs and original issuance discounts associated with the Company’s issuances of long-term debt instruments.\nIncome taxes:\nThe Company accounts for income taxes using the liability method, which requires the recognition of deferred tax assets and liabilities for the expected future tax consequences of events that have been included in the financial statements. Under this method, deferred tax assets and liabilities are determined based on differences between the U.S. GAAP basis and tax basis of assets and liabilities using enacted tax rules and rates currently scheduled to be in effect for the year in which the differences are expected to reverse. Tax carry forwards are also recognized in deferred tax assets and liabilities under this method. The effect of a change in tax rates on deferred tax assets and liabilities is recognized in income in the period of the enactment date. The Company would record a valuation allowance against deferred tax assets to the extent it is more likely than not the amount will not be realized, based upon evidence available at the time of the determination and any change in the valuation allowance is recorded in the period of a change in such determination. The Company did not establish a valuation allowance for deferred tax assets as of December 31, 2019 and 2018, as it was considered more likely than not that deferred tax assets were realizable through a combination of future taxable income, the realization of deferred tax liabilities and tax planning strategies.\nThe Company invests in certain tax credit funds that promote renewable energy. These investments generate a return primarily through the realization of federal tax credits and other tax benefits. The Company accounts for its renewable energy investments using the deferral method. Under this method, realized investment tax credits are recognized as a reduction of the renewable energy investments.\nThe Company regularly reviews its potential tax liabilities for tax years subject to audit. The amount of such liabilities is based on various factors, such as differing interpretations of tax regulations by the responsible tax authority, experience with previous tax audits and applicable tax law rulings. In management’s opinion, adequate provisions for income taxes have been made for all years presented. The estimates of the Company’s potential tax liabilities contain uncertainties because management must use judgment to estimate the exposures associated with the Company’s various tax positions and actual results could differ from estimates. See Note 15 for further information concerning the Company’s income taxes.\nEarnings per share:\nBasic earnings per share is calculated by dividing net income by the weighted-average number of common shares outstanding during the fiscal period. Diluted earnings per share is calculated by dividing the weighted-average number of common shares outstanding plus the common stock equivalents associated with the potential impact of dilutive stock options. Certain common stock equivalents that could potentially dilute basic earnings per share in the future were not included in the fully diluted computation because they would have been antidilutive. Generally, stock options are antidilutive and excluded from the earnings per share calculation when the exercise price exceeds the market price of the common shares. See Note 16 for further information concerning the Company’s common stock equivalents.\nNew accounting pronouncements:\nIn February of 2016, the FASB issued ASU No. 2016-02, “Leases (Topic 842)” (“ASU 2016-02”). Under ASU 2016-02, an entity is required to recognize right-of-use assets and lease liabilities on its balance sheet and disclose key information about leasing arrangements. ASU 2016-02 offers specific accounting guidance for a lessee, a lessor and sale and leaseback transactions. Lessees and lessors are required to disclose qualitative and quantitative information about leasing arrangements to enable a user of the financial statements to assess the amount, timing and uncertainty of cash flows arising from leases. In July of 2018, the FASB issued ASU No. 2018-11, “Leases (Topic 842): Targeted Improvement” (“ASU 2018-11”), to provide an additional, optional transition method for adopting ASU 2016-02, which allows for an entity to choose to apply the new lease standard at adoption date and recognize a cumulative-effective adjustment to the opening balance of retained earnings in the period of adoption, while comparative periods presented will continue to be in accordance with current U.S. GAAP Topic 840. For public companies, Topic 842 is effective for annual reporting periods beginning after December 15, 2018, including interim periods within that reporting period. The Company adopted this new guidance with its first quarter ending March 31, 2019, using the additional, optional transition method, the package of transitional practical expedients relating to the identification, classification and initial direct costs of leases commencing before the effective date of\nTopic 842, the transitional practical expedient for the treatment of existing land easements and the practical expedient to make an accounting policy election, by class of underlying asset, to not separate nonlease components from lease components; however, the Company did not elect the hindsight transitional practical expedient. The Company made an accounting policy election to not apply recognition requirements of the guidance to short-term leases. Due to the adoption of this new guidance, the Company recognized right-of-use assets and lease liabilities of $1.9 billion and $2.0 billion, respectively, on the accompanying Condensed Consolidated Balance Sheets as of December 31, 2019. The difference between the right-of-use assets and lease liabilities on the accompanying Condensed Consolidated Balance Sheet was primarily due to the accrual for straight-line rent expense. The Company made an adjustment to opening “Retained Deficit” on the accompanying Condensed Consolidated Balance Sheet in the amount of $1.4 million, net of the deferred tax impact, related to the adoption of this new guidance. With the adoption of this new guidance, the Company’s favorable lease assets and unfavorable lease liabilities, from a previous acquisition, were eliminated through an adjustment to opening “Operating lease, right-of-use assets” on the accompanying Condensed Consolidated Balance Sheet. The adoption of this new guidance did not have a material impact on the Company’s results of operations, cash flows, liquidity or the Company’s covenant compliance under its existing credit agreement.\nIn June of 2016, the FASB issued ASU No. 2016-13, “Financial Instruments - Credit Losses (Topic 326): Measurement of Credit Losses on Financial Instruments” (“ASU 2016-13”). Under ASU 2016-13, businesses and other organizations are required to present financial assets, measured at amortized costs basis, at the net amount expected to be collected. The allowance for credit losses is a valuation account that is deducted from the amortized cost basis, such as trade receivables. The measurement of expected credit loss will be based on historical experience, current conditions, and reasonable and supportable forecasts that affect the collectibility of the reported amount. For public companies, ASU 2016-13 is effective for annual reporting periods beginning after December 15, 2019, including interim periods within that reporting period, and requires a modified retrospective adoption, with early adoption permitted. The Company will adopt this guidance beginning with its first quarter ending March 31, 2020. The application of this new guidance is not expected to have a material impact on the Company’s consolidated financial condition, results of operations or cash flows.\nIn January of 2017, the FASB issued ASU No. 2017-04, “Intangibles - Goodwill and Other (Topic 350): Simplifying the Test for Goodwill Impairment” (“ASU 2017-04”). ASU 2017-04 eliminates the second step in the previous process for goodwill impairment testing; instead, the test is now a one-step process that calls for goodwill impairment loss to be measured as the excess of the reporting unit’s carrying amount over its fair value. For public companies, ASU 2017-04 is effective for annual reporting periods beginning after December 15, 2019, including interim periods within that reporting period, and requires prospective adoption, with early adoption after January 1, 2017. The Company early adopted this guidance beginning with its first quarter ending March 31, 2019. The application of this new guidance did not have a material impact on the Company’s consolidated financial condition, results of operations or cash flows.\nNOTE 2 - BUSINESS COMBINATION\nAfter the close of business on November 29, 2019, the Company completed the acquisition of Mayoreo de Autopartes y Aceites, S.A. de C.V. (“Mayasa”), a specialty retailer of automotive aftermarket parts headquartered in Guadalajara, Jalisco, Mexico pursuant to a stock purchase agreement. At the time of the acquisition, Mayasa operated six distribution centers, 21 Orma Autopartes stores and served over 2,000 independent jobber locations in 28 Mexican states. The results of Mayasa’s operations have been included in the Company’s consolidated financial statements beginning from the date of acquisition. Pro forma results of operations related to the acquisition of Mayasa are not presented as Mayasa’s results are not material to the Company’s results of operations.\nThe purchase price allocation process consists of collecting data and information to enable the Company to value the assets acquired and liabilities assumed as a result of the business combination. Potential identifiable intangible assets under evaluation include, but are not limited to, trade names and trademarks, non-compete agreements and customer relationships. In addition, other assets, including internal use software, and other liabilities may be identified, valued and recorded. Due to the close proximity of the Mayasa acquisition closing date and the Company’s fiscal year end, the Company remains in the initial measurement period.\nThe preliminary purchase price allocation, which is provisional and will change as additional information is obtained and valuation work is completed during the initial measurement period, resulted in the initial recognition of $128.1 million of goodwill and intangible assets included in “Goodwill” on the accompanying Consolidated Balance Sheets as of December 31, 2019. Goodwill generated from this acquisition is not amortizable for tax purposes.\nSee Note 6 for further information concerning the Company’s goodwill and other intangible assets.\nNOTE 3 - FAIR VALUE MEASUREMENTS\nFinancial assets and liabilities measured at fair value on a recurring basis:\nThe Company’s marketable securities were accounted for as trading securities and the carrying amount of its marketable securities were included in “Other assets, net” on the accompanying Consolidated Balance Sheets as of December 31, 2019 and 2018. The Company recorded an increase in fair value related to its marketable securities in the amount of $5.8 million for the year ended December 31, 2019, and a decrease in the amount of $1.7 million for the year ended December 31, 2018, which were included in “Other income (expense)” on the accompanying Consolidated Statements of Income.\nThe tables below identify the estimated fair value of the Company’s marketable securities, determined by reference to quoted market prices (Level 1), as of December 31, 2019 and 2018 (in thousands):\nNon-financial assets and liabilities measured at fair value on a nonrecurring basis:\nCertain long-lived non-financial assets and liabilities may be required to be measured at fair value on a nonrecurring basis in certain circumstances, including when there is evidence of impairment. These non-financial assets and liabilities may include assets acquired in a business combination or property and equipment that are determined to be impaired. As of December 31, 2019 and 2018, the Company did not have any non-financial assets or liabilities that had been measured at fair value subsequent to initial recognition.\nFair value of financial instruments:\nThe carrying amounts of the Company’s senior notes and unsecured revolving credit facility borrowings are included in “Long-term debt” on the accompanying Consolidated Balance Sheets as of December 31, 2019 and 2018.\nThe table below identifies the estimated fair value of the Company’s senior notes, using the market approach. The fair values as of December 31, 2019 and 2018, were determined by reference to quoted market prices of the same or similar instruments (Level 2) (in thousands):\nThe carrying amount of the Company’s unsecured revolving credit facility approximates fair value, as borrowings under the facility bear variable interest at current market rates. See Note 7 for further information concerning the Company’s senior notes and unsecured revolving credit facility.\nThe accompanying Consolidated Balance Sheets include other financial instruments, including cash and cash equivalents, accounts receivable, amounts receivable from suppliers and accounts payable. Due to the short-term nature of these financial instruments, the Company believes that the carrying values of these instruments approximate their fair values.\nNOTE 4 - PROPERTY AND EQUIPMENT\nThe following table identifies the types and balances of property and equipment included in “Property and equipment, at cost” on the accompanying Consolidated Balance Sheets as of December 31, 2019 and 2018, and includes the estimated useful lives for its types of property and equipment (in thousands, except original useful lives):\nThe Company recorded depreciation and amortization expense related to property and equipment in the amounts of $267.3 million, $246.0 million and $232.7 million for the years ended December 31, 2019, 2018 and 2017, respectively, which were primarily included in “Selling, general and administrative expenses” on the accompanying Consolidated Statements of Income.\nThe Company recorded a charge of $1.9 million and $11.4 million related to property and equipment for the year ended December 31, 2019 and 2018, respectively, primarily due to the disposal of certain software projects that were no longer expected to provide a long-term benefit, which was included in “Selling, general and administrative expenses” on the accompanying Consolidated Statements of Income.\nNOTE 5 - LEASES\nOperating lease commitments:\nSee Note 1 for further information concerning the Company’s adoption of Accounting Standard Codification 842 - Leases.\nThe following table summarizes Total lease cost for the year ended December 31, 2019, which was primarily included in “Selling, general and administrative expenses” on the accompanying Consolidated Statements of Income (in thousands):\nThe following table summarizes the Net rent expense amounts, prior to the adoption of Accounting Standard Codification 842 - Leases, for the years ended December 31, 2018 and 2017, which were included in “Selling, general and administrative expenses” on the accompanying Consolidated Statements of Income (in thousands):\nThe following table summarizes other lease related information for the year ended December 31, 2019:\nThe following table identifies the future minimum lease payments under all of the Company’s operating leases for each of the next five years, and in the aggregate thereafter, and reconciles to the present value of the “Operating lease liabilities, less current portion” included in the accompanying Consolidated Balance Sheet as of December 31, 2019 (in thousands):\nSee Note 14 for further information concerning the Company’s related party operating leases.\nThe future minimum lease payments under the Company’s operating leases, in the table above, do not include potential amounts for percentage rent and other variable operating lease related costs and have not been reduced by expected future minimum sublease income under non-cancelable subleases, which was approximately $18.6 million as of December 31, 2019.\nThe present value discount component of the future minimum lease payments under the Company’s operating leases, in the table above, was primarily calculated using the Company’s incremental borrowing rate based on information available at the lease commencement or modification date. Inputs for the calculation of the Company’s incremental borrowing rate include valuations and yields of U.S. domestic investment grade corporate bonds and the applicable credit spread over comparable U.S. Treasury rates, adjusted to a collateralized basis by estimating the credit spread improvement that would result from an upgrade of one ratings classification. For leases that commenced prior to January 1, 2019, the incremental borrowing rate used was as of January 1, 2019. When the implicit rate of a lease is available, the implicit rate is used in the calculation and not the Company’s incremental borrowing rate.\nNOTE 6 - GOODWILL AND OTHER INTANGIBLES\nGoodwill:\nGoodwill is reviewed for impairment annually during the fourth quarter, or more frequently if events or changes in circumstances indicate that impairment may exist. Goodwill is not amortizable for financial statement purposes. The Company did not record any goodwill impairment during the years ended December 31, 2019 or 2018.\nThe carrying amount of the Company’s goodwill was included in “Goodwill” on the accompanying Consolidated Balance Sheets as of December 31, 2019 and 2018, respectively. During the years ended December 31, 2019 and 2018, the Company recorded an increase in goodwill of $1.5 million and $18.2 million, respectively, resulting from small acquisitions.\nThe preliminary purchase price allocation related to the acquisition of Mayasa resulted in the initial recognition of goodwill and intangible assets in the amount of $128.1 million as of December 31, 2019, including changes resulting from foreign currency translations. This provisional amount will change as additional information is obtained and valuation work is completed during the initial measurement period.\nThe following table identifies the changes in goodwill and acquisition intangibles, which were included in “Goodwill” on the accompanying Consolidated Balance Sheets for the years ended December 31, 2019 and 2018 (in thousands):\nAs of December 31, 2019 and 2018, other than goodwill, the Company did not have any indefinite-lived intangible assets. Indefinite lived intangible assets related to the acquisition of Mayasa may be identified, valued and recorded during the measurement period.\nIntangibles other than goodwill:\nThe following table identifies the components of the Company’s amortizable intangibles as of December 31, 2019 and 2018 (in thousands):\nDuring the years ended December 31, 2019 and 2018, the Company recorded non-compete agreement assets in conjunction with small acquisitions in the amounts of less than $0.1 million and $0.9 million, respectively.\nWith the adoption of Accounting Standard Codification 842 - Leases, the Company’s favorable lease assets and unfavorable lease liabilities, from a previous acquisition, were eliminated. See Note 1 for further information concerning the Company’s adoption of Accounting Standard Codification 842 - Leases.\nIn prior years, the Company recorded favorable lease assets in conjunction with a previous acquisition; these favorable lease assets represent the values of operating leases acquired with favorable terms. For the years ended December 31, 2018 and 2017, the Company recorded amortization expense of $1.4 million and $1.6 million, respectively, related to its amortizable intangible assets, which were included in “Other assets, net” on the accompanying Consolidated Balance Sheets as of December 31, 2018.\nIn prior years, the Company recorded unfavorable lease liabilities in conjunction with a previous acquisition; these unfavorable lease liabilities represent the values of operating leases acquired with unfavorable terms. For the years ended December 31, 2018 and 2017, the Company recognized an amortized benefit of $0.9 million and $1.5 million, respectively, related to these unfavorable operating leases, which were included in “Other liabilities” on the accompanying Consolidated Balance Sheets as of December 31, 2018.\nThe following table identifies the estimated amortization expense and benefit of the Company’s intangibles for each of the next five years as of December 31, 2019 (in thousands):\nNOTE 7 - FINANCING\nThe following table identifies the amounts of the Company’s financing facilities, which were included in “Long-term debt” on the accompanying Consolidated Balance Sheets as of December 31, 2019 and 2018 (in thousands):\nThe following table identifies the principal maturities of the Company’s financing facilities as of December 31, 2019 (in thousands):\nUnsecured revolving credit facility:\nOn April 5, 2017, the Company entered into a credit agreement (the “Credit Agreement”). The Credit Agreement provides for a $1.2 billion unsecured revolving credit facility (the “Revolving Credit Facility”) arranged by JPMorgan Chase Bank, N.A., which is scheduled to mature in April 2022. The Credit Agreement includes a $200 million sub-limit for the issuance of letters of credit and a $75 million sub-limit for swing line borrowings under the Revolving Credit Facility. As described in the Credit Agreement governing the Revolving Credit Facility, the Company may, from time to time, subject to certain conditions, increase the aggregate commitments under the Revolving Credit Facility by up to $600 million, provided that the aggregate amount of the commitments does not exceed $1.8 billion at any time.\nAs of December 31, 2019 and 2018, the Company had outstanding letters of credit, primarily to support obligations related to workers’ compensation, general liability and other insurance policies, in the amounts of $38.9 million and $35.1 million, respectively, reducing the aggregate availability under the Revolving Credit Facility by those amounts.\nBorrowings under the Revolving Credit Facility (other than swing line loans) bear interest, at the Company’s option, at either an Alternate Base Rate or an Adjusted LIBO Rate (both as defined in the Credit Agreement) plus an applicable margin. Swing line loans made under the Revolving Credit Facility bear interest at an Alternate Base Rate plus the applicable margin for Alternate Base Rate loans. In addition, the Company pays a facility fee on the aggregate amount of the commitments under the Credit Agreement in an amount equal to a percentage of such commitments. The interest rate margins and facility fee are based upon the better of the ratings assigned to the Company’s debt by Moody’s Investor Service, Inc. and Standard & Poor’s Ratings Services, subject to limited exceptions. As of December 31, 2019, based upon the Company’s current credit ratings, its margin for Alternate Base Rate loans was 0.000%, its margin for Eurodollar Revolving Loans was 0.900% and its facility fee was 0.100%.\nThe Credit Agreement contains certain covenants, including limitations on subsidiary indebtedness, a minimum consolidated fixed charge coverage ratio of 2.50:1.00 and a maximum consolidated leverage ratio of 3.50:1.00. The consolidated fixed charge coverage ratio includes a calculation of earnings before interest, taxes, depreciation, amortization, rent and non-cash share-based compensation expense to fixed charges. Fixed charges include interest expense, capitalized interest and rent expense. The consolidated leverage ratio\nincludes a calculation of adjusted debt to earnings before interest, taxes, depreciation, amortization, rent and non-cash share-based compensation expense. Adjusted debt includes outstanding debt, outstanding stand-by letters of credit and similar instruments, five-times rent expense and excludes any premium or discount recorded in conjunction with the issuance of long-term debt. In the event that the Company should default on any covenant (subject to customary grace periods, cure rights and materiality thresholds) contained in the Credit Agreement, certain actions may be taken, including, but not limited to, possible termination of commitments, immediate payment of outstanding principal amounts plus accrued interest and other amounts payable under the Credit Agreement and litigation from lenders. As of December 31, 2019, the Company remained in compliance with all covenants under the Credit Agreement.\nSenior notes:\nOn May 20, 2019, the Company issued $500 million aggregate principal amount of unsecured 3.900% Senior Notes due 2029 (“3.900% Senior Notes due 2029”) at a price to the public of 99.991% of their face value with U.S. Bank National Association (“U.S. Bank”) as trustee. Interest on the 3.900% Senior Notes due 2029 is payable on June 1 and December 1 of each year, which began on December 1, 2019, and is computed on the basis of a 360-day year.\nThe Company has issued a cumulative $3.7 billion aggregate principal amount of unsecured senior notes, which are due between 2021 and 2029, with UMB Bank, N.A. and U.S. Bank as trustees. Interest on the senior notes, ranging from 3.550% to 4.875%, is payable semi-annually and is computed on the basis of a 360-day year. None of the Company’s subsidiaries is a guarantor under the senior notes. Each of the senior notes is subject to certain customary covenants, with which the Company complied as of December 31, 2019.\nNOTE 8 - WARRANTIES\nThe Company’s product warranty liabilities are included in “Other current liabilities” on the accompanying Consolidated Balance Sheets as of December 31, 2019 and 2018. The following table identifies the changes in the Company’s aggregate product warranty liabilities for the years ended December 31, 2019 and 2018 (in thousands):\nNOTE 9 - SHARE REPURCHASE PROGRAM\nIn January of 2011, the Company’s Board of Directors approved a share repurchase program. Under the program, the Company may, from time to time, repurchase shares of its common stock, solely through open market purchases effected through a broker dealer at prevailing market prices, based on a variety of factors such as price, corporate trading policy requirements and overall market conditions. The Company’s Board of Directors may increase or otherwise modify, renew, suspend or terminate the share repurchase program at any time, without prior notice. As announced on May 31, 2019, and February 5, 2020, the Company’s Board of Directors each time approved a resolution to increase the authorization amount under the share repurchase program by an additional $1.0 billion, resulting in a cumulative authorization amount of $13.8 billion. Each additional authorization is effective for a three-year period, beginning on its respective announcement date.\nThe following table identifies shares of the Company’s common stock that have been repurchased as part of the Company’s publicly announced share repurchase program for the year ended December 31, 2019 and 2018 (in thousands, except per share data):\nAs of December 31, 2019, the Company had $568.7 million remaining under its share repurchase program. Subsequent to the end of the year and through February 28, 2020, the Company repurchased an additional 0.9 million shares of its common stock under its share repurchase program, at an average price of $400.78, for a total investment of $363.4 million. The Company has repurchased a total of 77.1 million shares of its common stock under its share repurchase program since the inception of the program in January of 2011 and through February 28, 2020, at an average price of $162.72, for a total aggregate investment of $12.5 billion.\nNOTE 10 - REVENUE\nThe table below identifies the Company’s revenues disaggregated by major customer type for the years ended December 31, 2019, 2018 and 2017 (in thousands):\nAs of December 31, 2019 and 2018, the Company had recorded a deferred revenue liability of $4.1 million and $4.3 million, respectively, related to its loyalty program, which were included in “Other liabilities” on the accompanying Consolidated Balance Sheets. During the years ended December 31, 2019, 2018 and 2017, the Company recognized $15.6 million, $15.9 million and $17.6 million, respectively, of revenue related to its loyalty program, which were included in “Sales” on the accompanying Consolidated Statements of Income.\nNOTE 11 - SHARE-BASED COMPENSATION AND BENEFIT PLANS\nThe Company recognizes share-based compensation expense based on the fair value of the grants, awards or shares at the time of the grant, award or issuance. Share-based compensation includes stock option awards, restricted stock awards and stock appreciation rights issued under the Company’s incentive plans and stock issued through the Company’s employee stock purchase plan.\nThe table below identifies the shares that have been authorized for issuance and the shares available for future issuance under the Company plans, as of December 31, 2019 (in thousands):\nStock options:\nThe Company’s incentive plans provide for the granting of stock options for the purchase of common stock of the Company to certain key employees of the Company. Employee stock options are granted at an exercise price that is equal to the closing market price of the Company’s common stock on the date of the grant. Employee stock options granted under the plans expire after 10 years and typically vest 25% per year, over four years. The Company records compensation expense for the grant date fair value of the option awards evenly over the vesting period or minimum required service period.\nThe table below identifies the employee stock option activity under these plans during the year ended December 31, 2019:\nThe fair value of each stock option award is estimated on the date of the grant using the Black-Scholes option pricing model. The Black-Scholes model requires the use of assumptions, including the risk free rate, expected life, expected volatility and expected dividend yield.\n● Risk-free interest rate - The United States Treasury rates in effect at the time the options are granted for the options’ expected life.\n● Expected life - Represents the period of time that options granted are expected to be outstanding. The Company uses historical experience to estimate the expected life of options granted.\n● Expected volatility - Measure of the amount, by which the Company’s stock price is expected to fluctuate, based on a historical trend.\n● Expected dividend yield - The Company has not paid, nor does it have plans in the foreseeable future to pay, any dividends.\nThe table below identifies the weighted-average assumptions used for stock options awarded by the Company during the years ended December 31, 2019, 2018 and 2017:\nUpon adoption of ASU 2016-09, during the three months ended March 31, 2017, the Company elected to change its accounting policy to account for forfeitures as they occur. Prior to the year ended December 31, 2017, the Company’s forfeiture rate was the estimated percentage of options awarded that were expected to be forfeited or canceled prior to becoming fully vested, and the estimate was evaluated periodically and was based upon historical experience at the time of evaluation and reduced expense ratably over the vesting period or the minimum required service period.\nThe following table summarizes activity related to stock options awarded by the Company for the years ended December 31, 2019, 2018 and 2017:\nAt December 31, 2019, the remaining unrecognized compensation expense related to unvested stock option awards was $33.7 million, and the weighted-average period of time, over which this cost will be recognized, is 2.6 years.\nRestricted stock:\nThe Company’s incentive plans provide for the awarding of shares of restricted stock to certain key employees that vest evenly over a three-year period and are held in escrow until such vesting has occurred. Generally, unvested shares are forfeited when an employee ceases employment. The fair value of shares awarded under these plans is based on the closing market price of the Company’s common stock on the date of award and compensation expense is recorded over the vesting period or minimum required service period.\nThe table below identifies employee restricted stock activity under these plans during the year ended December 31, 2019 (in thousands, except per share data):\n(1) Includes less than one thousand shares withheld to cover employees’ taxes upon vesting.\nThe Company’s incentive plans provide for the awarding of shares of restricted stock to the directors of the Company that vest evenly over a three-year period and are held in escrow until such vesting has occurred. Unvested shares are forfeited when a director ceases their service on the Company’s Board of Directors for reasons other than death or retirement. The fair value of shares awarded under these plans is based on the closing market price of the Company’s common stock on the date of award, and compensation expense is recorded evenly over the minimum required service period.\nThe table below identifies director restricted stock activity under these plans during the year ended December 31, 2019 (in thousands, except per share data):\nThe following table summarizes activity related to restricted stock awarded by the Company for the years ended December 31, 2019, 2018 and 2017 (in thousands, except per share data):\nAt December 31, 2019, the remaining unrecognized compensation expense related to unvested restricted share awards was $0.3 million, and the weighted-average period of time, over which this cost will be recognized, is 0.5 years.\nEmployee stock purchase plan:\nThe Company’s employee stock purchase plan (the “ESPP”) permits eligible employees to purchase shares of the Company’s common stock at 85% of the fair market value. Employees may authorize the Company to withhold up to 5% of their annual salary to participate in the plan. The fair value of shares issued under the ESPP is based on the average of the high and low market prices of the Company’s common stock during the offering periods. Compensation expense is recognized based on the discount between the grant-date fair value and the employee purchase price for the shares sold to employees.\nThe table below summarizes activity related to the Company’s ESPP for the years ended December 31, 2019, 2018 and 2017 (in thousands, except per share data):\nProfit sharing and savings plan:\nThe Company sponsors a contributory profit sharing and savings plan (the “401(k) Plan”) that covers substantially all employees who are at least 21 years of age and have completed one year of service. The Company makes matching contributions equal to 100% of the first 2% of each employee’s wages that are contributed and 25% of the next 4% of each employee’s wages that are contributed. An employee generally must be employed on December 31 to receive that year’s Company matching contribution, with the matching contribution funded annually at the beginning of the subsequent year following the year in which the matching contribution was earned. The Company may also make additional discretionary profit sharing contributions to the plan on an annual basis as determined by the Board of Directors. The Company did not make any discretionary contributions to the 401(k) Plan during the years ended December 31, 2019, 2018 or 2017. The Company expensed matching contributions under the 401(k) Plan in the amounts of $27.5 million, $24.8 million and $22.6 million for the years ended December 31, 2019, 2018 and 2017, respectively, which were primarily included in “Selling, general and administrative expenses” on the accompanying Consolidated Statements of Income.\nNonqualified deferred compensation plan:\nThe Company sponsors a nonqualified deferred compensation plan (the “Deferred Compensation Plan”) for highly compensated employees whose contributions to the 401(k) Plan are limited due to the application of the annual limitations under the Internal Revenue Code. The Deferred Compensation Plan provides these employees with the opportunity to defer the full 6% of matched compensation, including salary and incentive based compensation, that was precluded under the Company’s 401(k) Plan, which is then matched by the Company using the same formula as the 401(k) Plan. An employee generally must be employed on December 31 to receive that year’s Company matching contribution, with the matching contribution funded annually at the beginning of the subsequent year following the year in which the matching contribution was earned. In the event of bankruptcy, the assets of this plan are available to satisfy the claims of general creditors. The Company has an unsecured obligation to pay, in the future, the value of the deferred compensation and Company match, adjusted to reflect the performance, whether positive or negative, of selected investment measurement options chosen by each participant during the deferral period. The liability for compensation deferred under the Deferred Compensation Plan was $32.2 million and $25.5 million as of December 31, 2019 and 2018, respectively, which were included in “Other liabilities” on the Consolidated Balance Sheets. The Company expensed matching contributions under the Deferred Compensation Plan in the amounts of $0.2 million, $0.1 million and $0.1 million for the years ended December 31, 2019, 2018 and 2017, respectively, which were primarily included in “Selling, general and administrative expenses” on the accompanying Consolidated Statements of Income.\nStock appreciation rights:\nDuring the year ended December 31, 2019, the Company awarded 8,009 stock appreciation rights under the incentive plan, all of which were outstanding at December 31, 2019. Stock appreciation rights granted under the plan expire after 10 years and vest 25% per year, over four years, and are settled in cash. As of December 31, 2018, there were no stock appreciation rights outstanding. The liability for compensation to be paid for redeemed stock appreciation rights was less than $0.1 million as of December 31, 2019, which was included in “Other liabilities” on the Consolidated Balance Sheets. Compensation expense for stock appreciation rights was less than $0.1 million for the year ended December 31, 2019, which was included in “Selling, general and administrative expenses” on the accompanying Consolidated Statements of Income.\nNOTE 12 - ACCUMULATED OTHER COMPREHENSIVE INCOME\nAccumulated other comprehensive income includes adjustments for foreign currency translations. The table below summarizes activity for changes in accumulated other comprehensive income included in “Accumulated other comprehensive income” on the accompanying Consolidated Balance Sheets as of December 31, 2019 and 2018 (in thousands):\n(1) Foreign currency is not shown net of additional U.S. tax, as other basis differences of non-U.S. subsidiaries are intended to be permanently reinvested.\nNOTE 13 - COMMITMENTS\nConstruction commitments:\nAs of December 31, 2019, the Company had construction commitments in the amount of $100.1 million.\nLetters of credit commitments:\nAs of December 31, 2019, the Company had outstanding letters of credit, primarily to satisfy workers’ compensation, general liability and other insurance policies, in the amount of $38.9 million. See Note 7 for further information concerning the Company’s letters of credit commitments.\nDebt financing commitments:\nEach series of senior notes is redeemable in whole, at any time, or in part, from time to time, at the Company’s option upon not less than 30 nor more than 60 days notice at a redemption price, plus any accrued and unpaid interest to, but not including, the redemption date, equal to the greater of (i) 100% of the principal amount thereof or (ii) the sum of the present values of the remaining scheduled payments of principal and interest thereon discounted to the redemption date on a semiannual basis at the applicable Treasury Yield plus basis points identified in the indenture governing such series of senior notes; provided, that on or after the date that is three months prior to the maturity date of the series of senior notes, such series of senior notes is redeemable at a redemption price equal to par plus accrued and unpaid interest to, but not including, the redemption date. In addition, if at any time the Company undergoes a Change of Control Triggering Event, as defined in the indenture governing such series of senior notes, the holders may require the Company to repurchase all or a portion of their senior notes at a price equal to 101% of the principal amount of the notes being repurchased, plus accrued and unpaid interest, if any, but not including the repurchase date. See Note 7 for further information concerning the Company’s debt financing commitments.\nSelf-insurance reserves:\nThe Company uses a combination of insurance and self-insurance mechanisms to provide for potential liabilities for Team Member health care benefits, workers’ compensation, vehicle liability, general liability and property loss. With the exception of certain Team Member health care benefit liabilities, employment related claims and litigation, certain commercial litigation and certain regulatory matters, the Company obtains third-party insurance coverage to limit its exposure to this obligation.\nSolar investment:\nThe Company has entered into an agreement to make capital contributions to certain tax credit equity investments for the purpose of receiving renewable energy tax credits. The Company is required to make capital contributions totaling $95.4 million upon achievement of project milestones by the solar energy farms, the timing of which is variable and outside of the Company’s control.\nNOTE 14 - RELATED PARTIES\nThe Company leases certain land and buildings related to 74 of its O’Reilly Auto Parts stores under fifteen- or twenty-year operating lease agreements with entities that include one or more of the Company’s affiliated directors or members of an affiliated director’s immediate family. Generally, these lease agreements provide for renewal options for an additional five years at the option of the Company and the lease agreements are periodically modified to further extend the lease term for specific stores under the agreements. Lease payments under these operating leases totaled $4.7 million, $4.6 million and $4.6 million during the years ended\nDecember 31, 2019, 2018 and 2017, respectively. The Company believes that the lease agreements with the affiliated entities are on terms comparable to those obtainable from third parties. See Note 5 for further information concerning the Company’s operating leases.\nNOTE 15 - INCOME TAXES\nThe following table identifies components of income from continuing operations before income taxes included in “Income before income taxes” on the accompanying Consolidated Statements of Income for the years ended December 31, 2019, 2018 and 2017 (in thousands):\nProvision for income taxes:\nThe following tables reconcile the amounts included in “Provision for income taxes” on the accompanying Consolidated Statements of Income for the years ended December 31, 2019, 2018 and 2017 (in thousands):\nThe following table outlines the reconciliation of the “Provision for income taxes” amounts included on the accompanying Consolidated Statements of Income to the amounts computed at the federal statutory rate for the years ended December 31, 2019, 2018 and 2017 (in thousands):\nThe U.S. Tax Cuts and Jobs Act, enacted in December 2017 (the “Tax Act”), significantly reduced the federal corporate income tax rate for tax years beginning in 2018 and required the Company to revalue its deferred income tax liabilities. The Company recorded a one-time tax benefit of $53.2 million in “Provision for income taxes” on the accompanying Consolidated Statements of Income for the year ended December 31, 2017, to reflect the reduced federal corporate income tax rate in the tax years the deferred tax differences are expected to reverse. This provisional tax benefit from the revaluation of the Company’s deferred income tax liabilities was recorded based on the Company’s initial evaluation of the impact of the Tax Act. During the year ended December 31, 2018, the Company completed its evaluation of the impact of the Tax Act and recorded an additional $1.3 million of tax benefit, finalizing the revaluation\nof its deferred income tax liabilities due to the Tax Act, which was recorded in “Provision for income taxes” on the accompanying Consolidated Statements of Income for the year ended December 31, 2018.\nDeferred income tax assets and liabilities:\nDeferred income taxes reflect the net tax effects of temporary differences between the carrying amounts of assets and liabilities for financial reporting purposes and the amounts used for income tax purposes, and also include the tax effect of carryforwards.\nThe following table identifies significant components of the Company’s net deferred tax liabilities included in “Deferred income taxes” on the accompanying Consolidated Balance Sheets as of December 31, 2019 and 2018 (in thousands):\nAs of December 31, 2019, the Company had tax credit carryforwards available for state tax purposes, net of federal impact, in the amount of $3.4 million, which generally expire in 2024.\nUnrecognized tax benefits:\nThe following table summarizes the changes in the gross amount of unrecognized tax benefits, excluding interest and penalties, for the years ended December 31, 2019, 2018 and 2017 (in thousands):\nFor the years ended December 31, 2019, 2018 and 2017, the Company recorded a reserve for unrecognized tax benefits, including interest and penalties, in the amounts of $36.6 million, $38.9 million and $40.9 million, respectively. All of the unrecognized tax benefits recorded as of December 31, 2019, 2018 and 2017, respectively, would affect the Company’s effective tax rate if recognized, generally net of the federal tax effect of approximately $7.7 million. The Company recognizes interest and penalties related to uncertain tax positions in income tax expense. As of December 31, 2019, 2018 and 2017, the Company had accrued approximately $5.1 million, $5.1 million and $5.5 million, respectively, of interest and penalties related to uncertain tax positions before the benefit of the deduction for interest on state and federal returns. During the years ended December 31, 2019, 2018 and 2017, the Company recorded tax expense related to an increase in its liability for interest and penalties in the amounts of $2.7 million, $2.3 million and $2.0 million, respectively. Although unrecognized tax benefits for individual tax positions may increase or decrease during 2020, the Company expects a reduction of $7.8 million of unrecognized tax benefits during the one-year period subsequent to December 31, 2019, resulting from settlement or expiration of the statute of limitations.\nThe Company’s United States federal income tax returns for tax years 2016 and beyond remain subject to examination by the Internal Revenue Service (“IRS”). The IRS concluded an examination of the O’Reilly consolidated 2014, 2015 and 2016 federal income tax\nreturns in the third quarter of 2018. The Company’s state income tax returns remain subject to examination by various state authorities for tax years ranging from 2008 through 2018.\nNOTE 16 - EARNINGS PER SHARE\nThe following table illustrates the computation of basic and diluted earnings per share for the years ended December 31, 2019, 2018 and 2017 (in thousands, except per share data):\n(1) See Note 11 for further information concerning the terms of the Company’s share-based compensation plans.\nSubsequent to the end of the year and through February 28, 2020, the Company repurchased 0.9 million shares of its common stock, at an average price of $400.78, for a total investment of $363.4 million.\nNOTE 17 - QUARTERLY RESULTS (Unaudited)\nThe following tables set forth certain quarterly unaudited operating data for the fiscal years ended December 31, 2019 and 2018. The unaudited quarterly information includes all adjustments, which the Company considers necessary for a fair presentation of the information shown (in thousands, except per share data):\n(1) Earnings per share amounts are computed independently for each quarter and annual period. The quarterly earnings per share amounts may not sum to equal the full-year earnings per share amount.\nThe unaudited operating data presented above should be read in conjunction with the Company’s consolidated financial statements and related notes, and the other financial information included therein.",
    "item_9": "Item 9. Changes in and Disagreements with Accountants on Accounting and Financial Disclosure\nNone.",
    "item_9A": "Item 9A. Controls and Procedures\nEVALUATION OF DISCLOSURE CONTROLS AND PROCEDURES\nAs of the end of the period covered by this report, the Company’s management, under the supervision and with the participation of its Chief Executive Officer and Chief Financial Officer, evaluated the effectiveness of the design and operation of the Company’s disclosure controls and procedures pursuant to Rule 13a-15(b) and as defined in Rule 13a-15(e) of the Securities Exchange Act of 1934, as amended (the “Exchange Act”). Based on that evaluation, the Chief Executive Officer and the Chief Financial Officer concluded that the Company’s disclosure controls and procedures as of the end of the period covered by this report are functioning effectively to provide reasonable assurance that the information required to be disclosed by the Company, including its consolidated subsidiaries, in reports filed under the Exchange Act is recorded, processed, summarized and reported within the time periods specified in the Securities and Exchange Commission’s rules and forms and is accumulated and communicated to management, including the Company’s Chief Executive Officer and Chief Financial Officer, as appropriate to allow timely decisions regarding required disclosure.\nCHANGES IN INTERNAL CONTROLS\nThere were no changes in the Company’s internal control over financial reporting during the fiscal quarter ended December 31, 2019, that have materially affected, or are reasonably likely to materially affect, the Company’s internal control over financial reporting.\nINTERNAL CONTROL OVER FINANCIAL REPORTING\nThe management of the Company, under the supervision and with the participation of the Company’s principal executive officer and principal financial officer and effected by the Company’s Board of Directors, is responsible for establishing and maintaining adequate internal control over financial reporting as defined in Rule 13(a)-15(f) or 15(d)-15(f) under the Exchange Act. The Company’s internal control system is designed to provide reasonable assurance regarding the reliability of financial reporting and the preparation of financial statements for external purposes in accordance with accounting principles generally accepted in the United States.\nInternal control over financial reporting includes all policies and procedures that\n● pertain to the maintenance of records that, in reasonable detail, accurately and fairly reflect the transactions and dispositions of the assets of the Company;\n● provide reasonable assurance that transactions are recorded as necessary to permit preparation of financial statements in accordance with accounting principles generally accepted in the United States of America, and that receipts and expenditures of the Company are being made only in accordance with authorizations of management and directors of the Company; and\n● provide reasonable assurance regarding prevention or timely detection of unauthorized acquisition, use or disposition of the Company’s assets that could have a material effect on the financial statements.\nManagement recognizes that all internal control systems, no matter how well designed, have inherent limitations. Therefore, even those systems determined to be effective can provide only reasonable assurance with respect to financial statement preparation and presentation. Also, projections of any evaluation of effectiveness to future periods are subject to risk. Over time, controls may become inadequate because of changes in conditions or deterioration in the degree of compliance with policies or procedures.\nUnder the supervision and with the participation of the Company’s principal executive officer and principal financial officer, management assessed the effectiveness of the Company’s internal control over financial reporting as of December 31, 2019. In making this assessment, management used the criteria set forth by the Committee of Sponsoring Organizations of the Treadway Commission in Internal Control - Integrated Framework (2013 framework). Based on this assessment, management believes that as of December 31, 2019, the Company’s internal control over financial reporting was effective based on those criteria.\nAs permitted by guidance issued by the Securities and Exchange Commission, management excluded from its assessment of its system of internal control over financial reporting the operations associated with the acquisition of Mayoreo de Autopartes y Aceites, S.A. de C.V. (“Mayasa”), pursuant to a stock purchase agreement, which was completed after the close of business on November 29, 2019. The acquired operations were included in the consolidated financial statements of the Company, which constituted 2% of total assets as of December 31, 2019, and less than 1% of revenues and less than 1% of net income for the year ended December 31, 2019.\nErnst & Young LLP, Independent Registered Public Accounting Firm, has audited the Company’s consolidated financial statements and has issued an attestation report on the effectiveness of the Company’s internal control over financial reporting, which is included in Item 8 of this annual report on Form 10-K.",
    "item_9B": "Item 9B. Other Information\nNot Applicable.\nPART III",
    "item_9C": "",
    "item_10": "Item 10. Directors, Executive Officers and Corporate Governance\nCertain information required by Part III is incorporated by reference from the Company’s Proxy Statement on Schedule 14A for the 2020 Annual Meeting of Shareholders (“Proxy Statement”), which will be filed with the Securities and Exchange Commission (the “SEC”) within 120 days of the end of the Company’s most recent fiscal year. Except for those portions specifically incorporated in this Annual Report on Form 10-K by reference to the Company’s Proxy Statement, no other portions of the Proxy Statement are deemed to be filed as part of this Annual Report on Form 10-K.\nDirectors and Officers:\nThe information regarding the directors of the Company will be included in the Company’s Proxy Statement under the caption “Proposal 1 - Election of Directors” and “Information Concerning the Board of Directors” and is incorporated herein by reference. The Proxy Statement will be filed with the SEC within 120 days of the end of the Company’s most recent fiscal year. The information regarding executive officers called for by Item 401 of Regulation S-K is included in Part I, in accordance with General Instruction G(3) to Form 10-K, for the Company’s executive officers who are not also directors.\nCode of Ethics:\nThe Company’s Board of Directors has adopted a code of ethics that applies to all of its directors, officers (including its chief executive officer, chief operating officer, chief financial officer, chief accounting officer, controller and any person performing similar functions), and Team Members. The Company’s Code of Ethics is available on its website at www.OReillyAuto.com, under the “Corporate Home” caption. The information on the Company’s website is not a part of this Annual Report on Form 10-K and is not incorporated by reference in this report or any of the Company’s other filings with the SEC.\nCorporate Governance:\nThe Corporate Governance/Nominating Committee of the Board of Directors does not have a written policy on the consideration of Director candidates recommended by shareholders. It is the view of the Board of Directors that all candidates, whether recommended by a shareholder or the Corporate Governance/Nominating Committee, shall be evaluated based on the same established criteria for persons to be nominated for election to the Board of Directors and its committees.\nThe Board of Directors has established an Audit Committee pursuant to Section 3(a)(58)(A) of the Exchange Act. The Audit Committee currently consists of Jay D. Burchfield, Thomas T. Hendrickson, John R. Murphy, Dana M. Perlman and Andrea M. Weiss, each an independent director in accordance with The Nasdaq Stock Market Marketplace Rule 5605(a)(2), the standards of Rule 10A-3 of the Exchange Act and the requirements of The Nasdaq Stock Market Marketplace Rule 5605(c)(2). In addition, our Board of Directors has determined that Mr. Hendrickson, Chairperson of the Audit Committee, qualifies as an audit committee financial expert under Item 407(d)(5) of Regulation S-K.",
    "item_11": "Item 11. Executive Compensation\nDirector and Officer Compensation:\nThe information required by Item 402 of Regulation S-K will be included in the Company’s Proxy Statement under the captions “Compensation of Executive Officers” and “Compensation of Directors” and is incorporated herein by reference.\nCompensation Committee:\nThe information required by Item 407(e)(4) and (e)(5) of Regulation S-K will be included in the Company’s Proxy Statement under the captions “Compensation Committee Interlocks and Insider Participation” and “Compensation Committee Report” and is incorporated herein by reference.",
    "item_12": "Item 12. Security Ownership of Certain Beneficial Owners and Management and Related Stockholder Matters\nThe information required by Item 201(d) of Regulation S-K will be included in the Company’s Proxy Statement under the caption “Equity Compensation Plans” and is incorporated herein by reference.\nThe information required by Item 403 of Regulation S-K will be included in the Company’s Proxy Statement under the captions “Security Ownership of Certain Beneficial Owners” and “Security Ownership of Directors and Management” and is incorporated herein by reference.",
    "item_13": "Item 13. Certain Relationships and Related Transactions, and Director Independence\nThe information required by Item 404 of Regulation S-K will be included in the Company’s Proxy Statement under the caption “Certain Relationships and Related Transactions” and is incorporated herein by reference.\nThe information required by Item 407(a) of Regulation S-K will be included in the Company’s Proxy Statement under the caption “Director Independence” and is incorporated herein by reference.",
    "item_14": "Item 14. Principal Accountant Fees and Services\nThe information required by Item 9(e) of Schedule 14A will be included in the Company’s Proxy Statement under the caption “Fees Paid to Independent Registered Public Accounting Firm” and is incorporated herein by reference.\nPART IV",
    "item_15": "Item 15. Exhibits and Financial Statement Schedules\n(a) The following documents are filed as part of this Annual Report on Form 10-K:\n1. Financial Statements - O’Reilly Automotive, Inc. and Subsidiaries\nThe following consolidated financial statements of O’Reilly Automotive, Inc. and Subsidiaries included in the Annual Shareholders’ Report of the registrant for the year ended December 31, 2019, are filed with this Annual Report in Part II, Item 8:\nManagement’s Report on Internal Control over Financial Reporting\nReport of Independent Registered Public Accounting Firm - Internal Control over Financial Reporting\nReport of Independent Registered Public Accounting Firm - Financial Statements\nConsolidated Balance Sheets as of December 31, 2019 and 2018\nConsolidated Statements of Income for the years ended December 31, 2019, 2018 and 2017\nConsolidated Statements of Comprehensive Income for the years ended December 31, 2019, 2018 and 2017\nConsolidated Statements of Shareholders’ Equity for the years ended December 31, 2019, 2018 and 2017\nConsolidated Statements of Cash Flows for the years ended December 31, 2019, 2018 and 2017\nNotes to Consolidated Financial Statements for the years ended December 31, 2019, 2018 and 2017\n2. Financial Statement Schedules - O’Reilly Automotive, Inc. and Subsidiaries\nThe following consolidated financial statement schedule of O’Reilly Automotive, Inc. and Subsidiaries is included in Item 15(a):\nSchedule II - Valuation and qualifying accounts\nAll other schedules, for which provision is made in the applicable accounting regulations of the Securities and Exchange Commission, are not required under the related instructions or are inapplicable, and therefore have been omitted.\n3. Exhibits",
    "item_16": "Item 16. Form 10-K Summary\nNot applicable.\nO’REILLY AUTOMOTIVE, INC. AND SUBSIDIARIES\nSCHEDULE II - VALUATION AND QUALIFYING ACCOUNTS\n(in thousands)\n(1) Uncollectable accounts written off.",
    "stock_ticker": "ORLY"
}